{"The number of custom presets does not match the number of source folders!":"Die aantal persoonlike voorstellings stem nie ooreen met die aantal bronvouers nie!","source folders have been detected.":"bron dopgehou is opgespoor.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"Aangepaste voorgestelde lyne is opgespoor. Kontroleer asseblief vir onsigbare lynbreuke. Daar moet een gids pad of vooraf ingestel per lyn wees. Maak seker dat jy nie per ongeluk 'n leë lyn geskep het nie.","The number of filename suffixes does not match the number of source folders! ":"Die aantal lêername agtervoegsels stem nie ooreen met die aantal bronvouers nie!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"lêernaam agtervoegsel lyne is opgespoor. Kontroleer asseblief vir onsigbare lynbreuke. Daar moet 'n gids pad of lêernaam agtervoegsel wees per reël. Maak seker dat jy nie per ongeluk 'n leë lyn geskep het nie.","The number of source folders does not match the number of destination folders!":"Die aantal bronvouers stem nie ooreen met die aantal bestemmingsgidse nie!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"bestemmingsgidse is opgespoor. Kontroleer asseblief vir onsigbare lynbreuke. Daar moet een gids pad per lyn wees. Maak seker dat jy nie per ongeluk 'n leë lyn geskep het nie.","The number of source folders does not match the number of temporary conversion folders!":"Die aantal bronvouers stem nie ooreen met die aantal tydelike omskakel-dopgehou nie!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"tydelike omskakeling dopgehou is opgespoor. Kontroleer asseblief vir onsigbare lynbreuke. Daar moet een gids pad per lyn wees. Maak seker dat jy nie per ongeluk 'n leë lyn geskep het nie.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Voer asseblief 'n geldige houer in soos '.mp4'. Maak seker dat die '.' Ingesluit word.","Corrupt file folder":"Korrupte lêergids","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"bestaan nie! Maak asseblief seker dat daar geen spasies of verborge karakters voor / na die pad is nie","Source folder":"Bron gids","Temporary conversion folder":"Tydelike Omskakeling gids","appears to be the same as or is within source folder":"blyk te wees dieselfde as of is in die bron gids","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"wat sal verhoed dat HBBatchBeast korrek funksioneer. Verander asseblief die tydelike omskakelingsgids na 'n gids buite die bronmap. As u die funksie 'Vervang oorspronklike lêers' wil gebruik, kies asseblief 'n bestemmingsmap wat nie dieselfde is as of binne die bronmap nie. Merk die boks 'Vervang oorspronklike lêers altyd' in die afdeling Gevorderde instellings. . Verwyder die vinkje uit die tydelike 'Tydelike Omskakel-gids' blokkie, aangesien dit in hierdie geval geen nut sal wees nie. Lêers sal omskep word in die bestemmingsmap en dan terug in die bronmap ingetrek word.","Destination folder":"Bestemmingsmap","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"wat sal verhoed dat HBBatchBeast korrek funksioneer. Verander asseblief die bestemmingsmap na 'n gids buite die bronmap. As u die funksie 'Vervang oorspronklike lêers' wil gebruik, kies asseblief 'n bestemmingsmap wat nie dieselfde is as of binne die bronmap nie. Merk die boks 'Vervang oorspronklike lêers altyd' in die afdeling Gevorderde instellings. . Verwyder die vinkje uit die tydelike 'Tydelike Omskakel-gids' blokkie, aangesien dit in hierdie geval geen nut sal wees nie. Lêers sal omskep word in die bestemmingsmap en dan terug in die bronmap ingetrek word.","Error creating temporary conversion folder":"Kon nie tydelike omskakelmap skep nie","Error creating destination folder":"Kon nie bestemmingsmap skep nie","Please select to use HandBrake or FFmpeg!":"Kies asseblief Handbrake of FFmpeg!","Please select a standard preset or input a custom one!":"Kies asseblief 'n standaardvoorstel of invoer 'n aangepaste een!","Please select a scan interval of 5 seconds or greater!":"Kies asseblief 'n scan interval van 5 sekondes of langer!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Maak asseblief seker dat die aantal gelyktydige HandBrake / FFmpeg-instellings wat gebruik word, een of meer is!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Ongeldige API sleutel! Klik asseblief op 'Nuwe' op die oortjie op afstandbeheer om 'n nuwe sleutel te genereer.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Voer asseblief 'n daaglikse skanderingstyd in 24-uur-formaat in: hh: mm (byvoorbeeld 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"BRONFILES SAL VERWYDER WORD NA OMVANG! Probeer asseblief voor behoorlike gebruik!","Benchmark failed!":"Maatstaf misluk!","Log does not exist!":"Log bestaan nie!","Folder does not exist!":"Vouer bestaan nie!","Error sending email! Please check your settings.":"Kon nie e-pos stuur nie! Gaan asseblief jou instellings na.","Test email sent!":"Toets e-pos gestuur!","All worker processes have been stopped.":"Alle werkerprosesse is gestaak.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Wagboek sal geplaas word sodra huidige items klaar is met verwerking. Is jy seker jy wil die tou onderbreek?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Wagrijpauze geïnitieerd.'Continu'-knoppie sal verskyn sodra alle werkers pauzeren.","Healthy file cache cleared!":"Gesonde lêer kas skoongemaak!","Cache cleared!":"Cache skoongemaak!","Cancel item":"Kanselleer item","Please check the above checkbox to use this feature.":"Gaan asseblief die boks hierbo aan om hierdie funksie te gebruik.","Configuration":"opset","Source folders":"Bron dopgehou","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Dit is die bronmap wat vir media geskandeer sal word. Die lêer moet ingevoer word sonder 'n skuinsstreep. Byvoorbeeld:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Die bronmap-padkas is uitbreidbaar (druk enter om 'n nuwe reël te skep). As jy meer bronmouers wil spesifiseer, maak seker dat elke bronmap-pad op sy eie lyn is, soos:","Video health check":"Video gesondheidstoets","Batch conversion and Folder watching":"Batch omskakeling en gids kyk","Remote Monitoring (Beta)":"Remote Monitoring (Beta)","Benchmark (Beta)":"Maatstaf (Beta)","System":"stelsel","Help":"help","Temporary conversion folders":"Tydelike Omskakeling dopgehou","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"As \"Tydelike Omskakelingsgids?\" is nagegaan, dan sal HandBrake lêers omskep in daardie gids. Sodra die omskakeling klaar is, sal die lêer in jou \"bestemmingsmap\" verplaas word. U moet soveel tydelike omskakel-dopgehou as bronmouers spesifiseer. Jou eerste bron gids sal omskep word in jou eerste tydelike omskakeling gids, jou tweede bron gids in jou tweede tydelike omskakeling gids en so aan. Maak seker dat elke pad vir tydelike omskakelingsgidse op sy eie lyn is.","Destination folders":"Bestemmingsvouers","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Spesifiseer bestemmingsmaproetes. Weereens, moet u soveel bestemmingsgidse as bronmouers spesifiseer. Lêers uit u eerste bronmap kom in u eerste bestemmingsmap, u tweede bronmaplêers in u tweede bestemmingsmap en so aan.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Eerste bron gids ---------> Eerste tydelike Omskakeling gids ---------> Eerste bestemming gids","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Tweede bron gids ---------> Tweede tydelike omskakeling gids ---------> Tweede bestemming gids","etc":"ens","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast sal nie behoorlik werk nie as u die bestemmingsmap dieselfde stel as of in die bronmap.","Standard preset:":"Standaard vooraf ingestel:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Kies die Handbrake-voorstelling waarmee jy jou lêers wil omskep. As \"Standaard vooraf ingestel\" gekies is, sal alle lêers in die gekose dopgehou omskep word met die gespesifiseerde HandBrake-voorstelling. Meer oor Handbrake presets kan u hier vind:","Custom preset:":"Gepasmaakte voorstelling:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"As \"Aangepaste voorgeprogrammeerde\" dan moet u u eie pasgemaakte vooraf ingestel. HBBatchBeast dek die \"HandBrakeCLI -in-bron bestemming\" deel van die HandBrakeCLI invoer sodat u die omskakeling parameters moet invoer. Byvoorbeeld:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"As u FFmpeg gebruik, moet u die invoer- en uitvoerparameters skei met 'n komma. Soos:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"U kan ook skakel na 'n pasgemaakte voorstelling wat uit die amptelike HandBrake GUI aansoek uitgevoer is, byvoorbeeld:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"As u probleme ondervind met persoonlike voorstellings, kan dit wees as gevolg van 'n bekende fout met die HandBrakeCLI (sal vasgestel word in die volgende HandBrakeCLI-vrystelling). Sien asseblief vir 'n tydelike oplossing:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Elke pasgemaakte voorinstelling moet op sy eie lyn wees, en soos die dopgehou moet daar soveel persoonlike voorstellings as bronvouers wees.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Eerste bron gids ---------> Eerste tydelike Omskakeling gids ---------> Eerste bestemming gids @ Custom preset 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Tweede bron gids ---------> Tweede tydelike Omskakeling gids ---------> Tweede bestemming gids @ Custom preset 2","See the following image for guidance:":"Sien die volgende prentjie vir leiding:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"As die gebruik van grafiese kaart kodering (soos NVENC), moet u moontlik die aantal HandBrake-gevalle verminder (probeer 2 of minder) as gevolg van VRAM-beperkings.","Select standard preset:":"Kies standaard voorverstelling:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC bespeur, maak asseblief seker dat die aantal HandBrakeCLI-gevalle tot 2 of laer (vir die meeste grafiese kaarte) verlaag word, of u kan foute ondervind as gevolg van nie genoeg VRAM nie. Hierdie instelling kan gevind word in die \"System\" oortjie.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Ingevoerde voorgeprogrammeerde bespeur. As jy probleme ondervind met ingevoerde persoonlike voorstellings, kan dit wees as gevolg van 'n bekende fout met die HandBrakeCLI (sal vasgestel word in die volgende HandBrakeCLI-vrystelling). 'N Tydelike oplossing is om' 'PictureRotate' te verwyder: '0: 0' 'van die .json-lêer. Meer inligting hier:","Container:":"houer:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Gee die houer aan wat u wil hê die uitvoerlêer het soos '.mp4'. U kan meer uitvind oor houers by:","Enable periodic scanning:":"Aktiveer periodieke skandering:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast kan jou bron dopgehou monitor en scan vir nuwe lêers op 'n bepaalde interval. Die interval tyd is in sekondes met die verstek 300 sekondes (5 minute). As hierdie opsie gekies is, dan sal u die program 'n nuwe lêer omskep en dan begin 'n aftellingsknop wanneer u op 'Scan and convert' druk. Dit sal oneindig loop totdat dit gestop word. Die scan interval is in die afdeling Gevorderde instellings.","Enable daily scanning:":"Aktiveer daaglikse skandering:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"In plaas van periodieke skandering, kan jy kies vir 'n skandering wat een keer per dag uitgevoer word. Die scan tyd word ingevoer in die afdeling Gevorderde instellings in hh: mm formaat soos '18: 30 '. Sodra 'Scan and convert' gekies is, sal die program wag tot die gespesifiseerde tyd totdat 'n scan- en omskakelingsproses uitgevoer word. Weereens, dit sal oneindig loop totdat dit gestaak word.","Show/hide advanced:":"Wys / verberg gevorderde:","Scan interval (minimum 5 seconds):":"Scan interval (minimum 5 sekondes):","Daily run time (hh:mm):":"Daaglikse hardloop tyd (hh: mm):","Output filename suffix:":"Uitvoer lêernaam agtervoegsel:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Dit is opsioneel. U kan 'n agtervoegsel spesifiseer om aan die einde van u lêernaam te voeg soos '_1080p' of '_testconversion' ens.","If 'standard preset' is selected then all output files will have the same suffix.":"As 'standaardvoorgestelde' gekies is, sal alle uitvoerlêers dieselfde agtervoegsel hê.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"As 'Custom preset' gekies is, kan u een agtervoegsel spesifiseer per bronmap / persoonlike voorvertoning. Maak seker dat elke agtervoegsel op sy eie lyn is. Byvoorbeeld, as jy 2 bronvouers het en 'pasgemaakte vooraf' gebruik, kan jy dit in die lêernaam-agtervoegselkas plaas:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Lêers in die eerste bronmap sal '_720p' by die uitvoer lêernaam gevoeg het. Lêers in die tweede bron gids sal '_1080p' bygevoeg word om lêernaam uit te voer ens.","Include these file containers:":"Sluit hierdie lêerhouers in:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Voer die lêerhouers in om na te soek. Elke tipe moet geskei word met 'n komma. Die standaardinskrywing is:","Exclude files smaller than (MB):":"Sluit lêers kleiner as (MB) uit:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Spesifiseer of lêers kleiner as 'n sekere grootte van omskakeling (in megagrepe) moet uitgesluit word","Exclude files larger than (MB):":"Sluit lêers groter as (MB) uit:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Spesifiseer of lêers groter as 'n sekere grootte uit omskakeling (in megagrepe) uitgesluit moet word.","Exclude filenames which include any of these words:":"Sluit lêername uit wat enige van hierdie woorde insluit:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Sleutel sleutelwoorde in wat gefilter moet word wanneer u vir lêers soek. Byvoorbeeld, as \"720p\" ingevoer word, sal enige lêers met \"720p\" in die titel nie omgeskakel word nie. Weer moet sleutelwoorde geskei word met 'n komma. Voer byvoorbeeld die volgende in die filterkassie in:","Include files with any ":"Sluit lêers in met enige"," or all ":"of almal"," of these":"van hierdie","properties:":"eienskappe:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Hier kan u video- en klank-eienskappe invoer wat lêers moet hê om te kan omskep word (inligting verkry met behulp van FFprobe). Die eienskappe moet geskei word met 'n komma. Gebruik die Media Info Viewer-instrument om te help bepaal watter eienskappe jy wil insluit. Maak seker dat jy 'n komma na die laaste eiendom plaas. Byvoorbeeld, om slegs lêers te omskep wat geënkodeer word met behulp van h264 en aac stereo klank:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Dit is opmerklik dat hierdie eiendomskontrole gedoen word sodra die omskakelingsproses begin (om tyd te bespaar terwyl die tou gebou word), alhoewel lêers in die omskakelwachtrij voorkom, word dit oorgeslaan / ingesluit as aan die korrekte voorwaardes voldoen word.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"As FFprobe eienskappe kan onttrek, verskyn 'n 'OK' in die kolom 'FFprobe' in die ry-aansig.","Exclude files with any ":"Sluit lêers uit met enige"," of these ":"van hierdie","The opposite of 'Include files with any or all of these properties'":"Die teenoorgestelde van 'lêers met enige of al hierdie eienskappe insluit'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Dit is 'n klein hulpmiddel om lêer eienskappe te analiseer om u te help om te bepaal watter eienskappe u by die bogenoemde opsies wil insluit / uitsluit. Dit gebruik FFprobe om inligting terug te gee. Sleep en laat lêers in die grys boks om dit te analiseer. Byvoorbeeld, om in 'n toetslêer te laat val, sal die volgende terugkeer:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"As u lêers soos hierdie nie wil omskep nie, kan u verskeie lêer eienskappe in die lêer 'Sluit lêers met enige of al hierdie eienskappe' uit en merk die boks langs 'alles' in plaas van 'enige', soos dit:","Copy excluded files to destination:":"Kopieer uitgesluit lêers na bestemming:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"As u hierdie opsie kies, sal lêers wat van omskakeling uitgesluit is, direk na die bestemmingsmap gekopieer word. Dit geld vir die volgende filters:","Exclude filenames which include any of these words":"Sluit lêername uit wat enige van hierdie woorde insluit","Include files with any or all of these properties":"Sluit lêers in met enige of al hierdie eienskappe","Exclude files with any or all of these properties":"Sluit lêers uit met enige of al hierdie eienskappe","Exclude files smaller than (MB)":"Sluit lêers kleiner uit as (MB)","Exclude files larger than (MB)":"Sluit lêers uit wat groter is as (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Let wel, dit geld ook vir lêers wat uitgesluit word omdat hulle nie die eiendomsvoorwaardes van die bogenoemde bevat nie. Moet nie per ongeluk kopieer as jy die hele biblioteek is as jy net 'n paar lêers probeer omskep nie.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Die kopie-kenmerk is nie van toepassing op die volgende filters nie (dws lêers uitgesluit as gevolg van die filter)","Include these file types":"Sluit hierdie lêertipes in","Delete source files after conversion:":"Verwyder bronlêers na omskakeling:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"As dit gekies word, sal die bronlêer dan verwyder word as 'n omskakelpoging suksesvol is. Hierdie proses word op die ou end gedoen na omskakeling van alle lêers. Dit beteken dat jy dieselfde bron lêers kan omskakel met verskeie voorsketse, alles op een slag. Die bron lêers sal daarna verwyder word.","Replace original file if converted file is smaller?(Compress attempt)":"Vervang oorspronklike lêer as omgeskakel lêer kleiner is? (Druk poging)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Kies hierdie boks as jy HBBatchBeast wil hê om die oorspronklike bronlêer outomaties te vervang as die nuwe lêer kleiner is. As die nuwe lêer nie kleiner is nie, sal dit in die bestemmingsmap gelaat word.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Maak seker dat jou bestemmingsmap nie dieselfde is as / of binne, jou bronmap of dit sal nie behoorlik werk nie.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Sodra HBBatchBeast probeer het om 'n spesifieke lêer te druk, sal dit daardie lêerpad by 'n kas voeg sodat dit nie weer in die toekoms gepoog sal word nie. U kan die kas met behulp van die geel knoppies bekyk / wysig / vee.","Replace original file always?":"Vervang oorspronklike lêer altyd?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Die oorspronklike lêer sal vervang word ongeag of die nuwe lêer groter of kleiner is.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Weereens, maak seker dat u bestemmingsmap nie dieselfde is as / of binne, u bronmap of dit sal nie behoorlik werk nie.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Sodra HBBatchBeast 'n spesifieke lêer getransskripteer het, sal dit daardie lêerpad by 'n kas voeg sodat dit nie weer in die toekoms gepoog sal word nie. U kan die kas met behulp van die geel knoppies bekyk / wysig / vee.","Copy subtitle (srt) files to destination?":"Kopieer ondertitel (srt) lêers na bestemming?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Subtitle '. Srt' lêers sal outomaties na die bestemmingsmap gekopieer word.","Automatically create temporary/destination folders if they don't exist?":"Skep outomaties tydelike / bestemming dopgehou as dit nie bestaan nie?","Custom bat path to run after each conversion (leave blank if not using):":"Gepasmaakte kolfbaan om na elke omskakeling te hardloop (laat leeg as dit nie gebruik word nie):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Voer die pad na 'n pasgemaakte joernaal wat u na elke sukses wil uitvoer. Byvoorbeeld:","Batch files with timeout statements won't work. More info here:":"Batch-lêers met time-out-stellings sal nie werk nie. Meer inligting hier:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Laat die kassie heeltemal leeg as jy nie hierdie opsie wil gebruik nie (maak seker daar is geen verborge karakters in die blokkie nie)","Run processes at low priority?":"Begin prosesse met lae prioriteit?","All conversion processes will be run at low priority, reducing processor usage.":"Alle omskakelingsprosesse sal teen lae prioriteit uitgevoer word, wat die verwerker se gebruik sal verminder.","Remove apostrophes from filenames:":"Verwyder apostrofe uit lêername:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Omskakelings / gesondheidskontrole skanderings mag misluk indien lêername apostrofe bevat. Kontroleer dit om apostrofe outomaties van lêername te verwyder."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Hierdie funksie kan scan vir korrupte video lêers met HandBrake se '- scan'-funksie, hoewel dit nie altyd akkuraat is nie. Dit gebruik ook FFprobe om 'n tweede verwysingspunt te verskaf. As beide FFprobe en HandBrake misluk, is daar 'n groot kans dat die lêer korrup is.","Move corrupt files into the following folder:":"Skuif korrupte lêers in die volgende gids:"," If checked, then any files which give errors will be moved into the specified folder.":"As dit nagegaan word, sal enige lêers wat foute gee, in die gespesifiseerde vouer verskuif word.","Corrupt file folder:":"Korrupte lêergids:","Run thorough file health check:":"Doen deeglike lêer gesondheidsondersoek:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"As dit nagegaan word, sal 'n baie stadiger, meer deeglike video gesondheidsondersoek uitgevoer word met behulp van FFmpeg in plaas van Handbrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Gebaseer op Desani se 'ScanMedia.ps1' gevind by:","Attempt to repair files after thorough check:":"Poging om lêers te herstel na deeglike tjek:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"As gekontroleer, sal HBBatchBeast poog om lêers te herstel met behulp van FFmpeg. 'N Nuwe lêer met die agtervoegsel' _repaired 'sal in dieselfde gids as die bronlêer geskep word.","'CRF' value to use when attempting to repair files:":"'CRF' waarde om te gebruik wanneer jy probeer om lêers te herstel:","The default 'CRF' value is 23. Please see the following for more information:":"Die standaard 'CRF'-waarde is 23. Sien asseblief die volgende vir meer inligting:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Die omvang van die CRF skaal is 0-51, waar 0 verloor is, 23 is die verstek en 51 is die ergste kwaliteit moontlik. 'N Laer waarde lei gewoonlik tot hoër gehalte, en 'n subjektiewe gesonde reeks is 17-28. Oorweeg 17 of 18 om visueel verlieslose of byna so te wees; Dit moet dieselfde of amper dieselfde lyk as die insette, maar dit is nie tegnies verlos nie.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast stoor 'n lys van geskandeerde lêerpaaie wat as onklaar aangemeld is. Maak die kas skoon om 'n vars scan op alle lêers uit te voer.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Aantal gelyktydige Handbrake / FFmpeg-instellings om te gebruik? (Aanbeveel 4 of minder):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Hierdie instelling is van toepassing op beide die \"Video Health Check\" en \"Scan and convert\" prosesse. Spesifiseer hoeveel Handbrake-drade om te gebruik. Daar is geen maksimum nie, hoewel dit aanbeveel word om nie meer as 4 te gebruik nie. 'N Hoër hoeveelheid kan jou rekenaar vries as dit nie baie kragtig is nie.","Queue size view limit?(Recommended 1000 or fewer):":"Waglyn grootte aansig limiet? (Aanbeveel 1000 of minder):","Automatically start \"Scan and convert\" when program opened?:":"Begin outomaties 'Scan and convert' wanneer die program oopgemaak word ?:","Save verbose logs?:":"Stoor verbose logs ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Gryskoppie hierdie boks om gedetailleerde subproseslogs te stoor. Dit sluit werkerskonsole in. Dit sal baie groot logs veroorsaak.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Vul e-posbesonderhede in om e-pos kennisgewings te ontvang as daar 'n fout ondervind word tydens 'n gesondheidstoets of omskakeling / gids om te kyk. Sal nie werk met rekeninge wat 2FA benodig nie. Jy moet toegang tot minder veilige programme op Gmail-rekeninge aktiveer.","Email address:":"E-pos adres:","For example:":"Byvoorbeeld:","Email password(not saved):":"E-pos wagwoord (nie gestoor):","SMTP server:":"SMTP-bediener:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Met hierdie funksie kan u die status van omskakeling / gesondheidsondersoek monitor met behulp van enige webblaaier. Nuttig wanneer bedieners uitgevoer word. Geen lêername word gestuur nie.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Indien aangeskakel, sal die volgende anonieme data na HBBatchBeast.io gestuur word:","API key":"API sleutel","Current status ('Searching', 'Running', 'Finished' etc)":"Huidige status ('Searching', 'Running', 'Finished' ens)","Number of:":"Nommer van:","Remaining items":"Oorblywende items","Successful items":"Suksesvolle items","Errored items":"Foute items","Cancelled items":"Gekanselleerde items","Worker percentages":"Werker persentasies","Last completed item time":"Laaste voltooide item tyd","Enable remote monitoring?:":"Aktiveer afgeleë monitering ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"'N basiese benchmarking nut gebou hoofsaaklik om te sien hoe 16 + kern verwerkers verrig met behulp van verskeie HandBrake instansies, hoewel dit kan uitgevoer word op enige tipe verwerker.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Dit sal 'n h265 4k voorbeeldlêer (2.5MB) aflaai en 'n maatstaf gebruik met 4 Handbrake instansies met vooraf ingestelde \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Resultate kan opgelaai word na hbbatchbeast.io as jy kies.","Queue":"tou","Output this session":"Uitset hierdie sessie","Media info viewer tool":"Media Info Viewer Tool","View replaced file cache":"Bekyk vervangde lêer kas","Clear replaced file cache":"Duidelike vervang lêer kas","Save config":"Stoor konfigurasie","Scan only":"Skandeer slegs","Scan and convert":"Skandeer en omskep","View scan/conversion summary log":"Bekyk skandering / omskakeling opsomming log","View individual file check/conversion log":"Sien individuele lêer tjek / Omskakeling log","View worker console output":"Sien werkerkonsole uitvoer","Health check":"Gesondheids ondersoek","Clear healthy file cache":"Maak gesonde lêer kas skoon","View error log":"Bekyk foutlogboek","Email test":"E-pos toets","View master log":"Bekyk meester log","Wiki help":"Wiki help","An application by HaveAGitGat":"'N Aansoek deur HaveAGitGat","New":"nuwe","Launch":"Begin","Benchmark":"maatstaf","See results":"Sien resultate","Pause queue":"Pouse wachtrij","Continue queue":"Gaan voort met tou","Stop queue":"Stop tou","Convert selected files":"Skakel geselekteerde lêers om","Toggle queue view":"Wissel waglys vertoning","Deselect all":"Deselecteer alles","Invert all":"Omkeer alles","Select all":"Kies alles","Toggle output view":"Wissel uitvoeruitsig"}