{
    "The number of custom presets does not match the number of source folders!": "عدد الإعدادات المسبقة المخصصة لا يتطابق مع عدد مجلدات المصدر!",
    "source folders have been detected.": "تم الكشف عن المجلدات المصدر.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "تم الكشف عن خطوط مخصصة مسبقا. يرجى التحقق مرة أخرى لمعرفة فواصل الأسطر غير المرئية. يجب أن يكون هناك مسار مجلد واحد أو إعداد مسبق لكل سطر. تأكد من عدم إنشاء خط فارغ بطريق الخطأ.",
    "The number of filename suffixes does not match the number of source folders! ": "عدد لاحقات اسم الملف لا يتطابق مع عدد مجلدات المصدر!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "تم اكتشاف خطوط لاحقة اسم الملف. يرجى التحقق مرة أخرى لمعرفة فواصل الأسطر غير المرئية. يجب أن يكون هناك مسار مجلد واحد أو اسم ملف لاحقة لكل سطر. تأكد من عدم إنشاء خط فارغ بطريق الخطأ.",
    "The number of source folders does not match the number of destination folders!": "عدد المجلدات المصدر لا يتطابق مع عدد المجلدات الوجهة!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "تم الكشف عن المجلدات الوجهة. يرجى التحقق مرة أخرى لمعرفة فواصل الأسطر غير المرئية. يجب أن يكون هناك مسار مجلد واحد في كل سطر. تأكد من عدم إنشاء خط فارغ بطريق الخطأ.",
    "The number of source folders does not match the number of temporary conversion folders!": "عدد مجلدات المصدر لا يتطابق مع عدد مجلدات التحويل المؤقتة!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "تم اكتشاف مجلدات التحويل المؤقتة. يرجى التحقق مرة أخرى لمعرفة فواصل الأسطر غير المرئية. يجب أن يكون هناك مسار مجلد واحد في كل سطر. تأكد من عدم إنشاء خط فارغ بطريق الخطأ.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "يرجى إدخال حاوية صالحة مثل \".mp4\". تأكد من تضمين \".\"",
    "Corrupt file folder": "مجلد ملف تالف",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "غير موجود! يرجى التأكد من عدم وجود مسافات أو أحرف مخفية قبل / بعد المسار",
    "Source folder": "المجلد المصدر",
    "Temporary conversion folder": "مجلد تحويل مؤقت",
    "appears to be the same as or is within source folder": "يبدو أن يكون هو نفسه مثل أو هو داخل المجلد المصدر",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "والتي ستمنع HBBatchBeast من العمل بشكل صحيح. الرجاء تغيير مجلد التحويل المؤقت إلى مجلد خارج المجلد المصدر. إذا كنت تريد استخدام \"استبدال ميزة الملفات الأصلية\" ، فالرجاء تحديد مجلد وجهة لا يتطابق مع المجلد المصدر أو داخله ، ثم حدد مربع الاختيار \"استبدال الملفات الأصلية دائمًا\" في قسم الإعدادات المتقدمة . ألغ تحديد مربع الاختيار \"مجلد التحويل المؤقت\" المؤقت لأنه لن يخدم أي فائدة في هذه الحالة. سيتم تحويل الملفات إلى المجلد الوجهة ثم نقلها مرة أخرى إلى المجلد المصدر.",
    "Destination folder": "مجلد الوجهة",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "والتي ستمنع HBBatchBeast من العمل بشكل صحيح. الرجاء تغيير مجلد الوجهة إلى مجلد خارج المجلد المصدر. إذا كنت تريد استخدام \"استبدال ميزة الملفات الأصلية\" ، فالرجاء تحديد مجلد وجهة لا يتطابق مع المجلد المصدر أو داخله ، ثم حدد مربع الاختيار \"استبدال الملفات الأصلية دائمًا\" في قسم الإعدادات المتقدمة . ألغ تحديد مربع الاختيار \"مجلد التحويل المؤقت\" المؤقت لأنه لن يخدم أي فائدة في هذه الحالة. سيتم تحويل الملفات إلى المجلد الوجهة ثم نقلها مرة أخرى إلى المجلد المصدر.",
    "Error creating temporary conversion folder": "خطأ في إنشاء مجلد تحويل مؤقت",
    "Error creating destination folder": "خطأ في إنشاء مجلد الوجهة",
    "Please select to use HandBrake or FFmpeg!": "يرجى اختيار استخدام HandBrake أو FFmpeg!",
    "Please select a standard preset or input a custom one!": "يرجى تحديد إعداد مسبق قياسي أو إدخال واحد مخصص!",
    "Please select a scan interval of 5 seconds or greater!": "يرجى تحديد فاصل المسح الضوئي من 5 ثوان أو أكثر!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "يرجى التأكد من أن عدد مثيلات HandBrake / FFmpeg المتزامنة التي يتم استخدامها في وقت واحد هو واحد أو أكثر!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "مفتاح API غير صالح! يرجى النقر فوق \"جديد\" في علامة التبويب المراقبة عن بُعد لإنشاء مفتاح جديد.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "يرجى إدخال وقت المسح اليومي بتنسيق 24 ساعة: hh: mm (على سبيل المثال 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "سيتم حذف ملفات المصدر بعد التحويل! يرجى اختبار قبل الاستخدام السليم!",
    "Benchmark failed!": "فشل المعيار!",
    "Log does not exist!": "السجل غير موجود!",
    "Folder does not exist!": "المجلد غير موجود!",
    "Error sending email! Please check your settings.": "خطأ في إرسال البريد الإلكتروني! يرجى التحقق من الإعدادات الخاصة بك.",
    "Test email sent!": "إرسال اختبار البريد الإلكتروني!",
    "All worker processes have been stopped.": "تم إيقاف جميع عمليات العمال.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "سيتم إيقاف قائمة الانتظار بمجرد الانتهاء من معالجة العناصر الحالية. هل أنت متأكد من أنك تريد إيقاف قائمة الانتظار مؤقتًا؟",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "قائمة انتظار بدء الإيقاف المؤقت. سيظهر زر \"متابعة\" بمجرد توقف جميع العمال مؤقتًا.",
    "Healthy file cache cleared!": "مسح ذاكرة التخزين المؤقت ملف صحي!",
    "Cache cleared!": "مسح ذاكرة التخزين المؤقت!",
    "Cancel item": "إلغاء البند",
    "Please check the above checkbox to use this feature.": "يرجى التحقق من مربع الاختيار أعلاه لاستخدام هذه الميزة.",
    "Configuration": "ترتيب",
    "Source folders": "المجلدات المصدر",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "هذا هو المجلد المصدر الذي سيتم فحصه بحثًا عن الوسائط. يجب إدخال المجلد بدون شرطة مائلة زائدة. فمثلا:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "مربع مسار المجلد المصدر قابل للتوسيع (اضغط مفتاح الإدخال لإنشاء سطر جديد). إذا كنت ترغب في تحديد مجلدات مصدر متعددة ، فتأكد من أن كل مسار مجلد مصدر موجود على السطر الخاص به مثل:",
    "Video health check": "فحص صحة الفيديو",
    "Batch conversion and Folder watching": "تحويل الدفعة ومشاهدة المجلد",
    "Remote Monitoring (Beta)": "المراقبة عن بعد (تجريبية)",
    "Benchmark (Beta)": "المعيار (تجريبي)",
    "System": "النظام",
    "Help": "مساعدة",
    "Temporary conversion folders": "مجلدات التحويل المؤقتة",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "إذا كان \"مجلد تحويل مؤقت؟\" محددًا ، ثم يقوم HandBrake بتحويل الملفات إلى هذا المجلد. بمجرد الانتهاء من التحويل ، سيتم نقل الملف إلى \"مجلد الوجهة\". ستحتاج إلى تحديد أكبر عدد ممكن من مجلدات التحويل المؤقتة مثل مجلدات المصدر. سيتم تحويل المجلد المصدر الأول الخاص بك إلى مجلد التحويل المؤقت الأول الخاص بك ، المجلد المصدر الثاني الخاص بك إلى مجلد التحويل المؤقت الثاني الخاص بك وهلم جرا. تأكد من أن كل مسار لمجلد التحويل المؤقت على خطه الخاص.",
    "Destination folders": "المجلدات الوجهة",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "حدد مسارات مجلد الوجهة. مرة أخرى ، ستحتاج إلى تحديد أكبر عدد ممكن من المجلدات الوجهة مثل المجلدات المصدر. ستنتهي الملفات من مجلد المصدر الأول في مجلد الوجهة الأول ، وملفات المجلد المصدر الثاني في مجلد الوجهة الثاني ، وما إلى ذلك.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "المجلد المصدر الأول ---------> مجلد التحويل المؤقت الأول ---------> المجلد الوجهة الأول",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "المجلد المصدر الثاني ---------> مجلد التحويل المؤقت الثاني ---------> المجلد الوجهة الثاني",
    "etc": "إلخ",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "لن يعمل HBBatchBeast بشكل صحيح إذا قمت بتعيين المجلد الوجهة بنفس المجلد المصدر أو داخله.",
    "Standard preset:": "الإعداد المسبق القياسي:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "حدد إعداد HandBrake المسبق الذي ترغب في تحويل ملفاتك به. إذا تم تحديد \"إعداد مسبق قياسي\" ، فسيتم تحويل جميع الملفات الموجودة في المجلدات المحددة باستخدام إعداد HandBrake المسبق المحدد. يمكنك العثور على المزيد حول إعدادات HandBrake المسبقة هنا:",
    "Custom preset:": "إعداد مسبق مخصص:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "إذا كان \"الإعداد المسبق المخصص\" ، فأنت بحاجة إلى إدخال الإعداد المسبق المخصص الخاص بك. يغطي HBBatchBeast الجزء \"HandBrakeCLI -i source -o source\" من مدخلات HandBrakeCLI لذلك تحتاج إلى إدخال معلمات التحويل. فمثلا:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "إذا كنت تستخدم FFmpeg ، فأنت بحاجة إلى فصل معلمات الإدخال والإخراج بفاصلة. مثل:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "يمكنك أيضًا الارتباط بإعداد مسبق مخصص تم تصديره من تطبيق HandBrake GUI الرسمي على سبيل المثال:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "إذا كنت تواجه مشكلة في الإعدادات المسبقة المخصصة ، فقد يكون ذلك بسبب وجود خلل معروف في HandBrakeCLI (سيتم إصلاحه في إصدار HandBrakeCLI التالي). يرجى الاطلاع على هذا للحصول على حل مؤقت:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "يجب أن يكون كل إعداد مسبق مخصص على خطه ، وعلى غرار المجلدات ، يجب أن يكون هناك العديد من الإعدادات المسبقة المخصصة مثل المجلدات المصدر.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "المجلد المصدر الأول ---------> مجلد التحويل المؤقت الأول ---------> المجلد الوجهة الأول @ مخصص مسبقا 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "المجلد المصدر الثاني ---------> مجلد التحويل المؤقت الثاني ---------> المجلد الوجهة الثاني @ مخصص مسبق 2",
    "See the following image for guidance:": "انظر الصورة التالية للحصول على التوجيه:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "إذا كنت تستخدم تشفير بطاقة الرسومات (مثل NVENC) ، فقد تحتاج إلى تقليل عدد مثيلات HandBrake (جرّب 2 أو أقل) بسبب قيود VRAM.",
    "Select standard preset:": "حدد الإعداد المسبق القياسي:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "تم الكشف عن NVENC ، يرجى التأكد من خفض عدد مثيلات HandBrakeCLI إلى 2 أو أقل (لمعظم بطاقات الرسومات) أو قد تواجه أخطاء بسبب عدم كفاية VRAM. يمكن العثور على هذا الإعداد في علامة التبويب \"النظام\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "تم الكشف عن الإعداد المسبق الذي تم استيراده. إذا كنت تواجه مشكلة في الإعدادات المسبقة المخصصة المستوردة ، فقد يرجع ذلك إلى وجود خطأ معروف في HandBrakeCLI (سيتم إصلاحه في إصدار HandBrakeCLI التالي). الحل المؤقت هو إزالة '\"PictureRotate\": \"0: 0\"' من ملف .json. مزيد من المعلومات هنا:",
    "Container:": "حاوية:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "حدد الحاوية التي تريد أن يحتوي ملف الإخراج عليها مثل \".mp4\". يمكنك معرفة المزيد عن الحاويات على:",
    "Enable periodic scanning:": "تمكين المسح الدوري:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "يمكن لـ HBBatchBeast مراقبة مجلدات المصدر وتشغيل عمليات المسح بحثًا عن ملفات جديدة في فاصل زمني محدد. الوقت الفاصل بالثواني مع الافتراضي 300 ثانية (5 دقائق). إذا تم تحديد هذا الخيار ، فعند الضغط على \"المسح والتحويل\" ، سيقوم البرنامج بتحويل أي ملفات جديدة ثم يبدأ مؤقت للعد التنازلي. وهذا حلقة لا نهائية حتى توقف. الفاصل الزمني للمسح الضوئي موجود في قسم الإعدادات المتقدمة.",
    "Enable daily scanning:": "تمكين المسح اليومي:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "بدلاً من المسح الدوري ، يمكنك اختيار إجراء المسح مرة واحدة يوميًا. يتم إدخال وقت الفحص في قسم الإعدادات المتقدمة بتنسيق hh: mm مثل \"18: 30\". بمجرد تحديد \"المسح الضوئي والتحويل\" ، سينتظر البرنامج الوقت المحدد حتى يتم تشغيل عملية المسح والتحويل. مرة أخرى ، هذا سوف حلقة لا نهائية حتى توقف.",
    "Show/hide advanced:": "إظهار / إخفاء متقدم:",
    "Scan interval (minimum 5 seconds):": "فترة المسح (5 ثوان على الأقل):",
    "Daily run time (hh:mm):": "وقت التشغيل اليومي (ساعة: مم):",
    "Output filename suffix:": "اسم ملف الإخراج لاحقة:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "هذا اختياري. يمكنك تحديد لاحقة لإضافتها إلى نهاية اسم الملف الخاص بك مثل \"_1080p\" أو \"_testconversion\" وما إلى ذلك.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "إذا تم تحديد \"الإعداد المسبق القياسي\" ، فسيكون لكل ملفات الإخراج نفس اللاحقة.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "إذا تم تحديد \"إعداد مسبق مخصص\" ، فيمكنك تحديد لاحقة واحدة لكل مجلد مصدر / إعداد مسبق مخصص. تأكد من أن كل لاحقة على خطها الخاص. على سبيل المثال ، إذا كان لديك مجلدان مصدران وكنت تستخدم \"إعداد مسبق مخصص\" ، فيمكنك وضع هذا في مربع لاحقة اسم الملف:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "ستتم إضافة \"_720p\" من الملفات في المجلد المصدر الأول إلى اسم ملف الإخراج. ستتم إضافة الملفات الموجودة في المجلد المصدر الثاني إلى \"_1080p\" لإخراج اسم الملف وما إلى ذلك.",
    "Include these file types:": "تضمين أنواع الملفات هذه:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "أدخل أنواع الملفات للبحث عنها. يجب فصل كل نوع بفاصلة. الإدخال الافتراضي هو:",
    "Exclude files smaller than (MB):": "استبعاد الملفات الأصغر من (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "حدد ما إذا كنت تريد استبعاد ملفات أصغر من حجم معين من التحويل (بالميغابايت)",
    "Exclude files larger than (MB):": "استبعاد الملفات الأكبر من (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "حدد ما إذا كنت تريد استبعاد ملفات أكبر من حجم معين من التحويل (بالميغابايت)",
    "Exclude filenames which include any of these words:": "استبعد أسماء الملفات التي تتضمن أيًا من هذه الكلمات:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "أدخل الكلمات الرئيسية المراد تصفيتها عند البحث عن الملفات. على سبيل المثال ، إذا تم إدخال \"720p\" ، فلن يتم تحويل أي ملفات بها \"720p\" في العنوان. مرة أخرى ، يجب فصل الكلمات الرئيسية بفاصلة. على سبيل المثال ، أدخل ما يلي في مربع التصفية:",
    "Include files with any ": "تضمين الملفات مع أي",
    " or all ": "أو كل شيء",
    " of these": "من هؤلاء",
    "properties:": "الخصائص:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "هنا يمكنك إدخال خصائص الفيديو والصوت التي يجب أن تحتوي عليها الملفات لكي يتم تحويلها (المعلومات المستخرجة باستخدام FFprobe). يجب فصل الخصائص بفاصلة. استخدم أداة عارض معلومات الوسائط للمساعدة في تحديد الخصائص التي ترغب في تضمينها. تأكد من وضع فاصلة بعد الخاصية الأخيرة. على سبيل المثال ، لتحويل الملفات المشفرة فقط باستخدام h264 و aac stereo audio:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "تجدر الإشارة إلى أن فحص الخاصية هذا يتم بمجرد بدء عملية التحويل (لتوفير الوقت أثناء إنشاء قائمة الانتظار) ، لذلك على الرغم من أن الملفات قد تظهر في قائمة انتظار التحويل ، إلا أنه سيتم تخطيها / تضمينها إذا تم استيفاء الشروط الصحيحة.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "إذا كانت FFprobe قادرة على استخراج الخصائص ، فسيظهر \"موافق\" في عمود \"FFprobe\" في عرض قائمة الانتظار.",
    "Exclude files with any ": "استبعاد الملفات مع أي",
    " of these ": "من هؤلاء",
    "The opposite of 'Include files with any or all of these properties'": "عكس \"تضمين الملفات مع أي من هذه الخصائص أو جميعها\"",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "هذه أداة صغيرة لتحليل خصائص الملف من أجل مساعدتك في تحديد الخصائص التي ترغب في تضمينها / استبعادها في الخيارات المذكورة أعلاه. يستخدم FFprobe لإرجاع المعلومات. قم بسحب وإفلات الملفات في المربع الرمادي لتحليلها. على سبيل المثال ، قد يؤدي إسقاط ملف اختبار إلى إرجاع ما يلي:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "إذا كنت تتطلع إلى استبعاد ملفات كهذه من التحويل ، فيمكنك وضع العديد من خصائص الملف في مربع \"استبعاد الملفات مع أي من هذه الخصائص أو جميعها\" وتحديد خانة الاختيار الموجودة بجوار \"الكل\" بدلاً من \"أي\" ، مثل ذلك:",
    "Copy excluded files to destination:": "نسخ الملفات المستبعدة إلى الوجهة:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "إذا قمت بتحديد هذا الخيار ، فسيتم نسخ الملفات التي تم استبعادها من التحويل مباشرةً إلى المجلد الوجهة. هذا ينطبق على المرشحات التالية:",
    "Exclude filenames which include any of these words": "استبعد أسماء الملفات التي تتضمن أيًا من هذه الكلمات",
    "Include files with any or all of these properties": "تضمين الملفات مع أي من هذه الخصائص أو جميعها",
    "Exclude files with any or all of these properties": "استبعد الملفات التي تحتوي على أي من هذه الخصائص أو جميعها",
    "Exclude files smaller than (MB)": "استبعاد الملفات الأصغر من (MB)",
    "Exclude files larger than (MB)": "استبعاد ملفات أكبر من (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "لاحظ أن هذا ينطبق أيضًا على الملفات المستبعدة لأنها لا تفي بشروط خاصية \"تضمين\" الواردة أعلاه حتى لا تنسخ المكتبة بالكامل عن طريق الخطأ عندما تحاول فقط تحويل بعض الملفات.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "لا تنطبق ميزة النسخ على المرشحات التالية (أي الملفات المستبعدة بسبب المرشح)",
    "Include these file types": "تشمل هذه الأنواع من الملفات",
    "Delete source files after conversion:": "حذف الملفات المصدر بعد التحويل:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "إذا تم تحديد هذا ، ثم إذا نجحت محاولة تحويل ، فسيتم حذف الملف المصدر. تتم هذه العملية في النهاية ، بعد تحويل جميع الملفات. هذا يعني أنه يمكنك تحويل الملفات المصدر نفسها باستخدام إعدادات مسبقة متعددة ، كل ذلك دفعة واحدة. سيتم حذف الملفات المصدر بعد ذلك.",
    "Replace original file if converted file is smaller?(Compress attempt)": "استبدال الملف الأصلي إذا كان الملف المحول أصغر؟ (محاولة ضغط)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "حدد مربع الاختيار هذا إذا كنت ترغب في أن يقوم HBBatchBeast باستبدال الملف المصدر الأصلي تلقائيًا إذا كان الملف الجديد أصغر. إذا لم يكن الملف الجديد أصغر ، فسيتم تركه في المجلد الوجهة.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "تأكد من أن المجلد الوجهة الخاص بك ليس هو نفسه / أو في الداخل ، المجلد المصدر الخاص بك أو لن يعمل بشكل صحيح.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "بمجرد أن يحاول HBBatchBeast ضغط ملف معين ، فسيضيف مسار الملف هذا إلى ذاكرة تخزين مؤقت حتى لا تتم محاولته مرة أخرى في المستقبل. يمكنك عرض / تحرير / مسح ذاكرة التخزين المؤقت باستخدام الأزرار الصفراء.",
    "Replace original file always?": "استبدال الملف الأصلي دائما؟",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "سيتم استبدال الملف الأصلي بغض النظر عما إذا كان الملف الجديد أكبر أم أصغر.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "مرة أخرى ، تأكد من أن مجلد الوجهة الخاص بك ليس هو نفسه / أو داخل ، المجلد المصدر الخاص بك أو لن يعمل بشكل صحيح.",
    "Copy subtitle (srt) files to destination?": "نسخ ملفات الترجمة (SRT) إلى الوجهة؟",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "سيتم نسخ ملفات العنوان الفرعي \".srt\" إلى المجلد الوجهة تلقائيًا.",
    "Automatically create temporary/destination folders if they don't exist?": "إنشاء المجلدات المؤقتة / الوجهة تلقائيًا إذا لم تكن موجودة؟",
    "Custom bat path to run after each conversion (leave blank if not using):": "مسار مضرب مخصص للتشغيل بعد كل تحويل (اتركه فارغًا إذا لم يستخدم):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "أدخل المسار إلى ملف دفعي مخصص ترغب في تنفيذه بعد كل تحويل. فمثلا:",
    "Batch files with timeout statements won't work. More info here:": "لن تعمل الملفات الدفعية ذات عبارات المهلة. مزيد من المعلومات هنا:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "اترك المربع فارغًا تمامًا إذا كنت لا ترغب في استخدام هذا الخيار (تأكد من عدم وجود أحرف مخفية في المربع)",
    "Run processes at low priority?": "تشغيل العمليات في أولوية منخفضة؟",
    "All conversion processes will be run at low priority, reducing processor usage.": "سيتم تشغيل جميع عمليات التحويل بأولوية منخفضة ، مما يقلل من استخدام المعالج.",
    "Remove apostrophes from filenames:": "إزالة الفواصل العليا من أسماء الملفات:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "قد تفشل عمليات فحص التحويلات / التحقق من الصحة إذا كانت أسماء الملفات تحتوي على علامة اقتباس أحادية. حدد هذا الخيار لإزالة علامات اقتباس أحادية تلقائيًا من أسماء الملفات.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "يمكن لهذه الميزة البحث عن ملفات الفيديو الفاسدة باستخدام ميزة '- مسح' HandBrake ، على الرغم من أن هذا ليس دقيقًا دائمًا. كما يستخدم FFprobe لتوفير نقطة مرجعية ثانية. إذا فشل كل من FFprobe و HandBrake ، فهناك احتمال كبير أن يكون الملف تالفًا.",
    "Move corrupt files into the following folder:": "انقل الملفات التالفة إلى المجلد التالي:",
    " If checked, then any files which give errors will be moved into the specified folder.": "إذا تم تحديده ، فسيتم نقل أي ملفات تعطي أخطاء إلى المجلد المحدد.",
    "Corrupt file folder:": "مجلد ملف تالف:",
    "Run thorough file health check:": "تشغيل فحص شامل للملفات الصحية:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "إذا تم تحديده ، فسيتم تشغيل فحص صحة فيديو أبطأ بكثير باستخدام FFmpeg بدلاً من HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "استنادًا إلى 'ScanMedia.ps1' من Desani الموجودة في:",
    "Attempt to repair files after thorough check:": "محاولة إصلاح الملفات بعد فحص شامل:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "إذا تم تحديده ، سيحاول HBBatchBeast إصلاح الملفات باستخدام FFmpeg. سيتم إنشاء ملف جديد مع لاحقة \"_repaired\" في نفس المجلد مثل الملف المصدر.",
    "'CRF' value to use when attempting to repair files:": "قيمة \"CRF\" لاستخدامها عند محاولة إصلاح الملفات:",
    "The default 'CRF' value is 23. Please see the following for more information:": "القيمة الافتراضية \"CRF\" هي 23. يرجى مراجعة ما يلي لمزيد من المعلومات:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "نطاق المقياس CRF هو 0–51 ، حيث 0 بلا خسارة ، 23 هو الافتراضي ، و 51 هو أسوأ جودة ممكنة. تؤدي القيمة الأقل عمومًا إلى جودة أعلى ، ويبلغ مدى عاقل ذاتي 17-28. اعتبار أن 17 أو 18 بلا خسارة بصرية أو تقريبًا ؛ يجب أن تبدو هي نفسها أو تقريبًا نفس المدخلات ولكنها ليست ضائعة تقنيًا.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "يحفظ HBBatchBeast قائمة مسارات الملفات الممسوحة ضوئيًا التي تم الإبلاغ عنها على أنها غير تالفة. امسح ذاكرة التخزين المؤقت لإجراء فحص جديد على جميع الملفات.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "عدد مثيلات HandBrake / FFmpeg المتزامنة الواجب استخدامها؟ (موصى به 4 أو أقل):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "ينطبق هذا الإعداد على كل من \"فحص صحة الفيديو\" وعمليات \"المسح الضوئي والتحويل\". حدد عدد مؤشرات ترابط HandBrake المراد استخدامها. لا يوجد حد أقصى على الرغم من أنه يوصى بعدم استخدام أكثر من 4. قد يجمد مقدار أعلى جهاز الكمبيوتر الخاص بك إذا لم يكن قوياً للغاية.",
    "Queue size view limit?(Recommended 1000 or fewer):": "حد عرض حجم قائمة الانتظار؟ (موصى به 1000 أو أقل):",
    "Automatically start \"Scan and convert\" when program opened?": "هل تريد بدء \"المسح والتحويل\" تلقائيًا عند فتح البرنامج؟",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "املأ تفاصيل البريد الإلكتروني لتلقي إشعارات البريد الإلكتروني في حالة حدوث خطأ أثناء الفحص الصحي أو مراقبة التحويل / المجلد. لن تعمل مع الحسابات التي تتطلب 2FA. تحتاج إلى تمكين الوصول إلى التطبيقات الأقل أمانًا على حسابات Gmail.",
    "Email address:": "عنوان بريد الكتروني:",
    "For example:": "فمثلا:",
    "Email password(not saved):": "كلمة مرور البريد الإلكتروني (لم يتم حفظها):",
    "SMTP server:": "خادم SMTP:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "تتيح هذه الميزة مراقبة حالة التحقق من التحويل / الصحة باستخدام أي متصفح ويب. مفيد عند تشغيل الخوادم وما إلى ذلك",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "في حالة التمكين ، سيتم إرسال البيانات المجهولة التالية إلى HBBatchBeast.io:",
    "API key": "مفتاح API",
    "Current status ('Searching', 'Running', 'Finished' etc)": "الوضع الحالي (\"البحث\" ، \"التشغيل\" ، \"انتهى\" ، إلخ)",
    "Number of:": "رقم ال:",
    "Remaining items": "البنود المتبقية",
    "Successful items": "العناصر الناجحة",
    "Errored items": "العناصر الخاطئة",
    "Cancelled items": "العناصر الملغاة",
    "Worker percentages": "نسب العمال",
    "Last completed item time": "آخر مرة اكتمل البند",
    "Enable remote monitoring?:": "تمكين المراقبة عن بعد؟",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "أداة مساعدة أساسية لقياس الأداء تم تصميمها أساسًا لمعرفة أداء 16+ من المعالجات الأساسية باستخدام مثيلات HandBrake متعددة على الرغم من إمكانية تشغيلها على أي نوع من المعالجات.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "سيؤدي ذلك إلى تنزيل ملف عينة بحجم h265 4 كيلو بايت (2.5 ميجابايت) وتشغيل معيار باستخدام 4 مثيلات HandBrake مع الإعداد المسبق \"سريع للغاية 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "يمكن تحميل النتائج على hbbatchbeast.io إذا اخترت ذلك.",
    "Queue": "طابور",
    "Output this session": "إخراج هذه الجلسة",
    "Media info viewer tool": "أداة عارض معلومات الوسائط",
    "View compress attempt cache": "عرض ضغط محاولة ذاكرة التخزين المؤقت",
    "Clear compress attempt cache": "مسح ضغط ذاكرة التخزين المؤقت المحاولة",
    "Save config": "حفظ التكوين",
    "Scan only": "مسح فقط",
    "Scan and convert": "مسح وتحويل",
    "View scan/conversion summary log": "عرض المسح / ملخص سجل التحويل",
    "View individual file check/conversion log": "عرض ملف فردي تحقق / سجل التحويل",
    "View worker console output": "عرض إخراج وحدة التحكم عامل",
    "Health check": "فحص طبي",
    "Clear healthy file cache": "مسح ذاكرة التخزين المؤقت ملف صحي",
    "View error log": "عرض سجل الأخطاء",
    "Email test": "اختبار البريد الإلكتروني",
    "View master log": "عرض السجل الرئيسي",
    "Wiki help": "مساعدة ويكي",
    "An application by HaveAGitGat": "طلب من HaveAGitGat",
    "New": "الجديد",
    "Launch": "إطلاق",
    "Benchmark": "المعيار",
    "See results": "رؤية النتائج",
    "Pause queue": "وقفة الانتظار",
    "Continue queue": "متابعة قائمة الانتظار",
    "Stop queue": "وقف قائمة الانتظار",
    "Convert selected files": "تحويل الملفات المحددة",
    "Toggle queue view": "تبديل عرض قائمة الانتظار",
    "Deselect all": "الغاء تحديد الكل",
    "Invert all": "عكس كل شيء",
    "Select all": "اختر الكل",
    "Toggle output view": "تبديل عرض الإخراج"
}