{"The number of custom presets does not match the number of source folders!":"Колькасць заказных пресетов не адпавядае колькасці зыходных тэчак!","source folders have been detected.":"былі знойдзеныя тэчкі-крыніцы.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"былі выяўленыя зададзеныя радкі. Калі ласка, праверце праверку нябачных разрыўаў радкоў. Павінна быць адзін шлях да тэчкі або зададзены ў радку. Пераканайцеся, што вы выпадкова не стварылі пустую радок.","The number of filename suffixes does not match the number of source folders! ":"Колькасць суфіксаў файла не адпавядае колькасці тэчак-крыніц!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"Суфікс імя файла быў знойдзены. Калі ласка, праверце праверку нябачных разрыўаў радкоў. У радку павінен быць адзін шлях да тэчкі або суфікс імя файла. Пераканайцеся, што вы выпадкова не стварылі пустую радок.","The number of source folders does not match the number of destination folders!":"Колькасць тэчак-крыніц не адпавядае колькасці папак прызначэння!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"тэчкі прызначэння былі выяўленыя. Калі ласка, праверце праверку нябачных разрыўаў радкоў. У радку павінна быць адзін шлях да тэчкі. Пераканайцеся, што вы выпадкова не стварылі пустую радок.","The number of source folders does not match the number of temporary conversion folders!":"Колькасць зыходных тэчак не адпавядае колькасці часовых папак пераўтварэння!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"Часовыя папкі пераўтварэння былі выяўленыя. Калі ласка, праверце праверку нябачных разрыўаў радкоў. У радку павінна быць адзін шлях да тэчкі. Пераканайцеся, што вы выпадкова не стварылі пустую радок.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Калі ласка, увядзіце сапраўдны кантэйнер, напрыклад, '.mp4'. Пераканайцеся ў тым, каб уключыць '.'","Corrupt file folder":"Пашкоджаная тэчка файла","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"не існуе! Калі ласка, пераканайцеся, што прабелаў або схаваных знакаў да / пасля шляху няма","Source folder":"Зыходная тэчка","Temporary conversion folder":"Часовая папка пераўтварэння","appears to be the same as or is within source folder":"падобна, ці знаходзіцца ў тэчцы зыходнага кода","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"што не дазволіць HBBatchBeast правільна працаваць. Калі ласка, змяніце тэчку часовага пераўтварэння ў тэчку за межамі зыходнай тэчкі. Калі вы хочаце выкарыстоўваць функцыю \"Замяніць арыгінальныя файлы\", выберыце тэчку прызначэння, якая не з'яўляецца той ці іншай, зыходнай тэчкай, а затым усталюйце сцяжок 'Змяніць арыгінальныя файлы заўсёды' у раздзеле Дадатковыя налады. . Здыміце сцяжок часовай папкі \"Часовая канверсія\", бо гэта не будзе карысна ў гэтым выпадку. Файлы будуць пераўтвораны ў мэтавую тэчку, а затым перамяшчаюцца назад у зыходную тэчку.","Destination folder":"Тэчка прызначэння","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"што не дазволіць HBBatchBeast правільна працаваць. Зменіце тэчку прызначэння на тэчку за межамі зыходнай тэчкі. Калі вы хочаце выкарыстоўваць функцыю \"Замяніць арыгінальныя файлы\", выберыце тэчку прызначэння, якая не з'яўляецца той ці іншай, зыходнай тэчкай, а затым усталюйце сцяжок 'Змяніць арыгінальныя файлы заўсёды' у раздзеле Дадатковыя налады. . Здыміце сцяжок часовай папкі \"Часовая канверсія\", бо гэта не будзе карысна ў гэтым выпадку. Файлы будуць пераўтвораны ў мэтавую тэчку, а затым перамяшчаюцца назад у зыходную тэчку.","Error creating temporary conversion folder":"Памылка стварэння часовай тэчкі пераўтварэння","Error creating destination folder":"Памылка стварэння тэчкі прызначэння","Please select to use HandBrake or FFmpeg!":"Калі ласка, абярыце выкарыстоўваць HandBrake або FFmpeg!","Please select a standard preset or input a custom one!":"Калі ласка, абярыце стандартны набор або ўвядзіце індывідуальны!","Please select a scan interval of 5 seconds or greater!":"Калі ласка, абярыце інтэрвал сканавання 5 секунд і больш!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Калі ласка, пераканайцеся, што колькасць адначасовых экземпляраў HandBrake / FFmpeg - адзін ці больш!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Няправільны ключ API! Калі ласка, націсніце кнопку \"Новы\" на ўкладцы выдаленага маніторынгу, каб стварыць новы ключ.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Калі ласка, увядзіце штодзённае час сканавання ў 24-гадзінным фармаце: чч: мм (напрыклад, 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"Пасля канверсіі будуць выдаленыя файлы. Калі ласка, праверце перад належным выкарыстаннем!","Benchmark failed!":"Тэст не ўдалося!","Log does not exist!":"Часопіс не існуе!","Folder does not exist!":"Тэчка не існуе!","Error sending email! Please check your settings.":"Памылка пры адпраўцы электроннай пошты! Праверце налады.","Test email sent!":"Праверка электроннай пошты адпраўлена!","All worker processes have been stopped.":"Усе працоўныя працэсы былі спыненыя.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Чарга будзе прыпынена пасля завяршэння апрацоўкі бягучых элементаў. Вы ўпэўнены, што жадаеце прыпыніць чаргу?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Пачынаецца паўза чаргі. Кнопка \"Працяг\" будзе з'яўляцца пасля таго, як усе работнікі прыпыніліся.","Healthy file cache cleared!":"Здаровы кэш файлаў ачышчаны!","Cache cleared!":"Кэш ачышчаны!","Cancel item":"Адмяніць элемент","Please check the above checkbox to use this feature.":"Калі ласка, праверце вышэйзгаданы сцяжок, каб выкарыстоўваць гэтую функцыю.","Configuration":"Канфігурацыя","Source folders":"Зыходныя тэчкі","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Гэта зыходная тэчка, якая будзе адсканавана на медыя. Тэчку трэба ўводзіць без касой рысы. Напрыклад:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Шлях зыходнай папкі пашыраецца (націсніце клавішу Увод, каб стварыць новую радок). Калі вы хочаце ўсталяваць некалькі зыходных тэчак, пераканайцеся, што кожны шлях да тэчкі-крыніцы знаходзіцца ў сваёй уласнай радку, напрыклад:","Video health check":"Праверка здароўя відэа","Batch conversion and Folder watching":"Пакетнае пераўтварэнне і прагляд тэчак","Remote Monitoring (Beta)":"Аддалены маніторынг (Beta)","Benchmark (Beta)":"Тэст (Бэта)","System":"Сістэма","Help":"Дапамажыце","Temporary conversion folders":"Часовыя папкі пераўтварэння","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Калі \"Тэчка часовай канверсіі?\" усталяваны, HandBrake пераўтворыць файлы ў гэтую тэчку. Пасля завяршэння пераўтварэння файл будзе змешчаны ў \"тэчку прызначэння\". Вам трэба будзе паказаць столькі часовых папак пераўтварэння, колькі зыходных папак. Ваша першая тэчка-крыніца будзе пераўтворана ў вашу першую папку часовага пераўтварэння, другую тэчку-крыніцу ў другую тэчку часовага пераўтварэння і г.д. Пераканайцеся, што кожны часовы шлях тэчкі пераўтварэння знаходзіцца ў сваёй уласнай радку.","Destination folders":"Тэчкі прызначэння","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Пакажыце шляху да папкі прызначэння. Зноў жа, вам трэба будзе вызначыць столькі тэчак прызначэння, колькі тэчак-крыніц. Файлы з вашай першай тэчкі зыходных файлаў у канчатковым выніку будуць у вашай першай тэчцы прызначэння, у другой папкі зыходнай папкі ў другой тэчцы прызначэння і гэтак далей.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Першая папка крыніцы ---------> Першая папка часовага пераўтварэння ---------> Першая тэчка прызначэння","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Другая тэчка крыніцы ---------> Другая папка часовага пераўтварэння ---------> Другая тэчка прызначэння","etc":"і г.д.","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast не будзе працаваць належным чынам, калі вы ўсталюеце тэчку прызначэння такую ж, як і ў яе, зыходная тэчка.","Standard preset:":"Стандартны набор:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Выберыце пресет HandBrake, у які вы хочаце пераўтварыць файлы. Калі абрана \"Стандартная пресета\", то ўсе файлы ў абранай тэчцы будуць пераўтвораны з дапамогай зададзенай пресеты HandBrake. Вы можаце даведацца больш пра пресеты HandBrake тут:","Custom preset:":"Прыстасаваны набор:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Калі \"Custom preset\" вам трэба ўвесці свой уласны набор. HBBatchBeast ахоплівае частку ўвахода HandBrakeCLI \"HandBrakeCLI -i-крыніца прызначэння\", так што вам трэба ўвесці параметры пераўтварэння. Напрыклад:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Пры выкарыстанні FFmpeg вам трэба аддзяліць ўваходныя і выходныя параметры запятымі. Такія як:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Вы таксама можаце спасылацца на прыстасаваную пресет, экспартуемую з афіцыйнага прыкладання HandBrake GUI:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Калі ў вас узніклі праблемы з карыстацкімі пресетами, гэта можа быць звязана з вядомай памылкай з HandBrakeCLI (будзе выпраўлена ў наступным выпуску HandBrakeCLI). Калі ласка, азнаёмцеся з гэтым для часовага рашэння:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Кожны прыстасаваны пресет павінен быць у сваёй уласнай радку, і, падобна тэчкам, трэба мець столькі прырэтаў, колькі зыходных тэчак.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Папка першага зыходнага кода ---------> Першая папка часовага пераўтварэння ---------> Першая тэчка прызначэння @ Custom preset 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Папка другой крыніцы ---------> Другая папка часовага пераўтварэння ---------> Другая тэчка прызначэння @ Custom preset 2","See the following image for guidance:":"Глядзіце наступныя выявы для кіраўніцтва:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Калі вы выкарыстоўваеце кадоўку відэакарты (напрыклад, NVENC), вам можа спатрэбіцца паменшыць колькасць экземпляраў HandBrake (паспрабуйце 2 ці менш) з-за абмежаванняў VRAM.","Select standard preset:":"Выберыце стандартны набор:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC выявіла, калі ласка, пераканайцеся, што колькасць экземпляраў HandBrakeCLI памяншаецца да 2 ці ніжэй (для большасці відэакарт) ці вы можаце сутыкнуцца з памылкамі з-за недахопу VRAM. Гэты параметр можна знайсці на ўкладцы \"Сістэма\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Імпартаваная пресет обнаружена. Калі ў вас узніклі праблемы з імпартаванымі прыстасавымі пресетами, гэта можа быць звязана з вядомай памылкай з HandBrakeCLI (будзе выпраўлена ў наступным выпуску HandBrakeCLI). Часовым рашэннем з'яўляецца выдаленне \"\" PictureRotate \":\" 0: 0 \"'з файла .json. Больш падрабязная інфармацыя тут:","Container:":"Кантэйнер:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Пакажыце кантэйнер, у якога патрэбны выхадны файл, як '.mp4'. Вы можаце даведацца больш пра кантэйнеры па адрасе:","Enable periodic scanning:":"Уключыць перыядычнае сканаванне:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast можа кантраляваць вашы зыходныя тэчкі і сканаваць новыя файлы з зададзеным інтэрвалам. Інтэрвал часу ў секундах, па змаўчанні 300 секунд (5 хвілін). Калі абрана гэтая опцыя, тады, калі вы націскаеце \"Сканіраваць і пераўтварыць\", праграма пераўтворыць любыя новыя файлы і пачнецца таймер зваротнага адліку. Гэта будзе завесы бясконца, пакуль не спыніцца. Інтэрвал сканавання знаходзіцца ў раздзеле Дадатковыя налады.","Enable daily scanning:":"Уключыць штодзённае сканаванне:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Замест перыядычнага сканавання вы можаце выбраць сканаванне, якое будзе выконвацца раз у дзень. Час сканавання ўводзіцца ў раздзеле Дадатковыя налады ў фармаце hh: mm, напрыклад, '18: 30 '. Пасля выбару \"Сканаванне і пераўтварэнне\" праграма будзе чакаць, пакуль не будзе паказаны час, пакуль не будзе запушчаны працэс сканавання і пераўтварэння. Зноў жа, гэта будзе завесы бясконца, пакуль не спыніцца.","Show/hide advanced:":"Паказаць / схаваць пашырана:","Scan interval (minimum 5 seconds):":"Інтэрвал сканавання (мінімум 5 секунд):","Daily run time (hh:mm):":"Сутачная працягласць працы (чч: мм):","Output filename suffix:":"Суфікс імя файла вываду:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Гэта не абавязкова. Вы можаце паказаць суфікс, каб дадаць да канца свайго імя файла, як '_1080p' ці '_testconversion' і г.д.","If 'standard preset' is selected then all output files will have the same suffix.":"Калі абрана \"стандартная пресета\", то ўсе выходныя файлы будуць мець адзін і той жа суфікс.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Калі абрана \"прыстасаваная пресета\", то вы можаце ўсталяваць адзін суфікс для тэчкі-крыніцы / прыстасаванай пресеты. Пераканайцеся, што кожны суфікс знаходзіцца ў сваім уласным радку. Напрыклад, калі ў вас ёсць 2 зыходныя тэчкі і вы карыстаецеся \"прыстасаваныя папярэднія\", вы можаце змясціць гэта ў поле суфіксаў імя файла:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Файлы ў першай тэчцы зыходнага коду дададуць '_720p' у імя файла вываду. Файлы ў другой тэчцы-крыніцы будуць дададзены '_1080p' у імя файла вываду і г.д.","Include these file containers:":"Уключыце гэтыя кантэйнеры для файлаў:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Калі ласка, увядзіце кантэйнеры файлаў для праверкі. Кожны тып павінен быць падзелены коскі. Запіс па змаўчанні:","Exclude files smaller than (MB):":"Выключыць файлы менш (МБ):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Пакажыце, ці варта выключаць файлы з меншай колькасцю вызначанага памеру з пераўтварэння (у мегабайтах)","Exclude files larger than (MB):":"Выключыць файлы больш, чым (МБ):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Пакажыце, ці варта выключаць файлы з канвертацыі файлаў больш, чым пэўнага памеру (у мегабайтах)","Exclude filenames which include any of these words:":"Выключыць імёны файлаў, якія ўключаюць любое з гэтых слоў:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Увядзіце ключавыя словы, якія трэба адфільтраваць пры сканаванні файлаў. Напрыклад, калі ўводзіцца \"720p\", то любыя файлы з \"720p\" у загалоўку не будуць пераўтвораныя. Зноў жа, ключавыя словы павінны быць падзеленыя коскамі. Напрыклад, у поле фільтра ўвядзіце наступнае:","Include files with any ":"Уключыце файлы з любым"," or all ":"ці ўсё"," of these":"з іх","properties:":"Уласцівасці:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Тут вы можаце ўвесці ўласцівасці відэа і аўдыё, якія павінны мець файлы для пераўтварэння (інфармацыя здабываецца з дапамогай FFprobe). Уласцівасці павінны быць падзеленыя коскамі. З дапамогай інструмента прагляду інфармацыі пра медыя можна вызначыць, якія ўласцівасці вы хочаце ўключыць. Пераканайцеся, што паставіце коску пасля апошняга ўласцівасці. Напрыклад, каб пераўтварыць толькі файлы, закадаваныя з выкарыстаннем h264 і aac stereo audio:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Варта адзначыць, што гэта праверка ўласцівасці праводзіцца пасля запуску працэсу пераўтварэння (зэканоміць час пры пабудове чаргі), таму што файлы ў чарзе пераўтварэння могуць з'явіцца, яны будуць прапушчаныя / уключаныя ў выпадку выканання правільных умоў.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Калі FFprobe здольны здабываць уласцівасці, у слупку \"FFprobe\" у выглядзе чаргі з'явіцца \"OK\".","Exclude files with any ":"Выключыць файлы з любой"," of these ":"з іх","The opposite of 'Include files with any or all of these properties'":"Супрацьлегласць \"Уключыць файлы з любым ці ўсім з гэтых уласцівасцяў\"","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Гэта невялікі інструмент для аналізу ўласцівасцяў файла, каб дапамагчы вам вызначыць, якія ўласцівасці вы хочаце ўключыць / выключыць у прыведзеных вышэй варыянтах. Ён выкарыстоўвае FFprobe для вяртання інфармацыі. Перацягнуць файлы ў шэры поле, каб прааналізаваць іх. Напрыклад, пры падзенні ў тэставы файл можа вярнуцца наступнае:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Калі вы жадаеце выключыць пераўтварэнне падобных файлаў, вы можаце змясціць некалькі ўласцівасцяў файла ў поле \"Выключыць файлы з любымі або усімі гэтымі ўласцівасцямі\" і ўсталяваць сцяжок побач з \"усе\" замест \"любы\" як так:","Copy excluded files to destination:":"Капіяваць выключаныя файлы ў пункт прызначэння:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Калі вы вылучыце гэты параметр, файлы, якія былі выключаны з канверсіі, будуць скапіяваныя непасрэдна ў тэчку прызначэння. Гэта адносіцца да наступных фільтраў:","Exclude filenames which include any of these words":"Выключыць імёны файлаў, якія ўключаюць любое з гэтых слоў","Include files with any or all of these properties":"Уключыце файлы з любымі або усімі гэтымі ўласцівасцямі","Exclude files with any or all of these properties":"Выключыць файлы з любымі або усімі гэтымі ўласцівасцямі","Exclude files smaller than (MB)":"Выключыць файлы менш, чым (МБ)","Exclude files larger than (MB)":"Выключыць файлы больш, чым (МБ)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Звярніце ўвагу, што гэта таксама тычыцца выключаных файлаў, таму што яны не адпавядаюць умовам уласцівасці \"Уключыць\" вышэй, таму выпадкова не капіюйце ўсю бібліятэку, калі спрабуеце пераўтварыць некалькі файлаў.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Функцыя капіравання не распаўсюджваецца на наступныя фільтры (г.зн. файлы, выключаныя з-за фільтра)","Include these file types":"Уключыце гэтыя тыпы файлаў","Delete source files after conversion:":"Выдаліць зыходныя файлы пасля пераўтварэння:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Калі гэта абрана, то калі спроба пераўтварэння паспяхова, зыходны файл будзе выдалены. Гэты працэс выконваецца ў самым канцы, пасля пераўтварэння ўсіх файлаў. Гэта азначае, што вы можаце пераўтварыць тыя ж зыходныя файлы, выкарыстоўваючы некалькі пресетов, усё за адзін раз. Потым зыходныя файлы будуць выдаленыя.","Replace original file if converted file is smaller?(Compress attempt)":"Заменіце зыходны файл, калі пераўтвораны файл менш? (Спроба сціску)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Усталюйце гэты сцяжок, калі HBBatchBeast аўтаматычна замяніць зыходны файл, калі новы файл менш. Калі новы файл не менш, то ён застанецца ў тэчцы прызначэння.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Пераканайцеся, што ваша папка прызначэння не такая, як / ці ўнутры, ваша зыходная тэчка, ці яна не будзе працаваць належным чынам.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Пасля таго, як HBBatchBeast спрабуе сціснуць пэўны файл, ён дадасць гэты шлях файла ў кэш, так што ён не будзе спрабаваны зноў у будучыні. Вы можаце праглядзець / рэдагаваць / выдаліць кэш з дапамогай жоўтых кнопак.","Replace original file always?":"Змяніць арыгінальны файл заўсёды?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Зыходны файл будзе заменены незалежна ад таго, ці будзе новы файл большым ці меншым.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Зноў жа, пераканайцеся, што ваша папка прызначэння не такая, як / ці ўнутры вашай тэчкі-крыніцы, ці яна не будзе працаваць належным чынам.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Пасля таго, як HBBatchBeast перанеслі канкрэтны файл, ён дадасць гэты шлях да кэша, так што ў далейшым ён не будзе спроб. Вы можаце праглядзець / рэдагаваць / выдаліць кэш з дапамогай жоўтых кнопак.","Copy subtitle (srt) files to destination?":"Капіяваць файлы субтытраў (SRT) у пункт прызначэння?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Файлы субтытраў '.srt' будуць аўтаматычна скапіяваныя ў тэчку прызначэння.","Automatically create temporary/destination folders if they don't exist?":"Аўтаматычна стварыць часовыя / прызначаныя тэчкі, калі яны не існуюць?","Custom bat path to run after each conversion (leave blank if not using):":"Карыстацкі шлях для біта для запуску пасля кожнага пераўтварэння (пакіньце пустым, калі не выкарыстоўваеце):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Увядзіце шлях да карыстацкага пакетнага файла, які вы хочаце выканаць пасля кожнага пераўтварэння. Напрыклад:","Batch files with timeout statements won't work. More info here:":"Пакетныя файлы з аперацыямі тайм-аўту не будуць працаваць. Больш падрабязная інфармацыя тут:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Пакіньце поле цалкам пустым, калі вы не жадаеце выкарыстоўваць гэтую опцыю (пераканайцеся, што ў поле няма схаваных знакаў).","Run processes at low priority?":"Запуск працэсаў з нізкім прыярытэтам?","All conversion processes will be run at low priority, reducing processor usage.":"Усе працэсы пераўтварэння будуць працаваць з нізкім прыярытэтам, што памяншае выкарыстанне працэсара.","Remove apostrophes from filenames:":"Выдаліць апострафы з назваў файлаў:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Сканаванне канверсіі / праверкі здароўя можа адбыцца збой, калі ў імёнах файлаў ёсць апострафы. Праверце гэта, каб аўтаматычна выдаліць апострафы з імёнаў файлаў."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Гэтая функцыя можа сканаваць пашкоджаныя відэафайлы з дапамогай функцыі \"--scan\" HandBrake, хоць гэта не заўсёды дакладна. Ён таксама выкарыстоўвае FFprobe для забеспячэння другой эталоннай кропкі. Калі абодва FFprobe і HandBrake не ўдалося, то існуе высокая верагоднасць пашкоджання файла.","Move corrupt files into the following folder:":"Перамясціць пашкоджаныя файлы ў наступную тэчку:"," If checked, then any files which give errors will be moved into the specified folder.":"Калі вы ўсталюеце гэты файл, усе файлы, якія прыводзяць да памылак, будуць перамешчаныя ў тэчку.","Corrupt file folder:":"Пашкоджаная тэчка файла:","Run thorough file health check:":"Выканаць старанную праверку стану файлаў:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Калі ўключана, то значна больш павольная, больш дбайная праверка здароўя відэа будзе выкарыстоўвацца з дапамогай FFmpeg замест HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"На падставе 'ScanMedia.ps1' Десани знойдзены на:","Attempt to repair files after thorough check:":"Спроба аднавіць файлы пасля дбайнай праверкі:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Калі ўключана, HBBatchBeast паспрабуе аднавіць файлы з дапамогай FFmpeg. Новы файл з суфіксам '_repaired' будзе створаны ў той жа тэчцы, што і зыходны файл.","'CRF' value to use when attempting to repair files:":"Значэнне 'CRF', якое будзе выкарыстоўвацца пры спробе аднавіць файлы:","The default 'CRF' value is 23. Please see the following for more information:":"Па змаўчанні значэнне 'CRF' складае 23. Для атрымання дадатковай інфармацыі гл. Наступнае:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Дыяпазон шкалы CRF складае 0–51, 0 - без страт, 23 - па змаўчанні, 51 - найгоршае якасць. Больш нізкае значэнне звычайна прыводзіць да больш высокай якасці, а дыяпазон суб'ектыўна разумны - 17-28. Лічыце, што 17 ці 18 з'яўляюцца візуальна без стратамі; ён павінен выглядаць так жа, ці амаль такі ж, як уваход, але гэта не тэхнічна без страт.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast захоўвае спіс адсканаваных шляхоў да файлаў, якія паведамляюцца як карумпаваныя. Ачысціце кэш, каб зрабіць новае сканаванне ўсіх файлаў.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Колькасьць адначасовых экземпляраў HandBrake / FFmpeg? (Рэкамендуецца 4 ці менш):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Гэты параметр распаўсюджваецца як на працэсы \"Праверка здароўя відэа\", так і \"Сканаванне і пераўтварэнне\". Пакажыце колькі патокаў HandBrake. Там няма максімуму, хоць рэкамендуецца не выкарыстоўваць больш за 4. Большая колькасць можа замарозіць ваш кампутар, калі ён не вельмі магутны.","Queue size view limit?(Recommended 1000 or fewer):":"Абмежаванне прагляду памераў у чарзе? (Рэкамендавана 1000 ці менш):","Automatically start \"Scan and convert\" when program opened?:":"Аўтаматычна запусціць \"Сканаваць і пераўтварыць\", калі праграма адкрыецца ?:","Save verbose logs?:":"Захаваць шматбаковыя часопісы ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Уключыце гэты сцяжок, каб захаваць падрабязныя часопісы падпрацэсаў. Гэта ўключае ў сябе працоўную кансоль ouput. Гэта прывядзе да вельмі вялікіх часопісаў.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Запоўніце падрабязнасці электроннай пошты, каб атрымліваць апавяшчэнні па электроннай пошце, калі ўзнікае памылка падчас праверкі здароўя або прагляду пераўтварэнняў / тэчак. Не працуеце з уліковымі запісамі, якія патрабуюць 2FA. Вам неабходна падключыць доступ да менш абароненых прыкладанняў на рахунках Gmail.","Email address:":"Адрас электроннай пошты:","For example:":"Напрыклад:","Email password(not saved):":"Пароль электроннай пошты (не захаваны):","SMTP server:":"SMTP-сервер:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Гэтая функцыя дазваляе адсочваць стан пераўтварэння / праверкі здароўя з дапамогай любога вэб-браўзэра. Карысна пры запуску сервераў і г.д.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Калі ўключана, на HBBatchBeast.io будуць адпраўлены наступныя ананімныя дадзеныя:","API key":"Ключ API","Current status ('Searching', 'Running', 'Finished' etc)":"Бягучы статус (\"Пошук\", \"Запуск\", \"Гатова\" і г.д.)","Number of:":"Колькасць:","Remaining items":"Астатнія прадметы","Successful items":"Паспяховыя прадметы","Errored items":"Памылковыя прадметы","Cancelled items":"Скасаваныя прадметы","Worker percentages":"Працэнтныя працэнты","Last completed item time":"Апошні завершаны пункт часу","Enable remote monitoring?:":"Уключыць выдаленае маніторынг ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Асноўная ўтыліта бенчмаркетынгу пабудавана ў асноўным, каб убачыць, як 16+ асноўных працэсараў працуюць з некалькімі экземплярамі HandBrake, хоць гэта можа быць запушчана на любым тыпе працэсара.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Гэта запампуе ўзор файла h265 4k (2.5MB) і запусціць тэст з дапамогай 4 асобнікаў HandBrake з зададзенай \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Вынікі могуць быць загружаныя на hbbatchbeast.io, калі вы вырашыце.","Queue":"Чарга","Output this session":"Выхад гэтай сесіі","Media info viewer tool":"Інструмент прагляду інфармацыі для медыя","View replaced file cache":"Прагледзець заменены кэш файлаў","Clear replaced file cache":"Ачысціць заменены файл кэша","Save config":"Захаваць канфігурацыю","Scan only":"Сканаванне толькі","Scan and convert":"Сканіраванне і пераўтварэнне","View scan/conversion summary log":"Прагляд зводнага часопіса сканавання / пераўтварэння","View individual file check/conversion log":"Прагледзець індывідуальны файл праверкі / пераўтварэння файлаў","View worker console output":"Прагляд выхаду кансолі працоўнага","Health check":"Праверка здароўя","Clear healthy file cache":"Ачысціце здаровы кэш файлаў","View error log":"Прагляд часопіса памылак","Email test":"Тэст па электроннай пошце","View master log":"Паглядзець галоўны часопіс","Wiki help":"Вікі-дапамога","An application by HaveAGitGat":"Прымяненне HaveAGitGat","New":"Новы","Launch":"Запуск","Benchmark":"Тэст","See results":"Глядзіце вынікі","Pause queue":"Паўза ў чарзе","Continue queue":"Працягнуць чаргу","Stop queue":"Стоп чарга","Convert selected files":"Пераўтварэнне выбраных файлаў","Toggle queue view":"Пераключыць выгляд чаргі","Deselect all":"Адмяніць усе","Invert all":"Інвертаваць усё","Select all":"Абраць усё","Toggle output view":"Пераключыць выгляд на выхад"}