{
    "The number of custom presets does not match the number of source folders!": "Броят на потребителските предварителни настройки не съответства на броя на изходните папки!",
    "source folders have been detected.": "бяха открити папки с източници.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "бяха открити персонализирани предварително зададени линии. Моля, проверете двойно за невидими прекъсвания на реда. Трябва да има по една пътека или предварително зададена папка на линия. Уверете се, че не сте създали празен ред.",
    "The number of filename suffixes does not match the number of source folders! ": "Броят на суфиксите с имена на файлове не съвпада с броя на изходните папки!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "бяха открити суфиксни линии на името на файла. Моля, проверете двойно за невидими прекъсвания на редовете. На ред трябва да има един път или име на файл. Уверете се, че не сте създали празен ред.",
    "The number of source folders does not match the number of destination folders!": "Броят на изходните папки не съвпада с броя на целевите папки!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "Открити са целеви папки. Моля, проверете двойно за невидими прекъсвания на редовете. Трябва да има по един път на папка на ред. Уверете се, че не сте създали празен ред.",
    "The number of source folders does not match the number of temporary conversion folders!": "Броят на изходните папки не съответства на броя на временните папки за преобразуване!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "са открити временни папки за преобразуване. Моля, проверете двойно за невидими прекъсвания на редовете. Трябва да има по един път на папка на ред. Уверете се, че не сте създали празен ред.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Моля, въведете валиден контейнер като \".mp4\". Уверете се, че сте включили „.“",
    "Corrupt file folder": "Повредена папка с файлове",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "не съществува! Моля, уверете се, че няма интервали или скрити знаци преди / след пътя",
    "Source folder": "Изходна папка",
    "Temporary conversion folder": "Папка за временна конверсия",
    "appears to be the same as or is within source folder": "Изглежда, че е същата като или е в изходната папка",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "което ще попречи на HBBatchBeast да функционира правилно. Моля, променете папката за временно преобразуване в папка извън папката с източници. Ако искате да използвате функцията „Замяна на оригиналните файлове“, моля, изберете папка, която не е същата като в папката-източник или в нея, след което поставете отметка в квадратчето „Смяна на оригиналните файлове винаги“ в раздела „Разширени настройки“. , Махнете отметката от квадратчето за временна папка „Временна папка за конвертиране“, тъй като тя няма да се използва в този случай. Файловете ще бъдат преобразувани в целевата папка и след това отново се преместват в изходната папка.",
    "Destination folder": "Целева папка",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "което ще попречи на HBBatchBeast да функционира правилно. Моля, променете целевата папка в папка извън папката източник. Ако искате да използвате функцията „Замяна на оригиналните файлове“, моля, изберете папка, която не е същата като в папката-източник или в нея, след което поставете отметка в квадратчето „Смяна на оригиналните файлове винаги“ в раздела „Разширени настройки“. , Махнете отметката от квадратчето за временна папка „Временна папка за конвертиране“, тъй като тя няма да се използва в този случай. Файловете ще бъдат преобразувани в целевата папка и след това отново се преместват в изходната папка.",
    "Error creating temporary conversion folder": "Грешка при създаването на папка за временно преобразуване",
    "Error creating destination folder": "При създаването на целевата папка възникна грешка",
    "Please select to use HandBrake or FFmpeg!": "Моля, изберете да използвате HandBrake или FFmpeg!",
    "Please select a standard preset or input a custom one!": "Моля, изберете стандартна предварителна настройка или въведете персонализиран!",
    "Please select a scan interval of 5 seconds or greater!": "Моля, изберете интервал на сканиране от 5 секунди или повече!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Моля, уверете се, че броят на едновременните копия на HandBrake / FFmpeg, които да използвате, е един или по-голям!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Невалиден ключ за API! Моля, кликнете върху „Ново“ в раздела за дистанционно наблюдение, за да генерирате нов ключ.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Моля, въведете дневно време за сканиране в 24-часов формат: hh: mm (например 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "ИЗТОЧНИТЕ ФАЙЛОВЕ ЩЕ БЪДАТ ИЗТРИВАНИ СЛЕД ПРЕОБРАЗУВАНЕ! Моля, проверете преди правилното използване!",
    "Benchmark failed!": "Бенчмаркът не бе успешен!",
    "Log does not exist!": "Влезте не съществува!",
    "Folder does not exist!": "Папката не съществува!",
    "Error sending email! Please check your settings.": "Грешка при изпращането на имейли! Моля, проверете настройките си.",
    "Test email sent!": "Тестовият имейл е изпратен!",
    "All worker processes have been stopped.": "Всички работнически процеси са спрени.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Опашката ще бъде поставена на пауза, след като текущите елементи завършат обработката. Наистина ли искате да поставите на пауза опашката?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Инициализира се пауза на опашка. Бутонът „Продължи“ ще се появи, след като всички работници са на пауза.",
    "Healthy file cache cleared!": "Изчистени са здравите файлове!",
    "Cache cleared!": "Изчистен кеш!",
    "Cancel item": "Отменете елемента",
    "Please check the above checkbox to use this feature.": "Моля, проверете горното квадратче за отметка, за да използвате тази функция.",
    "Configuration": "Конфигурация",
    "Source folders": "Изходни папки",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Това е изходната папка, която ще бъде сканирана за носители. Папката трябва да бъде въведена без последваща наклонена черта. Например:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Полето за пътека на изходната папка е разширяемо (натиснете Enter, за да създадете нов ред). Ако искате да посочите няколко папки с източници, уверете се, че всеки път на изходна папка е на свой ред, като например:",
    "Video health check": "Проверка на състоянието на видеоклипа",
    "Batch conversion and Folder watching": "Пакетно конвертиране и наблюдение на папки",
    "Remote Monitoring (Beta)": "Отдалечено наблюдение (бета)",
    "Benchmark (Beta)": "Бенчмарк (бета)",
    "System": "Система",
    "Help": "Помогне",
    "Temporary conversion folders": "Папки за временни реализации",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Ако „Папка за временно преобразуване?“ е отметнато, след което HandBrake ще преобразува файловете в тази папка. След като преобразуването приключи, файлът ще бъде преместен в „Целева папка“. Ще трябва да посочите толкова временни папки за преобразуване като изходни папки. Първата ви папка ще бъде преобразувана в първата ви папка за временно преобразуване, втората ви папка във втората папка за временно преобразуване и т.н. Уверете се, че пътят на всяка временна папка за конвертиране е на свой ред.",
    "Destination folders": "Целеви папки",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Посочете пътеки на папката по местоназначение. Отново ще трябва да посочите толкова папки за местоназначение, колкото изходните папки. Файловете от първата ви папка ще се окажат в първата ви папка, втората ви папка във втората папка и т.н.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Първоизточна папка ---------> Първа временна папка за преобразуване ---------> Първа дестинационна папка",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Втора папка източник ---------> Втора временна папка за преобразуване ---------> Втора папка за местоназначение",
    "etc": "и т.н.",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast няма да работи правилно, ако зададете папката-дестинация същата като или в папката-източник.",
    "Standard preset:": "Стандартна предварителна настройка:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Изберете предварителната настройка на HandBrake, с която искате да конвертирате файловете си. Ако е избрано \"Standard preset\", всички файлове в избраните папки ще бъдат преобразувани с помощта на зададената настройка HandBrake. Можете да намерите повече информация за пресетите на HandBrake тук:",
    "Custom preset:": "Персонализирана предварителна настройка:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Ако \"Предварително зададени настройки\", тогава трябва да въведете свой собствен потребителски пресет. HBBatchBeast покрива частта \"HandBrakeCLI -i източник-на местоназначение\" на входа на HandBrakeCLI, така че трябва да въведете параметрите за преобразуване. Например:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Ако използвате FFmpeg, трябва да разделите входните и изходните параметри със запетая. Като:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Можете също така да се свържете към персонализирана предварителна настройка, която е била експортирана от официалното GUI приложение на HandBrake например:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Ако имате проблеми с персонализирани предварителни настройки, това може да се дължи на известна грешка с HandBrakeCLI (ще бъде поправена в следващата версия на HandBrakeCLI). Моля, вижте това за временно решение:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Всяка персонализирана предварителна настройка трябва да е на свой ред и, подобно на папките, трябва да има колкото се може повече персонализирани предварителни настройки като изходни папки.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Първоизточна папка ---------> Първа временна папка за преобразуване ---------> Първа дестинационна папка @ Предварително зададена настройка 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Папка втори източник ---------> Втора временна папка за преобразуване ---------> Втора папка за местоназначение @ Предварително зададена настройка 2",
    "See the following image for guidance:": "Вижте следното изображение за напътствия:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Ако използвате кодиране на графична карта (като NVENC), тогава може да се наложи да намалите броя на случаите на HandBrake (опитайте 2 или по-малко) поради ограниченията на VRAM.",
    "Select standard preset:": "Изберете стандартна предварителна настройка:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC открива, моля уверете се, че сте намалили броя на HandBrakeCLI екземплярите на 2 или по-малко (за повечето графични карти) или може да срещнете грешки поради недостатъчна VRAM. Тази настройка може да бъде намерена в раздела \"Система\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Открит е вмъкнат пресет. Ако имате проблеми с внасяните персонализирани предварителни настройки, това може да се дължи на известна грешка с HandBrakeCLI (ще бъде поправена в следващата версия на HandBrakeCLI). Временно решение е да се премахне \"PictureRotate\": \"0: 0\" от файла .json. Повече информация тук:",
    "Container:": "Контейнер:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Посочете контейнера, който искате изходният файл да има, например \".mp4\". Можете да научите повече за контейнерите на:",
    "Enable periodic scanning:": "Активиране на периодичното сканиране:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast може да следи изходните ви папки и да сканира за нови файлове на определен интервал. Интервалът е в секунди, като по подразбиране е 300 секунди (5 минути). Ако е избрана тази опция, когато натиснете \"Сканиране и конвертиране\", програмата ще конвертира всички нови файлове и ще започне таймер за обратно отброяване. Това ще завърши безкрайно, докато спре. Интервалът на сканиране е в раздела за допълнителни настройки.",
    "Enable daily scanning:": "Активиране на ежедневното сканиране:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Вместо периодично сканиране, можете да избирате дали сканирането да се изпълнява веднъж на ден. Времето за сканиране се въвежда в раздела за разширени настройки във формат hh: mm, например \"18: 30\". След като е избрано \"Сканиране и конвертиране\", програмата ще изчака до определеното време, докато започне сканиране и преобразуване. Отново, това ще завърши безкрайно, докато спре.",
    "Show/hide advanced:": "Показване / скриване на напреднали:",
    "Scan interval (minimum 5 seconds):": "Интервал на сканиране (минимум 5 секунди):",
    "Daily run time (hh:mm):": "Дневно време (hh: mm):",
    "Output filename suffix:": "Суфикс на изходното име на файл:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Това не е задължително. Можете да зададете суфикс, който да добавите в края на името на файла си като '_1080p' или '_testconversion' и т.н.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Ако е избрано 'standard preset', всички изходни файлове ще имат същия суфикс.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Ако е избрано 'custom preset', можете да зададете една суфикс на изходна папка / предварително зададена настройка. Уверете се, че всяка суфикс е на свой ред. Например, ако имате 2 изходни папки и използвате „персонализирана настройка“, можете да поставите това в полето за име на файла:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Файловете в първата папка-източник ще имат '_720p' добавени към изходното име на файл. Файловете във втората изходна папка ще имат добавена _1080p към изходното име на файл и т.н.",
    "Include these file types:": "Включете тези типове файлове:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Въведете типовете файлове за сканиране. Всеки тип трябва да бъде разделен със запетая. Стандартният запис е:",
    "Exclude files smaller than (MB):": "Изключване на файлове, по-малки от (МБ):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Посочете дали да се изключат файлове от по-малки от определен размер от реализация (в мегабайта)",
    "Exclude files larger than (MB):": "Изключване на файлове, по-големи от (МБ):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Посочете дали да се изключат файлове от по-голям от определен размер от реализация (в мегабайта)",
    "Exclude filenames which include any of these words:": "Изключване на имена на файлове, които включват някоя от следните думи:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Въведете ключови думи, които да се филтрират при сканиране за файлове. Например, ако е въведено \"720p\", тогава всички файлове с \"720p\" в заглавието няма да бъдат преобразувани. Отново, ключовите думи трябва да бъдат разделени със запетая. Въведете например в полето за филтриране следното:",
    "Include files with any ": "Включвайте файлове с такива",
    " or all ": "или всички",
    " of these": "от тях",
    "properties:": "Имоти:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Тук можете да въведете видео и аудио свойства, които файловете трябва да имат, за да бъдат конвертирани (информация извлечена чрез FFprobe). Свойствата трябва да бъдат разделени със запетая. Използвайте инструмента за преглед на информация за мултимедия, за да определите кои свойства искате да включите. Уверете се, че сте поставили запетая след последното свойство. Например, да конвертирате само файлове, кодирани с h264 и aac стерео аудио:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Заслужава да се отбележи, че тази проверка на свойствата се извършва след като процесът на преобразуване започне (за да се спести време при изграждането на опашката), така че въпреки че файловете могат да се появят в опашката за преобразуване, те ще бъдат пропуснати / включени, ако са изпълнени правилните условия.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Ако FFprobe може да извлича свойства, тогава в колоната \"FFprobe\" в изгледа на опашката ще се появи \"OK\".",
    "Exclude files with any ": "Изключване на файлове с такива",
    " of these ": "от тях",
    "The opposite of 'Include files with any or all of these properties'": "Обратното на „Включване на файлове с някое или всички тези свойства“",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Това е малък инструмент за анализ на свойствата на файла, за да ви помогне да определите кои свойства искате да включите / изключите в горните опции. Той използва FFprobe за връщане на информация. Плъзнете и пуснете файлове в сивото поле, за да ги анализирате. Например пускането в тестов файл може да върне следното:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Ако искате да изключите такива файлове от преобразуването, можете да поставите няколко свойства на файла в полето „Изключване на файлове с някое или всички тези свойства“ и поставете отметка в квадратчето до „всички“ вместо „всички“, така:",
    "Copy excluded files to destination:": "Копиране на изключените файлове към местоназначението:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Ако изберете тази опция, тогава файловете, които са били изключени от преобразуването, ще бъдат копирани директно в целевата папка. Това се отнася за следните филтри:",
    "Exclude filenames which include any of these words": "Изключете имена на файлове, които включват някоя от тези думи",
    "Include files with any or all of these properties": "Включете файлове с някое или всички от тези свойства",
    "Exclude files with any or all of these properties": "Изключване на файлове с някои или всички тези свойства",
    "Exclude files smaller than (MB)": "Изключване на файлове, по-малки от (МБ)",
    "Exclude files larger than (MB)": "Изключване на файлове, по-големи от (МБ)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Забележете, че това се отнася и за изключени файлове, защото те не отговарят на условията за включване на собственост на горепосоченото, така че не случайно да копирате цялата библиотека, когато се опитвате да конвертирате само няколко файла.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Функцията за копиране не се прилага за следните филтри (т.е. файлове, изключени поради филтъра)",
    "Include these file types": "Включете тези типове файлове",
    "Delete source files after conversion:": "Изтриване на изходните файлове след реализация:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Ако това е избрано, тогава, ако опитът за реализация е успешен, файлът с източник ще бъде изтрит. Този процес се извършва в самия край, след конвертиране на всички файлове. Това означава, че можете да конвертирате един и същи източник на файлове с помощта на няколко пресета, всички в едно. След това изходните файлове ще бъдат изтрити.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Заменете оригиналния файл, ако конвертираният файл е по-малък?",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Изберете тази отметка, ако искате HBBatchBeast автоматично да замени оригиналния файл, ако новият файл е по-малък. Ако новият файл не е по-малък, той ще бъде оставен в целевата папка.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Уверете се, че целевата папка не е същата като в папката ви източник или няма да работи правилно.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "След като HBBatchBeast се опита да компресира определен файл, той ще добави този път към кеш, така че в бъдеще няма да се опитва отново. Можете да прегледате / редактирате / изчистите кеша с помощта на жълтите бутони.",
    "Replace original file always?": "Винаги ли да замените оригиналния файл?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Оригиналният файл ще бъде заменен, независимо дали новият файл е по-голям или по-малък.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Отново се уверете, че папката ви за дестинация не е същата като в папката ви източник или няма да работи правилно.",
    "Copy subtitle (srt) files to destination?": "Копиране на файловете на субтитрите (srt) към местоназначението?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Файловете на субтитрите '.srt' ще бъдат копирани автоматично в целевата папка.",
    "Automatically create temporary/destination folders if they don't exist?": "Автоматично създавайте папки за временен / целеви, ако не съществуват?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Персонализиран път на прилеп за пускане след всяко реализиране (оставете празно, ако не използвате):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Въведете пътя към персонализиран пакетен файл, който искате да изпълните след всяко преобразуване. Например:",
    "Batch files with timeout statements won't work. More info here:": "Пакетните файлове с отчети за изчакване не работят. Повече информация тук:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Оставете полето напълно празно, ако не искате да използвате тази опция (уверете се, че в полето няма скрити знаци)",
    "Run processes at low priority?": "Изпълнявайте процеси с нисък приоритет?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Всички процеси на преобразуване ще се изпълняват с нисък приоритет, което намалява използването на процесора.",
    "Remove apostrophes from filenames:": "Премахване на апострофи от имена на файлове:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Конверсиите / сканиранията за проверка на състоянието може да не успеят, ако имената на файловете имат апострофи. Изберете това, за да премахнете автоматично апострофите от имена на файлове.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Тази функция може да сканира за повредени видео файлове, използвайки функцията \"--scan\" на HandBrake, въпреки че това не винаги е точно. Той също използва FFprobe, за да осигури втора референтна точка. Ако и двете FFprobe и HandBrake се провалят, има голяма вероятност файлът да е повреден.",
    "Move corrupt files into the following folder:": "Преместване на повредени файлове в следната папка:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Ако е отметнато, всички файлове, които дават грешки, ще бъдат преместени в указаната папка.",
    "Corrupt file folder:": "Повредена папка с файлове:",
    "Run thorough file health check:": "Изпълнете подробна проверка на състоянието на файла:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Ако е отметнато, тогава много по-бавно, по-задълбочено видео проверка на здравето ще се изпълни с помощта на FFmpeg вместо HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Въз основа на „ScanMedia.ps1“ на Desani, намерен на адрес:",
    "Attempt to repair files after thorough check:": "Опит за поправка на файлове след задълбочена проверка:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Ако е отметнато, HBBatchBeast ще се опита да поправи файлове с помощта на FFmpeg. Нов файл със суфикс \"_repaired\" ще бъде създаден в същата папка като изходния файл.",
    "'CRF' value to use when attempting to repair files:": "Стойност „CRF“ за използване при опит за поправка на файлове:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Стойността по подразбиране „CRF“ е 23. Моля, вижте следното за повече информация:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Диапазонът на скалата на CRF е 0–51, където 0 е без загуба, 23 е по подразбиране и 51 е възможно най-лошото качество. По-ниската стойност обикновено води до по-високо качество, а субективно нормален диапазон е 17-28. Помислете за 17 или 18, за да сте без загуби или почти така; тя трябва да изглежда същата или почти същата като входа, но не е технически загуба.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast записва списък от трасета на сканираните файлове, докладвани като некорумпирани. Изчистете кеша, за да извършите ново сканиране на всички файлове.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Брой едновременни копия на HandBrake / FFmpeg, които да се използват? (Препоръчително 4 или по-малко):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Тази настройка важи както за \"Проверка на състоянието на видеото\", така и на \"Сканиране и конвертиране\". Укажете колко нишки на ръчната спирачка да използвате. Няма максимум, въпреки че е препоръчително да не се използват повече от 4. По-висока сума може да замрази компютъра, ако не е много мощен.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Ограничение за преглед на размера на опашката? (Препоръчително 1000 или по-малко):",
    "Automatically start \"Scan and convert\" when program opened?": "Автоматично стартирате \"Сканиране и конвертиране\", когато програмата се отвори?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Попълнете данните за имейли, за да получавате известия по имейл, ако възникне грешка по време на проверка на състоянието или конвертиране / гледане на папки. Няма да работи с профили, които изискват 2FA. Трябва да активирате достъпа до по-малко защитени приложения в профилите в Gmail.",
    "Email address:": "Имейл адрес:",
    "For example:": "Например:",
    "Email password(not saved):": "Парола за имейл (не е запазена):",
    "SMTP server:": "SMTP сървър:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Тази функция позволява наблюдение на състоянието на конвертиране / проверка на състоянието чрез всеки уеб браузър. Полезно, когато се изпълняват сървъри и т.н.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Ако е активирано, следните анонимни данни ще бъдат изпратени на HBBatchBeast.io:",
    "API key": "API ключ",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Текущо състояние („Търсене“, „Стартиране“, „Завършено“ и т.н.)",
    "Number of:": "Брой:",
    "Remaining items": "Оставащи елементи",
    "Successful items": "Успешни елементи",
    "Errored items": "Повредени елементи",
    "Cancelled items": "Отменени елементи",
    "Worker percentages": "Процент на работниците",
    "Last completed item time": "Последно завършено време за артикул",
    "Enable remote monitoring?:": "Активиране на дистанционното наблюдение ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Основна помощна програма за бенчмаркинг, построена главно, за да се види как 16-ядрените процесори се изпълняват, използвайки няколко случая на HandBrake, въпреки че може да се изпълнява на всеки тип процесор.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Това ще изтегли пробен файл h265 4k (2.5MB) и ще стартира бенчмарк, използвайки 4 HandBrake инстанции с предварително зададен \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Резултатите могат да бъдат качени на hbbatchbeast.io, ако решите.",
    "Queue": "Опашка",
    "Output this session": "Изведете тази сесия",
    "Media info viewer tool": "Инструмент за преглед на информация за мултимедия",
    "View compress attempt cache": "Преглед на кеша за опит за компресиране",
    "Clear compress attempt cache": "Изчистване на кеша за опит за компресиране",
    "Save config": "Запазване на конфиг",
    "Scan only": "Само сканиране",
    "Scan and convert": "Сканирайте и конвертирайте",
    "View scan/conversion summary log": "Преглед на отчетния отчет за сканиране / конверсия",
    "View individual file check/conversion log": "Преглед на дневника за проверка / конвертиране на отделни файлове",
    "View worker console output": "Вижте изхода на работната конзола",
    "Health check": "Преглед на здравето",
    "Clear healthy file cache": "Изчистване на здравия файлов кеш",
    "View error log": "Вижте дневника на грешките",
    "Email test": "Тест за имейл",
    "View master log": "Вижте главния дневник",
    "Wiki help": "Помощ за Wiki",
    "An application by HaveAGitGat": "Заявление от HaveAGitGat",
    "New": "нов",
    "Launch": "хвърлям",
    "Benchmark": "репер",
    "See results": "Вижте резултатите",
    "Pause queue": "Пауза на опашката",
    "Continue queue": "Продължете с опашка",
    "Stop queue": "Спиране на опашката",
    "Convert selected files": "Конвертиране на избраните файлове",
    "Toggle queue view": "Превключване на изгледа за опашка",
    "Deselect all": "Премахнете избора от всички",
    "Invert all": "Обърнете всички",
    "Select all": "Избери всички",
    "Toggle output view": "Превключва изгледа за изход"
}