{"The number of custom presets does not match the number of source folders!":"কাস্টম প্রিসেটগুলির সংখ্যা উৎস ফোল্ডারগুলির সংখ্যা মিলছে না!","source folders have been detected.":"উৎস ফোল্ডার সনাক্ত করা হয়েছে।","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"কাস্টম প্রিসেট লাইন সনাক্ত করা হয়েছে। অদৃশ্য লাইন বিরতি জন্য ডবল চেক করুন। লাইন প্রতি একটি ফোল্ডার পথ বা প্রিসেট থাকা উচিত। আপনি ভুলভাবে একটি ফাঁকা লাইন তৈরি না নিশ্চিত করুন।","The number of filename suffixes does not match the number of source folders! ":"ফাইল নাম প্রত্যয় সংখ্যা সংখ্যা উৎস ফোল্ডারগুলির সাথে মেলে না!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"ফাইল নাম suffix লাইন সনাক্ত করা হয়েছে। অদৃশ্য লাইন বিরতি জন্য ডবল চেক করুন। লাইন প্রতি একটি ফোল্ডার পাথ বা ফাইল নাম suffix থাকা উচিত। আপনি ভুলভাবে একটি ফাঁকা লাইন তৈরি না নিশ্চিত করুন।","The number of source folders does not match the number of destination folders!":"উৎস ফোল্ডারগুলির সংখ্যা গন্তব্য ফোল্ডারগুলির সংখ্যাটি মেলে না!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"গন্তব্য ফোল্ডার সনাক্ত করা হয়েছে। অদৃশ্য লাইন বিরতি জন্য ডবল চেক করুন। লাইন প্রতি একটি ফোল্ডার পাথ থাকা উচিত। আপনি ভুলভাবে একটি ফাঁকা লাইন তৈরি না নিশ্চিত করুন।","The number of source folders does not match the number of temporary conversion folders!":"উৎস ফোল্ডারগুলির সংখ্যা অস্থায়ী রূপান্তর ফোল্ডারগুলির সাথে মেলে না!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"অস্থায়ী রূপান্তর ফোল্ডার সনাক্ত করা হয়েছে। অদৃশ্য লাইন বিরতি জন্য ডবল চেক করুন। লাইন প্রতি একটি ফোল্ডার পাথ থাকা উচিত। আপনি ভুলভাবে একটি ফাঁকা লাইন তৈরি না নিশ্চিত করুন।","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"'.Mp4' হিসাবে একটি বৈধ ধারক লিখুন দয়া করে। '।' অন্তর্ভুক্ত করতে ভুলবেন না","Corrupt file folder":"দূষিত ফাইল ফোল্ডার","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"এটির অস্তিত্ব নেই! রাস্তা আগে / পরে কোন স্পেস বা লুকানো অক্ষর নেই নিশ্চিত করুন দয়া করে","Source folder":"উত্স ফোল্ডার","Temporary conversion folder":"অস্থায়ী রূপান্তর ফোল্ডার","appears to be the same as or is within source folder":"একই হিসাবে বা উত্স ফোল্ডার মধ্যে উপস্থিত বলে মনে হচ্ছে","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"যা সঠিকভাবে কাজ থেকে HBBatchBeast প্রতিরোধ করা হবে। অস্থায়ী রূপান্তর ফোল্ডারটি উৎস ফোল্ডারের বাইরে একটি ফোল্ডারে পরিবর্তন করুন। যদি আপনি 'মূল ফাইল বৈশিষ্ট্যটি প্রতিস্থাপন করুন' ব্যবহার করতে চান তবে অনুগ্রহ করে একটি গন্তব্য ফোল্ডার নির্বাচন করুন যা সোর্স ফোল্ডারের মতো, বা এর মধ্যে নয়, এবং তারপরে উন্নত সেটিংস বিভাগে 'সর্বদা আসল ফাইলগুলি প্রতিস্থাপন করুন' চেকবক্সটি চেক করুন। । অস্থায়ী 'অস্থায়ী রূপান্তর ফোল্ডার' চেকবক্সটি চেকমুক্ত করুন কারণ এটি এই ক্ষেত্রে কোনও ব্যবহার করবে না। ফাইলগুলি গন্তব্য ফোল্ডারে রূপান্তরিত হবে এবং তারপরে উৎস ফোল্ডারে সরানো হবে।","Destination folder":"গন্তব্য ফোল্ডার","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"যা সঠিকভাবে কাজ থেকে HBBatchBeast প্রতিরোধ করা হবে। উৎস ফোল্ডারের বাইরে একটি ফোল্ডারে গন্তব্য ফোল্ডারটি পরিবর্তন করুন। যদি আপনি 'মূল ফাইল বৈশিষ্ট্যটি প্রতিস্থাপন করুন' ব্যবহার করতে চান তবে অনুগ্রহ করে একটি গন্তব্য ফোল্ডার নির্বাচন করুন যা সোর্স ফোল্ডারের মতো, বা এর মধ্যে নয়, এবং তারপরে উন্নত সেটিংস বিভাগে 'সর্বদা আসল ফাইলগুলি প্রতিস্থাপন করুন' চেকবক্সটি চেক করুন। । অস্থায়ী 'অস্থায়ী রূপান্তর ফোল্ডার' চেকবক্সটি চেকমুক্ত করুন কারণ এটি এই ক্ষেত্রে কোনও ব্যবহার করবে না। ফাইলগুলি গন্তব্য ফোল্ডারে রূপান্তরিত হবে এবং তারপরে উৎস ফোল্ডারে সরানো হবে।","Error creating temporary conversion folder":"অস্থায়ী রূপান্তর ফোল্ডার তৈরি করার সময় ত্রুটি","Error creating destination folder":"গন্তব্য ফোল্ডার তৈরি করার সময় ত্রুটি","Please select to use HandBrake or FFmpeg!":"হাতব্রেক বা FFmpeg ব্যবহার করার জন্য নির্বাচন করুন!","Please select a standard preset or input a custom one!":"একটি মান প্রিসেট বা একটি কাস্টম এক ইনপুট নির্বাচন করুন!","Please select a scan interval of 5 seconds or greater!":"5 সেকেন্ড বা তার বেশি একটি স্ক্যান ব্যবধান নির্বাচন করুন!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"অনুগ্রহ করে নিশ্চিত করুন যে একযোগে হ্যান্ডব্রেক / FFmpeg ইনস্ট্যান্সগুলির সংখ্যা এক বা একাধিক!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"অবৈধ API কী! একটি নতুন কী তৈরি করতে রিমোট মনিটরিং ট্যাবে 'নতুন' ক্লিক করুন।","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"24 ঘন্টার ফর্ম্যাটে একটি দৈনিক স্ক্যান টাইম লিখুন দয়া করে: hh: mm (উদাহরণস্বরূপ 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"সোর্স ফাইল কনভার্সেশন পরে মুছে ফেলা হবে! সঠিক ব্যবহারের আগে পরীক্ষা করুন!","Benchmark failed!":"বেঞ্চমার্ক ব্যর্থ!","Log does not exist!":"লগ অস্তিত্ব নেই!","Folder does not exist!":"ফোল্ডার বিদ্যমান নেই!","Error sending email! Please check your settings.":"ইমেল পাঠানোর সময় ত্রুটি! আপনার সেটিংস চেক করুন।","Test email sent!":"টেস্ট ইমেইল পাঠানো হয়েছে!","All worker processes have been stopped.":"সমস্ত কর্মী প্রক্রিয়া বন্ধ করা হয়েছে।","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"বর্তমান আইটেম প্রক্রিয়াকরণ সমাপ্ত হয়েছে একবার সারিবদ্ধ করা হবে। আপনি কি সারি বিরাম করতে চান?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"সারি বিরাম শুরু হয়েছে। সমস্ত কর্মীদের বিরতি একবার 'অবিরত' বোতাম প্রদর্শিত হবে।","Healthy file cache cleared!":"স্বাস্থ্যকর ফাইল ক্যাশে সাফ!","Cache cleared!":"ক্যাশে সাফ!","Cancel item":"আইটেম বাদ","Please check the above checkbox to use this feature.":"এই বৈশিষ্ট্য ব্যবহার করার জন্য উপরের চেকবক্স চেক করুন।","Configuration":"কনফিগারেশন","Source folders":"উত্স ফোল্ডার","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"এই উৎস ফোল্ডার যা মিডিয়া জন্য স্ক্যান করা হবে। ফোল্ডার কোন trailing স্ল্যাশ দিয়ে প্রবেশ করা প্রয়োজন। উদাহরণ স্বরূপ:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"উৎস ফোল্ডার পাথ বাক্সটি প্রসারিতযোগ্য (একটি নতুন লাইন তৈরি করতে প্রবেশ টিপুন)। আপনি যদি একাধিক উত্স ফোল্ডার নির্দিষ্ট করতে চান তবে নিশ্চিত করুন যে প্রতিটি উত্স ফোল্ডার পাথ তার নিজস্ব লাইনে রয়েছে যেমন:","Video health check":"ভিডিও স্বাস্থ্য পরীক্ষা","Batch conversion and Folder watching":"ব্যাচ রূপান্তর এবং ফোল্ডার পর্যবেক্ষক","Remote Monitoring (Beta)":"রিমোট মনিটরিং (বিটা)","Benchmark (Beta)":"বেঞ্চমার্ক (বিটা)","System":"পদ্ধতি","Help":"সাহায্য করুন","Temporary conversion folders":"অস্থায়ী রূপান্তর ফোল্ডার","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"যদি \"অস্থায়ী রূপান্তর ফোল্ডার?\" চেক করা হয়, তারপর Handbrake যে ফোল্ডারে ফাইল রূপান্তর করা হবে। রূপান্তর শেষ হয়ে গেলে, ফাইলটিকে আপনার \"গন্তব্য ফোল্ডার\" এ সরানো হবে। উৎস ফোল্ডার হিসাবে আপনাকে অনেক অস্থায়ী রূপান্তর ফোল্ডারগুলি নির্দিষ্ট করতে হবে। আপনার প্রথম উত্স ফোল্ডারটি আপনার প্রথম অস্থায়ী রূপান্তর ফোল্ডারে রূপান্তরিত হবে, আপনার দ্বিতীয় উৎস ফোল্ডারটি আপনার দ্বিতীয় অস্থায়ী রূপান্তর ফোল্ডারে এবং আরও কিছুতে। প্রতিটি অস্থায়ী রূপান্তর ফোল্ডার পাথ তার নিজস্ব লাইন হয় তা নিশ্চিত করুন।","Destination folders":"গন্তব্য ফোল্ডার","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"গন্তব্য ফোল্ডার পাথ উল্লেখ করুন। আবার, আপনি উৎস ফোল্ডার হিসাবে অনেক গন্তব্য ফোল্ডার উল্লেখ করতে হবে। আপনার প্রথম উৎস ফোল্ডার থেকে ফাইলগুলি আপনার প্রথম গন্তব্য ফোল্ডারে শেষ হবে, আপনার দ্বিতীয় গন্তব্য ফোল্ডারে আপনার দ্বিতীয় উত্স ফোল্ডার ফাইল এবং এভাবে।","First source folder ---------> First temporary conversion folder ---------> First destination folder":"প্রথম উৎস ফোল্ডার ---------> প্রথম অস্থায়ী রূপান্তর ফোল্ডার ---------> প্রথম গন্তব্য ফোল্ডার","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"দ্বিতীয় উৎস ফোল্ডার ---------> দ্বিতীয় অস্থায়ী রূপান্তর ফোল্ডার ---------> দ্বিতীয় গন্তব্য ফোল্ডার","etc":"ইত্যাদি","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"যদি আপনি গন্তব্য ফোল্ডারটি, বা উৎস ফোল্ডারের মতো একই সেট করেন তাহলে HBBatchBeast সঠিকভাবে কাজ করবে না।","Standard preset:":"স্ট্যান্ডার্ড প্রিসেট:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"আপনার ফাইলগুলি কনভার্ট করতে চান এমন হ্যান্ডব্রেক প্রিসেটটি নির্বাচন করুন। যদি \"স্ট্যান্ডার্ড প্রিসেট\" নির্বাচন করা হয়, তবে নির্বাচিত ফোল্ডারগুলির সমস্ত ফাইল নির্দিষ্ট হ্যান্ডব্রেট প্রিসেট ব্যবহার করে রূপান্তরিত হবে। আপনি এখানে Handbrake presets সম্পর্কে আরো জানতে পারেন:","Custom preset:":"কাস্টম প্রিসেট:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"যদি \"কাস্টম প্রিসেট\" তবে আপনার নিজস্ব কাস্টম প্রিসেটটি প্রবেশ করতে হবে। HBBatchBeast হ্যান্ডব্রুকসিএল ইনপুটের \"হ্যান্ডব্র্যাকএলআই-উৎস-গন্তব্য\" গন্তব্যটি জুড়ে দেয় যাতে আপনাকে রূপান্তর পরামিতিগুলি প্রবেশ করতে হবে। উদাহরণ স্বরূপ:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"FFmpeg ব্যবহার করলে, আপনাকে একটি কমা দিয়ে ইনপুট এবং আউটপুট পরামিতিগুলি আলাদা করতে হবে। যেমন:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"উদাহরণস্বরূপ, আপনি অফিসিয়াল হ্যান্ডব্রুক GUI অ্যাপ্লিকেশন থেকে রপ্তানি করা একটি কাস্টম প্রিসেটের সাথে লিঙ্ক করতে পারেন:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"আপনি যদি কাস্টম প্রিসেটগুলির সাথে সমস্যায় পড়ে থাকেন, তবে এটি হ্যান্ডব্র্যাকসিআইয়ের সাথে একটি পরিচিত বাগের কারণে হতে পারে (পরবর্তী হ্যান্ডব্রেকসিএল রিলিজে সংশোধন করা হবে)। একটি অস্থায়ী সমাধান জন্য এই দেখুন দয়া করে:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"প্রতিটি কাস্টম প্রিসেটটি নিজের লাইনে থাকতে হবে এবং ফোল্ডারগুলির মতো, উৎস ফোল্ডারগুলির মতো অনেক কাস্টম প্রিসেট থাকা দরকার।","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"প্রথম উৎস ফোল্ডার ---------> প্রথম অস্থায়ী রূপান্তর ফোল্ডার ---------> প্রথম গন্তব্য ফোল্ডার @ কাস্টম প্রিসেট 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"দ্বিতীয় উৎস ফোল্ডার ---------> দ্বিতীয় অস্থায়ী রূপান্তর ফোল্ডার ---------> দ্বিতীয় গন্তব্য ফোল্ডার @ কাস্টম প্রিসেট 2","See the following image for guidance:":"নির্দেশিকা জন্য নিম্নলিখিত ছবি দেখুন:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"গ্রাফিক্স কার্ড এনকোডিং ব্যবহার করা (যেমন NVENC), তাহলে আপনার VRAM সীমাবদ্ধতাগুলির কারণে হ্যান্ডব্র্যাক ইনস্ট্যান্সের সংখ্যা কমাতে হবে (2 বা তার কম চেষ্টা করুন)।","Select standard preset:":"মান প্রিসেট নির্বাচন করুন:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC সনাক্ত হয়েছে, দয়া করে 2 বা তার নীচে (অধিকাংশ গ্রাফিক্স কার্ডগুলির জন্য) হ্যান্ডব্রেকসিএল ইনস্ট্যান্সের সংখ্যা কমিয়ে বা নিশ্চিত পর্যায়ে VRAM এর কারণে ত্রুটিগুলি অনুভব করতে পারে। এই সেটিংটি \"সিস্টেম\" ট্যাবে পাওয়া যাবে।","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"আমদানিকৃত প্রিসেট সনাক্ত করা হয়েছে। যদি আপনি আমদানি করা কাস্টম প্রিসেটের সাথে কোনও সমস্যায় পড়ে থাকেন, তবে এটি হ্যান্ডব্র্যাকসিআইয়ের সাথে একটি জ্ঞাত বাগের কারণে হতে পারে (পরবর্তী হ্যান্ডব্রেকসিএল রিলিজে সংশোধন করা হবে)। একটি অস্থায়ী সমাধান হল \"চিত্রসংযোগ\" মুছে ফেলার জন্য: .json ফাইল থেকে \"0: 0\" '। এখানে আরো তথ্য:","Container:":"ধারক:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"আউটপুট ফাইলটি যেমন '.mp4' থাকতে চান এমন ধারকটি নির্দিষ্ট করুন। আপনি এখানে কন্টেইনার সম্পর্কে আরো জানতে পারেন:","Enable periodic scanning:":"পর্যায়ক্রমিক স্ক্যান সক্ষম করুন:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast আপনার উত্স ফোল্ডারগুলি নিরীক্ষণ করতে এবং নির্দিষ্ট নির্দিষ্ট সময়ে নতুন ফাইলগুলির স্ক্যানগুলি চালাতে পারে। অন্তর্বর্তী সময় ডিফল্ট 300 সেকেন্ড (5 মিনিট) সঙ্গে সেকেন্ডে হয়। যদি এই বিকল্পটি নির্বাচন করা হয়, তবে যখন আপনি \"স্ক্যান করুন এবং রূপান্তর করুন\" টিপবেন তখন প্রোগ্রামটি কোনও নতুন ফাইল রূপান্তর করবে এবং একটি গণনা টাইমার শুরু হবে। থামা পর্যন্ত অসীমভাবে এই লুপ হবে। স্ক্যান বিরতি উন্নত সেটিংস বিভাগে হয়।","Enable daily scanning:":"দৈনিক স্ক্যানিং সক্ষম করুন:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"পর্যায়ক্রমিক স্ক্যান করার পরিবর্তে, আপনি একবারে একটি স্ক্যান চালানোর জন্য চয়ন করতে পারেন। স্ক্যান সময়টি এইচটিএমএল এ উন্নত সেটিংস বিভাগে প্রবেশ করা হয়: মিমি বিন্যাস যেমন '18: 30 '। একবার \"স্ক্যান এবং রূপান্তর করুন\" নির্বাচিত হলে, প্রোগ্রামটি স্ক্যান এবং রূপান্তর প্রক্রিয়া চলাকালীন নির্দিষ্ট সময় পর্যন্ত অপেক্ষা করবে। আবার, থামা পর্যন্ত অসীমভাবে এই লুপ হবে।","Show/hide advanced:":"দেখান / উন্নত লুকান:","Scan interval (minimum 5 seconds):":"ব্যবধান স্ক্যান করুন (সর্বনিম্ন 5 সেকেন্ড):","Daily run time (hh:mm):":"দৈনিক রান সময় (এইচএইচ: মিমি):","Output filename suffix:":"আউটপুট ফাইল নাম suffix:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"এই ঐচ্ছিক। আপনি আপনার ফাইলের নামের শেষে '_1080p' বা '_testconversion' ইত্যাদি যুক্ত করতে একটি প্রত্যয় নির্দিষ্ট করতে পারেন।","If 'standard preset' is selected then all output files will have the same suffix.":"যদি 'স্ট্যান্ডার্ড প্রিসেট' নির্বাচিত হয় তবে সমস্ত আউটপুট ফাইলগুলির একই অভিক্ষেপ থাকবে।","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"যদি 'কাস্টম প্রিসেট' নির্বাচন করা হয় তবে আপনি প্রতি উত্স ফোল্ডার / কাস্টম প্রিসেটের একটি প্রত্যয় নির্দিষ্ট করতে পারেন। প্রতিটি অনুভূতি তার নিজস্ব লাইন হয় তা নিশ্চিত করুন। উদাহরণস্বরূপ, যদি আপনার 2 উত্স ফোল্ডার থাকে এবং 'কাস্টম প্রিসেট' ব্যবহার করে থাকেন তবে আপনি এটি ফাইল নাম suffix বক্সে রাখতে পারেন:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"প্রথম উত্স ফোল্ডারে থাকা ফাইলগুলির মধ্যে '_720p' আউটপুট ফাইল নাম যোগ করা হবে। দ্বিতীয় উত্স ফোল্ডারে ফাইলগুলি '_1080p' আউটপুট ফাইল নাম ইত্যাদিতে যোগ করা হবে।","Include these file containers:":"এই ফাইল পাত্রে অন্তর্ভুক্ত করুন:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"জন্য স্ক্যান করতে ফাইল পাত্রে লিখুন। প্রতিটি টাইপ একটি কমা দ্বারা পৃথক করা প্রয়োজন। ডিফল্ট এন্ট্রি হল:","Exclude files smaller than (MB):":"কম ফাইল (এমবি) বাদ দাও:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"রূপান্তর থেকে একটি নির্দিষ্ট আকারের চেয়ে ছোট ফাইলগুলি বাদ দিতে হবে কিনা তা নির্দিষ্ট করুন (মেগাবাইটগুলিতে)","Exclude files larger than (MB):":"ফাইলগুলি (এমবি) থেকে বড় বাদ দিন:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"রূপান্তর থেকে নির্দিষ্ট আকারের চেয়ে বড় ফাইলগুলি বাদ দিতে হবে কিনা তা উল্লেখ করুন (মেগাবাইটগুলিতে)","Exclude filenames which include any of these words:":"ফাইলগুলির নামগুলি বাদ দিন যা এই শব্দের মধ্যে অন্তর্ভুক্ত:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"ফাইল জন্য স্ক্যান যখন আউট ফিল্টার করা কীওয়ার্ড লিখুন। উদাহরণস্বরূপ, যদি \"720p\" প্রবেশ করা হয়, তবে শিরোনামে \"720p\" সহ যে কোনও ফাইল রূপান্তরিত হবে না। আবার, কীওয়ার্ড একটি কমা দ্বারা পৃথক করা প্রয়োজন। উদাহরণস্বরূপ, ফিল্টার বাক্সে নিচের লিখুন:","Include files with any ":"যে কোন ফাইল অন্তর্ভুক্ত করুন"," or all ":"বা সব"," of these":"এদের মধ্যে","properties:":"বৈশিষ্ট্য:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"এখানে আপনি ভিডিও এবং অডিও বৈশিষ্ট্যগুলিকে ইনপুট করতে পারেন যা ফাইলগুলি রূপান্তরিত করার জন্য থাকতে হবে (FFprobe ব্যবহার করে তথ্য সরানো)। বৈশিষ্ট্য একটি কমা দ্বারা পৃথক করা আবশ্যক। কোন তথ্য অন্তর্ভুক্ত করতে চান তা নির্ধারণ করতে সহায়তা করার জন্য মিডিয়া তথ্য দর্শকের সরঞ্জামটি ব্যবহার করুন। শেষ সম্পত্তি পরে একটি কমা রাখা নিশ্চিত করুন। উদাহরণস্বরূপ, শুধুমাত্র H264 এবং AAC স্টিরিও অডিও ব্যবহার করে এনকোড করা ফাইলগুলি রূপান্তর করতে:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"রূপান্তর প্রক্রিয়াটি শুরু হওয়ার সময় (এই সারির সময় বাঁচানোর সময়) এই সম্পত্তি চেকটি সম্পন্ন করা হয় তা উল্লেখযোগ্য, তাই ফাইলগুলি রূপান্তর সারিতে প্রদর্শিত হতে পারে তবে সঠিক শর্তগুলি পূরণ হয়ে গেলে তা বাদ দেওয়া হবে / অন্তর্ভুক্ত করা হবে।","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"যদি FFprobe বৈশিষ্ট্যগুলি এক্সট্রাক্ট করতে সক্ষম হয়, তবে একটি 'ওকে' সারি দৃশ্যের \"FFprobe\" কলামে উপস্থিত হবে।","Exclude files with any ":"যে কোনও ফাইল বাদ দিন"," of these ":"এদের মধ্যে","The opposite of 'Include files with any or all of these properties'":"এর বিপরীতে 'যে কোনও বা সমস্ত বৈশিষ্ট্য সহ ফাইল অন্তর্ভুক্ত করুন'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"উপরের বৈশিষ্ট্যগুলির মধ্যে আপনি কোন বৈশিষ্ট্যগুলি অন্তর্ভুক্ত করতে চান / বাদ দিতে চান তা নির্ধারণ করতে সহায়তা করার জন্য এটি ফাইল বৈশিষ্টগুলির বিশ্লেষণের জন্য একটি ছোট হাতিয়ার। এটি তথ্য ফেরত FFprobe ব্যবহার করে। তাদের বিশ্লেষণ করতে ধূসর বাক্সে ফাইল টেনে আনুন এবং ছেড়ে দিন। উদাহরণস্বরূপ, একটি পরীক্ষার ফাইল ড্রপ নিম্নলিখিত ফিরে আসতে পারে:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"যদি আপনি রূপান্তরিত হতে এই ধরনের ফাইলগুলি বাদ দিতে চান তবে আপনি \"কোন বা সমস্ত সম্পত্তিগুলির সাথে ফাইলগুলি বাদ দিন\" বাক্সে বিভিন্ন ফাইলের বৈশিষ্ট্যগুলি রাখতে পারেন এবং 'যেকোনো' এর পরিবর্তে 'সব' এর পাশে চেকবাক্সটি চেক করুন। তাই ভালো:","Copy excluded files to destination:":"গন্তব্যস্থল থেকে বাদ দেওয়া ফাইল অনুলিপি করুন:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"আপনি যদি এই বিকল্পটি নির্বাচন করেন, তবে রূপান্তর থেকে বাদ দেওয়া ফাইলগুলি সরাসরি গন্তব্য ফোল্ডারে অনুলিপি করা হবে। এই নিম্নলিখিত ফিল্টার প্রযোজ্য:","Exclude filenames which include any of these words":"এই শব্দগুলির মধ্যে যে কোনও ফাইল নাম অন্তর্ভুক্ত করুন","Include files with any or all of these properties":"এই বৈশিষ্ট্যগুলির যে কোনও বা সবগুলির সাথে ফাইল অন্তর্ভুক্ত করুন","Exclude files with any or all of these properties":"এই বৈশিষ্ট্যগুলির যেকোনো বা সবগুলির সাথে ফাইলগুলি বাদ দিন","Exclude files smaller than (MB)":"ছোট ফাইল (এমবি) বাদ দাও","Exclude files larger than (MB)":"ফাইলের চেয়ে বড় (এমবি) বাদ দাও","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"উল্লেখ্য যে এটি বাদ দেওয়া ফাইলগুলির ক্ষেত্রেও প্রযোজ্য কারণ তারা উপরের \"সম্পত্তির অন্তর্ভুক্ত\" সম্পত্তির শর্তাদি পূরণ করে না তাই আপনি কেবলমাত্র কয়েকটি ফাইল রূপান্তর করার চেষ্টা করছেন যখন আপনি সম্পূর্ণ লাইব্রেরি নকল করবেন না।","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"অনুলিপি বৈশিষ্ট্য নিম্নোক্ত ফিল্টারগুলিতে প্রযোজ্য নয় (অর্থাত ফিল্টারগুলির কারণে ফাইলগুলি বাদ দেওয়া হয়েছে)","Include these file types":"এই ফাইল ধরনের অন্তর্ভুক্ত করুন","Delete source files after conversion:":"রূপান্তর করার পরে উৎস ফাইল মুছে দিন:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"যদি এটি নির্বাচিত হয়, তবে একটি রূপান্তর প্রচেষ্টা সফল হলে, উৎস ফাইল মুছে ফেলা হবে। এই প্রক্রিয়া সব ফাইল রূপান্তর করার পরে, খুব শেষে সম্পন্ন করা হয়। এর অর্থ হল আপনি একাধিক প্রিসেট ব্যবহার করে একই উৎস ফাইলগুলি একসাথে পরিবর্তন করতে পারেন। তারপর উৎস ফাইল মুছে ফেলা হবে।","Replace original file if converted file is smaller?(Compress attempt)":"রূপান্তরিত ফাইলটি ছোট হলে মূল ফাইলটি প্রতিস্থাপন করবেন? (প্রচেষ্টার সংক্ষেপে)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"যদি নতুন ফাইলটি ছোট হয় তবে HBBatchBeast স্বয়ংক্রিয়ভাবে মূল উৎস ফাইলটি প্রতিস্থাপন করতে চাইলে এই চেক বক্সটি নির্বাচন করুন। নতুন ফাইল ছোট না হলে, এটি গন্তব্য ফোল্ডারে ছেড়ে দেওয়া হবে।","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"আপনার গন্তব্য ফোল্ডারটি আপনার / অথবা সোর্স ফোল্ডারের মতো নয়, এটি সঠিকভাবে কাজ করবে না তা নিশ্চিত করুন।","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast একবার একটি নির্দিষ্ট ফাইল কম্প্রেস করার চেষ্টা করেছে, এটি একটি ফাইলের ক্যাশে যোগ করবে যাতে ভবিষ্যতে এটি আবার চেষ্টা করা হবে না। আপনি হলুদ বোতামগুলি ব্যবহার করে ক্যাশে দেখতে / সম্পাদনা / পরিষ্কার করতে পারেন।","Replace original file always?":"সর্বদা মূল ফাইল প্রতিস্থাপন?","The original file will be replaced regardless of whether the new file is larger or smaller.":"নতুন ফাইল বড় বা ছোট কিনা তা নির্বিশেষে মূল ফাইল প্রতিস্থাপিত হবে।","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"আবার, নিশ্চিত করুন যে আপনার গন্তব্য ফোল্ডারটি আপনার উৎস ফোল্ডার বা / অথবা এর মতো নয় তবে এটি সঠিকভাবে কাজ করবে না।","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast একবার একটি নির্দিষ্ট ফাইল ট্রান্সকোড করেছে, এটি একটি ফাইলের ক্যাশে যোগ করবে যাতে ভবিষ্যতে এটি আবার চেষ্টা করা হবে না। আপনি হলুদ বোতামগুলি ব্যবহার করে ক্যাশে দেখতে / সম্পাদনা / পরিষ্কার করতে পারেন।","Copy subtitle (srt) files to destination?":"গন্তব্য থেকে সাবটাইটেল ফাইল (srt)?","Subtitle '.srt' files will be copied to the destination folder automatically.":"সাবটাইটেল '.srt' ফাইল স্বয়ংক্রিয়ভাবে গন্তব্য ফোল্ডারে অনুলিপি করা হবে।","Automatically create temporary/destination folders if they don't exist?":"স্বয়ংক্রিয়ভাবে অস্থায়ী / গন্তব্য ফোল্ডারগুলি যদি অস্তিত্ব না থাকে তবে তা তৈরি করবেন?","Custom bat path to run after each conversion (leave blank if not using):":"প্রতিটি রূপান্তরের পরে চালানোর জন্য কাস্টম ব্যাট পাথ (ব্যবহার না করে ফাঁকা ছেড়ে দিন):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"একটি কাস্টম ব্যাচ ফাইলের পথটি ইনপুট করুন যা আপনি প্রতিটি রূপান্তর করার পরে চালাতে চান। উদাহরণ স্বরূপ:","Batch files with timeout statements won't work. More info here:":"সময়সীমা বিবৃতি সঙ্গে ব্যাচ ফাইল কাজ করবে না। এখানে আরো তথ্য:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"আপনি যদি এই বিকল্পটি ব্যবহার করতে না চান তবে বাক্সটিকে সম্পূর্ণ খালি রাখুন (বাক্সে কোনও লুকানো অক্ষর নেই তা নিশ্চিত করুন)","Run processes at low priority?":"কম অগ্রাধিকার এ প্রসেস চালানো?","All conversion processes will be run at low priority, reducing processor usage.":"সমস্ত রূপান্তর প্রক্রিয়া কম অগ্রাধিকার, প্রসেসর ব্যবহার হ্রাস করা হবে।","Remove apostrophes from filenames:":"ফাইল নাম থেকে apostrophes সরান:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"ফাইলের নামগুলি এটারপ্রোফেস থাকে তবে রূপান্তর / স্বাস্থ্য পরীক্ষা স্ক্যান ব্যর্থ হতে পারে। ফাইল নামগুলি থেকে স্বয়ংক্রিয়ভাবে স্বতঃস্ফূর্ত অপসারণের জন্য এটি পরীক্ষা করুন।"," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"এই বৈশিষ্ট্যটি হ্যান্ডব্রেকের '--স্কান' বৈশিষ্ট্য ব্যবহার করে দূষিত ভিডিও ফাইলগুলির জন্য স্ক্যান করতে পারে, যদিও এটি সর্বদা সঠিক নয়। এটি একটি দ্বিতীয় রেফারেন্স বিন্দু প্রদান FFprobe ব্যবহার করে। উভয় FFprobe এবং Handbrake ব্যর্থ হলে ফাইলটি দূষিত হওয়ার সম্ভাবনা বেশি।","Move corrupt files into the following folder:":"নিম্নলিখিত ফোল্ডারে দূষিত ফাইল সরান:"," If checked, then any files which give errors will be moved into the specified folder.":"যদি চেক করা থাকে, তবে যে কোনও ফাইল ত্রুটিগুলি নির্দিষ্ট ফোল্ডারে সরানো হবে।","Corrupt file folder:":"দূষিত ফাইল ফোল্ডার:","Run thorough file health check:":"পুঙ্খানুপুঙ্খ ফাইল স্বাস্থ্য পরীক্ষা চালান:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"যদি চেক করা হয়, তবে অনেক ধীর, আরও পুঙ্খানুপুঙ্খ ভিডিও স্বাস্থ্য পরীক্ষা হ্যান্ডব্রকের পরিবর্তে FFmpeg ব্যবহার করে চালানো হবে।"," Based on Desani's 'ScanMedia.ps1' found at:":"ডেসানীর 'স্ক্যানম্যানিয়া.এসপি 1' এর উপর ভিত্তি করে পাওয়া যায়:","Attempt to repair files after thorough check:":"পুঙ্খানুপুঙ্খভাবে চেক করার পরে ফাইল মেরামত করার প্রচেষ্টা:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"চেক করা হলে, HBBatchBeast FFmpeg ব্যবহার করে ফাইলগুলি মেরামত করার চেষ্টা করবে। প্রোটিক্স '_repaired' সহ একটি নতুন ফাইল উৎস ফাইলের মতো একই ফোল্ডারে তৈরি হবে।","'CRF' value to use when attempting to repair files:":"ফাইলগুলি মেরামত করার সময় ব্যবহার করার জন্য 'সিআরএফ' মান:","The default 'CRF' value is 23. Please see the following for more information:":"ডিফল্ট 'সিআরএফ' মান ২3। আরও তথ্যের জন্য নিম্নলিখিতটি দেখুন:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"সিআরএফ স্কেলের পরিসীমা 0-51, যেখানে 0 লসলেস, 23 ডিফল্ট, এবং 51 সবচেয়ে খারাপ গুণমান। একটি নিম্ন মানের সাধারণত উচ্চ মানের বাড়ে, এবং একটি বিষয়বস্তুর Sane পরিসীমা 17-28 হয়। 17 বা 18 বিবেচনা করুন দৃষ্টিশক্তিহীন বা প্রায় তাই হতে; এটা ইনপুট হিসাবে একই বা প্রায় একই চেহারা উচিত কিন্তু এটি প্রযুক্তিগতভাবে ক্ষতিগ্রস্ত নয়।","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast অচেনা হিসাবে রিপোর্ট স্ক্যান করা ফাইল পাথগুলির একটি তালিকা সংরক্ষণ করে। সব ফাইল একটি তাজা স্ক্যান সঞ্চালন ক্যাশে সাফ করুন।","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"একযোগে হ্যান্ডব্রেক / FFmpeg উদাহরণ ব্যবহার করার সংখ্যা? (প্রস্তাবিত 4 বা তার কম):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"এই সেটিংটি \"ভিডিও স্বাস্থ্য পরীক্ষা\" এবং \"স্ক্যান করুন এবং রূপান্তর করুন\" উভয় প্রক্রিয়ায় প্রযোজ্য। কত হাতব্রেক থ্রেড ব্যবহার করার জন্য উল্লেখ করুন। কোনও সর্বাধিক নেই যদিও এটি 4 এর বেশি ব্যবহার না করার পরামর্শ দেওয়া হয় তবে এটি খুব শক্তিশালী না হলে উচ্চতর পরিমাণ আপনার কম্পিউটারটি জমা দিতে পারে।","Queue size view limit?(Recommended 1000 or fewer):":"সারি আকার দেখুন সীমা? (প্রস্তাবিত 1000 বা কম):","Automatically start \"Scan and convert\" when program opened?:":"স্বয়ংক্রিয়ভাবে প্রোগ্রামটি খোলে \"স্ক্যান করুন এবং রূপান্তর করুন\" শুরু করুন ?:","Save verbose logs?:":"Verbose লগ সংরক্ষণ করুন ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"বিস্তারিত সাব-প্রক্রিয়া লগ সংরক্ষণ করতে এই চেকবাক্সটি চেক করুন। এই কর্মী কনসোল ouput অন্তর্ভুক্ত। এই খুব বড় লগ কারণ হবে।","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"একটি স্বাস্থ্য চেক বা রূপান্তর / ফোল্ডার দেখার সময় একটি ত্রুটি সম্মুখীন হলে ইমেল বিজ্ঞপ্তি পেতে ইমেল বিবরণ পূরণ করুন। 2FA প্রয়োজন যে অ্যাকাউন্ট সঙ্গে কাজ করবে না। Gmail অ্যাকাউন্টগুলিতে কম সুরক্ষিত অ্যাপ্লিকেশানগুলিতে অ্যাক্সেস সক্ষম করতে হবে।","Email address:":"ইমেল ঠিকানা:","For example:":"উদাহরণ স্বরূপ:","Email password(not saved):":"ইমেইল পাসওয়ার্ড (সংরক্ষিত না):","SMTP server:":"SMTP সার্ভার:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"এই বৈশিষ্ট্যটি কোনও ওয়েব ব্রাউজার ব্যবহার করে রূপান্তর / স্বাস্থ্য পরীক্ষা স্থিতি পর্যবেক্ষণের মঞ্জুরি দেয়। সার্ভার চালানোর সময় দরকারী। কোন ফাইলের নাম পাঠানো হয় না।","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"সক্রিয় থাকলে, নিম্নলিখিত বেনামী তথ্য HBBatchBeast.io এ পাঠানো হবে:","API key":"এপিআই কী","Current status ('Searching', 'Running', 'Finished' etc)":"বর্তমান অবস্থা ('অনুসন্ধান', 'চলমান', 'সমাপ্ত' ইত্যাদি)","Number of:":"সংখ্যা:","Remaining items":"বাকি জিনিস গুলো","Successful items":"সফল আইটেম","Errored items":"ত্রুটিযুক্ত আইটেম","Cancelled items":"বাতিল আইটেম","Worker percentages":"কর্মী শতাংশ","Last completed item time":"শেষ আইটেম সময় শেষ","Enable remote monitoring?:":"রিমোট পর্যবেক্ষণ সক্রিয় করা ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"একটি মৌলিক বেঞ্চমার্কিং ইউটিলিটি প্রধানতঃ 16+ কোর প্রসেসরগুলি একাধিক হ্যান্ডব্রেক ইনস্ট্যান্স ব্যবহার করে কীভাবে প্রবর্তন করে তা দেখতে নির্মিত হয় তবে এটি কোনও প্রক্রিয়াকরণে চালানো যেতে পারে।","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"এটি একটি H265 4k নমুনা ফাইল (2.5MB) ডাউনলোড করবে এবং প্রিসেট \"খুব দ্রুত 1080p30\" সহ 4 হ্যান্ডব্রেক ইনস্ট্যান্স ব্যবহার করে একটি বেঞ্চমার্ক চালাবে।","Results can be uploaded to hbbatchbeast.io if you choose.":"যদি আপনি চয়ন করেন তাহলে ফলাফল hbbatchbeast.io থেকে আপলোড করা যেতে পারে।","Queue":"কিউ","Output this session":"আউটপুট এই অধিবেশন","Media info viewer tool":"মিডিয়া তথ্য দর্শক টুল","View replaced file cache":"প্রতিস্থাপিত ফাইল ক্যাশে দেখুন","Clear replaced file cache":"সাফ ফাইল ফাইল ক্যাশে","Save config":"কনফিগ সংরক্ষণ করুন","Scan only":"শুধুমাত্র স্ক্যান করুন","Scan and convert":"স্ক্যান এবং রূপান্তর","View scan/conversion summary log":"স্ক্যান / রূপান্তর সংক্ষিপ্ত বিবরণ দেখুন","View individual file check/conversion log":"পৃথক ফাইল চেক / রূপান্তর লগ দেখুন","View worker console output":"কর্মী কনসোল আউটপুট দেখুন","Health check":"স্বাস্থ্য পরীক্ষা","Clear healthy file cache":"সুস্থ ফাইল ক্যাশে সাফ করুন","View error log":"ত্রুটি লগ দেখুন","Email test":"ইমেইল পরীক্ষা","View master log":"মাস্টার লগ দেখুন","Wiki help":"উইকি সাহায্য","An application by HaveAGitGat":"HaveagitGat দ্বারা একটি আবেদন","New":"নতুন","Launch":"শুরু করা","Benchmark":"উচ্চতার চিহ্ন","See results":"ফলাফল দেখুন","Pause queue":"সারি বিরতি","Continue queue":"সারি চালিয়ে যান","Stop queue":"সারি থামুন","Convert selected files":"নির্বাচিত ফাইল রূপান্তর করুন","Toggle queue view":"টুপি দেখুন টগল করুন","Deselect all":"সব গুলো অনির্বাচিত কর","Invert all":"সব বিপরীত","Select all":"সব নির্বাচন করুন","Toggle output view":"আউটপুট ভিউ টগল করুন"}