{
    "The number of custom presets does not match the number of source folders!": "El nombre de presets personalitzats no coincideix amb el nombre de carpetes d’origen.",
    "source folders have been detected.": "s'han detectat carpetes d’origen.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "s'han detectat línies predefinides personalitzades. Comproveu si hi ha salts de línia invisibles. Hi ha d’haver un camí d'accés a la carpeta o preestablert per línia. Assegureu-vos que no heu creat accidentalment una línia en blanc.",
    "The number of filename suffixes does not match the number of source folders! ": "El nombre de sufixos de nom de fitxer no coincideix amb el nombre de carpetes d’origen.",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "s'han detectat línies de sufix de nom de fitxer. Comproveu si hi ha salts de línia invisibles. Hi hauria d’haver un camí o carpeta de sufix per línia. Assegureu-vos que no heu creat accidentalment una línia en blanc.",
    "The number of source folders does not match the number of destination folders!": "El nombre de carpetes d’origen no coincideix amb el nombre de carpetes de destinació.",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "s'han detectat carpetes de destinació. Comproveu si hi ha salts de línia invisibles. Hi ha d’haver una ruta de carpeta per línia. Assegureu-vos que no heu creat accidentalment una línia en blanc.",
    "The number of source folders does not match the number of temporary conversion folders!": "El nombre de carpetes d’origen no coincideix amb el nombre de carpetes de conversió temporal.",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "s'han detectat carpetes de conversió temporal. Comproveu si hi ha salts de línia invisibles. Hi ha d’haver una ruta de carpeta per línia. Assegureu-vos que no heu creat accidentalment una línia en blanc.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Introduïu un contenidor vàlid com ara \".mp4\". Assegureu-vos d’incloure el '.'",
    "Corrupt file folder": "Carpeta d'arxius danyada",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "no existeix! Assegureu-vos que no hi hagi espais ni caràcters ocults abans i després del camí",
    "Source folder": "Carpeta d'origen",
    "Temporary conversion folder": "Carpeta de conversió temporal",
    "appears to be the same as or is within source folder": "Sembla que és igual o està dins de la carpeta d'origen",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "que impedirà que HBBatchBeast funcioni correctament. Canvieu la carpeta de conversió temporal a una carpeta fora de la carpeta d'origen. Si voleu utilitzar la funció \"Reemplaça els fitxers originals\", seleccioneu una carpeta de destinació que no sigui la mateixa o dins de la carpeta d'origen i, a continuació, marqueu la casella de selecció \"Reemplaça els fitxers originals\" a la secció de configuracions avançades. . Desmarqueu la casella de selecció temporal \"Carpeta de conversió temporal\", ja que en aquest cas no es farà servir. Els fitxers es convertiran a la carpeta de destinació i després es tornaran a la carpeta d'origen.",
    "Destination folder": "Carpeta de destinació",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "que impedirà que HBBatchBeast funcioni correctament. Canvieu la carpeta de destinació a una carpeta fora de la carpeta d'origen. Si voleu utilitzar la funció \"Reemplaça els fitxers originals\", seleccioneu una carpeta de destinació que no sigui la mateixa o dins de la carpeta d'origen i, a continuació, marqueu la casella de selecció \"Reemplaça els fitxers originals\" a la secció de configuracions avançades. . Desmarqueu la casella de selecció temporal \"Carpeta de conversió temporal\", ja que en aquest cas no es farà servir. Els fitxers es convertiran a la carpeta de destinació i després es tornaran a la carpeta d'origen.",
    "Error creating temporary conversion folder": "S'ha produït un error en crear la carpeta de conversió temporal",
    "Error creating destination folder": "S'ha produït un error en crear la carpeta de destinació",
    "Please select to use HandBrake or FFmpeg!": "Seleccioneu l’ús de HandBrake o FFmpeg!",
    "Please select a standard preset or input a custom one!": "Seleccioneu un valor predeterminat estàndard o introduïu-ne un personalitzat.",
    "Please select a scan interval of 5 seconds or greater!": "Seleccioneu un interval d’escaneig de 5 segons o més.",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Assegureu-vos que el nombre de instàncies simultànies de HandBrake / FFmpeg que s’utilitzen són un o més.",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "La clau de l'API no és vàlida. Feu clic a \"Nou\" a la pestanya de supervisió remota per generar una nova clau.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Introduïu un temps d’escaneig diari en format de 24 hores: hh: mm (per exemple, 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "ELS ARXIUS DE FONT seran eliminats després de la conversió! Provi abans d’utilitzar correctament!",
    "Benchmark failed!": "El benchmark ha fallat!",
    "Log does not exist!": "El registre no existeix!",
    "Folder does not exist!": "La carpeta no existeix!",
    "Error sending email! Please check your settings.": "S'ha produït un error en enviar el correu electrònic. Comproveu la vostra configuració.",
    "Test email sent!": "Test de correu electrònic enviat!",
    "All worker processes have been stopped.": "Tots els processos del treballador s'han aturat.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "La cua s’aturarà una vegada que els elements actuals acabin de processar-se. Esteu segur que voleu aturar la cua?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "S'ha iniciat la pausa de la cua. El botó 'Continua' apareixerà quan tots els treballadors s'han aturat.",
    "Healthy file cache cleared!": "Es va esborrar una memòria cau de fitxers saludable.",
    "Cache cleared!": "S'ha esborrat la memòria cau!",
    "Cancel item": "Cancel·la l'element",
    "Please check the above checkbox to use this feature.": "Comproveu la casella de selecció anterior per utilitzar aquesta funció.",
    "Configuration": "Configuració",
    "Source folders": "Carpetes d'origen",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Aquesta és la carpeta d'origen que s'escanejarà per a suports. Cal introduir la carpeta sense cap barra final. Per exemple:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "El quadre de ruta de la carpeta d'origen és ampliable (premeu Intro per crear una nova línia). Si voleu especificar diverses carpetes d'origen, assegureu-vos que la ruta de la carpeta d'origen estigui en la seva pròpia línia, com ara:",
    "Video health check": "Control de salut de vídeo",
    "Batch conversion and Folder watching": "Conversió per lots i visualització de carpetes",
    "Remote Monitoring (Beta)": "Monitorització remota (Beta)",
    "Benchmark (Beta)": "Punt de referència (Beta)",
    "System": "Sistema",
    "Help": "Ajuda",
    "Temporary conversion folders": "Carpetes temporals de conversió",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Si \"Carpeta de conversió temporal?\" està marcat, a continuació, HandBrake convertirà els fitxers en aquesta carpeta. Un cop finalitzada la conversió, el fitxer es mourà a la \"carpeta de destinació\". Haureu d’especificar tantes carpetes de conversió temporal com a carpetes d’origen. La vostra primera carpeta d'origen es convertirà a la vostra primera carpeta de conversió temporal, la vostra segona carpeta d'origen a la vostra segona carpeta de conversió temporal, etc. Assegureu-vos que la ruta de la carpeta de conversió temporal sigui a la seva pròpia línia.",
    "Destination folders": "Carpetes de destinació",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Especifiqueu els camins de la carpeta de destinació. De nou, haureu d’especificar tantes carpetes de destinació com a carpetes d’origen. Els fitxers de la vostra primera carpeta d'origen acabaran a la vostra primera carpeta de destinació, els fitxers de la vostra segona carpeta d'origen a la vostra segona carpeta de destinació, etc.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Primera carpeta d'origen ---------> Primera carpeta de conversió temporal ---------> Primera carpeta de destinació",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Segona carpeta d'origen ---------> Segona carpeta de conversió temporal ---------> Segona carpeta de destinació",
    "etc": "etc",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast no funcionarà correctament si establiu la carpeta de destinació igual que, o dins, la carpeta d'origen.",
    "Standard preset:": "Preset estàndard:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Seleccioneu la configuració prèvia de HandBrake amb la qual voleu convertir els vostres fitxers. Si es selecciona \"Preset estàndard\", tots els fitxers de les carpetes seleccionades es convertiran utilitzant el valor predefinit de HandBrake especificat. Podeu trobar més informació sobre els valors predefinits de HandBrake:",
    "Custom preset:": "Preset personalitzat:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Si \"Preset personalitzat\" heu d’introduir el vostre propi preset personalitzat. HBBatchBeast cobreix la part \"destí -o font de HandBrakeCLI\" de l'entrada de HandBrakeCLI, de manera que necessiteu introduir els paràmetres de conversió. Per exemple:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Si utilitzeu FFmpeg, heu de separar els paràmetres d’entrada i sortida amb una coma. Tal com:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "També podeu enllaçar a una configuració prèvia personalitzada que s’ha exportat des de l’aplicació gràfica oficial de HandBrake per exemple:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Si teniu problemes amb els valors predefinits personalitzats, és possible que es deu a un error conegut amb HandBrakeCLI (es solucionarà a la propera versió de HandBrakeCLI). Vegeu això per obtenir una solució temporal:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Cada preestabliment personalitzat ha de ser a la seva pròpia línia i, de manera similar a les carpetes, cal que tingueu tants valors predefinits personalitzats com a carpetes d'origen.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Primera carpeta d'origen ---------> Primera carpeta de conversió temporal ---------> Primera carpeta de destinació @ Preset personalitzat 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Segona carpeta d'origen ---------> Segona carpeta de conversió temporal ---------> Segona carpeta de destinació @ Preset personalitzat 2",
    "See the following image for guidance:": "Consulteu la imatge següent per obtenir orientació:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Si utilitzeu la codificació de la targeta gràfica (com ara NVENC), és possible que hagueu de reduir el nombre d’instàncies de HandBrake (proveu 2 o menys) a causa de les limitacions de VRAM.",
    "Select standard preset:": "Seleccioneu el valor predefinit estàndard:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "S'ha detectat el NVENC, assegureu-vos de reduir el nombre d’instàncies de HandBrakeCLI a 2 o per sota (per a la majoria de targetes gràfiques) o si es poden trobar errors a causa de la falta de VRAM suficient. Aquest paràmetre es pot trobar a la pestanya \"Sistema\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "S’ha detectat un valor predefinit importat. Si teniu problemes amb els valors predefinits personalitzats importats, és possible que s’hagi de produir un error conegut amb HandBrakeCLI (s’haurà de corregir a la propera versió HandBrakeCLI). Una solució temporal és eliminar \"PictureRotate\": \"0: 0\" 'del fitxer .json. Més informació aquí:",
    "Container:": "Contenidor:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Especifiqueu el contenidor que voleu tenir el fitxer de sortida, com ara \".mp4\". Podeu obtenir més informació sobre els contenidors a:",
    "Enable periodic scanning:": "Habiliteu l’anàlisi periòdica:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast pot supervisar les carpetes d'origen i executar exploracions de fitxers nous a un interval especificat. El temps d’interval és en segons i el valor per defecte és de 300 segons (5 minuts). Si se selecciona aquesta opció, quan premeu \"Escanejar i convertir\", el programa convertirà els fitxers nous i començarà un temporitzador. Això farà un bucle infinitament fins que s’aturi. L’interval d’exploració es troba a la secció de configuracions avançades.",
    "Enable daily scanning:": "Habiliteu l’escaneig diari:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "En lloc d’explorar periòdicament, podeu triar si s’executa l’exploració una vegada al dia. El temps d’escaneig s’introdueix a la secció de configuracions avançades en format hh: mm com a \"18: 30\". Una vegada que \"Escanejar i convertir\" estigui seleccionat, el programa esperarà fins al moment especificat fins a executar un procés d'escaneig i conversió. Un cop més, això es rodejarà infinitament fins que s’aturi.",
    "Show/hide advanced:": "Mostra / amaga avançat:",
    "Scan interval (minimum 5 seconds):": "Interval d’escaneig (mínim 5 segons):",
    "Daily run time (hh:mm):": "Temps d’execució diari (hh: mm):",
    "Output filename suffix:": "Sufix del nom de fitxer de sortida:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Això és opcional. Podeu especificar un sufix per afegir al final del vostre nom de fitxer com '_1080p' o '_testconversion', etc.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Si se selecciona \"preestablert estàndard\", tots els fitxers de sortida tindran el mateix sufix.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Si es selecciona \"predefinit personalitzat\", podeu especificar un sufix per carpeta d'origen / preset personalitzat. Assegureu-vos que cada sufix està en la seva pròpia línia. Per exemple, si teniu dues carpetes d'origen i utilitzeu el \"valor predeterminat personalitzat\", podeu posar-ho a la caixa de sufix de nom de fitxer:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Els fitxers de la primera carpeta d'origen tindran \"_720p\" afegit al nom del fitxer de sortida. Els fitxers de la segona carpeta d'origen tindran \"_1080p\" afegit al nom del fitxer de sortida, etc.",
    "Include these file types:": "Inclou aquests tipus de fitxers:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Introduïu els tipus de fitxer per cercar. Cada tipus ha de ser separat per una coma. L’entrada predeterminada és:",
    "Exclude files smaller than (MB):": "Exclou fitxers més petits que (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Especifiqueu si voleu excloure fitxers de menor mida determinats de la conversió (en megabytes)",
    "Exclude files larger than (MB):": "Exclou fitxers més grans que (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Especifiqueu si cal excloure fitxers de més d’una determinada mida de la conversió (en megabytes)",
    "Exclude filenames which include any of these words:": "Exclou els noms de fitxer que incloguin alguna d'aquestes paraules:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Introduïu les paraules clau que es volen filtrar en escanejar fitxers. Per exemple, si s'introdueix \"720p\", els fitxers amb \"720p\" al títol no es convertiran. De nou, les paraules clau han de ser separades per una coma. Per exemple, introduïu el següent al quadre de filtre:",
    "Include files with any ": "Inclou fitxers amb qualsevol",
    " or all ": "o tots",
    " of these": "d'aquests",
    "properties:": "propietats:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Aquí podeu introduir propietats de vídeo i àudio que els fitxers han de tenir per convertir (informació extreta amb FFprobe). Les propietats han d'estar separades per una coma. Utilitzeu l’eina de visualització d’informació multimèdia per ajudar a determinar quines propietats voleu incloure. Assegureu-vos de posar una coma després de l’última propietat. Per exemple, per convertir només els fitxers codificats mitjançant l’àudio estèreo h264 i aac:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Val la pena assenyalar que aquesta comprovació de propietats es realitza una vegada que s'inicia el procés de conversió (per estalviar temps mentre es construeix la cua), tot i que els fitxers poden aparèixer a la cua de conversió, se'ls ometrà o inclourà si es compleixen les condicions correctes.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Si FFprobe és capaç d’extraure propietats, apareixerà un \"OK\" a la columna \"FFprobe\" a la vista de la cua.",
    "Exclude files with any ": "Exclou els fitxers amb qualsevol",
    " of these ": "d'aquests",
    "The opposite of 'Include files with any or all of these properties'": "El contrari de \"Inclou fitxers amb qualsevol o totes aquestes propietats\"",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Aquesta és una petita eina per analitzar les propietats dels fitxers per tal d'ajudar-vos a determinar quines propietats voleu incloure / excloure en les opcions anteriors. Utilitza FFprobe per retornar informació. Arrossegueu i deixeu anar els fitxers al quadre gris per analitzar-los. Per exemple, deixar anar un fitxer de prova pot retornar el següent:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Si voleu excloure fitxers com aquest de convertir-vos, podeu posar diverses propietats de fitxer al quadre \"Exclou fitxers amb qualsevol o totes aquestes propietats\" i marqueu la casella situada al costat de \"tot\" en lloc de \"qualsevol\", així:",
    "Copy excluded files to destination:": "Copieu els fitxers exclosos a la destinació:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Si seleccioneu aquesta opció, els fitxers que s’han exclòs de la conversió es copiaran directament a la carpeta de destinació. Això s'aplica als filtres següents:",
    "Exclude filenames which include any of these words": "Exclou els noms de fitxer que incloguin qualsevol d'aquestes paraules",
    "Include files with any or all of these properties": "Incloeu fitxers amb qualsevol o totes aquestes propietats",
    "Exclude files with any or all of these properties": "Exclou els fitxers amb qualsevol o totes aquestes propietats",
    "Exclude files smaller than (MB)": "Exclou fitxers més petits que (MB)",
    "Exclude files larger than (MB)": "Exclou fitxers més grans que (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Tingueu en compte que això també s'aplica als fitxers exclosos perquè no compleixen les condicions de propietat \"Inclou\" de les anteriors, de manera que no copieu accidentalment tota la biblioteca quan només intenteu convertir alguns fitxers.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "La funció de còpia no s'aplica als filtres següents (és a dir, els fitxers exclosos a causa del filtre)",
    "Include these file types": "Inclou aquests tipus de fitxers",
    "Delete source files after conversion:": "Suprimeix els fitxers d'origen després de la conversió:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Si està seleccionat, si un intent de conversió té èxit, se suprimirà el fitxer font. Aquest procés es realitza al final, després de la conversió de tots els fitxers. Això vol dir que podeu convertir els mateixos fitxers d'origen utilitzant múltiples valors predefinits, tot d'una vegada. A continuació, esborraran els fitxers d'origen.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Substituïu el fitxer original si el fitxer convertit és més petit?",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Seleccioneu aquesta casella de selecció si voleu que HBBatchBeast substitueixi automàticament el fitxer font original si el fitxer nou és més petit. Si el fitxer nou no és més petit, es deixarà a la carpeta de destinació.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Assegureu-vos que la vostra carpeta de destinació no sigui la mateixa o que hi hagi, la vostra carpeta d'origen o no funcioni correctament.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Una vegada que HBBatchBeast hagi intentat comprimir un fitxer específic, afegirà el camí del fitxer a una memòria cau de manera que no es torni a provar en el futur. Podeu veure / editar / esborrar la memòria cau amb els botons grocs.",
    "Replace original file always?": "Reemplaça el fitxer original sempre?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "El fitxer original es substituirà independentment de si el fitxer nou és més gran o més petit.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Una vegada més, assegureu-vos que la vostra carpeta de destinació no sigui la mateixa que la carpeta d'origen o que hi hagi dins, o que no funcioni correctament.",
    "Copy subtitle (srt) files to destination?": "Copieu els fitxers de subtítols (srt) a la destinació?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Els fitxers .srt dels subtítols es copiaran automàticament a la carpeta de destinació.",
    "Automatically create temporary/destination folders if they don't exist?": "Creeu automàticament carpetes temporals / de destinació si no existeixen?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Ruta de ratolí personalitzada per executar després de cada conversió (deixeu en blanc si no esteu utilitzant):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Introduïu el camí d'accés a un fitxer de lot personalitzat que voleu executar després de cada conversió. Per exemple:",
    "Batch files with timeout statements won't work. More info here:": "Els fitxers per lots amb declaracions de temps d'espera no funcionaran. Més informació aquí:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Deixa el quadre completament buit si no voleu utilitzar aquesta opció (assegureu-vos que no hi hagi caràcters ocults a la caixa)",
    "Run processes at low priority?": "Voleu executar processos amb prioritat baixa?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Tots els processos de conversió s’executaran amb prioritat baixa, reduint l’ús del processador.",
    "Remove apostrophes from filenames:": "Elimineu els apòstrofs dels noms de fitxer:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Les exploracions de conversions / comprovacions de salut poden fallar si els noms de fitxer tenen apòstrofs. Marqueu-ho per eliminar automàticament els apòstrofs dels noms dels fitxers.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Aquesta funció pot escanejar fitxers de vídeo corruptes mitjançant la funció \"--scan\" de HandBrake, tot i que això no sempre és exacte. També utilitza FFprobe per proporcionar un segon punt de referència. Si FFprobe i HandBrake fallen, hi ha moltes possibilitats que el fitxer estigui malmès.",
    "Move corrupt files into the following folder:": "Mou els fitxers corruptes a la següent carpeta:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Si està marcat, els fitxers que donin errors es mourran a la carpeta especificada.",
    "Corrupt file folder:": "Carpeta d'arxius danyada:",
    "Run thorough file health check:": "Executeu una comprovació minuciosa del fitxer:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Si està marcat, es durà a terme una comprovació de salut de vídeo molt més lenta i més completa amb FFmpeg en comptes de HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Basat en \"ScanMedia.ps1\" de Desani que es troba a:",
    "Attempt to repair files after thorough check:": "Intenta reparar els fitxers després d’una comprovació completa:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Si està marcat, HBBatchBeast intentarà reparar fitxers mitjançant FFmpeg. Es crearà un fitxer nou amb el sufix \"arreglat\" a la mateixa carpeta que el fitxer font.",
    "'CRF' value to use when attempting to repair files:": "Valor 'CRF' per utilitzar quan intenteu reparar fitxers:",
    "The default 'CRF' value is 23. Please see the following for more information:": "El valor \"CRF\" predeterminat és de 23. Consulteu el següent per obtenir més informació:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "El rang de l'escala CRF és 0–51, on 0 és sense pèrdues, 23 és el valor per defecte i 51 és la pitjor qualitat possible. Un valor més baix generalment condueix a una major qualitat, i un rang sani subjectivament és de 17–28. Penseu en 17 o 18 per ser visualment sense pèrdua o gairebé; hauria de tenir el mateix aspecte o gairebé el mateix que l’entrada, però no és tècnicament sense pèrdues.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast desa una llista de camins de fitxers escanejats reportats com a incorruptibles. Esborreu la memòria cau per realitzar una exploració nova de tots els fitxers.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Nombre de instàncies simultànies de HandBrake / FFmpeg per utilitzar? (Recomanat 4 o menys):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Aquest paràmetre s'aplica tant als processos \"Comprovació de la salut de vídeo\" com \"Escanejar i convertir\". Especifiqueu quants fils de mà per utilitzar. No hi ha màxim, encara que es recomana no utilitzar més de 4. Una quantitat més alta pot congelar l’ordinador si no és molt potent.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Límit de visualització de la mida de la cua? (Recomanat 1000 o menys):",
    "Automatically start \"Scan and convert\" when program opened?": "Comenceu automàticament \"Escanejar i convertir\" quan s'obri el programa?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Empleneu les dades del correu electrònic per rebre notificacions per correu electrònic si apareix un error durant la comprovació de la salut o la visualització de la conversió / carpeta. No funcionarà amb comptes que requereixin 2FA. Heu d’habilitar l’accés a aplicacions menys segures als comptes de Gmail.",
    "Email address:": "Correu electrònic:",
    "For example:": "Per exemple:",
    "Email password(not saved):": "Contrasenya del correu electrònic (no guardada):",
    "SMTP server:": "Servidor SMTP:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Aquesta funció permet supervisar l’estat de conversió / comprovació de la salut mitjançant qualsevol navegador web. Útil quan executeu servidors, etc.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Si està habilitat, s'enviaran les següents dades anònimes a HBBatchBeast.io:",
    "API key": "Clau de l'API",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Estat actual (\"Cerca\", \"Execució\", \"Finalitzat\", etc)",
    "Number of:": "Nombre de:",
    "Remaining items": "Els elements restants",
    "Successful items": "Elements d'èxit",
    "Errored items": "Articles erròniats",
    "Cancelled items": "Articles cancel·lats",
    "Worker percentages": "Percentatges dels treballadors",
    "Last completed item time": "Hora de l’últim article completat",
    "Enable remote monitoring?:": "Activa el monitoratge remot?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Una utilitat bàsica de benchmarking construïda principalment per veure com funcionen 16+ processadors de nucli utilitzant múltiples instàncies de HandBrake, tot i que es pot executar en qualsevol tipus de processador.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Això descarregarà un fitxer de mostra d’h265 4k (2,5 MB) i executareu un punt de referència utilitzant 4 instàncies de HandBrake amb un valor predefinit \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Els resultats es poden penjar a hbbatchbeast.io si ho desitgeu.",
    "Queue": "Cua",
    "Output this session": "Envieu aquesta sessió",
    "Media info viewer tool": "Eina de visualització d'informació multimèdia",
    "View compress attempt cache": "Mostra la memòria cau de l'intent de comprimir",
    "Clear compress attempt cache": "Esborrar la memòria cau de l'intent de compressió",
    "Save config": "Desa la configuració",
    "Scan only": "Només escaneja",
    "Scan and convert": "Escanejar i convertir",
    "View scan/conversion summary log": "Consulteu el registre de resum d’escaneig / conversió",
    "View individual file check/conversion log": "Consulteu el registre de comprovació / conversió de fitxers individuals",
    "View worker console output": "Visualitzeu la sortida de la consola de treballador",
    "Health check": "Revisió de salut",
    "Clear healthy file cache": "Esborreu la memòria cau de fitxers saludable",
    "View error log": "Mostra el registre d'errors",
    "Email test": "Prova de correu electrònic",
    "View master log": "Veure registre mestre",
    "Wiki help": "Ajuda de Wiki",
    "An application by HaveAGitGat": "Una aplicació per HaveAGitGat",
    "New": "Nou",
    "Launch": "Inicia",
    "Benchmark": "Punt de referència",
    "See results": "Veure resultats",
    "Pause queue": "Pausa de la cua",
    "Continue queue": "Continua la cua",
    "Stop queue": "Atura la cua",
    "Convert selected files": "Convertir fitxers seleccionats",
    "Toggle queue view": "Commuta la vista de la cua",
    "Deselect all": "Deseleccionar tot",
    "Invert all": "Inverteix tot",
    "Select all": "Seleccionar tot",
    "Toggle output view": "Commuta la vista de sortida"
}