{
    "The number of custom presets does not match the number of source folders!": "Počet vlastních předvoleb neodpovídá počtu zdrojových složek!",
    "source folders have been detected.": "byly zjištěny zdrojové složky.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "byly zjištěny vlastní přednastavené řádky. Prosím, zkontrolujte, zda nejsou neviditelné konce řádků. Měla by existovat jedna cesta složky nebo přednastavena na řádek. Ujistěte se, že jste omylem nevytvořili prázdný řádek.",
    "The number of filename suffixes does not match the number of source folders! ": "Počet přípon souborů neodpovídá počtu zdrojových složek!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "řádky přípon souborů. Prosím, zkontrolujte, zda nejsou neviditelné konce řádků. Na jeden řádek by měla být jedna cesta složky nebo přípona názvu souboru. Ujistěte se, že jste omylem nevytvořili prázdný řádek.",
    "The number of source folders does not match the number of destination folders!": "Počet zdrojových složek neodpovídá počtu cílových složek!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "cílové složky. Prosím, zkontrolujte, zda nejsou neviditelné konce řádků. Na jeden řádek by měla být jedna cesta složky. Ujistěte se, že jste omylem nevytvořili prázdný řádek.",
    "The number of source folders does not match the number of temporary conversion folders!": "Počet zdrojových složek neodpovídá počtu dočasných složek konverzí!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "dočasných složek konverze. Prosím, zkontrolujte, zda nejsou neviditelné konce řádků. Na jeden řádek by měla být jedna cesta složky. Ujistěte se, že jste omylem nevytvořili prázdný řádek.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Zadejte prosím platný kontejner, například „.mp4“. Nezapomeňte zahrnout znak „.“",
    "Corrupt file folder": "Poškozená složka souboru",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "neexistuje! Ujistěte se, že před / po cestě nejsou žádné mezery ani skryté znaky",
    "Source folder": "Zdrojová složka",
    "Temporary conversion folder": "Dočasná složka konverze",
    "appears to be the same as or is within source folder": "Zdá se, že je stejná nebo je ve zdrojové složce",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "zabrání správnému fungování HBBatchBeast. Změňte dočasnou složku konverze na složku mimo zdrojovou složku. Chcete-li použít funkci Nahradit původní soubory, vyberte cílovou složku, která není stejná jako zdrojová složka nebo v ní, a zaškrtněte políčko Nahradit původní soubory vždy v části Rozšířené nastavení. . Zrušte zaškrtnutí políčka „Dočasná složka konverze“, protože v tomto případě nebude sloužit k použití. Soubory budou převedeny do cílové složky a poté přesunuty zpět do zdrojové složky.",
    "Destination folder": "Cílová složka",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "zabrání správnému fungování HBBatchBeast. Změňte cílovou složku do složky mimo zdrojovou složku. Chcete-li použít funkci „Nahradit původní soubory“, vyberte cílovou složku, která není stejná jako zdrojová složka nebo ve zdrojové složce, a zaškrtněte políčko Nahradit původní soubory vždy v části Rozšířené nastavení. . Zrušte zaškrtnutí políčka „Dočasná složka konverze“, protože v tomto případě nebude sloužit k použití. Soubory budou převedeny do cílové složky a poté přesunuty zpět do zdrojové složky.",
    "Error creating temporary conversion folder": "Chyba při vytváření dočasné složky konverze",
    "Error creating destination folder": "Chyba při vytváření cílové složky",
    "Please select to use HandBrake or FFmpeg!": "Vyberte prosím použití HandBrake nebo FFmpeg!",
    "Please select a standard preset or input a custom one!": "Vyberte standardní přednastavení nebo zadejte vlastní předvolbu!",
    "Please select a scan interval of 5 seconds or greater!": "Vyberte interval skenování 5 sekund nebo více!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Ujistěte se, že počet současných instancí HandBrake / FFmpeg, který chcete použít, je jeden nebo více!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Neplatný klíč API! Chcete-li vygenerovat nový klíč, klikněte na kartě vzdáleného monitorování na tlačítko Nový.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Zadejte denní dobu skenování ve formátu 24 hodin: hh: mm (například 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "SOUBORY SOUBORŮ BUDOU PO PŘEPRAVĚ ODESLAT! Před správným použitím otestujte!",
    "Benchmark failed!": "Benchmark selhal!",
    "Log does not exist!": "Protokol neexistuje!",
    "Folder does not exist!": "Složka neexistuje!",
    "Error sending email! Please check your settings.": "Chyba při odesílání e-mailu! Zkontrolujte prosím nastavení.",
    "Test email sent!": "Odeslat testovací e-mail!",
    "All worker processes have been stopped.": "Všechny pracovní procesy byly zastaveny.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Po dokončení zpracování aktuálních položek bude fronta pozastavena. Opravdu chcete pozastavit frontu?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Jakmile se všichni pracovníci pozastaví, zobrazí se tlačítko pozastavení inicializace fronty.",
    "Healthy file cache cleared!": "Zdravá mezipaměť souborů vymazána!",
    "Cache cleared!": "Vyrovnaná mezipaměť!",
    "Cancel item": "Zrušit položku",
    "Please check the above checkbox to use this feature.": "Chcete-li tuto funkci použít, zaškrtněte toto políčko.",
    "Configuration": "Konfigurace",
    "Source folders": "Zdrojové složky",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Toto je zdrojová složka, která bude naskenována pro média. Složku je třeba zadat bez lomítka. Například:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Pole cesty zdrojové složky je rozbalitelné (pro vytvoření nového řádku stiskněte klávesu enter). Chcete-li určit více zdrojových složek, ujistěte se, že každá cesta ke zdrojové složce je na vlastním řádku, například:",
    "Video health check": "Kontrola stavu videa",
    "Batch conversion and Folder watching": "Dávková konverze a sledování složek",
    "Remote Monitoring (Beta)": "Vzdálené monitorování (Beta)",
    "Benchmark (Beta)": "Benchmark (Beta)",
    "System": "Systém",
    "Help": "Pomoc",
    "Temporary conversion folders": "Dočasné složky konverze",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Pokud \"Dočasná složka konverze?\" je zaškrtnuto, pak HandBrake převede soubory do této složky. Po dokončení převodu bude soubor přesunut do složky „Cíl“. Jako zdrojové složky budete muset zadat tolik dočasných složek konverzí. Vaše první zdrojová složka bude převedena na první dočasnou složku konverze, druhou zdrojovou složku do druhé dočasné složky konverze a tak dále. Ujistěte se, že každá dočasná cesta ke složce konverzí je na vlastním řádku.",
    "Destination folders": "Cílové složky",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Zadejte cesty cílové složky. Znovu budete muset zadat co nejvíce cílových složek jako zdrojové složky. Soubory z první zdrojové složky skončí ve vaší první cílové složce, ve druhém zdrojovém adresáři ve vašem druhém cílovém adresáři a podobně.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "První zdrojová složka ---------> První dočasná složka konverze ---------> První cílová složka",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Druhá zdrojová složka ---------> Druhá dočasná složka konverze ---------> Druhá cílová složka",
    "etc": "atd",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast nebude fungovat správně, pokud nastavíte cílovou složku jako zdrojovou složku nebo v ní.",
    "Standard preset:": "Standardní přednastavení:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Vyberte předvolbu HandBrake, kterou chcete převést na soubory. Pokud je vybrána možnost \"Standardní přednastavení\", všechny soubory ve vybraných složkách budou převedeny pomocí zadané předvolby HandBrake. Více o přednastaveních HandBrake naleznete zde:",
    "Custom preset:": "Vlastní přednastavení:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Pokud \"Vlastní přednastavení\", pak musíte zadat vlastní přednastavení. HBBatchBeast pokrývá část \"HandBrakeCLI -i source -o destination\" část HandBrakeCLI vstupu, takže musíte zadat parametry konverze. Například:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Pokud používáte FFmpeg, musíte oddělit vstupní a výstupní parametry čárkou. Jako:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Můžete také odkazovat na vlastní přednastavení, které bylo exportováno z oficiální aplikace HandBrake GUI, například:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Pokud máte potíže s vlastními přednastaveními, může to být způsobeno známou chybou s HandBrakeCLI (bude opraveno v dalším vydání HandBrakeCLI). Toto řešení naleznete pro dočasné řešení:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Každé vlastní přednastavení musí být na svém vlastním řádku a podobně jako složky musí existovat tolik uživatelských předvoleb jako zdrojových složek.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "První zdrojová složka ---------> První dočasná složka konverze ---------> První cílová složka @ Vlastní předvolba 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Druhá zdrojová složka ---------> Druhá dočasná složka konverze ---------> Druhá cílová složka @ Vlastní předvolba 2",
    "See the following image for guidance:": "Pokyny naleznete v následujícím obrázku:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Pokud používáte kódování grafické karty (například NVENC), bude pravděpodobně nutné snížit počet instancí HandBrake (zkuste 2 nebo méně) z důvodu omezení VRAM.",
    "Select standard preset:": "Vyberte standardní přednastavení:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC zjistil, prosím, nezapomeňte snížit počet instancí HandBrakeCLI na 2 nebo nižší (pro většinu grafických karet) nebo se mohou vyskytnout chyby způsobené nedostatkem VRAM. Toto nastavení naleznete v záložce \"Systém\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Je-li problém s importovanými vlastními předvolbami, může to být způsobeno známou chybou s HandBrakeCLI (bude opraveno v dalším vydání HandBrakeCLI). Dočasným řešením je odebrat soubor \"PictureRotate\": \"0: 0\" ze souboru .json. Více informací zde:",
    "Container:": "Kontejner:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Určete kontejner, ve kterém chcete mít výstupní soubor, jako například '.mp4'. Více informací o kontejnerech naleznete na adrese:",
    "Enable periodic scanning:": "Povolit pravidelné skenování:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast může sledovat zdrojové složky a spouštět skenování nových souborů v určeném intervalu. Doba intervalu je v sekundách, výchozí hodnota je 300 sekund (5 minut). Pokud je tato volba vybrána, pak po stisknutí tlačítka \"Skenovat a konvertovat\" program převede všechny nové soubory a začne odpočítávání. To se bude nekonečně opakovat, dokud se nezastaví. Interval skenování se nachází v části pokročilých nastavení.",
    "Enable daily scanning:": "Povolit denní skenování:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Namísto pravidelného skenování můžete zvolit, aby se skenování spouštělo jednou denně. Doba skenování se zadává do sekce pokročilých nastavení ve formátu hh: mm, například „18: 30“. Jakmile je vybrána možnost „Skenovat a konvertovat“, bude program čekat až do zadaného času, dokud nebude spuštěn proces skenování a konverze. Opět platí, že to bude nekonečně nekonečné, dokud se nezastaví.",
    "Show/hide advanced:": "Zobrazit / skrýt pokročilé:",
    "Scan interval (minimum 5 seconds):": "Interval skenování (minimálně 5 sekund):",
    "Daily run time (hh:mm):": "Denní doba provozu (hh: mm):",
    "Output filename suffix:": "Přípona výstupního souboru:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Toto je volitelné. Můžete zadat příponu, která se má přidat na konec názvu souboru, jako je _1080p nebo _testkonverze atd.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Pokud je vybráno „standardní přednastavení“, budou mít všechny výstupní soubory stejnou příponu.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Pokud je vybráno „vlastní přednastavení“, můžete zadat jednu příponu na zdrojovou složku / vlastní přednastavení. Ujistěte se, že každá přípona je na vlastním řádku. Pokud máte například 2 zdrojové složky a používáte „vlastní přednastavení“, můžete je umístit do pole přípony názvu souboru:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Soubory v první zdrojové složce budou mít \"_720p\" přidány do výstupního souboru. Soubory ve druhé zdrojové složce budou přidány do výstupního souboru „_1080p“ atd.",
    "Include these file types:": "Zahrnout tyto typy souborů:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Zadejte typy souborů, které chcete vyhledat. Každý typ musí být oddělen čárkou. Výchozí položka je:",
    "Exclude files smaller than (MB):": "Vyloučit soubory menší než (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Určete, zda chcete vyloučit soubory, které jsou menší než určitá velikost, z konverzí (v megabajtech)",
    "Exclude files larger than (MB):": "Vyloučit soubory větší než (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Určete, zda mají být soubory převedeny na větší než určitou velikost (v megabajtech).",
    "Exclude filenames which include any of these words:": "Vyloučit názvy souborů, které obsahují některá z těchto slov:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Při skenování souborů zadejte klíčová slova, která mají být filtrována. Například, pokud je zadáno \"720p\", pak žádné soubory s \"720p\" v názvu nebudou převedeny. Klíčová slova musí být opět oddělena čárkou. Například do pole filtru zadejte následující:",
    "Include files with any ": "Zahrnout soubory s libovolným",
    " or all ": "nebo všechny",
    " of these": "z nich",
    "properties:": "vlastnosti:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Zde můžete zadat vlastnosti videa a zvuku, které musí mít soubory, aby mohly být převedeny (informace extrahované pomocí nástroje FFprobe). Vlastnosti musí být odděleny čárkou. Pomocí nástroje pro zobrazení informací o médiích můžete určit, které vlastnosti chcete zahrnout. Ujistěte se, že jste za poslední vlastnost vložili čárku. Chcete-li například konvertovat pouze soubory, které jsou kódovány pomocí stereofonního zvuku h264 a aac:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Je třeba poznamenat, že tato kontrola vlastností se provádí, jakmile se proces konverze spustí (aby se ušetřil čas při vytváření fronty), takže i když se soubory mohou objevit ve frontě konverzí, budou přeskočeny / zahrnuty, pokud budou splněny správné podmínky.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Pokud FFprobe dokáže extrahovat vlastnosti, zobrazí se ve sloupci \"FFprobe\" v zobrazení fronty \"OK\".",
    "Exclude files with any ": "Vyloučit soubory s libovolným",
    " of these ": "z nich",
    "The opposite of 'Include files with any or all of these properties'": "Opak „Zahrnout soubory s některými nebo všemi těmito vlastnostmi“",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Jedná se o malý nástroj pro analýzu vlastností souborů s cílem zjistit, které vlastnosti chcete zahrnout / vyloučit do výše uvedených možností. K návratu informací používá FFprobe. Přetáhněte soubory do šedého pole a analyzujte je. Například vynechání testovacího souboru může vrátit následující:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Chcete-li vyloučit takové soubory, které mají být převedeny, můžete do pole Vyloučit soubory s některými nebo všemi těmito vlastnostmi umístit několik vlastností souboru a zaškrtnout políčko vedle položky „vše“ namísto „libovolné“, jako tak:",
    "Copy excluded files to destination:": "Kopírovat vyloučené soubory do cíle:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Pokud vyberete tuto možnost, budou soubory, které byly vyloučeny z převodu, zkopírovány přímo do cílové složky. To platí pro následující filtry:",
    "Exclude filenames which include any of these words": "Vyloučit názvy souborů, které obsahují některá z těchto slov",
    "Include files with any or all of these properties": "Zahrnout soubory s některou nebo všechny tyto vlastnosti",
    "Exclude files with any or all of these properties": "Vyloučit soubory s některými nebo všemi těmito vlastnostmi",
    "Exclude files smaller than (MB)": "Vyloučit soubory menší než (MB)",
    "Exclude files larger than (MB)": "Vyloučit soubory větší než (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Toto platí také pro soubory vyloučené, protože nesplňují podmínky \"Zahrnout\" uvedené výše, takže se vám nedopatřením kopíruje celá knihovna, když se pokoušíte pouze převést několik souborů.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Funkce kopírování se nevztahuje na následující filtry (tj. Soubory vyloučené kvůli filtru)",
    "Include these file types": "Zahrnout tyto typy souborů",
    "Delete source files after conversion:": "Smazat zdrojové soubory po konverzi:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Pokud je tato volba vybrána, bude úspěšný pokus o konverzi a zdrojový soubor bude vymazán. Tento proces se provádí na samém konci, po konverzi všech souborů. To znamená, že můžete převést stejné zdrojové soubory pomocí více předvoleb, vše najednou. Poté budou odstraněny zdrojové soubory.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Pokud je převedený soubor menší, nahraďte původní soubor (pokus o komprimaci)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Zaškrtněte toto políčko, pokud chcete HBBatchBeast automaticky nahradit původní zdrojový soubor, pokud je nový soubor menší. Pokud nový soubor není menší, bude ponechán v cílové složce.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Ujistěte se, že cílová složka není stejná jako / nebo uvnitř vaší zdrojové složky nebo nebude fungovat správně.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Jakmile se HBBatchBeast pokusil komprimovat specifický soubor, přidá tuto cestu k souboru do mezipaměti, aby se v budoucnu znovu nepokusila. Pomocí žlutých tlačítek můžete zobrazit / upravit / vymazat mezipaměť.",
    "Replace original file always?": "Nahraďte původní soubor vždy?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Původní soubor bude nahrazen bez ohledu na to, zda je nový soubor větší nebo menší.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Znovu se ujistěte, že cílová složka není stejná jako / nebo uvnitř vaší zdrojové složky nebo nebude fungovat správně.",
    "Copy subtitle (srt) files to destination?": "Kopírovat soubory titulků (srt) do cíle?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Soubory „.srt“ titulků budou automaticky zkopírovány do cílové složky.",
    "Automatically create temporary/destination folders if they don't exist?": "Automaticky vytvářet dočasné / cílové složky, pokud neexistují?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Vlastní cesta k netopýru, která se má spustit po každé konverzi (ponechte prázdné, pokud nepoužíváte):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Zadejte cestu k vlastnímu dávkovému souboru, který chcete provést po každé konverzi. Například:",
    "Batch files with timeout statements won't work. More info here:": "Dávkové soubory s příkazy časového limitu nebudou fungovat. Více informací zde:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Pokud nechcete tuto možnost používat, ponechte pole zcela prázdné (ujistěte se, že v poli nejsou žádné skryté znaky)",
    "Run processes at low priority?": "Spustit procesy s nízkou prioritou?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Všechny procesy konverze budou spuštěny s nízkou prioritou, což sníží využití procesoru.",
    "Remove apostrophes from filenames:": "Odebrat apostrofy ze jmen souborů:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Konverze / kontroly stavu kontroly mohou selhat, pokud mají názvy souborů apostrofy. Zaškrtnutím tohoto políčka automaticky odstraníte apostrofy ze souborů.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Tato funkce může skenovat poškozené video soubory pomocí funkce \"--scan\" aplikace HandBrake, i když to není vždy přesné. Rovněž používá FFprobe k poskytnutí druhého referenčního bodu. Pokud selžou jak FFprobe, tak HandBrake, je vysoká šance, že je soubor poškozen.",
    "Move corrupt files into the following folder:": "Přesuňte poškozené soubory do následující složky:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Pokud je zaškrtnuto, budou všechny soubory, které poskytují chyby, přesunuty do zadané složky.",
    "Corrupt file folder:": "Poškozená složka souboru:",
    "Run thorough file health check:": "Spustit důkladnou kontrolu stavu souborů:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Pokud je zaškrtnuto, pak mnohem pomalejší, důkladnější kontrola stavu videa bude spuštěna pomocí FFmpeg namísto HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Na základě Desaniho 'ScanMedia.ps1' nalezeného na:",
    "Attempt to repair files after thorough check:": "Pokus o opravu souborů po důkladné kontrole:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Pokud je zaškrtnuto, HBBatchBeast se pokusí opravit soubory pomocí FFmpeg. Nový soubor s příponou „_repaired“ bude vytvořen ve stejné složce jako zdrojový soubor.",
    "'CRF' value to use when attempting to repair files:": "Hodnota „CRF“, která se má použít při pokusu o opravu souborů:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Výchozí hodnota „CRF“ je 23. Další informace naleznete v následujícím textu:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Rozsah stupnice CRF je 0–51, kde 0 je bezeztrátová, 23 je výchozí a 51 nejhorší možná. Nižší hodnota obecně vede k vyšší kvalitě a subjektivně rozumný rozsah je 17–28. Zvažte 17 nebo 18, aby byly vizuálně bezztrátové nebo téměř tak; měl by vypadat stejně nebo téměř stejně jako vstup, ale není technicky bezztrátový.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast uloží seznam tras naskenovaných souborů, které byly nahlášeny jako nepřesné. Vymažte mezipaměť a proveďte novou kontrolu všech souborů.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Počet simultánních instancí HandBrake / FFmpeg, které se mají použít? (Doporučeno 4 nebo méně):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Toto nastavení platí pro procesy \"Kontrola stavu videa\" a \"Skenovat a konvertovat\". Zadejte, kolik podprocesů HandBrake použít. Neexistuje žádné maximum, i když se doporučuje nepoužívat více než 4. Vyšší množství může zmrazit váš počítač, pokud to není moc silný.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Limit zobrazení velikosti fronty (doporučeno 1000 nebo méně):",
    "Automatically start \"Scan and convert\" when program opened?": "Automaticky spustit \"Scan and convert\" při otevření programu?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Vyplňte e-mailové údaje, abyste obdrželi e-mailová upozornění, pokud se během kontroly stavu nebo konverze / sledování složky vyskytne chyba. Nebude fungovat s účty, které vyžadují 2FA. Musíte povolit přístup k méně zabezpečeným aplikacím v účtech Gmail.",
    "Email address:": "Emailová adresa:",
    "For example:": "Například:",
    "Email password(not saved):": "E-mailové heslo (není uloženo):",
    "SMTP server:": "SMTP server:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Tato funkce umožňuje sledování stavu konverze / stavu kontroly pomocí libovolného webového prohlížeče. Užitečné při spuštění serverů atd.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Pokud je tato možnost povolena, budou do HBBatchBeast.io odeslána následující anonymní data:",
    "API key": "Klíč API",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Aktuální stav ('Vyhledávání', 'Běh', 'Dokončení' atd.)",
    "Number of:": "Počet:",
    "Remaining items": "Zbývající položky",
    "Successful items": "Úspěšné položky",
    "Errored items": "Chybné položky",
    "Cancelled items": "Zrušené položky",
    "Worker percentages": "Pracovní procenta",
    "Last completed item time": "Čas poslední dokončené položky",
    "Enable remote monitoring?:": "Povolit vzdálené monitorování ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Základní nástroj benchmarking postavený hlavně vidět jak 16 + jádrové procesory vykonávají používat několik HandBrake instancí ačkoli to může být provozováno na nějakém typu procesoru.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Tím stáhnete vzorový soubor h265 4k (2.5MB) a spustíte benchmark pomocí 4 instancí HandBrake s přednastaveným \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Výsledky můžete nahrát na hbbatchbeast.io, pokud si vyberete.",
    "Queue": "Fronta",
    "Output this session": "Výstup této relace",
    "Media info viewer tool": "Prohlížeč médií info",
    "View compress attempt cache": "Zobrazení mezipaměti pokusu o komprimaci",
    "Clear compress attempt cache": "Vymazat mezipaměť pokusu o komprimaci",
    "Save config": "Uložit konfig",
    "Scan only": "Pouze skenování",
    "Scan and convert": "Skenovat a konvertovat",
    "View scan/conversion summary log": "Zobrazit souhrnný protokol o skenování / konverzi",
    "View individual file check/conversion log": "Zobrazení protokolu o kontrole / konverzi jednotlivých souborů",
    "View worker console output": "Zobrazení výstupu pracovní konzoly",
    "Health check": "Zdravotní prohlídka",
    "Clear healthy file cache": "Vymazat zdravou mezipaměť souborů",
    "View error log": "Zobrazení protokolu chyb",
    "Email test": "Test e-mailu",
    "View master log": "Zobrazit hlavní protokol",
    "Wiki help": "Nápověda Wiki",
    "An application by HaveAGitGat": "Aplikace HaveAGitGat",
    "New": "Nový",
    "Launch": "Zahájení",
    "Benchmark": "Benchmark",
    "See results": "Viz výsledky",
    "Pause queue": "Pozastavit frontu",
    "Continue queue": "Pokračujte ve frontě",
    "Stop queue": "Zastavte frontu",
    "Convert selected files": "Převést vybrané soubory",
    "Toggle queue view": "Přepnout zobrazení fronty",
    "Deselect all": "Odznačit vše",
    "Invert all": "Invertovat vše",
    "Select all": "Vybrat vše",
    "Toggle output view": "Přepnout zobrazení výstupu"
}