{"The number of custom presets does not match the number of source folders!":"Nid yw nifer y rhagosodiadau personol yn cyfateb i nifer y ffolderi ffynhonnell!","source folders have been detected.":"mae ffolderi ffynhonnell wedi cael eu canfod.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"mae llinellau rhagosodedig personol wedi'u canfod. Gwiriwch am doriadau llinell anweledig. Dylai fod un llwybr ffolder neu ragosodiad fesul llinell. Gwnewch yn siŵr nad ydych wedi creu llinell wag yn ddamweiniol.","The number of filename suffixes does not match the number of source folders! ":"Nid yw nifer yr ôl-ddodiadau enw ffeil yn cyfateb i nifer y ffolderi ffynhonnell!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"canfuwyd llinellau ôl-ddodiad enwau ffeiliau. Gwiriwch am doriadau llinell anweledig. Dylai fod un llwybr ffolder neu ôl-ddodiad enw fesul llinell. Gwnewch yn siŵr nad ydych wedi creu llinell wag yn ddamweiniol.","The number of source folders does not match the number of destination folders!":"Nid yw nifer y ffolderi ffynhonnell yn cyfateb i nifer y ffolderi cyrchfan!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"mae ffolderi cyrchfannau wedi'u canfod. Gwiriwch am doriadau llinell anweledig. Dylai fod un llwybr ffolder fesul llinell. Gwnewch yn siŵr nad ydych wedi creu llinell wag yn ddamweiniol.","The number of source folders does not match the number of temporary conversion folders!":"Nid yw nifer y ffolderi ffynhonnell yn cyfateb i nifer y ffolderi trosi dros dro!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"mae ffolderi trosi dros dro wedi'u canfod. Gwiriwch am doriadau llinell anweledig. Dylai fod un llwybr ffolder fesul llinell. Gwnewch yn siŵr nad ydych wedi creu llinell wag yn ddamweiniol.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Rhowch gynhwysydd dilys fel '.mp4'. Gwnewch yn siŵr eich bod yn cynnwys y '.'","Corrupt file folder":"Ffolder ffeil llygredig","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"nid yw'n bodoli! Gwnewch yn siŵr nad oes unrhyw fannau na chymeriadau cudd cyn / ar ôl y llwybr","Source folder":"Ffolder ffynhonnell","Temporary conversion folder":"Ffolder trosi dros dro","appears to be the same as or is within source folder":"ymddengys ei fod yr un fath â ffolder y ffynhonnell neu y mae ynddi","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"a fydd yn atal HBBatchBeast rhag gweithredu'n gywir. Newidiwch y ffolder trosi dros dro i ffolder y tu allan i'r ffolder ffynhonnell. Os ydych chi eisiau defnyddio'r 'nodwedd ffeiliau newydd', dewiswch ffolder cyrchfan nad yw yr un fath â'r ffolder ffynhonnell, neu ynddi, ac yna gwiriwch y blwch gwirio 'Ailosod ffeiliau gwreiddiol bob amser' yn yr adran gosodiadau uwch . Dad-diciwch y blwch gwirio dros dro 'Ffolder trosi dros dro' gan na fydd yn cael ei ddefnyddio yn yr achos hwn. Caiff ffeiliau eu trosi'n ffolder cyrchfan ac yna'u symud yn ôl i'r ffolder ffynhonnell.","Destination folder":"Ffolder cyrchfan","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"a fydd yn atal HBBatchBeast rhag gweithredu'n gywir. Newidiwch y ffolder cyrchfan i ffolder y tu allan i'r ffolder ffynhonnell. Os ydych chi eisiau defnyddio'r 'nodwedd ffeiliau newydd', dewiswch ffolder cyrchfan nad yw yr un fath â'r ffolder ffynhonnell, neu ynddi, ac yna gwiriwch y blwch gwirio 'Ailosod ffeiliau gwreiddiol bob amser' yn yr adran gosodiadau uwch . Dad-diciwch y blwch gwirio dros dro 'Ffolder trosi dros dro' gan na fydd yn cael ei ddefnyddio yn yr achos hwn. Caiff ffeiliau eu trosi'n ffolder cyrchfan ac yna'u symud yn ôl i'r ffolder ffynhonnell.","Error creating temporary conversion folder":"Gwall wrth greu ffolder trosi dros dro","Error creating destination folder":"Gwall wrth greu ffolder cyrchfan","Please select to use HandBrake or FFmpeg!":"Dewiswch ddefnyddio HandBrake neu FFmpeg!","Please select a standard preset or input a custom one!":"Dewiswch ragosodiad safonol neu fewnbwn un arfer!","Please select a scan interval of 5 seconds or greater!":"Dewiswch gyfnod sgan o 5 eiliad neu fwy!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Gwnewch yn siŵr bod nifer yr achosion HandBrake / FFmpeg ar yr un pryd i'w defnyddio yn un neu fwy!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Allwedd API annilys! Cliciwch 'Newydd' ar y tab monitro o bell i greu allwedd newydd.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Rhowch amser sgan dyddiol mewn fformat 24 awr: hh: mm (er enghraifft 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"BYDD FFURFLENNI FFYNHONNELL YN CAEL EU DIRPRWYO AR ÔL ADDASU! Profwch cyn ei ddefnyddio'n iawn!","Benchmark failed!":"Methodd meincnod!","Log does not exist!":"Nid yw log yn bodoli!","Folder does not exist!":"Nid oes ffolder yn bodoli!","Error sending email! Please check your settings.":"Gwall wrth anfon e-bost! Gwiriwch eich gosodiadau.","Test email sent!":"Anfonwyd e-bost prawf!","All worker processes have been stopped.":"Mae pob proses gweithiwr wedi dod i ben.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Bydd ciw yn cael ei oedi ar ôl i'r eitemau cyfredol orffen prosesu. Ydych chi'n siŵr eich bod am oedi'r ciw?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Cychwyn ar seibiant ciw. Bydd y botwm 'parhau' yn ymddangos unwaith y bydd yr holl weithwyr wedi oedi.","Healthy file cache cleared!":"Clir ffeil iach wedi'i glirio!","Cache cleared!":"Cache wedi'i glirio!","Cancel item":"Diddymu eitem","Please check the above checkbox to use this feature.":"Gwiriwch y blwch gwirio uchod i ddefnyddio'r nodwedd hon.","Configuration":"Cyfluniad","Source folders":"Ffolderi ffynhonnell","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Dyma'r ffolder ffynhonnell a gaiff ei sganio ar gyfer y cyfryngau. Mae angen nodi'r ffolder heb unrhyw slaes. Er enghraifft:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Mae blwch y llwybr ffolder ffynhonnell yn ddichonadwy (pwyswch fynd i mewn i greu llinell newydd). Os ydych am nodi ffolderi ffynhonnell lluosog, gwnewch yn siŵr bod pob llwybr ffolder ffynhonnell ar ei linell ei hun fel:","Video health check":"Gwiriad iechyd fideo","Batch conversion and Folder watching":"Trawsnewid swp a gwylio Ffolderi","Remote Monitoring (Beta)":"Monitro o Bell (Beta)","Benchmark (Beta)":"Meincnod (Beta)","System":"System","Help":"Help","Temporary conversion folders":"Ffolderi trosi dros dro","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Os \"Ffolder trosi dros dro?\" yn cael ei wirio, yna bydd HandBrake yn trosi ffeiliau i'r ffolder honno. Unwaith y bydd y trawsnewid wedi'i orffen, caiff y ffeil ei symud i'ch \"Ffolder Cyrchfan\". Bydd angen i chi nodi cymaint o ffolderi trosi dros dro â ffolderi ffynhonnell. Bydd eich ffolder ffynhonnell gyntaf yn cael ei drawsnewid yn eich ffolder trosi dros dro cyntaf, eich ffolder ail ffynhonnell i'ch ail ffolder trosi dros dro ac yn y blaen. Sicrhewch fod pob llwybr ffolder trosi dros dro ar ei linell ei hun.","Destination folders":"Ffolderi cyrchfan","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Nodwch y llwybrau ffolder cyrchfan. Unwaith eto, bydd angen i chi nodi cymaint o ffolderi cyrchfannau â ffolderi ffynhonnell. Bydd ffeiliau o'ch ffolder ffynhonnell gyntaf yn y pen draw i'ch ffolder cyrchfan cyntaf, eich ffeiliau ffolder ail ffynhonnell yn eich ail ffolder cyrchfan ac ati.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Ffolder ffynhonnell gyntaf ---------> Y ffolder trosi dros dro cyntaf ---------> Ffolder cyrchfan gyntaf","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Ffolder ail ffynhonnell ---------> Ail ffolder trosi dros dro ---------> Ail ffolder cyrchfan","etc":"ac ati","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"Ni fydd HBBatchBeast yn gweithio'n iawn os ydych chi'n gosod y ffolder cyrchfan yr un fath â, neu o fewn, y ffolder ffynhonnell.","Standard preset:":"Safon ragosodedig:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Dewiswch y preset HandBrake yr hoffech ei newid gyda'ch ffeiliau. Os dewisir \"Standard preset\", yna caiff yr holl ffeiliau yn y ffolderi a ddewisir eu trosi gan ddefnyddio'r rhagosodiad HandBrake penodedig. Gallwch gael mwy o wybodaeth am ragosodiadau HandBrake yma:","Custom preset:":"Rhagosodiad personol:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Os \"Custom preset\" yna bydd angen i chi roi eich rhagosodiad personol eich hun. Mae HBBatchBeast yn cwmpasu'r rhan \"HandBrakeCLI -i source -o\" o'r mewnbwn HandBrakeCLI felly mae angen i chi fynd i mewn i'r paramedrau trosi. Er enghraifft:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Os ydych chi'n defnyddio FFmpeg, mae angen i chi wahanu'r paramedrau mewnbwn ac allbwn gyda choma. Fel:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Gallwch hefyd gysylltu â rhagosodiad personol sydd wedi cael ei allforio o gais swyddogol GUBrake GUI:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Os ydych chi'n cael trafferth gyda phresgripsiynau personol, gall fod o ganlyniad i nam hysbys gyda'r HandBrakeCLI (bydd yn cael ei osod yn y datganiad nesaf gan HandBrakeCLI). Gweler hwn am ateb dros dro:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Mae angen i bob rhagosodiad arfer fod ar ei linell ei hun ac, yn debyg i'r ffolderi, mae angen bod cymaint o ragosodiadau arfer â ffolderi ffynhonnell.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Ffolder ffynhonnell gyntaf ---------> Y ffolder trosi dros dro cyntaf ---------> Ffolder cyrchfan gyntaf @ Custom preset 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Ffolder ail ffynhonnell ---------> Ail ffolder trosi dros dro ---------> Ail ffolder cyrchfan @ Custom preset 2","See the following image for guidance:":"Gweler y ddelwedd ganlynol am arweiniad:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Os ydych chi'n defnyddio amgodio cardiau graffeg (fel NVENC), yna efallai y bydd angen i chi leihau nifer yr achosion HandBrake (rhowch gynnig ar 2 neu lai) oherwydd cyfyngiadau VRAM.","Select standard preset:":"Dewiswch ragosodiad safonol:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC a ganfuwyd, gwnewch yn siŵr eich bod yn gostwng nifer yr achosion HandBrakeCLI i 2 neu is (ar gyfer y rhan fwyaf o gardiau graffeg) neu efallai y byddwch chi'n dod ar draws gwallau oherwydd nad oes digon o VRAM. Gellir dod o hyd i'r gosodiad hwn yn y tab \"System\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Wedi'i fewnforio rhagosodedig rhagosodedig.Os ydych chi'n cael trafferth gyda phresgripsiynau personol wedi'u mewnforio, gall fod oherwydd nam adnabyddus gyda'r HandBrakeCLI (caiff ei osod yn y datganiad nesaf gan HandBrakeCLI). Ateb dros dro yw cael gwared ar \"\" PictureRotate \":\" 0: 0 \"o'r ffeil .json. Mwy o wybodaeth yma:","Container:":"Cynhwysydd:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Nodwch y cynhwysydd yr hoffech i'r ffeil allbwn ei gael fel '.mp4'. Gallwch ddarganfod mwy am gynwysyddion yn:","Enable periodic scanning:":"Galluogi sganio cyfnodol:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"Gall HBBatchBeast fonitro'ch ffolderi ffynhonnell a rhedeg sganiau ar gyfer ffeiliau newydd ar gyfnod penodol. Mae'r amser egwyl mewn eiliadau gyda'r 300 yn eiliad (5 munud). Os dewisir yr opsiwn hwn, yna pan fyddwch chi'n pwyso \"Sganio a throsi\", bydd y rhaglen yn trosi unrhyw ffeiliau newydd ac yna bydd amserydd cyfrif yn dechrau. Bydd hyn yn dolennu'n ddiddiwedd hyd nes y caiff ei stopio. Mae'r cyfnod sgan yn yr adran gosodiadau uwch.","Enable daily scanning:":"Galluogi sganio dyddiol:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Yn lle sganio cyfnodol, gallwch ddewis i gael sgan i'w redeg unwaith y dydd. Cofnodir amser y sgan yn yr adran gosodiadau uwch ar fformat hh: mm fel '18: 30 '. Unwaith y bydd \"Sganio a throsi\" yn cael ei ddewis, bydd y rhaglen yn aros tan yr amser penodedig hyd nes y bydd yn rhedeg proses sganio a throsi. Unwaith eto, bydd hyn yn dolennu'n ddiddiwedd hyd nes y caiff ei stopio.","Show/hide advanced:":"Dangos / cuddio uwch:","Scan interval (minimum 5 seconds):":"Cyfnod sgan (o leiaf 5 eiliad):","Daily run time (hh:mm):":"Amser rhedeg dyddiol (hh: mm):","Output filename suffix:":"Ôl-ddodiad enw ffeil allbwn:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Mae hyn yn ddewisol. Gallwch nodi ôl-ddodiad i'w ychwanegu at ddiwedd eich enw ffeil fel '_1080p' neu '_testconversion' ac ati.","If 'standard preset' is selected then all output files will have the same suffix.":"Os dewisir 'rhagosodiad safonol' yna bydd yr holl ôl-ddodiad yn yr holl ffeiliau allbwn.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Os dewisir 'custom preset' yna gallwch nodi un ôl-ddodiad fesul ffolder ffynhonnell / rhagosodiad personol. Sicrhewch fod pob ôl-ddodiad ar ei linell ei hun. Er enghraifft, os oes gennych 2 ffolder ffynhonnell ac yn defnyddio 'rhagosodiad personol', gallech roi hwn yn y blwch ôl-enw ffeil:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Bydd ffeiliau yn y ffolder ffynhonnell gyntaf yn cael eu hychwanegu at enw ffeil allbwn. Bydd gan ffeiliau yn y ffolder ail ffynhonnell '_1080p' wedi'i ychwanegu at enw ffeil allbwn ac ati.","Include these file containers:":"Cynhwyswch y cynwysyddion ffeiliau hyn:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Rhowch y cynwysyddion ffeiliau i'w sganio ar eu cyfer. Mae angen gwahanu pob math â choma. Y cofnod diofyn yw:","Exclude files smaller than (MB):":"Peidiwch â chynnwys ffeiliau sy'n llai na (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Nodwch a ddylech wahardd ffeiliau sy'n llai na maint penodol o drosi (mewn megabeit)","Exclude files larger than (MB):":"Peidiwch â chynnwys ffeiliau sy'n fwy na (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Nodwch a ddylech wahardd ffeiliau sy'n fwy na maint penodol o drosi (mewn megabeit)","Exclude filenames which include any of these words:":"Peidiwch â chynnwys enwau ffeiliau sy'n cynnwys unrhyw un o'r geiriau hyn:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Rhowch eiriau allweddol i'w hidlo allan wrth sganio ar gyfer ffeiliau. Er enghraifft, os rhoddir \"720p\", yna ni fydd unrhyw ffeiliau gyda \"720p\" yn y teitl yn cael eu trosi. Unwaith eto, mae angen gwahanu geiriau allweddol gyda choma. Er enghraifft, nodwch y canlynol yn y blwch hidlo:","Include files with any ":"Cynhwyswch ffeiliau gydag unrhyw rai"," or all ":"neu i gyd"," of these":"o'r rhain","properties:":"eiddo:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Yma gallwch fewnbynnu priodweddau fideo a sain y mae'n rhaid i ffeiliau eu cael er mwyn cael eu trosi (gwybodaeth wedi'i dynnu gan ddefnyddio FFprobe). Rhaid gwahanu'r eiddo â choma. Defnyddiwch yr offeryn gwylio gwybodaeth cyfryngau i helpu i benderfynu pa eiddo yr hoffech eu cynnwys. Gwnewch yn siŵr eich bod yn rhoi coma ar ôl yr eiddo diwethaf. Er enghraifft, i drosi ffeiliau sy'n cael eu hamgodio gan ddefnyddio sain stereo h264 ac aac yn unig:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Mae'n werth nodi bod y gwiriad eiddo hwn yn cael ei wneud unwaith y bydd y broses drawsnewid yn dechrau (er mwyn arbed amser wrth adeiladu'r ciw), felly er y gall ffeiliau ymddangos yn y ciw trosi, cânt eu hepgor / eu cynnwys os bodlonir yr amodau cywir.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Os yw FFprobe yn gallu tynnu eiddo, yna bydd 'OK' yn ymddangos yn y golofn \"FFprobe\" yng ngolwg y ciw.","Exclude files with any ":"Eithriwch ffeiliau gydag unrhyw rai"," of these ":"o'r rhain","The opposite of 'Include files with any or all of these properties'":"I'r gwrthwyneb o 'Cynnwys ffeiliau gydag unrhyw un neu bob un o'r eiddo hyn'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Mae hwn yn offeryn bach i ddadansoddi eiddo ffeiliau er mwyn eich helpu i benderfynu pa eiddo yr hoffech eu cynnwys / eithrio yn yr opsiynau uchod. Mae'n defnyddio FFprobe i ddychwelyd gwybodaeth. Llusgwch a gollwng ffeiliau yn y blwch llwyd i'w dadansoddi. Er enghraifft, gallai gollwng mewn ffeil brawf ddychwelyd y canlynol:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Os ydych chi'n awyddus i wahardd ffeiliau fel hyn rhag cael eu trosi, yna gallwch chi roi sawl eiddo ffeil yn y blwch \"Eithrio ffeiliau gydag unrhyw un neu bob un o'r blychau eiddo\" a gwirio'r blwch gwirio nesaf at 'all' yn lle 'any', fel felly:","Copy excluded files to destination:":"Copïo ffeiliau sydd wedi'u heithrio i'r gyrchfan:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Os dewiswch yr opsiwn hwn, yna caiff ffeiliau sydd wedi'u heithrio o drosi eu copïo'n uniongyrchol i'r ffolder cyrchfan. Mae hyn yn berthnasol i'r hidlyddion canlynol:","Exclude filenames which include any of these words":"Peidiwch â chynnwys enwau ffeiliau sy'n cynnwys unrhyw un o'r geiriau hyn","Include files with any or all of these properties":"Cynhwyswch ffeiliau gydag unrhyw un neu bob un o'r eiddo hyn","Exclude files with any or all of these properties":"Eithriwch ffeiliau gydag unrhyw un neu bob un o'r eiddo hyn","Exclude files smaller than (MB)":"Peidiwch â chynnwys ffeiliau sy'n llai na (MB)","Exclude files larger than (MB)":"Peidiwch â chynnwys ffeiliau sy'n fwy na (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Sylwch fod hyn hefyd yn berthnasol i ffeiliau sydd wedi'u heithrio oherwydd nad ydynt yn cwrdd ag amodau eiddo \"Cynnwys\" yr uchod, felly peidiwch â chopïo eich llyfrgell gyfan yn ddamweiniol pan fyddwch chi'n ceisio trosi ychydig o ffeiliau yn unig.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Nid yw'r nodwedd copi yn berthnasol i'r hidlyddion canlynol (hy ffeiliau wedi'u heithrio oherwydd yr hidlydd)","Include these file types":"Cynhwyswch y mathau hyn o ffeiliau","Delete source files after conversion:":"Dileu ffeiliau ffynhonnell ar ôl eu trosi:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Os caiff hwn ei ddewis, yna os bydd ymgais trosi yn llwyddiannus, caiff y ffeil ffynhonnell ei dileu. Mae'r broses hon yn cael ei gwneud ar y diwedd, ar ôl trosi pob ffeil. Mae hyn yn golygu y gallwch drosi'r un ffeiliau ffynhonnell gan ddefnyddio nifer o ragosodiadau, i gyd ar yr un pryd. Yna caiff y ffeiliau ffynhonnell eu dileu wedyn.","Replace original file if converted file is smaller?(Compress attempt)":"Amnewid y ffeil wreiddiol os yw'r ffeil wedi'i throsi yn llai? (Ymgais cywasgu)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Dewiswch y blwch gwirio hwn os hoffech i HBBatchBeast ddisodli'r ffeil wreiddiol yn awtomatig os yw'r ffeil newydd yn llai. Os nad yw'r ffeil newydd yn llai, yna caiff ei gadael yn y ffolder cyrchfan.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Gwnewch yn siŵr nad yw'ch ffolder cyrchfan yr un fath â / neu o fewn, eich ffolder ffynhonnell neu na fydd yn gweithio'n iawn.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Unwaith y mae HBBatchBeast wedi ceisio cywasgu ffeil benodol, bydd yn ychwanegu'r llwybr ffeil hwnnw i storfa fel na fydd yn cael ei geisio eto yn y dyfodol. Gallwch weld / golygu / clirio'r storfa gan ddefnyddio'r botymau melyn.","Replace original file always?":"Amnewid y ffeil wreiddiol bob amser?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Bydd y ffeil wreiddiol yn cael ei disodli p'un a yw'r ffeil newydd yn fwy neu'n llai.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Unwaith eto, gwnewch yn siŵr nad yw'ch ffolder cyrchfan yr un fath â / neu o fewn, eich ffolder ffynhonnell neu na fydd yn gweithio'n iawn.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Unwaith y mae HBBatchBeast wedi trawsgodi ffeil benodol, bydd yn ychwanegu'r llwybr ffeil hwnnw i storfa fel na fydd yn cael ei geisio eto yn y dyfodol. Gallwch weld / golygu / clirio'r storfa gan ddefnyddio'r botymau melyn.","Copy subtitle (srt) files to destination?":"Copďwch ffeiliau isdeitlau (srt) i'r gyrchfan?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Bydd ffeiliau is-deitl '.srt' yn cael eu copïo i'r ffolder cyrchfan yn awtomatig.","Automatically create temporary/destination folders if they don't exist?":"Creu ffolderi dros dro / cyrchfan yn awtomatig os nad ydynt yn bodoli?","Custom bat path to run after each conversion (leave blank if not using):":"Llwybr ystlumod personol i'w redeg ar ôl pob trosiad (gadewch yn wag os nad yw'n defnyddio):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Mewnosodwch y llwybr i ffeil swp bwrpasol yr hoffech ei gweithredu ar ôl pob trosiad. Er enghraifft:","Batch files with timeout statements won't work. More info here:":"Ni fydd ffeiliau swp gyda datganiadau amser yn gweithio. Mwy o wybodaeth yma:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Gadewch y blwch yn gwbl wag os nad ydych am ddefnyddio'r opsiwn hwn (gwnewch yn siŵr nad oes unrhyw gymeriadau cudd yn y blwch)","Run processes at low priority?":"Rhoi prosesau blaenoriaeth isel ar waith?","All conversion processes will be run at low priority, reducing processor usage.":"Bydd yr holl brosesau trosi yn cael eu rhedeg ar flaenoriaeth isel, gan leihau'r defnydd o broseswyr.","Remove apostrophes from filenames:":"Dileu apostrophesau o enwau ffeiliau:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Gall sganiau trosi / gwirio iechyd fethu os oes gan enwau ffeiliau apostrophesau. Gwiriwch hyn er mwyn dileu apostrophes yn awtomatig o enwau ffeiliau."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Gall y nodwedd hon sganio ar gyfer ffeiliau fideo llwgr gan ddefnyddio nodwedd '- sgan' HandBrake, er nad yw hyn bob amser yn gywir. Mae hefyd yn defnyddio FFprobe i ddarparu ail bwynt cyfeirio. Os bydd FFprobe a HandBrake yn methu yna mae siawns uchel bod y ffeil yn llygredig.","Move corrupt files into the following folder:":"Symudwch ffeiliau llygredig i'r ffolder ganlynol:"," If checked, then any files which give errors will be moved into the specified folder.":"Os caiff ei wirio, caiff unrhyw ffeiliau sy'n rhoi gwallau eu symud i'r ffolder penodedig.","Corrupt file folder:":"Ffolder ffeil llygredig:","Run thorough file health check:":"Cynnal gwiriad iechyd ffeil trylwyr:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Os caiff ei wirio, yna bydd gwiriad fideo fideo llawer arafach, mwy trylwyr yn cael ei redeg gan ddefnyddio FFmpeg yn lle HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Yn seiliedig ar 'ScanMedia.ps1' Desani a ddarganfuwyd yn:","Attempt to repair files after thorough check:":"Ceisiwch atgyweirio ffeiliau ar ôl gwiriad trylwyr:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Os caiff ei wirio, bydd HBBatchBeast yn ceisio trwsio ffeiliau gan ddefnyddio FFmpeg. Bydd ffeil newydd gyda'r ôl-ddodiad '_repaired' yn cael ei chreu yn yr un ffolder â'r ffeil ffynhonnell.","'CRF' value to use when attempting to repair files:":"Gwerth 'CRF' i'w ddefnyddio wrth geisio atgyweirio ffeiliau:","The default 'CRF' value is 23. Please see the following for more information:":"Y gwerth diofyn 'CRF' yw 23. Gweler y canlynol am fwy o wybodaeth:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Yr ystod o raddfa CRF yw 0–51, lle mae 0 yn ddi-fai, 23 yn ddiofyn, a 51 yn waethaf bosibl. Yn gyffredinol, mae gwerth is yn arwain at ansawdd uwch, ac ystod bwnc oddrychol yw 17–28. Ystyriwch fod 17 neu 18 yn weledol ddiarwybod neu bron felly; dylai edrych yr un fath neu bron yr un fath â'r mewnbwn ond nid yw'n dechnegol ddi-gol.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"Mae HBBatchBeast yn arbed rhestr o lwybrau ffeiliau wedi'u sganio yr adroddwyd eu bod yn afreolus. Clirio'r storfa i wneud sgan ffres ar bob ffeil.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Nifer yr achosion HandBrake / FFmpeg ar yr un pryd i'w defnyddio (4 neu lai a argymhellir):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Mae'r gosodiad hwn yn berthnasol i'r prosesau \"Gwiriad fideo fideo\" a \"Sganio a newid\". Nodwch faint o edau HandBrake i'w defnyddio. Nid oes uchafswm, ond argymhellir peidio â defnyddio mwy na 4. Gall swm uwch rewi eich cyfrifiadur os nad yw'n bwerus iawn.","Queue size view limit?(Recommended 1000 or fewer):":"Terfyn golwg maint y ciw? (1000 neu lai a argymhellir):","Automatically start \"Scan and convert\" when program opened?:":"Dechrau \"Scan and convert\" yn awtomatig pan agorodd y rhaglen ?:","Save verbose logs?:":"Arbedwch foncyffion verbose ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Gwiriwch y blwch gwirio hwn i arbed logiau is-broses manwl. Mae hyn yn cynnwys cyfamod consol gweithwyr. Bydd hyn yn achosi boncyffion mawr iawn.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Llenwch fanylion e-bost i dderbyn hysbysiadau e-bost os dewch ar draws gwall yn ystod archwiliad iechyd neu wylio trosi / ffolder. Ni fydd yn gweithio gyda chyfrifon sydd angen 2FA. Mae angen i chi alluogi mynediad at apps llai diogel ar gyfrifon Gmail.","Email address:":"Cyfeiriad ebost:","For example:":"Er enghraifft:","Email password(not saved):":"Cyfrinair e-bost (heb ei gadw):","SMTP server:":"Gweinydd SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Mae'r nodwedd hon yn caniatáu monitro statws trosi / gwirio iechyd gan ddefnyddio unrhyw borwr gwe. Defnyddiol wrth redeg gweinyddwyr ac ati. Ni anfonir enwau ffeiliau.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Os caiff ei alluogi, anfonir y data dienw canlynol at HBBatchBeast.io:","API key":"Allwedd API","Current status ('Searching', 'Running', 'Finished' etc)":"Statws cyfredol ('Chwilio', 'Rhedeg', 'Wedi'i orffen' ac ati)","Number of:":"Nifer o:","Remaining items":"Yr eitemau sy'n weddill","Successful items":"Eitemau llwyddiannus","Errored items":"Eitemau wedi'u hanwybyddu","Cancelled items":"Eitemau wedi'u canslo","Worker percentages":"Canrannau gweithwyr","Last completed item time":"Amser yr eitem a gwblhawyd ddiwethaf","Enable remote monitoring?:":"Galluogi monitro o bell ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Adeiladwyd cyfleustod meincnodi sylfaenol yn bennaf i weld sut mae proseswyr craidd 16+ yn perfformio gan ddefnyddio achosion HandBrake lluosog er y gellir ei redeg ar unrhyw fath o brosesydd.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Bydd hyn yn lawrlwytho ffeil sampl h265 4k (2.5MB) ac yn rhedeg meincnod gan ddefnyddio 4 achos HandBrake gyda \"Fast Fast 1080p30\".","Results can be uploaded to hbbatchbeast.io if you choose.":"Gellir llwytho'r canlyniadau i hbbatchbeast.io os dewiswch chi.","Queue":"Ciw","Output this session":"Allbwn y sesiwn hon","Media info viewer tool":"Offeryn gwyliwr gwybodaeth cyfryngau","View replaced file cache":"Gweld cache ffeil yn ei le","Clear replaced file cache":"Clirio storfa ffeiliau newydd","Save config":"Arbedwch ffurfwedd","Scan only":"Sgan yn unig","Scan and convert":"Sganiwch a throsi","View scan/conversion summary log":"Cofnod sgan gweld / trosi crynodeb","View individual file check/conversion log":"Gweld gwiriad ffeil unigol / log trosi","View worker console output":"Gweld allbwn gweithiwr consol","Health check":"Gwiriad iechyd","Clear healthy file cache":"Cache ffeil iach clir","View error log":"Gweld log gwall","Email test":"Prawf e-bost","View master log":"Gweld prif feistr","Wiki help":"Cymorth Wiki","An application by HaveAGitGat":"Cais gan HaveAGitGat","New":"Newydd","Launch":"Lansiad","Benchmark":"Meincnod","See results":"Gweler y canlyniadau","Pause queue":"Oedi ciw","Continue queue":"Parhau i aros","Stop queue":"Stopiwch y ciw","Convert selected files":"Trosi ffeiliau dethol","Toggle queue view":"Codi golwg ciw","Deselect all":"Dewiswch bawb","Invert all":"Gwrthdroi popeth","Select all":"Dewiswch y cyfan","Toggle output view":"Toggle view view"}