{"The number of custom presets does not match the number of source folders!":"Antallet af brugerdefinerede forudindstillinger stemmer ikke overens med antallet af kildemapper!","source folders have been detected.":"kildemapper er blevet detekteret.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"brugerdefinerede forudindstillede linjer er blevet detekteret. Venligst dobbeltkig efter usynlige linjeskift. Der skal være en mappebane eller forudindstillet pr. Linje. Sørg for, at du ikke ved et uheld har oprettet en tom linje.","The number of filename suffixes does not match the number of source folders! ":"Antallet af filnavnsuplikser stemmer ikke overens med antallet af kildemapper!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"filnavn suffiks linjer er blevet detekteret. Venligst dobbeltkig efter usynlige linjeskift. Der skal være en mappebane eller et filnavnsupport per linje. Sørg for, at du ikke ved et uheld har oprettet en tom linje.","The number of source folders does not match the number of destination folders!":"Antallet af kildemapper svarer ikke til antallet af destinationsmapper!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"destinationsmapper er blevet detekteret. Venligst dobbeltkig efter usynlige linjeskift. Der skal være en mappebane pr. Linje. Sørg for, at du ikke ved et uheld har oprettet en tom linje.","The number of source folders does not match the number of temporary conversion folders!":"Antallet af kildemapper svarer ikke til antallet af midlertidige konverteringsmapper!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"Der er blevet registreret midlertidige konverteringsmapper. Venligst dobbeltkig efter usynlige linjeskift. Der skal være en mappebane pr. Linje. Sørg for, at du ikke ved et uheld har oprettet en tom linje.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Indtast venligst en gyldig container som '.mp4'. Sørg for at inkludere '.'","Corrupt file folder":"Korrupt filmappe","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"eksisterer ikke! Sørg for, at der ikke er plads eller skjulte tegn før / efter stien","Source folder":"Kilde mappe","Temporary conversion folder":"Midlertidig konverteringsmappe","appears to be the same as or is within source folder":"ser ud til at være det samme som eller er inde i kildemappe","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"som forhindrer HBBatchBeast i at fungere korrekt. Venligst ændre den midlertidige konverteringsmappe til en mappe uden for kildemappen. Hvis du vil bruge funktionen \"Udskift originalfiler\", skal du vælge en destinationsmappe, der ikke er den samme som eller inden for kildemappen, og markér afkrydsningsfeltet 'Erstat originale filer' i afsnittet avancerede indstillinger . Fjern markeringen i afkrydsningsfeltet midlertidig 'Midlertidig konvertering mappe', da det ikke fungerer i denne sag. Filer vil blive konverteret til destinationsmappen og derefter flyttet tilbage til kildemappen.","Destination folder":"Destinationsmappe","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"som forhindrer HBBatchBeast i at fungere korrekt. Venligst skift destinationsmappen til en mappe uden for kildemappen. Hvis du vil bruge funktionen \"Udskift originalfiler\", skal du vælge en destinationsmappe, der ikke er den samme som eller inden for kildemappen, og markér afkrydsningsfeltet 'Erstat originale filer' i afsnittet avancerede indstillinger . Fjern markeringen i afkrydsningsfeltet midlertidig 'Midlertidig konvertering mappe', da det ikke fungerer i denne sag. Filer vil blive konverteret til destinationsmappen og derefter flyttet tilbage til kildemappen.","Error creating temporary conversion folder":"Fejl ved oprettelse af midlertidig konverteringsmappe","Error creating destination folder":"Fejl ved oprettelse af destinationsmappe","Please select to use HandBrake or FFmpeg!":"Vælg venligst for at bruge HandBrake eller FFmpeg!","Please select a standard preset or input a custom one!":"Vælg venligst en standardindstilling eller indtast en brugerdefineret!","Please select a scan interval of 5 seconds or greater!":"Vælg venligst et scanningsinterval på 5 sekunder eller mere!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Sørg for, at antallet af samtidige HandBrake / FFmpeg-tilfælde, der skal bruges, er en eller flere!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Ugyldig API-nøgle! Klik på 'Ny' på fjernovervågningsfanen for at generere en ny nøgle.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Indtast venligst en daglig scanningstid i 24-timers format: hh: mm (for eksempel 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"KILDEFILER SKAL SLETTES AFTER KONVERSION! Prøv venligst før brug!","Benchmark failed!":"Benchmark mislykkedes!","Log does not exist!":"Log findes ikke!","Folder does not exist!":"Mappe eksisterer ikke!","Error sending email! Please check your settings.":"Fejl ved afsendelse af e-mail! Tjek venligst dine indstillinger.","Test email sent!":"Test e-mail sendt!","All worker processes have been stopped.":"Alle arbejdsprocesser er stoppet.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Kø bliver pauset, når de nuværende elementer er færdige med behandlingen. Er du sikker på, at du vil sætte køen i pause?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Køpause indledt. 'Fortsæt' knappen vises, når alle medarbejdere har standset.","Healthy file cache cleared!":"Sundt fil cache ryddet!","Cache cleared!":"Cache ryddet!","Cancel item":"Annuller element","Please check the above checkbox to use this feature.":"Kontroller ovenstående afkrydsningsfelt for at bruge denne funktion.","Configuration":"Konfiguration","Source folders":"Kildemapper","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Dette er kildemappen, som vil blive scannet til medier. Mappen skal indtastes uden skråstreg. For eksempel:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Kildemappe sti boksen er udvidelig (tryk enter for at oprette en ny linje). Hvis du vil angive flere kildemapper, skal du sørge for at hver kildemappebane er på sin egen linje, f.eks .:","Video health check":"Video sundhedskontrol","Batch conversion and Folder watching":"Batch konvertering og mappe watching","Remote Monitoring (Beta)":"Fjernovervågning (beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"System","Help":"Hjælp","Temporary conversion folders":"Midlertidige konverteringsmapper","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Hvis \"Midlertidig konverteringsmappe?\" er markeret, så vil HandBrake konvertere filer til den pågældende mappe. Når konverteringen er færdig, flyttes filen til din \"Destination folder\". Du skal angive så mange midlertidige konverteringsmapper som kildemapper. Din første kildemappe konverteres til din første midlertidige konverteringsmappe, din anden kildemappe til din anden midlertidige konverteringsmappe og så videre. Sørg for, at hver midlertidig konverteringsmappebane er på sin egen linje.","Destination folders":"Destinationsmapper","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Angiv destinationsmappestier. Igen skal du angive så mange destinationsmapper som kildemapper. Filer fra din første kildemappe vil ende i din første destinationsmappe, dine anden kildemappefiler i din anden destinationsmappe og så videre.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Første kildemappe ---------> Første midlertidige konverteringsmappe ---------> Første destinationsmappe","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Anden kildemappe ---------> Anden midlertidig konverteringsmappe ---------> Anden destinationsmappe","etc":"etc","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast virker ikke korrekt, hvis du angiver destinationsmappen det samme som eller inden for kildemappen.","Standard preset:":"Standardindstilling:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Vælg den håndbremse forudindstilling, du gerne vil konvertere dine filer med. Hvis \"Standard forudindstillet\" er valgt, vil alle filer i de valgte mapper blive konverteret ved hjælp af den angivne HandBrake-indstilling. Du kan finde mere om HandBrake presets her:","Custom preset:":"Brugerdefineret forudindstilling:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Hvis \"Brugerdefineret forudindstillet\" skal du indtaste din egen brugerdefinerede forudindstilling. HBBatchBeast dækker \"HandBrakeCLI -i source -o destination\" -delen af HandBrakeCLI inputen, så du skal indtaste konverteringsparametrene. For eksempel:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Hvis du bruger FFmpeg, skal du adskille input- og outputparametre med et komma. Såsom:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Du kan også linke til en brugerdefineret forudindstilling, der er eksporteret fra den officielle HandBrake GUI-applikation for eksempel:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Hvis du har problemer med brugerdefinerede forudindstillinger, kan det skyldes en kendt fejl med HandBrakeCLI (vil blive rettet i næste HandBrakeCLI-udgivelse). Se venligst dette for en midlertidig løsning:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Hver brugerdefineret forudindstilling skal være på sin egen linje, og der skal ligge så mange brugerdefinerede forudindstillinger som kildemapper, ligesom mapperne.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Første kildemappe ---------> Første midlertidige konverteringsmappe ---------> Første destinationsmappe @ Brugerdefineret forudindstillet 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Anden kildemappe ---------> Anden midlertidig konverteringsmappe ---------> Anden destinationsmappe @ Brugerdefineret forudindstillet 2","See the following image for guidance:":"Se følgende billede som vejledning:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Hvis du bruger grafikkortkodning (f.eks. NVENC), skal du muligvis reducere antallet af HandBrake-forekomster (prøv 2 eller færre) på grund af VRAM-begrænsninger.","Select standard preset:":"Vælg standard forudindstilling:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC registreret, skal du sørge for at sænke antallet af HandBrakeCLI-tilfælde til 2 eller under (for de fleste grafikkort), eller du kan støde på fejl på grund af ikke nok VRAM. Denne indstilling findes i fanen \"System\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Importeret forudindstillet detected.If du har problemer med importerede brugerdefinerede forudindstillinger, kan det skyldes en kendt fejl med HandBrakeCLI (vil blive fastsat i næste HandBrakeCLI-udgivelse). En midlertidig løsning er at fjerne '\"PictureRotate\": \"0: 0\"' fra .json-filen. Mere info her:","Container:":"Beholder:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Angiv den container, du vil have, at outputfilen skal have f.eks. '.Mp4'. Du kan finde ud af mere om containere på:","Enable periodic scanning:":"Aktivér periodisk scanning:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast kan overvåge dine kildemapper og køre scanninger til nye filer med et bestemt interval. Intervalletiden er i sekunder, hvis standard er 300 sekunder (5 minutter). Hvis denne valgmulighed er valgt, vil programmet, når du trykker på \"Scan og konverter\", konvertere nye filer, og derefter begynder en nedtællingstimer. Dette løber uendeligt, indtil det er stoppet. Scanningsintervallet er i sektionen for avancerede indstillinger.","Enable daily scanning:":"Aktivér daglig scanning:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"I stedet for periodisk scanning kan du vælge, at en scanning skal køres en gang om dagen. Scantidspunktet indtastes i afsnittet avancerede indstillinger i hh: mm-format som '18: 30 '. Når \"Scan og konverter\" er valgt, venter programmet, indtil den angivne tid, før du kører en scannings- og konverteringsproces. Igen vil dette løbe uendeligt til stoppet.","Show/hide advanced:":"Vis / skjul avanceret:","Scan interval (minimum 5 seconds):":"Scan interval (minimum 5 sekunder):","Daily run time (hh:mm):":"Daglig løbetid (hh: mm):","Output filename suffix:":"Output filnavn suffiks:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Dette er valgfrit. Du kan angive et suffix, der skal tilføjes til slutningen af dit filnavn som '_1080p' eller '_testconversion' osv.","If 'standard preset' is selected then all output files will have the same suffix.":"Hvis 'standardindstilling' er valgt, vil alle uddatafiler have samme suffiks.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Hvis 'brugerdefineret forudindstilling' er valgt, kan du angive et suffiks pr. Kildemappe / brugerdefineret forudindstilling. Sørg for, at hvert suffiks er på sin egen linje. Hvis du for eksempel har 2 kildemapper og bruger 'brugerdefineret forudindstillet', kan du sætte dette i filnavns suffiksboksen:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Filer i den første kildemappe vil have '_720p' tilføjet til output filnavn. Filer i den anden kildemappe vil have '_1080p' tilføjet til output filnavn osv.","Include these file containers:":"Inkluder disse filbeholdere:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Indtast filbeholdere for at scanne efter. Hver type skal adskilles med et komma. Standardindgangen er:","Exclude files smaller than (MB):":"Ekskluder filer mindre end (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Angiv, om du vil ekskludere filer, der er mindre end en vis størrelse fra konvertering (i megabyte)","Exclude files larger than (MB):":"Ekskluder filer større end (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Angiv, om du vil ekskludere filer, der er større end en vis størrelse, fra konvertering (i megabyte)","Exclude filenames which include any of these words:":"Ekskluder filnavne, der indeholder et af disse ord:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Indtast søgeord, der skal filtreres ud, når du scanner efter filer. For eksempel, hvis \"720p\" er indtastet, vil eventuelle filer med \"720p\" i titlen ikke blive konverteret. Igen skal søgeord adskilles med et komma. Indtast eksempelvis følgende i filterboksen:","Include files with any ":"Inkluder filer med nogen"," or all ":"eller alle"," of these":"af disse","properties:":"ejendomme:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Her kan du indtaste video- og lydegenskaber, som filer skal have for at blive konverteret (information hentet ud fra FFprobe). Egenskaberne skal adskilles med et komma. Brug medieinformationsvisningsværktøjet til at bestemme hvilke egenskaber du vil medtage. Sørg for at sætte et komma efter den sidste egenskab. For eksempel kan kun konverteres filer, der er kodet ved hjælp af h264 og aac stereo lyd:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Det er værd at bemærke, at denne ejendomskontrol er udført, når konverteringsprocessen starter (for at spare tid, mens køen opbygges), så selv om filer kan vises i konverteringskøen, bliver de oversprunget / inkluderet, hvis de korrekte betingelser er opfyldt.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Hvis FFprobe er i stand til at udtrække egenskaber, vises en 'OK' i kolonnen \"FFprobe\" i køvisningen.","Exclude files with any ":"Ekskluder filer med nogen"," of these ":"af disse","The opposite of 'Include files with any or all of these properties'":"Det modsatte af 'Inkluder filer med nogen eller alle disse egenskaber'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Dette er et lille værktøj til at analysere filegenskaber med for at hjælpe dig med at bestemme hvilke egenskaber du vil medtage / ekskludere i ovenstående muligheder. Det bruger FFprobe til at returnere information. Træk og slip filer i den grå boks for at analysere dem. F.eks. Kan droppe i en testfil returnere følgende:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Hvis du vil ekskludere filer som denne fra at blive konverteret, kan du sætte flere filegenskaber i boksen \"Ekskluder filer med nogen eller alle disse egenskaber\" og marker afkrydsningsfeltet ud for \"alle\" i stedet for \"nogen\" ligesom:","Copy excluded files to destination:":"Kopier ekskluderede filer til destinationen:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Hvis du vælger denne indstilling, kopieres filer, der er udelukket fra konvertering, direkte til destinationsmappen. Dette gælder for følgende filtre:","Exclude filenames which include any of these words":"Ekskluder filnavne, der indeholder et af disse ord","Include files with any or all of these properties":"Inkluder filer med nogen eller alle disse egenskaber","Exclude files with any or all of these properties":"Ekskluder filer med nogen eller alle disse egenskaber","Exclude files smaller than (MB)":"Ekskluder filer mindre end (MB)","Exclude files larger than (MB)":"Ekskluder filer større end (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Bemærk, at dette også gælder for filer, der er udelukket, fordi de ikke opfylder betingelserne for \"Inkluder\" af ovenstående, så ikke tilfældigvis kopierer du hele biblioteket, når du kun forsøger at konvertere nogle få filer.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Kopieringsfunktionen gælder ikke for følgende filtre (dvs. filer udelukket på grund af filteret)","Include these file types":"Inkluder disse filtyper","Delete source files after conversion:":"Slet kildefiler efter konvertering:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Hvis dette er markeret, bliver kildedata slettet, hvis et konverteringsforsøg er vellykket. Denne proces er færdig i slutningen, efter konvertering af alle filer. Det betyder, at du kan konvertere de samme kildefiler ved hjælp af flere forudindstillinger, alt sammen på én gang. Kildefilerne slettes derefter bagefter.","Replace original file if converted file is smaller?(Compress attempt)":"Erstat originale fil, hvis konverterede fil er mindre? (Komprimer forsøg)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Marker dette afkrydsningsfelt, hvis du vil have HBBatchBeast til automatisk at erstatte den oprindelige kildefil, hvis den nye fil er mindre. Hvis den nye fil ikke er mindre, bliver den tilbage i destinationsmappen.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Sørg for, at din destinationsmappe ikke er den samme som / eller inden for din kildemappe, eller den fungerer ikke korrekt.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Når HBBatchBeast har forsøgt at komprimere en bestemt fil, tilføjer den den pågældende filsti til en cache, så den ikke vil blive forsøgt igen i fremtiden. Du kan se / redigere / rydde cachen ved hjælp af de gule knapper.","Replace original file always?":"Erstat originalfilen altid?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Den originale fil vil blive erstattet, uanset om den nye fil er større eller mindre.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Igen skal du sørge for, at din destinationsmappe ikke er den samme som / eller inden for din kildemappe, eller den fungerer ikke korrekt.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Når HBBatchBeast har transcodet en bestemt fil, vil den tilføje den pågældende filsti til en cache, så den ikke vil blive forsøgt igen i fremtiden. Du kan se / redigere / rydde cachen ved hjælp af de gule knapper.","Copy subtitle (srt) files to destination?":"Kopier undertekst (srt) filer til destination?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Undertekst '.srt' filer kopieres automatisk til destinationsmappen.","Automatically create temporary/destination folders if they don't exist?":"Opret automatisk midlertidige / destinationsmapper, hvis de ikke findes?","Custom bat path to run after each conversion (leave blank if not using):":"Brugerdefineret flagermus for at køre efter hver konvertering (lad være tom hvis den ikke bruges):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Indtast stien til en brugerdefineret batchfil, som du gerne vil udføre efter hver konvertering. For eksempel:","Batch files with timeout statements won't work. More info here:":"Batch filer med timeout udsagn vil ikke fungere. Mere info her:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Forlad boksen helt tom, hvis du ikke vil bruge denne indstilling (sørg for, at der ikke er skjulte tegn i boksen)","Run processes at low priority?":"Kør processer med lav prioritet?","All conversion processes will be run at low priority, reducing processor usage.":"Alle konverteringsprocesser vil blive kørt med lav prioritet, hvilket reducerer processorbrug.","Remove apostrophes from filenames:":"Fjern apostrofer fra filnavne:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Konverteringer / sundhedskontrol scanninger kan mislykkes, hvis filnavne har apostrofer. Kontroller dette for automatisk at fjerne apostrofer fra filnavne."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Denne funktion kan scanne efter korrupte videofiler ved hjælp af HandBrake's'scan '-funktion, selv om dette ikke altid er korrekt. Det bruger også FFprobe til at give et andet referencepunkt. Hvis både FFprobe og HandBrake fejler, er der stor risiko for, at filen er korrupt.","Move corrupt files into the following folder:":"Flyt korrupte filer i følgende mappe:"," If checked, then any files which give errors will be moved into the specified folder.":"Hvis markeret, vil eventuelle filer, der giver fejl, flyttes til den angivne mappe.","Corrupt file folder:":"Korrupt filmappe:","Run thorough file health check:":"Kør grundig dokumentsundersøgelse:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Hvis markeret, vil en meget langsommere, mere grundig video sundhedstjekke blive kørt ved hjælp af FFmpeg i stedet for HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Baseret på Desani's 'ScanMedia.ps1' fundet på:","Attempt to repair files after thorough check:":"Forsøg på at reparere filer efter grundig kontrol:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Hvis markeret, vil HBBatchBeast forsøge at reparere filer ved hjælp af FFmpeg. En ny fil med suffixet '_repaired' oprettes i samme mappe som kildefilen.","'CRF' value to use when attempting to repair files:":"'CRF' værdi, der skal bruges, når du forsøger at reparere filer:","The default 'CRF' value is 23. Please see the following for more information:":"Standardværdien \"CRF\" er 23. Se venligst følgende for yderligere oplysninger:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"CRF-skalaens rækkevidde er 0-51, hvor 0 er tabsløs, 23 er standard og 51 er den dårligste kvalitet muligt. En lavere værdi fører generelt til højere kvalitet, og et subjektivt sanseligt område er 17-28. Overvej 17 eller 18 for at være visuelt tabløs eller næsten så; det skal se det samme eller næsten det samme som input men det er ikke teknisk tabsløst.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast gemmer en liste over scannede filstier, der rapporteres som ukorrekte. Ryd cachen for at udføre en frisk scanning på alle filer.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Antal samtidige HandBrake / FFmpeg-forekomster at bruge? (Anbefalet 4 eller færre):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Denne indstilling gælder både \"Video Health Check\" og \"Scan and Convert\" processer. Angiv, hvor mange HandBrake-tråde der skal bruges. Der er ikke noget maksimum, selvom det anbefales at bruge ikke mere end 4. Et højere beløb kan fryse din computer, hvis det ikke er meget kraftfuldt.","Queue size view limit?(Recommended 1000 or fewer):":"Køestørrelsesgrænse? (Anbefalet 1000 eller færre):","Automatically start \"Scan and convert\" when program opened?:":"Start automatisk \"Scan og konverter\", når programmet åbnes ?:","Save verbose logs?:":"Gem verbose logs ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Marker dette afkrydsningsfelt for at gemme detaljerede underprocesslogfiler. Dette inkluderer arbejdskonsol ouput. Dette vil medføre meget store logfiler.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Udfyld e-mail-oplysninger for at modtage e-mail-meddelelser, hvis der opstår en fejl under en sundhedstjek eller konvertering / mappevisning. Vil ikke arbejde med konti, der kræver 2FA. Du skal aktivere adgang til mindre sikre apps på Gmail-konti.","Email address:":"Email adresse:","For example:":"For eksempel:","Email password(not saved):":"Email-adgangskode (ikke gemt):","SMTP server:":"SMTP-server:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Denne funktion gør det muligt at overvåge status for konvertering / sundhedskontrol ved hjælp af en webbrowser. Nyttig når du kører servere osv. Der sendes ikke filnavne.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Hvis aktiveret, sendes følgende anonyme data til HBBatchBeast.io:","API key":"API-nøgle","Current status ('Searching', 'Running', 'Finished' etc)":"Aktuel status ('Søgning', 'Løb', 'Færdig' osv.)","Number of:":"Antallet af:","Remaining items":"Resterende varer","Successful items":"Succesfulde ting","Errored items":"Fejlede emner","Cancelled items":"Annullerede varer","Worker percentages":"Arbejdsprocenter","Last completed item time":"Sidste gennemført varetid","Enable remote monitoring?:":"Aktivér fjernovervågning ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Et grundlæggende benchmarking-værktøj bygget hovedsageligt for at se, hvordan 16+ kerneprocessorer udfører brug af flere HandBrake-forekomster, selvom det kan køres på en hvilken som helst type processor.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Dette vil hente en h265 4k prøvefil (2.5MB) og køre en benchmark ved hjælp af 4 HandBrake-instanser med forudindstillet \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Resultaterne kan uploades til hbbatchbeast.io, hvis du vælger.","Queue":"Kø","Output this session":"Udfør denne session","Media info viewer tool":"Medieinformationsvisningsværktøj","View replaced file cache":"Se udskiftet filcache","Clear replaced file cache":"Clear udskiftet fil cache","Save config":"Gem config","Scan only":"Kun scanning","Scan and convert":"Scan og konverter","View scan/conversion summary log":"Se scannings- / konverteringsopsamlingslog","View individual file check/conversion log":"Se individuelle filcheck / konverteringslog","View worker console output":"Se arbejdskonsoludgang","Health check":"Sundhedstjek","Clear healthy file cache":"Ryd sunde fil cache","View error log":"Se fejllogfilen","Email test":"Email test","View master log":"Se master log","Wiki help":"Wiki Hjælp","An application by HaveAGitGat":"En ansøgning fra HaveAGitGat","New":"Ny","Launch":"Lancering","Benchmark":"Benchmark","See results":"Se resultater","Pause queue":"Pause kø","Continue queue":"Fortsæt køen","Stop queue":"Stop køen","Convert selected files":"Konverter valgte filer","Toggle queue view":"Skift kø-visning","Deselect all":"Fravælg alle","Invert all":"Inverter alle","Select all":"Vælg alle","Toggle output view":"Skift output visning"}