{"The number of custom presets does not match the number of source folders!":"Die Anzahl der benutzerdefinierten Voreinstellungen stimmt nicht mit der Anzahl der Quellordner überein!","source folders have been detected.":"Quellordner wurden erkannt.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"benutzerdefinierte voreingestellte Zeilen wurden erkannt. Bitte überprüfen Sie, ob unsichtbare Zeilenumbrüche vorliegen. Es sollte einen Ordnerpfad oder eine Voreinstellung pro Zeile geben. Stellen Sie sicher, dass Sie nicht versehentlich eine leere Zeile erstellt haben.","The number of filename suffixes does not match the number of source folders! ":"Die Anzahl der Dateinamen-Suffixe stimmt nicht mit der Anzahl der Quellordner überein!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"Dateinamen-Suffix-Zeilen wurden erkannt. Bitte überprüfen Sie, ob unsichtbare Zeilenumbrüche vorliegen. Es sollte einen Ordnerpfad oder ein Dateinamensuffix pro Zeile geben. Stellen Sie sicher, dass Sie nicht versehentlich eine leere Zeile erstellt haben.","The number of source folders does not match the number of destination folders!":"Die Anzahl der Quellordner stimmt nicht mit der Anzahl der Zielordner überein!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"Zielordner wurden erkannt. Bitte überprüfen Sie, ob unsichtbare Zeilenumbrüche vorliegen. Es sollte einen Ordnerpfad pro Zeile geben. Stellen Sie sicher, dass Sie nicht versehentlich eine leere Zeile erstellt haben.","The number of source folders does not match the number of temporary conversion folders!":"Die Anzahl der Quellordner stimmt nicht mit der Anzahl der temporären Konvertierungsordner überein!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"Temporäre Konvertierungsordner wurden erkannt. Bitte überprüfen Sie, ob unsichtbare Zeilenumbrüche vorliegen. Es sollte einen Ordnerpfad pro Zeile geben. Stellen Sie sicher, dass Sie nicht versehentlich eine leere Zeile erstellt haben.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Bitte geben Sie einen gültigen Container wie '.mp4' ein. Stellen Sie sicher, dass das '.'","Corrupt file folder":"Beschädigter Dateiordner","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ist nicht vorhanden! Bitte stellen Sie sicher, dass vor / nach dem Pfad keine Leerzeichen oder versteckten Zeichen stehen","Source folder":"Quellverzeichnis","Temporary conversion folder":"Temporärer Konvertierungsordner","appears to be the same as or is within source folder":"scheint derselbe zu sein wie oder befindet sich im Quellordner","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"Dies verhindert, dass HBBatchBeast richtig funktioniert. Bitte ändern Sie den temporären Konvertierungsordner in einen Ordner außerhalb des Quellordners. Wenn Sie die Funktion \"Originaldateien ersetzen\" verwenden möchten, wählen Sie einen Zielordner aus, der nicht mit dem Quellordner identisch ist oder sich darin befindet, und aktivieren Sie das Kontrollkästchen \"Originaldateien immer ersetzen\" im Abschnitt \"Erweiterte Einstellungen\" . Deaktivieren Sie das temporäre Kontrollkästchen \"Temporärer Konvertierungsordner\", da es in diesem Fall keine Verwendung findet. Dateien werden in den Zielordner konvertiert und anschließend wieder in den Quellordner verschoben.","Destination folder":"Zielordner","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"Dies verhindert, dass HBBatchBeast richtig funktioniert. Bitte ändern Sie den Zielordner in einen Ordner außerhalb des Quellordners. Wenn Sie die Funktion \"Originaldateien ersetzen\" verwenden möchten, wählen Sie einen Zielordner aus, der nicht mit dem Quellordner identisch ist oder sich darin befindet, und aktivieren Sie das Kontrollkästchen \"Originaldateien immer ersetzen\" im Abschnitt \"Erweiterte Einstellungen\" . Deaktivieren Sie das temporäre Kontrollkästchen \"Temporärer Konvertierungsordner\", da es in diesem Fall keine Verwendung findet. Dateien werden in den Zielordner konvertiert und anschließend wieder in den Quellordner verschoben.","Error creating temporary conversion folder":"Fehler beim Erstellen des temporären Konvertierungsordners","Error creating destination folder":"Fehler beim Erstellen des Zielordners","Please select to use HandBrake or FFmpeg!":"Bitte wählen Sie HandBrake oder FFmpeg!","Please select a standard preset or input a custom one!":"Bitte wählen Sie ein Standard-Preset oder geben Sie ein benutzerdefiniertes ein!","Please select a scan interval of 5 seconds or greater!":"Bitte wählen Sie ein Scanintervall von 5 Sekunden oder länger!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Stellen Sie sicher, dass mindestens eine HandBrake / FFmpeg-Instanz gleichzeitig verwendet wird!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Ungültiger API-Schlüssel! Klicken Sie auf der Registerkarte \"Fernüberwachung\" auf \"Neu\", um einen neuen Schlüssel zu generieren.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Bitte geben Sie eine tägliche Scanzeit im 24-Stunden-Format ein: hh: mm (zum Beispiel 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"QUELLENDATEIEN WERDEN NACH DER KONVERTIERUNG GELÖSCHT! Bitte vor dem bestimmungsgemäßen Gebrauch testen!","Benchmark failed!":"Benchmark fehlgeschlagen!","Log does not exist!":"Log existiert nicht!","Folder does not exist!":"Ordner existiert nicht!","Error sending email! Please check your settings.":"Fehler beim Senden der E-Mail! Bitte überprüfen Sie Ihre Einstellungen.","Test email sent!":"Test-E-Mail gesendet!","All worker processes have been stopped.":"Alle Worker-Prozesse wurden gestoppt.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Die Warteschlange wird angehalten, sobald die Verarbeitung der aktuellen Elemente abgeschlossen ist. Möchten Sie die Warteschlange wirklich anhalten?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Warteschlangenpause eingeleitet. Die Schaltfläche \"Weiter\" wird angezeigt, sobald alle Mitarbeiter angehalten haben.","Healthy file cache cleared!":"Fehlerfreier Dateicache gelöscht!","Cache cleared!":"Cache geleert!","Cancel item":"Artikel abbrechen","Please check the above checkbox to use this feature.":"Aktivieren Sie das obige Kontrollkästchen, um diese Funktion zu verwenden.","Configuration":"Aufbau","Source folders":"Quellordner","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Dies ist der Quellordner, der nach Medien durchsucht wird. Der Ordner muss ohne abschließenden Schrägstrich eingegeben werden. Zum Beispiel:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Das Feld für den Quellordnerpfad kann erweitert werden (drücken Sie die Eingabetaste, um eine neue Zeile zu erstellen). Wenn Sie mehrere Quellordner angeben möchten, stellen Sie sicher, dass sich jeder Quellordnerpfad in einer eigenen Zeile befindet, z. B .:","Video health check":"Video-Gesundheitscheck","Batch conversion and Folder watching":"Stapelkonvertierung und Ordnerüberwachung","Remote Monitoring (Beta)":"Fernüberwachung (Beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"System","Help":"Hilfe","Temporary conversion folders":"Temporäre Konvertierungsordner","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Wenn \"Temporärer Konvertierungsordner?\" Ist diese Option aktiviert, konvertiert HandBrake Dateien in diesen Ordner. Nach Abschluss der Konvertierung wird die Datei in Ihren \"Zielordner\" verschoben. Sie müssen so viele temporäre Konvertierungsordner wie Quellordner angeben. Ihr erster Quellordner wird in Ihren ersten temporären Konvertierungsordner konvertiert, Ihr zweiter Quellordner in Ihren zweiten temporären Konvertierungsordner und so weiter. Stellen Sie sicher, dass sich jeder temporäre Konvertierungsordnerpfad in einer eigenen Zeile befindet.","Destination folders":"Zielordner","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Geben Sie die Zielordnerpfade an. Auch hier müssen Sie so viele Zielordner wie Quellordner angeben. Dateien aus Ihrem ersten Quellordner werden in Ihrem ersten Zielordner, die Dateien aus Ihrem zweiten Quellordner in Ihrem zweiten Zielordner usw. gespeichert.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Erster Quellordner ---------> Erster temporärer Konvertierungsordner ---------> Erster Zielordner","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Zweiter Quellordner ---------> Zweiter temporärer Konvertierungsordner ---------> Zweiter Zielordner","etc":"usw","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast funktioniert nicht ordnungsgemäß, wenn Sie den Zielordner auf den gleichen Wert oder innerhalb des Quellordners festlegen.","Standard preset:":"Standardvoreinstellung:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Wählen Sie die HandBrake-Voreinstellung aus, mit der Sie Ihre Dateien konvertieren möchten. Wenn \"Standardvoreinstellung\" ausgewählt ist, werden alle Dateien in den ausgewählten Ordnern mit der angegebenen HandBrake-Voreinstellung konvertiert. Weitere Informationen zu HandBrake-Voreinstellungen finden Sie hier:","Custom preset:":"Benutzerdefinierte Voreinstellung:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Bei \"Benutzerdefinierte Voreinstellung\" müssen Sie eine eigene benutzerdefinierte Voreinstellung eingeben. HBBatchBeast deckt den Teil \"HandBrakeCLI -i source -o destination\" der HandBrakeCLI-Eingabe ab, sodass Sie die Konvertierungsparameter eingeben müssen. Zum Beispiel:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Wenn Sie FFmpeg verwenden, müssen Sie die Eingabe- und Ausgabeparameter durch ein Komma trennen. Sowie:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Sie können auch eine Verknüpfung zu einer benutzerdefinierten Voreinstellung erstellen, die aus der offiziellen HandBrake-GUI-Anwendung exportiert wurde. Beispiel:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Wenn Sie Probleme mit benutzerdefinierten Voreinstellungen haben, liegt dies möglicherweise an einem bekannten Fehler in der HandBrakeCLI (der in der nächsten HandBrakeCLI-Version behoben wird). Hier finden Sie eine vorübergehende Lösung:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Jede benutzerdefinierte Voreinstellung muss sich in einer eigenen Zeile befinden. Ähnlich wie bei den Ordnern müssen auch hier so viele benutzerdefinierte Voreinstellungen vorhanden sein wie bei den Quellordnern.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Erster Quellordner ---------> Erster temporärer Konvertierungsordner ---------> Erster Zielordner @ Benutzerdefinierte Voreinstellung 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Zweiter Quellordner ---------> Zweiter temporärer Konvertierungsordner ---------> Zweiter Zielordner @ Benutzerdefinierte Voreinstellung 2","See the following image for guidance:":"In der folgenden Abbildung finden Sie Anleitungen:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Wenn Sie Grafikkartencodierung (wie NVENC) verwenden, müssen Sie möglicherweise die Anzahl der HandBrake-Instanzen (versuchen Sie es mit 2 oder weniger) aufgrund von VRAM-Einschränkungen reduzieren.","Select standard preset:":"Standardvoreinstellung auswählen:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Wenn NVENC erkannt wird, stellen Sie sicher, dass die Anzahl der HandBrakeCLI-Instanzen auf 2 oder weniger verringert wird (für die meisten Grafikkarten). Andernfalls treten möglicherweise Fehler auf, weil nicht genügend VRAM vorhanden ist. Diese Einstellung finden Sie in der Registerkarte \"System\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Importierte Voreinstellung erkannt. Wenn Sie Probleme mit importierten benutzerdefinierten Voreinstellungen haben, liegt möglicherweise ein bekannter Fehler in der HandBrakeCLI vor (wird in der nächsten HandBrakeCLI-Version behoben). Eine vorübergehende Lösung besteht darin, \"PictureRotate\": \"0: 0\" aus der .json-Datei zu entfernen. Mehr Infos hier:","Container:":"Container:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Geben Sie den Container an, den die Ausgabedatei haben soll, z. B. \".mp4\". Mehr über Container erfahren Sie unter:","Enable periodic scanning:":"Periodisches Scannen aktivieren:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast kann Ihre Quellordner überwachen und in einem festgelegten Intervall nach neuen Dateien suchen. Die Intervallzeit wird in Sekunden angegeben. Die Standardeinstellung ist 300 Sekunden (5 Minuten). Wenn diese Option ausgewählt ist, konvertiert das Programm alle neuen Dateien, wenn Sie auf \"Scannen und konvertieren\" klicken, und anschließend wird ein Countdown-Timer gestartet. Dies wird endlos wiederholt, bis es gestoppt wird. Das Scanintervall finden Sie im Abschnitt Erweiterte Einstellungen.","Enable daily scanning:":"Tägliches Scannen aktivieren:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Anstatt regelmäßig zu scannen, können Sie festlegen, dass ein Scan einmal am Tag ausgeführt wird. Die Scanzeit wird in den erweiterten Einstellungen im Format hh: mm eingegeben, z. B. '18: 30 '. Sobald \"Scannen und Konvertieren\" ausgewählt ist, wartet das Programm bis zur angegebenen Zeit, bis ein Scan- und Konvertierungsvorgang ausgeführt wird. Dies wird wiederum eine Endlosschleife bilden, bis es gestoppt wird.","Show/hide advanced:":"Erweitert ein- / ausblenden:","Scan interval (minimum 5 seconds):":"Scanintervall (mindestens 5 Sekunden):","Daily run time (hh:mm):":"Tägliche Laufzeit (hh: mm):","Output filename suffix:":"Ausgabedateiname-Suffix:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Dies ist optional. Sie können ein Suffix angeben, das an das Ende Ihres Dateinamens angehängt werden soll, z. B. \"_1080p\" oder \"_testconversion\" usw.","If 'standard preset' is selected then all output files will have the same suffix.":"Wenn 'Standardvoreinstellung' ausgewählt ist, haben alle Ausgabedateien das gleiche Suffix.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Wenn \"Benutzerdefinierte Voreinstellung\" ausgewählt ist, können Sie ein Suffix pro Quellordner / benutzerdefinierte Voreinstellung angeben. Stellen Sie sicher, dass jedes Suffix in einer eigenen Zeile steht. Wenn Sie beispielsweise zwei Quellordner haben und eine benutzerdefinierte Voreinstellung verwenden, können Sie diese in das Feld für das Dateinamensuffix einfügen:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Bei Dateien im ersten Quellordner wird dem Ausgabedateinamen \"_720p\" hinzugefügt. Bei Dateien im zweiten Quellordner wird \"_1080p\" zum Ausgabedateinamen usw. hinzugefügt.","Include these file containers:":"Schließen Sie diese Datei-Container ein:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Geben Sie die zu scannenden Dateicontainer ein. Jeder Typ muss durch ein Komma getrennt werden. Der Standardeintrag lautet:","Exclude files smaller than (MB):":"Dateien ausschließen, die kleiner als (MB) sind:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Geben Sie an, ob Dateien, die kleiner als eine bestimmte Größe sind, von der Konvertierung ausgeschlossen werden sollen (in Megabyte).","Exclude files larger than (MB):":"Dateien ausschließen, die größer als (MB) sind:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Geben Sie an, ob Dateien, die größer als eine bestimmte Größe sind, von der Konvertierung ausgeschlossen werden sollen (in Megabyte).","Exclude filenames which include any of these words:":"Schließen Sie Dateinamen aus, die eines der folgenden Wörter enthalten:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Geben Sie Schlüsselwörter ein, die beim Scannen nach Dateien herausgefiltert werden sollen. Wenn beispielsweise \"720p\" eingegeben wird, werden Dateien mit dem Titel \"720p\" nicht konvertiert. Auch hier müssen Stichwörter durch ein Komma getrennt werden. Geben Sie beispielsweise Folgendes in das Filterfeld ein:","Include files with any ":"Dateien mit einbeziehen"," or all ":"oder alle"," of these":"von diesen","properties:":"Eigenschaften:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Hier können Sie Video- und Audioeigenschaften eingeben, die Dateien haben müssen, um konvertiert zu werden (mit FFprobe extrahierte Informationen). Die Eigenschaften müssen durch ein Komma getrennt werden. Verwenden Sie das Tool zur Anzeige von Medieninformationen, um zu bestimmen, welche Eigenschaften Sie einschließen möchten. Stellen Sie sicher, dass hinter der letzten Eigenschaft ein Komma steht. So konvertieren Sie beispielsweise nur Dateien, die mit h264- und aac-Stereo-Audio codiert sind:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Es ist zu beachten, dass diese Eigenschaftsprüfung nach dem Start des Konvertierungsprozesses durchgeführt wird (um Zeit beim Erstellen der Warteschlange zu sparen). Obwohl Dateien möglicherweise in der Konvertierungswarteschlange angezeigt werden, werden sie übersprungen / eingeschlossen, wenn die richtigen Bedingungen erfüllt sind.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Wenn FFprobe Eigenschaften extrahieren kann, wird in der Warteschlangenansicht in der Spalte \"FFprobe\" ein \"OK\" angezeigt.","Exclude files with any ":"Schließen Sie Dateien mit any aus"," of these ":"von diesen","The opposite of 'Include files with any or all of these properties'":"Das Gegenteil von \"Dateien mit einigen oder allen dieser Eigenschaften einschließen\"","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Dies ist ein kleines Tool zum Analysieren von Dateieigenschaften, mit dem Sie bestimmen können, welche Eigenschaften in die obigen Optionen einbezogen / ausgeschlossen werden sollen. Es verwendet FFprobe, um Informationen zurückzugeben. Ziehen Sie Dateien in das graue Feld, um sie zu analysieren. Wenn Sie beispielsweise eine Testdatei ablegen, wird möglicherweise Folgendes zurückgegeben:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Wenn Sie solche Dateien von der Konvertierung ausschließen möchten, können Sie mehrere Dateieigenschaften in das Feld \"Dateien mit einer oder allen dieser Eigenschaften ausschließen\" einfügen und das Kontrollkästchen neben \"Alle\" anstelle von \"Alle\" aktivieren. wie so:","Copy excluded files to destination:":"Ausgeschlossene Dateien in das Ziel kopieren:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Wenn Sie diese Option auswählen, werden Dateien, die von der Konvertierung ausgeschlossen wurden, direkt in den Zielordner kopiert. Dies gilt für folgende Filter:","Exclude filenames which include any of these words":"Schließen Sie Dateinamen aus, die eines dieser Wörter enthalten","Include files with any or all of these properties":"Schließen Sie Dateien mit einigen oder allen dieser Eigenschaften ein","Exclude files with any or all of these properties":"Schließen Sie Dateien mit einigen oder allen dieser Eigenschaften aus","Exclude files smaller than (MB)":"Dateien ausschließen, die kleiner als (MB) sind","Exclude files larger than (MB)":"Dateien ausschließen, die größer als (MB) sind","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Beachten Sie, dass dies auch für ausgeschlossene Dateien gilt, da diese die oben genannten Bedingungen für die Eigenschaft \"Einschließen\" nicht erfüllen. Kopieren Sie also nicht versehentlich Ihre gesamte Bibliothek, wenn Sie nur versuchen, einige Dateien zu konvertieren.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Die Kopierfunktion gilt nicht für die folgenden Filter (dh Dateien, die aufgrund des Filters ausgeschlossen wurden)","Include these file types":"Schließen Sie diese Dateitypen ein","Delete source files after conversion:":"Quelldateien nach der Konvertierung löschen:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Wenn dies ausgewählt ist, wird die Quelldatei gelöscht, wenn ein Konvertierungsversuch erfolgreich war. Dieser Vorgang wird ganz am Ende nach der Konvertierung aller Dateien durchgeführt. Dies bedeutet, dass Sie dieselben Quelldateien mit mehreren Voreinstellungen auf einmal konvertieren können. Die Quelldateien werden anschließend gelöscht.","Replace original file if converted file is smaller?(Compress attempt)":"Originaldatei ersetzen, wenn konvertierte Datei kleiner ist? (Komprimierungsversuch)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Aktivieren Sie dieses Kontrollkästchen, wenn HBBatchBeast die ursprüngliche Quelldatei automatisch ersetzen soll, wenn die neue Datei kleiner ist. Wenn die neue Datei nicht kleiner ist, verbleibt sie im Zielordner.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Stellen Sie sicher, dass Ihr Zielordner nicht mit / oder in Ihrem Quellordner identisch ist oder nicht ordnungsgemäß funktioniert.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Sobald HBBatchBeast versucht hat, eine bestimmte Datei zu komprimieren, fügt es diesen Dateipfad einem Cache hinzu, damit es in Zukunft nicht erneut versucht wird. Sie können den Cache mit den gelben Schaltflächen anzeigen / bearbeiten / löschen.","Replace original file always?":"Originaldatei immer ersetzen?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Die ursprüngliche Datei wird unabhängig davon ersetzt, ob die neue Datei größer oder kleiner ist.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Vergewissern Sie sich erneut, dass Ihr Zielordner nicht mit Ihrem Quellordner identisch ist oder sich darin befindet, da er sonst nicht ordnungsgemäß funktioniert.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Nachdem HBBatchBeast eine bestimmte Datei transkodiert hat, fügt es diesen Dateipfad einem Cache hinzu, damit es in Zukunft nicht erneut versucht wird. Sie können den Cache mit den gelben Schaltflächen anzeigen / bearbeiten / löschen.","Copy subtitle (srt) files to destination?":"Untertiteldateien (srt) zum Ziel kopieren?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Untertitel-SRT-Dateien werden automatisch in den Zielordner kopiert.","Automatically create temporary/destination folders if they don't exist?":"Temporäre Ordner / Zielordner automatisch erstellen, wenn sie nicht vorhanden sind?","Custom bat path to run after each conversion (leave blank if not using):":"Benutzerdefinierter Fledermauspfad, der nach jeder Konvertierung ausgeführt wird (leer lassen, wenn nicht verwendet):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Geben Sie den Pfad zu einer benutzerdefinierten Batchdatei ein, die Sie nach jeder Konvertierung ausführen möchten. Zum Beispiel:","Batch files with timeout statements won't work. More info here:":"Batch-Dateien mit Timeout-Anweisungen funktionieren nicht. Mehr Infos hier:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Lassen Sie das Feld vollständig leer, wenn Sie diese Option nicht verwenden möchten (stellen Sie sicher, dass sich keine versteckten Zeichen im Feld befinden).","Run processes at low priority?":"Prozesse mit niedriger Priorität ausführen?","All conversion processes will be run at low priority, reducing processor usage.":"Alle Konvertierungsprozesse werden mit niedriger Priorität ausgeführt, wodurch die Prozessorauslastung verringert wird.","Remove apostrophes from filenames:":"Entfernen Sie Apostrophe aus Dateinamen:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Überprüfungen von Konvertierungen / Integritätsprüfungen schlagen möglicherweise fehl, wenn in den Dateinamen Apostrophe enthalten sind. Aktivieren Sie diese Option, um Apostrophe automatisch aus den Dateinamen zu entfernen."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Diese Funktion kann mit der '--scan'-Funktion von HandBrake nach beschädigten Videodateien suchen, obwohl dies nicht immer korrekt ist. Es wird auch FFprobe verwendet, um einen zweiten Referenzpunkt bereitzustellen. Wenn sowohl FFprobe als auch HandBrake fehlschlagen, besteht eine hohe Wahrscheinlichkeit, dass die Datei beschädigt ist.","Move corrupt files into the following folder:":"Verschieben Sie beschädigte Dateien in den folgenden Ordner:"," If checked, then any files which give errors will be moved into the specified folder.":"Wenn diese Option aktiviert ist, werden alle fehlerhaften Dateien in den angegebenen Ordner verschoben.","Corrupt file folder:":"Beschädigter Dateiordner:","Run thorough file health check:":"Führen Sie eine gründliche Überprüfung des Dateizustands durch:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Wenn diese Option aktiviert ist, wird mit FFmpeg anstelle von HandBrake eine wesentlich langsamere und gründlichere Überprüfung des Video-Zustands durchgeführt."," Based on Desani's 'ScanMedia.ps1' found at:":"Basierend auf Desanis 'ScanMedia.ps1' gefunden bei:","Attempt to repair files after thorough check:":"Versuchen Sie, Dateien nach gründlicher Prüfung zu reparieren:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Wenn diese Option aktiviert ist, versucht HBBatchBeast, Dateien mit FFmpeg zu reparieren. Eine neue Datei mit dem Suffix '_repaired' wird im selben Ordner wie die Quelldatei erstellt.","'CRF' value to use when attempting to repair files:":"'CRF'-Wert, der beim Versuch, Dateien zu reparieren, verwendet wird:","The default 'CRF' value is 23. Please see the following for more information:":"Der Standardwert für 'CRF' ist 23. Weitere Informationen finden Sie in den folgenden Abschnitten:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Der Bereich der CRF-Skala liegt zwischen 0 und 51, wobei 0 verlustfrei ist, 23 die Standardeinstellung ist und 51 die schlechtestmögliche Qualität ist. Ein niedrigerer Wert führt im Allgemeinen zu einer höheren Qualität, und ein subjektiv vernünftiger Bereich liegt zwischen 17 und 28. Betrachten Sie 17 oder 18 als visuell verlustfrei oder fast so; Es sollte genauso oder fast genauso aussehen wie die Eingabe, ist aber technisch nicht verlustfrei.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast speichert eine Liste der gescannten Dateipfade, die als nicht beschädigt gemeldet werden. Leeren Sie den Cache, um alle Dateien neu zu scannen.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Anzahl der gleichzeitig zu verwendenden HandBrake / FFmpeg-Instanzen (empfohlen 4 oder weniger):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Diese Einstellung gilt sowohl für den \"Video Health Check\" als auch für den \"Scan and Convert\" -Prozess. Geben Sie an, wie viele HandBrake-Threads verwendet werden sollen. Es gibt kein Maximum, obwohl empfohlen wird, nicht mehr als 4 zu verwenden. Eine höhere Menge kann Ihren Computer einfrieren, wenn er nicht sehr leistungsfähig ist.","Queue size view limit?(Recommended 1000 or fewer):":"Größenbeschränkung der Warteschlange? (Empfohlen 1000 oder weniger):","Automatically start \"Scan and convert\" when program opened?:":"Beim Programmstart automatisch \"Scannen und Konvertieren\" starten ?:","Save verbose logs?:":"Ausführliche Protokolle speichern ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Aktivieren Sie dieses Kontrollkästchen, um detaillierte Unterprozessprotokolle zu speichern. Dies schließt die Ausgabe der Arbeitskonsole ein. Dies führt zu sehr großen Protokollen.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Füllen Sie die E-Mail-Details aus, um E-Mail-Benachrichtigungen zu erhalten, wenn während einer Integritätsprüfung oder einer Konvertierung / Ordnerüberwachung ein Fehler auftritt. Funktioniert nicht mit Konten, die 2FA erfordern. Sie müssen den Zugriff auf weniger sichere Apps in Google Mail-Konten aktivieren.","Email address:":"E-Mail-Addresse:","For example:":"Zum Beispiel:","Email password(not saved):":"E-Mail-Passwort (nicht gespeichert):","SMTP server:":"SMTP-Server:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Diese Funktion ermöglicht die Überwachung des Status der Konvertierung / Integritätsprüfung mit einem beliebigen Webbrowser. Nützlich beim Betrieb von Servern usw. Es werden keine Dateinamen gesendet.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Wenn aktiviert, werden die folgenden anonymen Daten an HBBatchBeast.io gesendet:","API key":"API-Schlüssel","Current status ('Searching', 'Running', 'Finished' etc)":"Aktueller Status (\"Suchen\", \"Laufen\", \"Beendet\" usw.)","Number of:":"Anzahl der:","Remaining items":"Restposten","Successful items":"Erfolgreiche Artikel","Errored items":"Fehlerhafte Artikel","Cancelled items":"Stornierte Artikel","Worker percentages":"Arbeiterprozentsätze","Last completed item time":"Letzte abgeschlossene Artikelzeit","Enable remote monitoring?:":"Fernüberwachung aktivieren ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Ein grundlegendes Benchmarking-Dienstprogramm, das hauptsächlich entwickelt wurde, um die Leistung von 16+ Core-Prozessoren mit mehreren HandBrake-Instanzen zu ermitteln, obwohl es auf jedem Prozessortyp ausgeführt werden kann.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Dadurch wird eine h265 4k-Beispieldatei (2,5 MB) heruntergeladen und ein Benchmark mit 4 HandBrake-Instanzen mit der Voreinstellung \"Very Fast 1080p30\" ausgeführt.","Results can be uploaded to hbbatchbeast.io if you choose.":"Die Ergebnisse können auf Wunsch auf hbbatchbeast.io hochgeladen werden.","Queue":"Warteschlange","Output this session":"Diese Sitzung ausgeben","Media info viewer tool":"Tool zur Anzeige von Medieninformationen","View replaced file cache":"Cache für ersetzte Dateien anzeigen","Clear replaced file cache":"Ersetzter Dateicache löschen","Save config":"Konfiguration speichern","Scan only":"Nur scannen","Scan and convert":"Scannen und konvertieren","View scan/conversion summary log":"Anzeigen des Scan- / Conversion-Zusammenfassungsprotokolls","View individual file check/conversion log":"Anzeigen des einzelnen Dateiprüfungs- / Konvertierungsprotokolls","View worker console output":"Ausgabe der Arbeitskonsole anzeigen","Health check":"Gesundheitskontrolle","Clear healthy file cache":"Leeren Sie den Cache für fehlerfreie Dateien","View error log":"Fehlerprotokoll anzeigen","Email test":"E-Mail-Test","View master log":"Hauptprotokoll anzeigen","Wiki help":"Wiki-Hilfe","An application by HaveAGitGat":"Eine Anwendung von HaveAGitGat","New":"Neu","Launch":"Starten","Benchmark":"Benchmark","See results":"Siehe Ergebnisse","Pause queue":"Warteschlange anhalten","Continue queue":"Warteschlange fortsetzen","Stop queue":"Warteschlange anhalten","Convert selected files":"Konvertiert ausgewählte Dateien","Toggle queue view":"Warteschlangenansicht umschalten","Deselect all":"Alle abwählen","Invert all":"Alle umkehren","Select all":"Wählen Sie Alle","Toggle output view":"Ausgabeansicht umschalten"}