{"The number of custom presets does not match the number of source folders!":"Ο αριθμός των προσαρμοσμένων προεπιλογών δεν αντιστοιχεί στον αριθμό των φακέλων προέλευσης!","source folders have been detected.":"φακέλους προέλευσης.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"έχουν εντοπιστεί προσαρμοσμένες προκαθορισμένες γραμμές. Κάντε διπλό έλεγχο για αόρατα διαλείμματα γραμμής. Πρέπει να υπάρχει μία διαδρομή φακέλου ή προκαθορισμένη γραμμή ανά γραμμή. Βεβαιωθείτε ότι δεν έχετε δημιουργήσει τυχαία μια κενή γραμμή.","The number of filename suffixes does not match the number of source folders! ":"Ο αριθμός των επιθημάτων αρχείων δεν ταιριάζει με τον αριθμό των φακέλων προέλευσης!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"έχουν ανιχνευθεί γραμμές παραγώγων αρχείων. Κάντε διπλό έλεγχο για αόρατα διαλείμματα γραμμής. Πρέπει να υπάρχει μία διαδρομή φακέλου ή κατάληξη ονόματος αρχείου ανά γραμμή. Βεβαιωθείτε ότι δεν έχετε δημιουργήσει τυχαία μια κενή γραμμή.","The number of source folders does not match the number of destination folders!":"Ο αριθμός των φακέλων προέλευσης δεν αντιστοιχεί στον αριθμό των φακέλων προορισμού!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"φακέλους προορισμού έχουν ανιχνευθεί. Κάντε διπλό έλεγχο για αόρατα διαλείμματα γραμμής. Θα πρέπει να υπάρχει μία διαδρομή φακέλου ανά γραμμή. Βεβαιωθείτε ότι δεν έχετε δημιουργήσει τυχαία μια κενή γραμμή.","The number of source folders does not match the number of temporary conversion folders!":"Ο αριθμός των φακέλων προέλευσης δεν ταιριάζει με τον αριθμό των προσωρινών φακέλων μετατροπής!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"έχουν ανιχνευθεί προσωρινά φάκελοι μετατροπής. Κάντε διπλό έλεγχο για αόρατα διαλείμματα γραμμής. Θα πρέπει να υπάρχει μία διαδρομή φακέλου ανά γραμμή. Βεβαιωθείτε ότι δεν έχετε δημιουργήσει τυχαία μια κενή γραμμή.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Καταχωρίστε ένα έγκυρο κοντέινερ, όπως '.mp4'. Βεβαιωθείτε ότι έχετε συμπεριλάβει το σύμβολο '.'","Corrupt file folder":"Διακοσμημένο φάκελο αρχείων","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"δεν υπάρχει! Βεβαιωθείτε ότι δεν υπάρχουν κενά ή χαρακτήρες πριν ή μετά τη διαδρομή","Source folder":"Φάκελος προέλευσης","Temporary conversion folder":"Προσωρινός φάκελος μετατροπής","appears to be the same as or is within source folder":"φαίνεται να είναι το ίδιο με το φάκελο προέλευσης ή βρίσκεται μέσα σε αυτόν","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"η οποία θα αποτρέψει τη σωστή λειτουργία του HBBatchBeast. Αλλάξτε το φάκελο προσωρινής μετατροπής σε φάκελο εκτός του φακέλου προέλευσης. Αν θέλετε να χρησιμοποιήσετε τη λειτουργία \"Αντικατάσταση αρχικών αρχείων\", επιλέξτε ένα φάκελο προορισμού που δεν είναι ο ίδιος με τον φάκελο προέλευσης ή μέσα στον φάκελο προέλευσης και, στη συνέχεια, επιλέξτε το πλαίσιο ελέγχου \"Αντικατάσταση αρχικών αρχείων πάντα\" στην ενότητα σύνθετων ρυθμίσεων . Καταργήστε την επιλογή του πλαισίου προσωρινής αποθήκευσης \"Προσωρινή μετατροπή\", καθώς δεν θα χρησιμοποιηθεί σε αυτή την περίπτωση. Τα αρχεία θα μετατραπούν στον φάκελο προορισμού και στη συνέχεια θα μετακινηθούν ξανά στον φάκελο προέλευσης.","Destination folder":"Φάκελος προορισμού","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"η οποία θα αποτρέψει τη σωστή λειτουργία του HBBatchBeast. Αλλάξτε τον φάκελο προορισμού σε φάκελο εκτός του φακέλου προέλευσης. Αν θέλετε να χρησιμοποιήσετε τη λειτουργία \"Αντικατάσταση αρχικών αρχείων\", επιλέξτε ένα φάκελο προορισμού που δεν είναι ο ίδιος με τον φάκελο προέλευσης ή μέσα στον φάκελο προέλευσης και, στη συνέχεια, επιλέξτε το πλαίσιο ελέγχου \"Αντικατάσταση αρχικών αρχείων πάντα\" στην ενότητα σύνθετων ρυθμίσεων . Καταργήστε την επιλογή του πλαισίου προσωρινής αποθήκευσης \"Προσωρινή μετατροπή\", καθώς δεν θα χρησιμοποιηθεί σε αυτή την περίπτωση. Τα αρχεία θα μετατραπούν στον φάκελο προορισμού και στη συνέχεια θα μετακινηθούν ξανά στον φάκελο προέλευσης.","Error creating temporary conversion folder":"Σφάλμα δημιουργίας φακέλου προσωρινής μετατροπής","Error creating destination folder":"Σφάλμα στη δημιουργία φακέλου προορισμού","Please select to use HandBrake or FFmpeg!":"Επιλέξτε να χρησιμοποιήσετε το HandBrake ή το FFmpeg!","Please select a standard preset or input a custom one!":"Επιλέξτε μια τυπική προρρύθμιση ή εισαγάγετε μια προσαρμοσμένη!","Please select a scan interval of 5 seconds or greater!":"Επιλέξτε ένα διάστημα σάρωσης τουλάχιστον 5 δευτερολέπτων!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Βεβαιωθείτε ότι ο αριθμός των ταυτόχρονων παρουσιών HandBrake / FFmpeg που χρησιμοποιείτε είναι ένα ή περισσότερα!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Μη έγκυρο κλειδί API! Κάντε κλικ στο κουμπί \"Νέα\" στην καρτέλα απομακρυσμένης παρακολούθησης για να δημιουργήσετε ένα νέο κλειδί.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Εισαγάγετε μια ημερήσια ώρα σάρωσης σε μορφή 24 ωρών: hh: mm (για παράδειγμα 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"Τα αρχεία προέλευσης θα διαγραφούν μετά την μετατροπή! Παρακαλούμε δοκιμάστε πριν από τη σωστή χρήση!","Benchmark failed!":"Το δείκτη αναφοράς απέτυχε!","Log does not exist!":"Το αρχείο καταγραφής δεν υπάρχει!","Folder does not exist!":"Ο φάκελος δεν υπάρχει!","Error sending email! Please check your settings.":"Σφάλμα κατά την αποστολή email Ελέγξτε τις ρυθμίσεις σας.","Test email sent!":"Δοκιμάστε το ηλεκτρονικό ταχυδρομείο!","All worker processes have been stopped.":"Όλες οι διαδικασίες των εργαζομένων έχουν σταματήσει.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Η ουρά θα τεθεί σε παύση όταν ολοκληρωθεί η επεξεργασία των τρεχόντων στοιχείων. Είστε βέβαιοι ότι θέλετε να θέσετε σε παύση την ουρά;","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Η παύση της ουράς ξεκίνησε. Το κουμπί 'Συνέχιση' θα εμφανιστεί μόλις οι εργαζόμενοι έχουν παύσει.","Healthy file cache cleared!":"Η υγιή προσωρινή μνήμη αρχείων εκκαθαρίστηκε!","Cache cleared!":"Η κρυφή μνήμη εκκαθαρίστηκε!","Cancel item":"Ακύρωση στοιχείου","Please check the above checkbox to use this feature.":"Παρακαλούμε ελέγξτε το παραπάνω πλαίσιο ελέγχου για να χρησιμοποιήσετε αυτή τη λειτουργία.","Configuration":"Διαμόρφωση","Source folders":"Πηγές φακέλων","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Αυτός είναι ο φάκελος προέλευσης που θα σαρωθεί για μέσα. Ο φάκελος πρέπει να εισαχθεί χωρίς καθόλου πλάγια κάθετο. Για παράδειγμα:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Το πλαίσιο διαδρομής φακέλου προέλευσης είναι επεκτάσιμο (πατήστε enter για να δημιουργήσετε μια νέα γραμμή). Εάν θέλετε να καθορίσετε πολλούς φακέλους πηγών, βεβαιωθείτε ότι κάθε διαδρομή φακέλου προέλευσης είναι στη δική της γραμμή, όπως:","Video health check":"Έλεγχος υγείας βίντεο","Batch conversion and Folder watching":"Μετατροπή παρτίδας και Παρακολούθηση φακέλου","Remote Monitoring (Beta)":"Απομακρυσμένη παρακολούθηση (Beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"Σύστημα","Help":"Βοήθεια","Temporary conversion folders":"Προσωρινοί φάκελοι μετατροπής","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Εάν \"Προσωρινός φάκελος μετατροπής;\" , τότε το HandBrake θα μετατρέψει τα αρχεία σε αυτόν το φάκελο. Μόλις ολοκληρωθεί η μετατροπή, το αρχείο θα μεταφερθεί στον \"φάκελο προορισμού\". Θα χρειαστεί να καθορίσετε πολλούς φακέλους προσωρινής μετατροπής ως φακέλους πηγής. Ο πρώτος φάκελος προέλευσης θα μετατραπεί στον πρώτο προσωρινό φάκελο μετατροπής, στον δεύτερο φάκελο προέλευσης στον δεύτερο προσωρινό φάκελο μετατροπής και ούτω καθεξής. Βεβαιωθείτε ότι κάθε διαδρομή του φακέλου προσωρινής μετατροπής βρίσκεται στη δική του γραμμή.","Destination folders":"Φάκελοι προορισμού","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Καθορίστε τις διαδρομές φακέλου προορισμού. Και πάλι, θα πρέπει να καθορίσετε όσο περισσότερους φακέλους προορισμού είναι οι φάκελοι πηγών. Τα αρχεία από τον πρώτο φάκελο προέλευσης θα καταλήξουν στον πρώτο φάκελο προορισμού σας, τα δευτερεύοντα αρχεία φακέλου προέλευσης στον δεύτερο φάκελο προορισμού και ούτω καθεξής.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Πρώτος φάκελος προέλευσης ---------> Πρώτος φάκελος προσωρινής μετατροπής ---------> Πρώτος φάκελος προορισμού","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Δεύτερος φάκελος προέλευσης ---------> Δεύτερος προσωρινός φάκελος μετατροπής ---------> Δεύτερος φάκελος προορισμού","etc":"και τα λοιπα","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"Το HBBatchBeast δεν θα λειτουργήσει σωστά αν ο φάκελος προορισμού είναι ο ίδιος με αυτόν ή μέσα στον φάκελο προέλευσης.","Standard preset:":"Πρότυπη προεπιλογή:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Επιλέξτε το Preset HandBrake στο οποίο θέλετε να μετατρέψετε τα αρχεία σας. Εάν έχει επιλεγεί \"Προκαθορισμένη προεπιλογή\", τότε όλα τα αρχεία των επιλεγμένων φακέλων θα μετατραπούν χρησιμοποιώντας την προκαθορισμένη ρύθμιση HandBrake. Μπορείτε να βρείτε περισσότερα για τις προεπιλογές HandBrake εδώ:","Custom preset:":"Προσαρμοσμένη προρρύθμιση:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Εάν έχει οριστεί \"Προεπιλεγμένη ρύθμιση\", τότε πρέπει να εισαγάγετε τη δική σας προσαρμοσμένη προεπιλογή. Το HBBatchBeast καλύπτει το τμήμα \"HandBrakeCLI -i source -o προορισμός\" της εισόδου HandBrakeCLI, ώστε να χρειάζεται να εισαγάγετε τις παραμέτρους μετατροπής. Για παράδειγμα:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Εάν χρησιμοποιείτε FFmpeg, πρέπει να διαχωρίσετε τις παραμέτρους εισόδου και εξόδου με κόμμα. Οπως:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Μπορείτε επίσης να συνδέσετε μια προσαρμοσμένη προεπιλογή που έχει εξαχθεί από την επίσημη εφαρμογή HandBrake GUI για παράδειγμα:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Εάν αντιμετωπίζετε προβλήματα με προσαρμοσμένες προεπιλογές, ενδέχεται να οφείλεται σε ένα γνωστό σφάλμα με το HandBrakeCLI (θα οριστεί στην επόμενη έκδοση του HandBrakeCLI). Ανατρέξτε σε αυτό για μια προσωρινή λύση:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Κάθε προσαρμοσμένη προεπιλογή πρέπει να είναι στη δική της γραμμή και, όπως και στους φακέλους, πρέπει να υπάρχουν όσες προσαρμοσμένες προεπιλογές είναι οι φάκελοι πηγής.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Πρώτος φάκελος πηγής ---------> Πρώτος προσωρινός φάκελος μετατροπής ---------> Πρώτος φάκελος προορισμού @ Προεπιλεγμένος προρυθμισμένος αριθμός 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Δεύτερος φάκελος προέλευσης ---------> Δεύτερος προσωρινός φάκελος μετατροπής ---------> Δεύτερος φάκελος προορισμού @ Προεπιλεγμένος προρυθμισμένος αριθμός 2","See the following image for guidance:":"Δείτε την παρακάτω εικόνα για καθοδήγηση:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Εάν χρησιμοποιείτε κωδικοποίηση κάρτας γραφικών (όπως NVENC), τότε ίσως χρειαστεί να μειώσετε τον αριθμό των περιπτώσεων HandBrake (δοκιμάστε 2 ή λιγότερα) λόγω περιορισμών VRAM.","Select standard preset:":"Επιλέξτε τυπική προρρύθμιση:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Η NVENC ανίχνευσε, φροντίστε να μειώσετε τον αριθμό των περιπτώσεων HandBrakeCLI σε 2 ή παρακάτω (για τις περισσότερες κάρτες γραφικών) ή ενδέχεται να αντιμετωπίσετε σφάλματα λόγω ανεπάρκειας VRAM. Αυτή η ρύθμιση βρίσκεται στην καρτέλα \"Σύστημα\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Η εισαγόμενη προκαθορισμένη ανίχνευση.Αν έχετε πρόβλημα με τις εισαγόμενες προσαρμοσμένες προεπιλογές, μπορεί να οφείλεται σε ένα γνωστό σφάλμα με το HandBrakeCLI (θα καθοριστεί στην επόμενη έκδοση του HandBrakeCLI). Μια προσωρινή λύση είναι να αφαιρέσετε το \"PictureRotate\": \"0: 0\" από το αρχείο .json. Περισσότερες πληροφορίες εδώ:","Container:":"Δοχείο:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Καθορίστε το κοντέινερ που θέλετε να έχει το αρχείο εξόδου όπως '.mp4'. Μπορείτε να μάθετε περισσότερα σχετικά με τα δοχεία σε:","Enable periodic scanning:":"Ενεργοποίηση περιοδικής σάρωσης:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"Το HBBatchBeast μπορεί να παρακολουθεί τους φακέλους πηγών και να εκτελεί σαρώσεις για νέα αρχεία σε συγκεκριμένο χρονικό διάστημα. Ο χρόνος διαστήματος είναι σε δευτερόλεπτα, ενώ η προεπιλογή είναι 300 δευτερόλεπτα (5 λεπτά). Εάν αυτή η επιλογή είναι επιλεγμένη, τότε όταν πατήσετε \"Σάρωση και μετατροπή\", το πρόγραμμα θα μετατρέψει όλα τα νέα αρχεία και στη συνέχεια θα ξεκινήσει ένας χρονομετρητής αντίστροφης μέτρησης. Αυτό θα λυθεί άπειρα μέχρι να σταματήσει. Το διάστημα σάρωσης είναι στην ενότητα σύνθετων ρυθμίσεων.","Enable daily scanning:":"Ενεργοποίηση καθημερινής σάρωσης:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Αντί της περιοδικής σάρωσης, μπορείτε να επιλέξετε να εκτελείται μια σάρωση μία φορά την ημέρα. Ο χρόνος σάρωσης εισάγεται στην ενότητα προχωρημένων ρυθμίσεων σε μορφή hh: mm όπως '18: 30 '. Μόλις επιλεγεί η επιλογή \"Σάρωση και μετατροπή\", το πρόγραμμα θα περιμένει μέχρι την καθορισμένη ώρα μέχρι να εκτελέσει μια διαδικασία σάρωσης και μετατροπής. Και πάλι, αυτό θα βρεθεί απεριόριστα μέχρι να σταματήσει.","Show/hide advanced:":"Εμφάνιση / απόκρυψη προχωρημένου:","Scan interval (minimum 5 seconds):":"Διάστημα σάρωσης (τουλάχιστον 5 δευτερόλεπτα):","Daily run time (hh:mm):":"Ημερήσια διάρκεια εκτέλεσης (hh: mm):","Output filename suffix:":"Έξοδος ονόματος αρχείου:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Αυτό είναι προαιρετικό. Μπορείτε να καθορίσετε μια κατάληξη για να προσθέσετε στο τέλος του ονόματος αρχείου σας όπως '_1080p' ή '_testconversion' κ.λπ.","If 'standard preset' is selected then all output files will have the same suffix.":"Εάν έχει επιλεγεί \"πρότυπη προεπιλογή\", τότε όλα τα αρχεία εξόδου θα έχουν την ίδια κατάληξη.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Εάν έχει επιλεγεί \"προσαρμοσμένη προεπιλογή\", μπορείτε να ορίσετε ένα κατάληξη ανά φάκελο προέλευσης / προσαρμοσμένη προεπιλογή. Βεβαιωθείτε ότι κάθε κατάληξη είναι στη δική της γραμμή. Για παράδειγμα, αν έχετε 2 πηγαίους φακέλους και χρησιμοποιείτε το \"custom preset\", μπορείτε να το βάλετε στο πλαίσιο suffix του αρχείου:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Τα αρχεία στον πρώτο φάκελο προέλευσης θα έχουν προστεθεί στο αρχείο εξόδου '_720p'. Τα αρχεία στο δεύτερο φάκελο προέλευσης θα έχουν προστεθεί '_1080p' στο όνομα αρχείου εξόδου κλπ.","Include these file containers:":"Συμπεριλάβετε αυτά τα κοντέινερ αρχείων:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Εισαγάγετε τα δοχεία αρχείων προς σάρωση. Κάθε τύπος πρέπει να διαχωρίζεται με κόμμα. Η προεπιλεγμένη καταχώρηση είναι:","Exclude files smaller than (MB):":"Εξαίρεση αρχείων μικρότερων από (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Καθορίστε εάν θα αποκλείσετε αρχεία μικρότερα από ένα συγκεκριμένο μέγεθος από τη μετατροπή (σε megabytes)","Exclude files larger than (MB):":"Εξαίρεση αρχείων μεγαλύτερων από (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Καθορίστε εάν θα αποκλείσετε τα αρχεία μεγαλύτερα από ένα συγκεκριμένο μέγεθος από τη μετατροπή (σε megabytes)","Exclude filenames which include any of these words:":"Εξαιρούνται ονόματα αρχείων που περιλαμβάνουν οποιαδήποτε από αυτές τις λέξεις:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Εισαγάγετε τις λέξεις-κλειδιά που θα φιλτραριστούν κατά τη σάρωση αρχείων. Για παράδειγμα, εάν εισαχθεί \"720p\", τότε όλα τα αρχεία με \"720p\" στον τίτλο δεν θα μετατραπούν. Και πάλι, οι λέξεις-κλειδιά πρέπει να χωρίζονται με κόμμα. Για παράδειγμα, πληκτρολογήστε τα παρακάτω στο πλαίσιο φίλτρου:","Include files with any ":"Συμπεριλάβετε αρχεία με οποιαδήποτε"," or all ":"ή όλα"," of these":"από αυτά","properties:":"ιδιότητες:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Εδώ μπορείτε να εισαγάγετε τις ιδιότητες βίντεο και ήχου που πρέπει να έχουν τα αρχεία για να μετατραπούν (πληροφορίες εξάγονται χρησιμοποιώντας το FFprobe). Οι ιδιότητες πρέπει να διαχωρίζονται με κόμμα. Χρησιμοποιήστε το εργαλείο προβολής πληροφοριών πολυμέσων για να προσδιορίσετε ποιες ιδιότητες θέλετε να συμπεριλάβετε. Βεβαιωθείτε ότι έχετε τοποθετήσει κόμμα μετά την τελευταία ιδιότητα. Για παράδειγμα, για να μετατρέψετε μόνο τα αρχεία που κωδικοποιούνται χρησιμοποιώντας h264 και aac στερεοφωνικό ήχο:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Αξίζει να σημειωθεί ότι αυτός ο έλεγχος ιδιότητας πραγματοποιείται μόλις ξεκινήσει η διαδικασία μετατροπής (για να εξοικονομήσετε χρόνο κατά την κατασκευή της ουράς), έτσι αν και τα αρχεία ενδέχεται να εμφανίζονται στην ουρά μετατροπής, θα παραλειφθούν / συμπεριληφθούν εάν τηρηθούν οι σωστές συνθήκες.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Αν το FFprobe είναι σε θέση να εξαγάγει ιδιότητες, τότε στη στήλη \"FFprobe\" στην αναμονή ουράς θα εμφανιστεί ένα \"OK\".","Exclude files with any ":"Εξαίρεση αρχείων με οποιαδήποτε"," of these ":"από αυτά","The opposite of 'Include files with any or all of these properties'":"Το αντίθετο από το 'Συμπερίληψη αρχείων με κάποια ή όλες αυτές τις ιδιότητες'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Αυτό είναι ένα μικρό εργαλείο για την ανάλυση ιδιοτήτων αρχείων με σκοπό να σας βοηθήσει να προσδιορίσετε ποιες ιδιότητες θα θέλατε να συμπεριλάβετε / αποκλείσετε στις παραπάνω επιλογές. Χρησιμοποιεί το FFprobe για να επιστρέψει πληροφορίες. Σύρετε και αφήστε τα αρχεία στο γκρίζο πλαίσιο για να τα αναλύσετε. Για παράδειγμα, η απόρριψη ενός αρχείου δοκιμής ενδέχεται να επιστρέψει τα εξής:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Εάν θέλετε να εξαιρέσετε τέτοια αρχεία από μετατροπή, τότε μπορείτε να τοποθετήσετε πολλές ιδιότητες αρχείων στο πλαίσιο \"Εξαίρεση αρχείων με κάποια ή όλες αυτές τις ιδιότητες\" και να επιλέξετε το πλαίσιο ελέγχου δίπλα στο \"όλα\" αντί για \"οποιεσδήποτε\" όπως έτσι:","Copy excluded files to destination:":"Αντιγραφή αρχείων που εξαιρούνται στον προορισμό:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Αν επιλέξετε αυτήν την επιλογή, τότε τα αρχεία που έχουν αποκλειστεί από τη μετατροπή θα αντιγραφούν απευθείας στο φάκελο προορισμού. Αυτό ισχύει για τα παρακάτω φίλτρα:","Exclude filenames which include any of these words":"Εξαιρούνται ονόματα αρχείων που περιλαμβάνουν οποιαδήποτε από αυτές τις λέξεις","Include files with any or all of these properties":"Συμπεριλάβετε αρχεία με κάποια ή όλες αυτές τις ιδιότητες","Exclude files with any or all of these properties":"Εξαίρεση αρχείων με κάποια ή όλες αυτές τις ιδιότητες","Exclude files smaller than (MB)":"Εξαίρεση αρχείων μικρότερων από (MB)","Exclude files larger than (MB)":"Εξαίρεση αρχείων μεγαλύτερων από (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Σημειώστε ότι αυτό ισχύει και για τα αρχεία που εξαιρούνται επειδή δεν πληρούν τις προϋποθέσεις ιδιοκτησίας \"Συμπερίληψη\" των παραπάνω, οπότε μην αντιγράφετε κατά λάθος ότι είστε ολόκληρη η βιβλιοθήκη όταν προσπαθείτε να μετατρέψετε μόνο μερικά αρχεία.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Η δυνατότητα αντιγραφής δεν ισχύει για τα παρακάτω φίλτρα (δηλαδή τα αρχεία που εξαιρούνται λόγω του φίλτρου)","Include these file types":"Συμπεριλάβετε αυτούς τους τύπους αρχείων","Delete source files after conversion:":"Διαγραφή αρχείων προέλευσης μετά τη μετατροπή:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Εάν αυτή είναι επιλεγμένη, τότε εάν η προσπάθεια μετατροπής είναι επιτυχής, το αρχείο προέλευσης θα διαγραφεί. Αυτή η διαδικασία γίνεται στο τέλος, μετά τη μετατροπή όλων των αρχείων. Αυτό σημαίνει ότι μπορείτε να μετατρέψετε τα ίδια αρχεία προέλευσης χρησιμοποιώντας πολλαπλές προεπιλογές, όλες με μία κίνηση. Στη συνέχεια, τα αρχεία προέλευσης θα διαγραφούν στη συνέχεια.","Replace original file if converted file is smaller?(Compress attempt)":"Αντικαταστήστε το πρωτότυπο αρχείο εάν το μετατρεπόμενο αρχείο είναι μικρότερο (προσπάθεια συμπίεσης)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Επιλέξτε αυτό το πλαίσιο ελέγχου αν θέλετε το HBBatchBeast να αντικαταστήσει αυτόματα το πρωτότυπο αρχείο προέλευσης αν το νέο αρχείο είναι μικρότερο. Εάν το νέο αρχείο δεν είναι μικρότερο, τότε θα παραμείνει στο φάκελο προορισμού.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Βεβαιωθείτε ότι ο φάκελος προορισμού δεν είναι ο ίδιος με τον / ή εντός, τον φάκελο προέλευσης ή ότι δεν θα λειτουργήσει σωστά.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Μόλις το HBBatchBeast επιχειρήσει να συμπιέσει ένα συγκεκριμένο αρχείο, θα προσθέσει τη διαδρομή του αρχείου σε μια προσωρινή μνήμη, ώστε να μην επιχειρηθεί ξανά στο μέλλον. Μπορείτε να προβάλετε / επεξεργαστείτε / διαγράψετε την προσωρινή μνήμη χρησιμοποιώντας τα κίτρινα κουμπιά.","Replace original file always?":"Να αντικαθιστάτε πάντα το πρωτότυπο αρχείο;","The original file will be replaced regardless of whether the new file is larger or smaller.":"Το αρχικό αρχείο θα αντικατασταθεί ανεξάρτητα από το εάν το νέο αρχείο είναι μεγαλύτερο ή μικρότερο.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Και πάλι, βεβαιωθείτε ότι ο φάκελος προορισμού σας δεν είναι ο ίδιος με / ή μέσα στο φάκελο προέλευσης ή ότι δεν θα λειτουργήσει σωστά.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Μόλις το HBBatchBeast μεταγλωττίσει ένα συγκεκριμένο αρχείο, θα προσθέσει τη διαδρομή του αρχείου σε μια προσωρινή μνήμη, ώστε να μην επιχειρηθεί ξανά στο μέλλον. Μπορείτε να προβάλετε / επεξεργαστείτε / διαγράψετε την προσωρινή μνήμη χρησιμοποιώντας τα κίτρινα κουμπιά.","Copy subtitle (srt) files to destination?":"Αντιγραφή αρχείων υποτίτλων (srt) στον προορισμό;","Subtitle '.srt' files will be copied to the destination folder automatically.":"Τα αρχεία υποτίτλων \".srt\" θα αντιγραφούν αυτόματα στο φάκελο προορισμού.","Automatically create temporary/destination folders if they don't exist?":"Δημιουργήστε αυτόματα προσωρινά / προορισμούς φακέλους αν δεν υπάρχουν;","Custom bat path to run after each conversion (leave blank if not using):":"Προσαρμοσμένη διαδρομή νυχτερίδας για εκτέλεση μετά από κάθε μετατροπή (αφήστε κενό αν δεν τη χρησιμοποιείτε):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Εισαγάγετε τη διαδρομή σε ένα προσαρμοσμένο αρχείο δέσμης που θέλετε να εκτελέσετε μετά από κάθε μετατροπή. Για παράδειγμα:","Batch files with timeout statements won't work. More info here:":"Τα αρχεία δέσμης με δηλώσεις χρονικού ορίου δεν θα λειτουργήσουν. Περισσότερες πληροφορίες εδώ:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Αφήστε το κουτί εντελώς άδειο αν δεν θέλετε να χρησιμοποιήσετε αυτήν την επιλογή (βεβαιωθείτε ότι δεν υπάρχουν κρυφοί χαρακτήρες στο κουτί)","Run processes at low priority?":"Εκτελέστε διαδικασίες με χαμηλή προτεραιότητα;","All conversion processes will be run at low priority, reducing processor usage.":"Όλες οι διαδικασίες μετατροπής θα εκτελούνται με χαμηλή προτεραιότητα, μειώνοντας τη χρήση του επεξεργαστή.","Remove apostrophes from filenames:":"Κατάργηση απόστροφων από τα ονόματα αρχείων:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Οι μετατροπές / σαρώσεις ελέγχου υγείας ενδέχεται να αποτύχουν εάν τα ονόματα των αρχείων έχουν αποστάξεις. Επιλέξτε αυτό για να καταργήσετε αυτόματα τα αποστάγματα από τα ονόματα αρχείων."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Αυτή η λειτουργία μπορεί να ανιχνεύσει διεφθαρμένα αρχεία βίντεο χρησιμοποιώντας τη λειτουργία '--scan' του HandBrake, αν και αυτό δεν είναι πάντα ακριβές. Χρησιμοποιεί επίσης το FFprobe για να παρέχει ένα δεύτερο σημείο αναφοράς. Εάν αποτύχει και το FFprobe και το HandBrake τότε υπάρχει μεγάλη πιθανότητα το αρχείο να είναι κατεστραμμένο.","Move corrupt files into the following folder:":"Μετακινήστε κατεστραμμένα αρχεία στον ακόλουθο φάκελο:"," If checked, then any files which give errors will be moved into the specified folder.":"Εάν είναι επιλεγμένο, τότε όλα τα αρχεία που δίνουν σφάλματα θα μεταφερθούν στον καθορισμένο φάκελο.","Corrupt file folder:":"Λάθος φάκελο αρχείων:","Run thorough file health check:":"Εκτελέστε λεπτομερή έλεγχο υγείας αρχείων:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Εάν είναι επιλεγμένο, τότε θα πραγματοποιηθεί πολύ πιο αργός, πιο λεπτομερής έλεγχος υγείας βίντεο χρησιμοποιώντας το FFmpeg αντί για το HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Με βάση το 'ScanMedia.ps1' της Desani που βρέθηκε στο:","Attempt to repair files after thorough check:":"Προσπάθεια επισκευής των αρχείων μετά από ενδελεχή έλεγχο:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Εάν είναι επιλεγμένο, το HBBatchBeast θα προσπαθήσει να επιδιορθώσει τα αρχεία χρησιμοποιώντας το FFmpeg. Ένα νέο αρχείο με το επίθημα '_repaired' θα δημιουργηθεί στον ίδιο φάκελο με το αρχείο προέλευσης.","'CRF' value to use when attempting to repair files:":"Η τιμή \"CRF\" που πρέπει να χρησιμοποιείται κατά την προσπάθεια επισκευής αρχείων:","The default 'CRF' value is 23. Please see the following for more information:":"Η προεπιλεγμένη τιμή \"CRF\" είναι 23. Για περισσότερες πληροφορίες, ανατρέξτε στα παρακάτω:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Το εύρος της κλίμακας CRF είναι 0-51, όπου 0 είναι χωρίς απώλειες, 23 είναι η προεπιλογή και 51 είναι η χειρότερη δυνατή ποιότητα. Μια χαμηλότερη τιμή γενικά οδηγεί σε υψηλότερη ποιότητα και μια υποκειμενικά ισορροπημένη κλίμακα είναι 17-28. Θεωρήστε 17 ή 18 να είναι οπτικά χωρίς απώλειες ή σχεδόν έτσι? θα πρέπει να φαίνεται ίδια ή σχεδόν ίδια με την είσοδο, αλλά δεν είναι τεχνικά χωρίς απώλειες.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"Το HBBatchBeast αποθηκεύει μια λίστα με σαρωμένες διαδρομές αρχείων που έχουν αναφερθεί ως άθικτες. Εκκαθαρίστε την προσωρινή μνήμη για να πραγματοποιήσετε μια νέα σάρωση σε όλα τα αρχεία.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Αριθμός ταυτόχρονων περιπτώσεων HandBrake / FFmpeg που πρέπει να χρησιμοποιήσετε; (Συνιστώμενοι 4 ή λιγότεροι):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Αυτή η ρύθμιση ισχύει και για τις διεργασίες \"Έλεγχος υγείας βίντεο\" και \"Σάρωση και μετατροπή\". Καθορίστε πόσες ίνες HandBrake να χρησιμοποιήσετε. Δεν υπάρχει μέγιστο αν και συνιστάται να μην χρησιμοποιείται περισσότερο από 4. Ένα υψηλότερο ποσό μπορεί να παγώσει τον υπολογιστή σας εάν δεν είναι πολύ ισχυρό.","Queue size view limit?(Recommended 1000 or fewer):":"Όριο προβολής μεγέθους ουράς (Συνιστώμενο 1000 ή λιγότερα):","Automatically start \"Scan and convert\" when program opened?:":"Ξεκινήστε αυτόματα τη λειτουργία \"Σάρωση και μετατροπή\" όταν το πρόγραμμα ανοίξει ;:","Save verbose logs?:":"Αποθήκευση λεπτομερών αρχείων καταγραφής ;:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Επιλέξτε αυτό το πλαίσιο ελέγχου για να αποθηκεύσετε λεπτομερή αρχεία καταγραφής υπο-διεργασιών. Αυτό περιλαμβάνει την ouput κονσόλας εργαζομένων. Αυτό θα προκαλέσει πολύ μεγάλα αρχεία καταγραφής.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Συμπληρώστε τα στοιχεία του ηλεκτρονικού ταχυδρομείου για να λαμβάνετε ειδοποιήσεις μέσω ηλεκτρονικού ταχυδρομείου αν παρουσιαστεί σφάλμα κατά τη διάρκεια ενός ελέγχου υγείας ή παρακολούθησης μετατροπής / φακέλου. Δεν θα λειτουργήσει με λογαριασμούς που απαιτούν 2FA. Πρέπει να ενεργοποιήσετε την πρόσβαση σε λιγότερο ασφαλείς εφαρμογές σε λογαριασμούς Gmail.","Email address:":"Διεύθυνση ηλεκτρονικού ταχυδρομείου:","For example:":"Για παράδειγμα:","Email password(not saved):":"Κωδικός ηλεκτρονικού ταχυδρομείου (δεν αποθηκεύτηκε):","SMTP server:":"Διακομιστής SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Αυτή η δυνατότητα επιτρέπει την παρακολούθηση της κατάστασης ελέγχου μετατροπής / υγείας χρησιμοποιώντας οποιοδήποτε πρόγραμμα περιήγησης ιστού. Χρήσιμο όταν εκτελούνται διακομιστές κλπ. Δεν αποστέλλονται ονόματα αρχείων.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Εάν είναι ενεργοποιημένη, τα ακόλουθα ανώνυμα δεδομένα θα σταλούν στο HBBatchBeast.io:","API key":"API κλειδί","Current status ('Searching', 'Running', 'Finished' etc)":"Τρέχουσα κατάσταση (\"Αναζήτηση\", \"Τρέξιμο\", \"Τελειωμένο\" κ.λπ.)","Number of:":"Αριθμός:","Remaining items":"Παραμένοντα στοιχεία","Successful items":"Επιτυχημένα στοιχεία","Errored items":"Εσφαλμένα αντικείμενα","Cancelled items":"Ακυρωμένα στοιχεία","Worker percentages":"Ποσοστά εργαζομένων","Last completed item time":"Τελευταία ώρα ολοκλήρωσης στοιχείου","Enable remote monitoring?:":"Ενεργοποίηση απομακρυσμένης παρακολούθησης ;:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Ένα βασικό βοηθητικό πρόγραμμα συγκριτικής αξιολόγησης που βασίζεται κυρίως στο πώς οι 16+ επεξεργαστές πυρήνα εκτελούν χρήση πολλαπλών περιπτώσεων HandBrake αν και μπορεί να τρέξει σε οποιοδήποτε τύπο επεξεργαστή.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Αυτό θα κατεβάσει ένα δείγμα αρχείου h265 4k (2.5MB) και θα εκτελέσει ένα σημείο αναφοράς χρησιμοποιώντας 4 περιπτώσεις HandBrake με προκαθορισμένο \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Τα αποτελέσματα μπορούν να μεταφορτωθούν στο hbbatchbeast.io αν επιλέξετε.","Queue":"Ουρά","Output this session":"Εξάγετε αυτή τη σύνοδο","Media info viewer tool":"Εργαλείο προβολής πληροφοριών μέσων","View replaced file cache":"Προβολή της προσωρινής μνήμης αντικατάστασης αρχείων","Clear replaced file cache":"Καταργήστε την προσωρινή μνήμη cache αρχείων","Save config":"Αποθήκευση ρυθμίσεων","Scan only":"Μόνο σάρωση","Scan and convert":"Σάρωση και μετατροπή","View scan/conversion summary log":"Προβολή αρχείου καταγραφής σύνοψης σάρωσης / μετατροπής","View individual file check/conversion log":"Δείτε το αρχείο ελέγχου επιμέρους αρχείων / μετατροπής","View worker console output":"Προβάλετε την έξοδο της κονσόλας εργασίας","Health check":"Ελεγχος υγείας","Clear healthy file cache":"Καθαρή υγιή προσωρινή μνήμη αρχείων","View error log":"Προβολή αρχείου καταγραφής σφαλμάτων","Email test":"Δοκιμή ηλεκτρονικού ταχυδρομείου","View master log":"Προβολή κύριου αρχείου καταγραφής","Wiki help":"Wiki βοήθεια","An application by HaveAGitGat":"Μια αίτηση από HaveAGitGat","New":"Νέος","Launch":"Εκτόξευση","Benchmark":"Σημείο αναφοράς","See results":"Δείτε τα αποτελέσματα","Pause queue":"Παύση ουράς","Continue queue":"Συνέχεια ουράς","Stop queue":"Διακοπή ουράς","Convert selected files":"Μετατροπή επιλεγμένων αρχείων","Toggle queue view":"Εναλλαγή προβολής ουράς","Deselect all":"Αποεπιλογή όλων","Invert all":"Αναστρέψτε όλα","Select all":"Επιλογή όλων","Toggle output view":"Εναλλαγή προβολής εξόδου"}