{"The number of custom presets does not match the number of source folders!":"La nombro de kutimaj presets ne egalas al la nombro de fontaj dosierujoj!","source folders have been detected.":"fontaj dosierujoj estis detektitaj.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"kutimaj antaŭdifinitaj linioj estis detektitaj. Bonvolu kontroli du por nevideblaj linioj. Devus ekzisti unu dosierujo vojo aŭ antaŭdifinita po linio. Certigu, ke vi ne hazarde kreis malplenan linion.","The number of filename suffixes does not match the number of source folders! ":"La nombro de dosiernaj sufiksoj ne kongruas kun la nombro de fontaj dosierujoj!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"dosiernomaj sufikso linioj estis detektitaj. Bonvolu kontroli du por nevideblaj linioj. Devus esti unu dosierujo aŭ filename sufikso por linio. Certigu, ke vi ne hazarde kreis malplenan linion.","The number of source folders does not match the number of destination folders!":"La nombro de fontaj dosierujoj ne kongruas kun la nombro de destinaj dosierujoj!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"destinaj dosierujoj estis detektitaj. Bonvolu kontroli du por nevideblaj linioj. Devus esti unu dosierujo vojo per linio. Certigu, ke vi ne hazarde kreis malplenan linion.","The number of source folders does not match the number of temporary conversion folders!":"La nombro de fontaj dosierujoj ne kongruas kun la nombro de provizoraj dosierujoj.","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"temporaj konvertaj dosierujoj estis detektitaj. Bonvolu kontroli du por nevideblaj linioj. Devus esti unu dosierujo vojo per linio. Certigu, ke vi ne hazarde kreis malplenan linion.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Bonvolu enigi validan ujon kiel '.mp4'. Certigu, ke vi inkluzivas la '.'","Corrupt file folder":"Koruptigita dosierujo de dosieroj","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ne ekzistas! Bonvolu certigi, ke ne ekzistas spacoj aŭ kaŝitaj karakteroj antaŭ / post la vojo","Source folder":"Fonta dosierujo","Temporary conversion folder":"Intertempa konvertilo dosierujo","appears to be the same as or is within source folder":"ŝajnas esti la sama aŭ ene de fonta dosierujo","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"kiu malebligos funkcii ĝuste HBBatchBeast. Bonvolu ŝanĝi la dosieron de transiga konvertado al dosierujo ekster la fonta dosierujo. Se vi volas uzi la 'Anstataŭigu originalan dosieron', bonvolu elekti celan dosierujon, kiu ne estas la sama kiel, aŭ ene, la fonta dosierujo, kaj poste marku la markoveston 'Anstataŭigi originalajn dosierojn' en la antaŭita agordo. . Malmarku la temporan \"Temporan-konvertan dosierujon\" markobutonon ĉar ĝi ne servos en ĉi tiu kazo. Dosieroj konvertiĝos al la celita dosierujo kaj poste revenos al la fonta dosierujo.","Destination folder":"Celita dosierujo","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"kiu malebligos funkcii ĝuste HBBatchBeast. Bonvolu ŝanĝi la celan dosierujon al dosierujo ekster la fonta dosierujo. Se vi volas uzi la 'Anstataŭigu originalan dosieron', bonvolu elekti celan dosierujon, kiu ne estas la sama kiel, aŭ ene, la fonta dosierujo, kaj poste marku la markoveston 'Anstataŭigi originalajn dosierojn' en la antaŭita agordo. . Malmarku la temporan \"Temporan-konvertan dosierujon\" markobutonon ĉar ĝi ne servos en ĉi tiu kazo. Dosieroj konvertiĝos al la celita dosierujo kaj poste revenos al la fonta dosierujo.","Error creating temporary conversion folder":"Eraro dum kreo de provizora dosierujo","Error creating destination folder":"Eraro kreanta celloko","Please select to use HandBrake or FFmpeg!":"Bonvolu elekti uzi HandBrake aŭ FFmpeg!","Please select a standard preset or input a custom one!":"Bonvolu elekti norman antaŭdifinitan aŭ enmetitan kutimon!","Please select a scan interval of 5 seconds or greater!":"Bonvolu elekti skanan intervalon de 5 sekundoj aŭ pli!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Bonvolu certigi, ke la nombro de samtempaj HandBrake / FFmpeg-petskriboj uzi unu aŭ pli!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Nevalida API-ŝlosilo! Bonvolu alklaki 'Nova' en la fora kontrolfilmo por generi novan ŝlosilon.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Bonvolu enmeti ĉiutagan tempon dum 24-hora formato: hh: mm (ekzemple 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"FONTO Dosieroj estos forigita post konversacio! Bonvolu testi antaŭ konvena uzo!","Benchmark failed!":"Referenca malsukcesis!","Log does not exist!":"La ŝtipo ne ekzistas!","Folder does not exist!":"Dosierujo ne ekzistas!","Error sending email! Please check your settings.":"Eraro sendante retpoŝton! Bonvolu kontroli viajn agordojn.","Test email sent!":"Testo retpoŝto sendita!","All worker processes have been stopped.":"Ĉiuj laboristaj procezoj estas haltigitaj.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Atendovico estos paŭzata post kiam aktualaj eroj finos prilaboradon. Ĉu vi certas, ke vi volas paŭzi la atendovicon?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Komenca paŭzo komenciĝis. Butono 'Daŭrigu' aperos post kiam ĉiuj laboristoj paŭzis.","Healthy file cache cleared!":"Sana dosierujo kaŝita!","Cache cleared!":"Cache malbaris!","Cancel item":"Nuligi eron","Please check the above checkbox to use this feature.":"Bonvolu kontroli la supran markobutonon por uzi ĉi tiun funkcion.","Configuration":"Agordo","Source folders":"Fonto dosierujoj","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Ĉi tiu estas la fonta dosierujo, kiu estos skanita por amaskomunikiloj. La dosierujo devas esti enmetita sen fino. Ekzemple:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"La fonto-vojpeto estas vastiga (premu enen por krei novan linion). Se vi volas specifi plurajn fonto-dosierujojn, certigu, ke ĉiu fonta dosierujo estas sur sia propra linio, ekzemple:","Video health check":"Video-sanigilo","Batch conversion and Folder watching":"Batch konvertiĝo kaj Folder rigardante","Remote Monitoring (Beta)":"Remote Monitoring (Beta)","Benchmark (Beta)":"Referenco (Beta)","System":"Sistemo","Help":"Helpo","Temporary conversion folders":"Intertempaj konvertantaj dosierujoj","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Se \"Intertempa konvertado dosierujo?\" estas markita, tiam HandBrake konvertos dosierojn al tiu dosierujo. Post kiam la konvertiĝo finiĝos, la dosiero moviĝos en vian \"Celita dosierujo\". Vi bezonos specifi tiom da provizoraj dosierujoj kiel fontaj dosieroj. Via unua fonta dosierujo estos transformita en vian unuan provizoran dosierujon por konvertiĝo, vian duan fontan dosierujon en via dua provizora dosierujo kaj tiel plu. Certigu, ke ĉiu portempa konvertanta dosierujo estas sur sia propra linio.","Destination folders":"Destinaj dosierujoj","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Specifu destinajn dosierujajn vojojn. Denove, vi bezonos specifi tiom destinon dosierujojn kiel fonto dosierujoj. Dosieroj de via unua fonta dosierujo finos en via unua celdosierujo, viaj duarĝaj dosierujaj dosieroj en via dua celloko kaj tiel plu.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Unua fonta dosierujo ---------> Unua portempa konvertanta dosierujo ---------> Unua destinta dosierujo","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Dua fonta dosierujo ---------> Dua provizora konvertilo dosierujo ---------> Dua cellokara dosierujo","etc":"ktp","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast ne funkcios ĝuste se vi fiksas la celan dosierujon kiel, aŭ ene, la fonta dosierujo.","Standard preset:":"Norma antaŭdifinita:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Elektu la antaŭtempon HandBrake kun kiu vi volas konverti viajn dosierojn. Se \"Norma malpostagordita\" estas elektita, tiam ĉiuj dosieroj en la elektitaj dosierujoj estos konvertataj per la specifita Handbrake-malpostagordo. Vi povas trovi pli pri Handbrake-presets ĉi tie:","Custom preset:":"Laŭmenda antaŭdifinita:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Se \"Laŭmezure antaŭdifinita\" tiam vi bezonas eniri vian propran preset. HBBatchBeast kovras la \"HandBrakeCLI -i fonto -o-celloko\" parto de la HandBrakeCLI-enigaĵo do vi devas eniri la konvertajn parametrojn. Ekzemple:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Se vi uzas FFmpeg, vi devas apartigi la enigajn kaj elirajn parametrojn per komo. Kiel:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Vi povas ankaŭ ligi al kutimo antaŭdifinita ke estas eksportita de la oficiala HandBrake GUI-aplikaĵo ekzemple:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Se vi havas problemojn kun presetaj preskriboj, ĝi eble ŝajnos al konata cimo kun la HandBrakeCLI (estos riparita en la sekva eldono de HandBrakeCLI). Bonvolu vidi ĉi tion por provizora solvo:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Ĉiu laŭmeta malpostagordo devas esti en sia propra linio kaj, simile al la dosierujoj, devas esti tiom multaj kutimaj agordoj kiel fontaj dosierujoj.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Unua fonta dosierujo ---------> Unua portempa konvertanta dosierujo ---------> Unua cellokopujo @ Laŭmenda antaŭzorgo 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Dua fonta dosierujo ---------> Dua provizora dosierujo de konvertiĝo ---------> Dua cellokara dosierujo @ Laŭmenda antaŭzorgo 2","See the following image for guidance:":"Vidu la sekvan bildon por gvidado:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Se vi uzas grafikajn kartojn (ekzemple NVENC), eble vi bezonos redukti la nombron da Handbrake-kazoj (provu 2 aŭ malpli) pro VRAM-limoj.","Select standard preset:":"Elektu norman antaŭdifinitan:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC eltrovis, bonvolu malpligrandigi la nombron da HandBrakeCLI-okazoj al 2 aŭ malsupre (por la plej multaj grafikaj kartoj) aŭ vi eble trovos erarojn pro ne sufiĉa VRAM. Ĉi tiu agordo troviĝas en la langeto \"Sistemo\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Importita antaŭdifinita detektita.Se vi havas problemojn kun importitaj kutimaj presets, ĝi eble ŝajnos al konata cimo kun la HandBrakeCLI (estos riparita en la sekva HandBrakeCLI-eldono). Provizora solvo estas forigi '\"PictureRotate\": \"0: 0\"' de la .json-dosiero. Pli da informoj ĉi tie:","Container:":"Ujo:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Indiku la ujon, kiun vi volas, ke havu la eliga dosiero kiel '.mp4'. Vi povas ekscii pli pri ujoj ĉe:","Enable periodic scanning:":"Ebligi periodan skanadon:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast povas kontroli viajn fonto-dosierujojn kaj ekzameni skanojn por novaj dosieroj je specifa intervalo. La intertempa tempo estas en sekundoj kun la apriora 300 sekundoj (5 minutoj). Se ĉi tiu opcio estas selektita, tiam kiam vi premos \"Scintigi kaj konverti\", la programo konvertos novajn dosierojn kaj tiam rakontas malantaŭen temporizilo komenciĝos. Ĉi tio buklos senfine ĝis haltis. La skanada intervalo estas en la antaŭita agordo-sekcio.","Enable daily scanning:":"Ebligi ĉiutagan skanadon:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Anstataŭ perioda skanado, vi povas elekti, ke skanado estu prizorgita unufoje tage. La skanado tempo eniras en la antaŭita agorda sekcio en hh: mm formato kiel ekzemple '18: 30'. Post kiam \"Scintigi kaj konverti\" estas elektita, la programo atendos ĝis la specifa tempo ĝis funkciado de skanado kaj konvertiĝo. Denove, ĉi tio funkcios senfine ĝis haltis.","Show/hide advanced:":"Montri / kaŝi antaŭen:","Scan interval (minimum 5 seconds):":"Scan-intervalo (minimumo 5 sekundoj):","Daily run time (hh:mm):":"Ĉiutaga daŭro (hh: mm):","Output filename suffix:":"Sufikso de elŝutita dosiernomo:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Ĉi tio estas nedeviga. Vi povas specifi sufikson aldonitan al la fino de via dosiernomo kiel '_1080p' aŭ '_testconversion' ktp.","If 'standard preset' is selected then all output files will have the same suffix.":"Se 'normala antaŭdifinita' estas elektita tiam ĉiuj produktadaj dosieroj havos la saman sufikson.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Se 'kutimo antaŭdifinita' estas elektita tiam vi povas specifi unu sufikson por fonto dosierujo / kutimo antaŭdifinita. Certigu, ke ĉiu sufikso estas en sia propra linio. Ekzemple, se vi havas 2 fontajn dosierujojn kaj uzas 'kutimon antaŭaranĝojn', vi povus meti tion en la dosiernan sufikson skatolo:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Dosieroj en la unua fonta dosierujo havos '_720p' aldonitan al dosiernomo. Dosieroj en la dua fonto-dosierujo havos '_1080p' aldonitan al eliga dosiernomo, ktp.","Include these file containers:":"Inkluzivi ĉi tiujn dosierujojn:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Eniru la dosierujojn por serĉado. Ĉiu tipo devas esti apartigita per komo. La defaŭlta eniro estas:","Exclude files smaller than (MB):":"Ekskludi dosierojn pli malgrandajn ol (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Indiku ĉu ekskludi dosierojn pli malgrandajn ol certan grandecon de konvertiĝo (en megabajtoj)","Exclude files larger than (MB):":"Ekskludi dosierojn pli grandajn ol (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Indiku ĉu ekskludi dosierojn pli grandajn ol certan grandecon de konvertiĝo (en megabajtoj)","Exclude filenames which include any of these words:":"Ekskludi dosiernomojn, kiuj inkluzivas iun ajn el ĉi tiuj vortoj:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Entajpu ŝlosilvortojn filtrendajn dum skanado de dosieroj. Ekzemple, se \"720p\" eniras, tiam ĉiuj dosieroj kun \"720p\" en la titolo ne estos konvertitaj. Denove, ŝlosilvortoj devas esti apartigitaj per komo. Ekzemple, enigu la sekvan en la skatolo de filtriloj:","Include files with any ":"Inkluzivi dosierojn kun iu ajn"," or all ":"aŭ ĉiuj"," of these":"de ĉi tiuj","properties:":"propraĵoj:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Ĉi tie vi povas enigi vidbendajn kaj sonajn propraĵojn, kiujn dosieroj devas havi por esti konvertitaj (informoj ĉerpitaj per FFprobe). La propraĵoj devas esti apartigitaj per komo. Uzu la ilon por informiloj pri amaskomunikiloj por helpi determini, kio vi volas inkludi. Nepre metu komon post la lasta posedaĵo. Ekzemple, por konverti nur dosierojn koditajn uzante h264 kaj aac-stereodan sonon:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Notindas, ke ĉi tiu posedaĵkontrolo estas farita post kiam la konverta procezo komenciĝas (por ŝpari tempon konstruante la atendovicon), do kvankam dosieroj povas aperi en la konverta atendovico, ili estos ignoritaj se la ĝustaj kondiĉoj estas plenumitaj.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Se FFprobe kapablas ĉerpi propraĵojn, tiam 'OK' aperos en la \"FFprobe\" kolumno en la vida vido.","Exclude files with any ":"Ekskludi dosierojn kun iu ajn"," of these ":"de ĉi tiuj","The opposite of 'Include files with any or all of these properties'":"La malo de 'Inkluzivi dosierojn kun iuj aŭ ĉiuj el ĉi tiuj ecoj'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Ĉi tio estas malgranda ilo por analizi dosierkvalitojn kun por helpi vin determini kiujn proprietojn vi volas inkludi / ekskludi en la supraj opcioj. I uzas FFprobe por resendi informojn. Trenu kaj faligu dosierojn en la grizan skatolon por analizi ilin. Ekzemple, faligi testan dosieron povus redoni la jenajn:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Se vi volas ekskludi ĉi tiajn dosierojn por ne esti konvertita, tiam vi povas meti plurajn dosierajn propraĵojn en la \"Ekskludi dosierojn kun iu aŭ ĉiuj el ĉi tiuj ecoj\" kaj elektu la markobutonon apud \"ĉio\" anstataŭ \"iu\", tiel:","Copy excluded files to destination:":"Kopiu ekskluzivajn dosierojn al celloko:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Se vi elektas ĉi tiun opcion, tiam dosieroj ekskluditaj de konvertiĝo estos kopiitaj rekte al la celdosierujo. Ĉi tio validas por la sekvaj filtriloj:","Exclude filenames which include any of these words":"Ekskludi dosiernomojn, kiuj inkluzivas iun ajn el ĉi tiuj vortoj","Include files with any or all of these properties":"Inkluzivi dosierojn kun iu ajn aŭ ĉiuj ĉi tiuj nemoveblaĵoj","Exclude files with any or all of these properties":"Ekskludi dosierojn kun iu ajn aŭ ĉiuj ĉi tiuj nemoveblaĵoj","Exclude files smaller than (MB)":"Ekskludi dosierojn pli malgrandajn ol (MB)","Exclude files larger than (MB)":"Ekskludi dosierojn pli grandajn ol (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Notu, ke ĉi tio validas ankaŭ por dosieroj ekskluditaj ĉar ili ne plenumas la kondiĉojn de \"Inkluzivi\" propraĵojn de la supre menciitaj, do ne hazarde kopiu vi estas tuta biblioteko kiam vi nur provas konverti kelkajn dosierojn.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"La kopia trajto ne aplikiĝas al la sekvaj filtriloj (te dosieroj ekskluditaj pro la filtrilo)","Include these file types":"Inkluzivi ĉi tiujn dosiertipojn","Delete source files after conversion:":"Forigi fontdosierojn post konvertiĝo:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Se ĉi tiu estas elektita, tiam se konverta provo sukcesos, la fonta dosiero estos forigita. Ĉi tiu procezo estas farita ĉe la fino, post konvertiĝo de ĉiuj dosieroj. Ĉi tio signifas, ke vi povas konverti la samajn fontdosierojn uzante plurajn antaŭdifinitajn presets, ĉiuj samtempe. La fontaj dosieroj poste estos forigitaj.","Replace original file if converted file is smaller?(Compress attempt)":"Anstataŭigi originalan dosieron se konvertita dosiero estas pli malgranda?","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Elektu ĉi tiun markobutonon, se vi volas, ke HBBatchBeast aŭtomate anstataŭigas la originalan fontdosieron se la nova dosiero estas pli malgranda. Se la nova dosiero ne estas pli malgranda, tiam ĝi restos en la celdosierujo.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Certigu, ke via celdosierujo ne estas la sama kiel / aŭ ene, via fonta dosierujo aŭ ĝi ne funkcios ĝuste.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Post kiam HBBatchBeast provis kunpremi specifan dosieron, ĝi aldonos tiun dosieron-vojon al kaŝmemoro tiel ke ĝi ne denove estos provita. Vi povas vidi / redakti / forviŝi la kaŝmemoron uzante la flavajn butonojn.","Replace original file always?":"Anstataŭigi la originalan dosieron ĉiam?","The original file will be replaced regardless of whether the new file is larger or smaller.":"La origina dosiero estos anstataŭigita, sendepende de ĉu la nova dosiero estas pli granda aŭ pli malgranda.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Denove, certigu, ke via celloko estas ne la sama kiel / aŭ ene, via fonta dosierujo aŭ ĝi ne funkcios ĝuste.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Post kiam HBBatchBeast transkodis specifan dosieron, ĝi aldonos tiun dosier-vojon al kaŝmemoro tiel ke ĝi ne denove estos provita. Vi povas vidi / redakti / forviŝi la kaŝmemoron uzante la flavajn butonojn.","Copy subtitle (srt) files to destination?":"Kopiu dosierojn de subtitoloj (srt) al destino?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Dosieroj de subtitoloj '.srt' estos kopiitaj aŭtomate al la celdosierujo.","Automatically create temporary/destination folders if they don't exist?":"Aŭtomate kreas provizorajn / destinajn dosierujojn se ili ne ekzistas?","Custom bat path to run after each conversion (leave blank if not using):":"Laŭmenda veturila vojo por kuri post ĉiu konvertiĝo (lasu malplenan se vi ne uzas):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Enigu la vojon al kutima dosiero kiun vi volas plenumi post ĉiu konvertiĝo. Ekzemple:","Batch files with timeout statements won't work. More info here:":"Batch-dosieroj kun tempomalendaj deklaroj ne funkcios. Pli da informoj ĉi tie:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Lasu skatolon tute malplena se vi ne volas uzi ĉi tiun opcion (certigu, ke ne estas kaŝitaj signoj en la kesto)","Run processes at low priority?":"Kreu procezojn kun malalta prioritato?","All conversion processes will be run at low priority, reducing processor usage.":"Ĉiuj konvertaj procezoj funkcios je malalta prioritato, reduktante procesoran uzadon.","Remove apostrophes from filenames:":"Forigi apostrofojn de dosiernomoj:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Konvertadoj / san-kontrolaj esploroj eble malsukcesos se dosiernomoj havas apostrofojn. Enŝaltu ĉi tion por aŭtomate forigi apostrofojn de dosiernomoj."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Ĉi tiu funkcio povas serĉi difektitajn videajn dosierojn per la funkcio '--scan' de HandBrake, kvankam ĉi tio ne ĉiam estas preciza. I ankaŭ uzas FFprobe por provizi duan referencan punkton. Se FFprobe kaj HandBrake malsukcesas, estas granda ŝanco, ke la dosiero estas korupta.","Move corrupt files into the following folder:":"Movu difektitajn dosierojn en la sekvan dosierujon:"," If checked, then any files which give errors will be moved into the specified folder.":"Se markita, tiam ĉiuj dosieroj kun eraroj estos movitaj en la specifitan dosierujon.","Corrupt file folder:":"Koruptigita dosierujo de dosieroj:","Run thorough file health check:":"Kuru ĝisdatigitan kontrolekziston:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Se markita, tiam multe pli malrapida, pli funda video-kontrolilo estos uzata per FFmpeg anstataŭ HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Surbaze de \"ScanMedia.ps1\" de Desani trovita ĉe:","Attempt to repair files after thorough check:":"Provi ripari dosierojn post ĝisfunda kontrolo:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Se markita, HBBatchBeast provos ripari dosierojn per FFmpeg. Nova dosiero kun la sufikso '_repaired' estos kreita en la sama dosierujo kiel la fontdosiero.","'CRF' value to use when attempting to repair files:":"Valoro 'CRF' uzenda dum provado ripari dosierojn:","The default 'CRF' value is 23. Please see the following for more information:":"La apriora 'CRF' valoro estas 23. Bonvolu vidi la jenajn por pli da informoj:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"La teritorio de la CRF-skalo estas 0–51, kie 0 estas senenigita, 23 estas la defaŭlta, kaj 51 estas la plej malbona kvalito ebla. Pli malalta valoro ĝenerale kondukas al pli alta kvalito, kaj subjekteme mense sana estas 17-28. Konsideru 17 aŭ 18 esti vide senigitaj aŭ preskaŭ tiel; ĝi devas aspekti egale aŭ preskaŭ la sama kiel la enigo, sed ĝi ne estas teknike senigita.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast konservas liston de skanitaj dosieraj vojoj raportitaj kiel senkoruptaj. Forigu la kaŝmemoron por fari novan skanadon en ĉiuj dosieroj.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Nombro de samtempaj okazoj pri FRAFRAJ / FFAMPEG uzataj? (Rekomendita 4 aŭ malpli):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Ĉi tiu agordo validas por la procezoj \"Videa sankontrolo\" kaj \"Skanu kaj konverti\". Specifu kiom da HandBrake-fadenoj uzi. Ne estas maksimumo kvankam estas rekomendita ne uzi pli ol 4. Pli alta kvanto povas frostigi vian komputilon se ĝi ne estas tre potenca.","Queue size view limit?(Recommended 1000 or fewer):":"Limo de vido de atendovojo? (Rekomendita 1000 aŭ malpli):","Automatically start \"Scan and convert\" when program opened?:":"Aŭtomate starti \"Skanu kaj konvertiĝu\" kiam programo malfermiĝis?","Save verbose logs?:":"Konservi detalajn protokolojn:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Marku ĉi tiun markobutonon por konservi detalajn sub-procezajn registrojn. Ĉi tio inkluzivas la eligo de laborista konzolo. Ĉi tio kaŭzos tre grandajn ŝtipojn.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Plenigu retpoŝtajn detalojn por ricevi retpoŝtajn sciigojn, se troviĝas eraro dum sankontrolo aŭ konvertado / dosierujo rigardante. Ne funkcios kun kontoj, kiuj bezonas 2FA. Vi devas ebligi aliron al malpli sekuraj programoj en kontoj de Gmail.","Email address:":"Retpoŝta adreso:","For example:":"Ekzemple:","Email password(not saved):":"Retpoŝta pasvorto (ne konservita):","SMTP server:":"SMTP-servilo:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Ĉi tiu funkcio permesas monitoradon de la stato de konvertiĝo / sano per ajna ret-foliumilo. Utila kiam vi funkciigas servilojn ktp Neniuj dosiernomoj estas senditaj.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Se ŝaltita, la sekvaj anonimaj datumoj estos sendataj al HBBatchBeast.io:","API key":"API-ŝlosilo","Current status ('Searching', 'Running', 'Finished' etc)":"Nuna stato ('Serĉado', 'Kuri', 'Finita' ktp)","Number of:":"Nombro de:","Remaining items":"Restaĵoj","Successful items":"Sukcesaj aĵoj","Errored items":"Eraritaj artikoloj","Cancelled items":"Nuligitaj eroj","Worker percentages":"Procentoj de laboristoj","Last completed item time":"Lasta kompletigita tempo-tempo","Enable remote monitoring?:":"Ĉu ebligi foran monitoradon?","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Baza benchmarking-ilo konstruis ĉefe por vidi kiel 16+ kernaj procesoroj plenumas uzante plurajn HandBrake-okazojn kvankam ĝi povas esti prizorgita sur ajna speco de procesoro.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Ĉi tio elŝutos specimenan dosieron h265 4k (2.5MB) kaj uzos 4-indicon per 4 HandBrake-okazoj kun antaŭaranĝoj \"Tre Rapida 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Rezultoj povas esti alŝutitaj al hbbatchbeast.io se vi elektas.","Queue":"Atendovico","Output this session":"Eligu ĉi tiun sesion","Media info viewer tool":"Agordoj pri amaskomunikila informo","View replaced file cache":"Vidi anstataŭigitan dosierujon","Clear replaced file cache":"Klara anstataŭaĵa dosiero kaŝmemoro","Save config":"Konservu agordon","Scan only":"Skanu nur","Scan and convert":"Skanu kaj konvertu","View scan/conversion summary log":"Vidi skanadon / konvertiĝon resuman protokolon","View individual file check/conversion log":"Rigardu individuan dosieron ĉeko / konvertiĝo","View worker console output":"Vidi laboristan konzolon produkton","Health check":"Sanintkontrolo","Clear healthy file cache":"Ŝlosi sanan dosierujon","View error log":"Rigardu erarmarkon","Email test":"Retpoŝta testo","View master log":"Rigardu majstran taglibron","Wiki help":"Vikio-helpo","An application by HaveAGitGat":"Apliko de HaveAGitGat","New":"Nova","Launch":"Lanĉo","Benchmark":"Referenco","See results":"Vidu rezultojn","Pause queue":"Paŭzi voston","Continue queue":"Daŭrigu atendovicon","Stop queue":"Ĉesigu atendovicon","Convert selected files":"Konverti elektitajn dosierojn","Toggle queue view":"Ŝaltu atendovojo","Deselect all":"Malelekti ĉiujn","Invert all":"Inversigu ĉiujn","Select all":"Elekti ĉiujn","Toggle output view":"Baskuli eligan vidpunkton"}