{
    "The number of custom presets does not match the number of source folders!": "El número de ajustes preestablecidos personalizados no coincide con el número de carpetas de origen!",
    "source folders have been detected.": "Se han detectado carpetas de origen.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "Se han detectado líneas predefinidas personalizadas. Por favor, compruebe si hay saltos de línea invisibles. Debe haber una ruta de carpeta o preset por línea. Asegúrese de no haber creado accidentalmente una línea en blanco.",
    "The number of filename suffixes does not match the number of source folders! ": "¡El número de sufijos de nombre de archivo no coincide con el número de carpetas de origen!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "Se han detectado líneas de sufijo de nombre de archivo. Por favor, compruebe si hay saltos de línea invisibles. Debe haber una ruta de carpeta o un sufijo de nombre de archivo por línea. Asegúrese de no haber creado accidentalmente una línea en blanco.",
    "The number of source folders does not match the number of destination folders!": "¡El número de carpetas de origen no coincide con el número de carpetas de destino!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "Se han detectado carpetas de destino. Por favor, compruebe si hay saltos de línea invisibles. Debe haber una ruta de carpeta por línea. Asegúrese de no haber creado accidentalmente una línea en blanco.",
    "The number of source folders does not match the number of temporary conversion folders!": "¡El número de carpetas de origen no coincide con el número de carpetas de conversión temporales!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "Se han detectado carpetas de conversión temporales. Por favor, compruebe si hay saltos de línea invisibles. Debe haber una ruta de carpeta por línea. Asegúrese de no haber creado accidentalmente una línea en blanco.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Por favor ingrese un contenedor válido como '.mp4'. Asegúrate de incluir el '.'",
    "Corrupt file folder": "Carpeta de archivos corruptos",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "¡no existe! Asegúrese de que no haya espacios ni caracteres ocultos antes / después de la ruta",
    "Source folder": "Carpeta de origen",
    "Temporary conversion folder": "Carpeta de conversión temporal",
    "appears to be the same as or is within source folder": "parece ser el mismo o está dentro de la carpeta de origen",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "lo que evitará que HBBatchBeast funcione correctamente. Cambie la carpeta de conversión temporal a una carpeta fuera de la carpeta de origen. Si desea utilizar la función \"Reemplazar archivos originales\", seleccione una carpeta de destino que no sea la misma que en la carpeta de origen, y luego marque la casilla de verificación \"Reemplazar archivos originales\" en la sección de configuración avanzada . Desmarque la casilla de verificación temporal 'Carpeta de conversión temporal' ya que no servirá de nada en este caso. Los archivos se convertirán en la carpeta de destino y luego se moverán de nuevo a la carpeta de origen.",
    "Destination folder": "Carpeta de destino",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "lo que evitará que HBBatchBeast funcione correctamente. Cambie la carpeta de destino a una carpeta fuera de la carpeta de origen. Si desea utilizar la función \"Reemplazar archivos originales\", seleccione una carpeta de destino que no sea la misma que en la carpeta de origen, y luego marque la casilla de verificación \"Reemplazar archivos originales\" en la sección de configuración avanzada . Desmarque la casilla de verificación temporal 'Carpeta de conversión temporal' ya que no servirá de nada en este caso. Los archivos se convertirán en la carpeta de destino y luego se moverán de nuevo a la carpeta de origen.",
    "Error creating temporary conversion folder": "Error al crear la carpeta de conversión temporal",
    "Error creating destination folder": "Error al crear la carpeta de destino",
    "Please select to use HandBrake or FFmpeg!": "Por favor, seleccione utilizar HandBrake o FFmpeg!",
    "Please select a standard preset or input a custom one!": "Por favor, seleccione un preset estándar o ingrese uno personalizado!",
    "Please select a scan interval of 5 seconds or greater!": "Por favor, seleccione un intervalo de escaneo de 5 segundos o más!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "¡Asegúrese de que la cantidad de instancias simultáneas de HandBrake / FFmpeg que se usen sea una o más!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Clave de API inválida! Haga clic en 'Nuevo' en la pestaña de monitoreo remoto para generar una nueva clave.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Ingrese una hora de escaneo diaria en formato de 24 horas: hh: mm (por ejemplo, 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "LOS ARCHIVOS DE FUENTES SE BORRARÁN DESPUÉS DE LA CONVERSIÓN! Por favor, prueba antes de su uso adecuado!",
    "Benchmark failed!": "¡El punto de referencia falló!",
    "Log does not exist!": "¡El registro no existe!",
    "Folder does not exist!": "¡La carpeta no existe!",
    "Error sending email! Please check your settings.": "¡Error al enviar el correo! Por favor, compruebe su configuración.",
    "Test email sent!": "Correo electrónico de prueba enviado!",
    "All worker processes have been stopped.": "Todos los procesos de trabajo han sido detenidos.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "La cola se pausará una vez que los elementos actuales hayan terminado de procesarse. ¿Estás seguro de que quieres pausar la cola?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Se inició la pausa en la cola. El botón \"Continuar\" aparecerá una vez que todos los trabajadores hayan hecho una pausa.",
    "Healthy file cache cleared!": "Caché de archivo saludable borrado!",
    "Cache cleared!": "Caché borrado!",
    "Cancel item": "Cancelar artículo",
    "Please check the above checkbox to use this feature.": "Por favor, marque la casilla de verificación anterior para utilizar esta función.",
    "Configuration": "Configuración",
    "Source folders": "Carpetas de origen",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Esta es la carpeta de origen que se analizará en busca de medios. La carpeta debe ingresarse sin una barra diagonal. Por ejemplo:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "El cuadro de ruta de la carpeta de origen es expandible (presione Intro para crear una nueva línea). Si desea especificar varias carpetas de origen, asegúrese de que cada ruta de la carpeta de origen esté en su propia línea, como por ejemplo:",
    "Video health check": "Video chequeo de salud",
    "Batch conversion and Folder watching": "Conversión por lotes y visualización de carpetas",
    "Remote Monitoring (Beta)": "Monitoreo remoto (Beta)",
    "Benchmark (Beta)": "Punto de referencia (Beta)",
    "System": "Sistema",
    "Help": "Ayuda",
    "Temporary conversion folders": "Carpetas de conversión temporal",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Si \"Carpeta de conversión temporal?\" está marcado, luego HandBrake convertirá los archivos en esa carpeta. Una vez finalizada la conversión, el archivo se moverá a su \"Carpeta de destino\". Deberá especificar tantas carpetas de conversión temporales como carpetas de origen. Su primera carpeta de origen se convertirá en su primera carpeta de conversión temporal, su segunda carpeta de origen en su segunda carpeta de conversión temporal y así sucesivamente. Asegúrese de que cada ruta de la carpeta de conversión temporal esté en su propia línea.",
    "Destination folders": "Carpetas de destino",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Especifique las rutas de la carpeta de destino. De nuevo, deberá especificar tantas carpetas de destino como carpetas de origen. Los archivos de su primera carpeta de origen terminarán en su primera carpeta de destino, su segunda carpeta de origen en su segunda carpeta de destino y así sucesivamente.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Primera carpeta de origen ---------> Primera carpeta de conversión temporal ---------> Primera carpeta de destino",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Segunda carpeta de origen ---------> Segunda carpeta de conversión temporal ---------> Segunda carpeta de destino",
    "etc": "etc",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast no funcionará correctamente si configura la carpeta de destino igual o dentro de la carpeta de origen.",
    "Standard preset:": "Preset estándar:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Seleccione el ajuste preestablecido de HandBrake con el que desea convertir sus archivos. Si se selecciona \"Preset estándar\", todos los archivos en las carpetas seleccionadas se convertirán usando el preset de freno de mano especificado. Puede encontrar más información sobre los ajustes predefinidos de HandBrake aquí:",
    "Custom preset:": "Preset personalizado:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Si \"Preset personalizado\", debe ingresar su propio ajuste preestablecido personalizado. HBBatchBeast cubre la parte \"HandBrakeCLI -i source -o destination\" de la entrada HandBrakeCLI, por lo que debe ingresar los parámetros de conversión. Por ejemplo:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Si usa FFmpeg, debe separar los parámetros de entrada y salida con una coma. Como:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "También puede vincular a un ajuste preestablecido personalizado que se haya exportado desde la aplicación GUI oficial de HandBrake por ejemplo:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Si tiene problemas con los ajustes preestablecidos personalizados, puede deberse a un error conocido con HandBrakeCLI (se solucionará en la próxima versión de HandBrakeCLI). Por favor vea esto para una solución temporal:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Cada ajuste preestablecido personalizado debe estar en su propia línea y, al igual que en las carpetas, debe haber tantos ajustes preestablecidos personalizados como las carpetas de origen.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Primera carpeta de origen ---------> Primera carpeta de conversión temporal ---------> Primera carpeta de destino @ Preset personalizado 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Segunda carpeta de origen ---------> Segunda carpeta de conversión temporal ---------> Segunda carpeta de destino @ Preselección personalizada 2",
    "See the following image for guidance:": "Vea la siguiente imagen para orientación:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Si utiliza la codificación de la tarjeta gráfica (como NVENC), es posible que deba reducir el número de instancias de HandBrake (intente 2 o menos) debido a las limitaciones de VRAM.",
    "Select standard preset:": "Seleccione preajuste estándar:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC detectada, asegúrese de reducir el número de instancias de HandBrakeCLI a 2 o menos (para la mayoría de las tarjetas gráficas) o puede encontrar errores debido a que no hay suficiente VRAM. Esta configuración se puede encontrar en la pestaña \"Sistema\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Se detectó un preajuste importado. Si tiene problemas con los preajustes personalizados importados, puede deberse a un error conocido con el HandBrakeCLI (se solucionará en la próxima versión de HandBrakeCLI). Una solución temporal es eliminar '\"PictureRotate\": \"0: 0\"' del archivo .json. Más información aquí:",
    "Container:": "Envase:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Especifique el contenedor que desea que tenga el archivo de salida, como '.mp4'. Puede encontrar más información sobre los contenedores en:",
    "Enable periodic scanning:": "Habilitar la exploración periódica:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast puede monitorear sus carpetas de origen y ejecutar escaneos para nuevos archivos en un intervalo específico. El intervalo de tiempo es en segundos y el valor predeterminado es 300 segundos (5 minutos). Si se selecciona esta opción, cuando presione \"Escanear y convertir\", el programa convertirá los archivos nuevos y comenzará un contador de cuenta regresiva. Esto se repetirá infinitamente hasta que pare El intervalo de exploración está en la sección de configuración avanzada.",
    "Enable daily scanning:": "Habilitar el escaneo diario:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "En lugar de la exploración periódica, puede elegir que una exploración se ejecute una vez al día. El tiempo de escaneo se ingresa en la sección de configuración avanzada en formato hh: mm como '18: 30 '. Una vez que se selecciona \"Escanear y convertir\", el programa esperará hasta el tiempo especificado hasta que se ejecute un proceso de escaneo y conversión. De nuevo, esto se repetirá infinitamente hasta que se detenga.",
    "Show/hide advanced:": "Mostrar / ocultar avanzado:",
    "Scan interval (minimum 5 seconds):": "Intervalo de escaneo (mínimo 5 segundos):",
    "Daily run time (hh:mm):": "Tiempo de ejecución diario (hh: mm):",
    "Output filename suffix:": "Sufijo de nombre de archivo de salida:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Esto es opcional. Puede especificar un sufijo para agregar al final de su nombre de archivo como '_1080p' o '_testconversion', etc.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Si se selecciona 'preset estándar', todos los archivos de salida tendrán el mismo sufijo.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Si se selecciona 'preset personalizado', puede especificar un sufijo por carpeta de origen / preset personalizado. Asegúrese de que cada sufijo esté en su propia línea. Por ejemplo, si tiene 2 carpetas de origen y está usando 'ajuste preestablecido personalizado', puede poner esto en el cuadro de sufijo de nombre de archivo:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Los archivos en la carpeta de la primera fuente tendrán '_720p' agregado a la salida del nombre de archivo. Los archivos en la segunda carpeta de origen tendrán '_1080p' agregado al archivo de salida, etc.",
    "Include these file types:": "Incluir estos tipos de archivos:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Ingrese los tipos de archivo para buscar. Cada tipo debe estar separado por una coma. La entrada por defecto es:",
    "Exclude files smaller than (MB):": "Excluir archivos más pequeños que (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Especifique si se excluyen de la conversión los archivos más pequeños que un tamaño determinado en megabytes",
    "Exclude files larger than (MB):": "Excluir archivos más grandes que (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Especifique si se excluyen de la conversión los archivos de tamaño superior a un tamaño determinado (en megabytes)",
    "Exclude filenames which include any of these words:": "Excluye los nombres de archivo que incluyan cualquiera de estas palabras:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Introduzca las palabras clave que se filtrarán al escanear los archivos. Por ejemplo, si se ingresa \"720p\", los archivos con \"720p\" en el título no se convertirán. Una vez más, las palabras clave deben estar separadas por una coma. Por ejemplo, ingrese lo siguiente en el cuadro de filtro:",
    "Include files with any ": "Incluir archivos con cualquier",
    " or all ": "o todo",
    " of these": "de estos",
    "properties:": "propiedades:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Aquí puede ingresar las propiedades de video y audio que los archivos deben tener para poder ser convertidos (información extraída usando FFprobe). Las propiedades deben estar separadas por una coma. Use la herramienta del visor de información de medios para ayudar a determinar qué propiedades le gustaría incluir. Asegúrate de poner una coma después de la última propiedad. Por ejemplo, para convertir solo los archivos que están codificados con audio estéreo h264 y aac:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Vale la pena tener en cuenta que esta verificación de propiedades se realiza una vez que se inicia el proceso de conversión (para ahorrar tiempo al crear la cola), por lo que aunque los archivos pueden aparecer en la cola de conversión, se omitirán / incluirán si se cumplen las condiciones correctas.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Si FFprobe puede extraer propiedades, aparecerá un 'Aceptar' en la columna \"FFprobe\" en la vista de cola.",
    "Exclude files with any ": "Excluir archivos con cualquier",
    " of these ": "de estos",
    "The opposite of 'Include files with any or all of these properties'": "El opuesto a 'Incluir archivos con alguna o todas estas propiedades'",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Esta es una pequeña herramienta para analizar las propiedades de los archivos con el fin de ayudarlo a determinar qué propiedades le gustaría incluir / excluir en las opciones anteriores. Utiliza FFprobe para devolver información. Arrastre y suelte los archivos en el cuadro gris para analizarlos. Por ejemplo, soltar un archivo de prueba puede devolver lo siguiente:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Si desea excluir la conversión de archivos como este, puede colocar varias propiedades de archivo en el cuadro \"Excluir archivos con alguna o todas estas propiedades\" y marcar la casilla de verificación junto a \"todos\" en lugar de \"cualquiera\", al igual que:",
    "Copy excluded files to destination:": "Copie los archivos excluidos al destino:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Si selecciona esta opción, los archivos excluidos de la conversión se copiarán directamente en la carpeta de destino. Esto se aplica a los siguientes filtros:",
    "Exclude filenames which include any of these words": "Excluir nombres de archivos que incluyan cualquiera de estas palabras",
    "Include files with any or all of these properties": "Incluir archivos con alguna o todas estas propiedades",
    "Exclude files with any or all of these properties": "Excluir archivos con alguna o todas estas propiedades",
    "Exclude files smaller than (MB)": "Excluir archivos más pequeños que (MB)",
    "Exclude files larger than (MB)": "Excluir archivos más grandes que (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Tenga en cuenta que esto también se aplica a los archivos excluidos porque no cumplen con las condiciones de propiedad \"Incluir\" de las anteriores, así que no copie accidentalmente su biblioteca completa cuando solo está intentando convertir algunos archivos.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "La función de copia no se aplica a los siguientes filtros (es decir, archivos excluidos debido al filtro)",
    "Include these file types": "Incluir estos tipos de archivos",
    "Delete source files after conversion:": "Eliminar archivos de origen después de la conversión:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Si se selecciona, entonces, si un intento de conversión tiene éxito, el archivo de origen se eliminará. Este proceso se realiza al final, después de la conversión de todos los archivos. Esto significa que puede convertir los mismos archivos de origen utilizando varios ajustes preestablecidos, todo de una vez. Los archivos de origen se eliminarán posteriormente.",
    "Replace original file if converted file is smaller?(Compress attempt)": "¿Reemplazar el archivo original si el archivo convertido es más pequeño? (Intento de compresión)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Seleccione esta casilla de verificación si desea que HBBatchBeast reemplace automáticamente el archivo fuente original si el archivo nuevo es más pequeño. Si el nuevo archivo no es más pequeño, se dejará en la carpeta de destino.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Asegúrese de que su carpeta de destino no sea la misma que en su carpeta de origen o que no funcione correctamente.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Una vez que HBBatchBeast haya intentado comprimir un archivo específico, agregará esa ruta de archivo a una memoria caché para que no se vuelva a intentar en el futuro. Puede ver / editar / borrar el caché usando los botones amarillos.",
    "Replace original file always?": "¿Reemplazar archivo original siempre?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "El archivo original se reemplazará independientemente de si el nuevo archivo es más grande o más pequeño.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Nuevamente, asegúrese de que su carpeta de destino no sea la misma que en su carpeta de origen o que no funcione correctamente.",
    "Copy subtitle (srt) files to destination?": "¿Copiar archivos de subtítulos (srt) a destino?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Los archivos de subtítulos '.srt' se copiarán a la carpeta de destino automáticamente.",
    "Automatically create temporary/destination folders if they don't exist?": "¿Crear automáticamente carpetas temporales / de destino si no existen?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Ruta de murciélago personalizada para ejecutar después de cada conversión (déjela en blanco si no la usa):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Ingrese la ruta a un archivo por lotes personalizado que le gustaría ejecutar después de cada conversión. Por ejemplo:",
    "Batch files with timeout statements won't work. More info here:": "Los archivos por lotes con declaraciones de tiempo de espera no funcionarán. Más información aquí:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Deje el cuadro completamente vacío si no desea usar esta opción (asegúrese de que no haya caracteres ocultos en el cuadro)",
    "Run processes at low priority?": "Ejecutar procesos con baja prioridad?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Todos los procesos de conversión se ejecutarán con baja prioridad, reduciendo el uso del procesador.",
    "Remove apostrophes from filenames:": "Eliminar apóstrofes de los nombres de archivo:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Los análisis de conversiones / chequeo de salud pueden fallar si los nombres de los archivos tienen apóstrofes. Marque esto para eliminar automáticamente los apóstrofes de los nombres de archivos.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Esta función puede buscar archivos de video corruptos utilizando la función '--scan' de HandBrake, aunque esto no siempre es preciso. También utiliza FFprobe para proporcionar un segundo punto de referencia. Si tanto FFprobe como HandBrake fallan, existe una alta probabilidad de que el archivo esté dañado.",
    "Move corrupt files into the following folder:": "Mueva los archivos corruptos a la siguiente carpeta:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Si está marcado, cualquier archivo que dé errores se moverá a la carpeta especificada.",
    "Corrupt file folder:": "Carpeta de archivos corruptos:",
    "Run thorough file health check:": "Ejecutar un chequeo completo del estado del archivo:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Si se marca, se ejecutará una comprobación de estado de video mucho más lenta y exhaustiva con FFmpeg en lugar de HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Basado en el 'ScanMedia.ps1' de Desani encontrado en:",
    "Attempt to repair files after thorough check:": "Intente reparar los archivos después de un control completo:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Si se marca, HBBatchBeast intentará reparar archivos usando FFmpeg. Se creará un nuevo archivo con el sufijo '_repaired' en la misma carpeta que el archivo de origen.",
    "'CRF' value to use when attempting to repair files:": "Valor 'CRF' para usar al intentar reparar archivos:",
    "The default 'CRF' value is 23. Please see the following for more information:": "El valor predeterminado de 'CRF' es 23. Consulte la siguiente información para obtener más información:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "El rango de la escala CRF es 0–51, donde 0 no tiene pérdidas, 23 es el valor predeterminado y 51 es la peor calidad posible. Un valor más bajo generalmente conduce a una calidad más alta, y un rango subjetivamente sano es de 17-28. Considera que 17 o 18 son visualmente sin pérdida o casi así; debería verse igual o casi igual a la entrada pero no es técnicamente sin pérdidas.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast guarda una lista de rutas de archivo escaneadas reportadas como no corruptas. Borre la memoria caché para realizar un nuevo análisis en todos los archivos.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Número de instancias simultáneas de HandBrake / FFmpeg para usar? (Recomendado 4 o menos):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Esta configuración se aplica tanto a los procesos de \"Comprobación de estado del video\" como a \"Explorar y convertir\". Especifique cuántos hilos de HandBrake utilizar. No hay un máximo, aunque se recomienda no usar más de 4. Una cantidad mayor puede congelar su computadora si no es muy potente.",
    "Queue size view limit?(Recommended 1000 or fewer):": "¿Límite de la vista del tamaño de la cola? (Recomendado 1000 o menos):",
    "Automatically start \"Scan and convert\" when program opened?": "¿Iniciar automáticamente \"Escanear y convertir\" cuando se abre el programa?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Complete los detalles del correo electrónico para recibir notificaciones por correo electrónico si se encuentra un error durante una verificación de estado o una conversión / visualización de carpeta. No funciona con cuentas que requieren 2FA. Debe habilitar el acceso a aplicaciones menos seguras en las cuentas de Gmail.",
    "Email address:": "Dirección de correo electrónico:",
    "For example:": "Por ejemplo:",
    "Email password(not saved):": "Contraseña de correo electrónico (no guardado):",
    "SMTP server:": "Servidor SMTP:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Esta función permite monitorear el estado de la conversión / comprobación de estado usando cualquier navegador web. Útil para ejecutar servidores, etc.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Si está habilitado, los siguientes datos anónimos se enviarán a HBBatchBeast.io:",
    "API key": "Clave API",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Estado actual ('Buscando', 'En ejecución', 'Finalizado', etc.)",
    "Number of:": "Número de:",
    "Remaining items": "Objetos restantes",
    "Successful items": "Artículos exitosos",
    "Errored items": "Artículos errados",
    "Cancelled items": "Artículos cancelados",
    "Worker percentages": "Porcentajes de trabajador",
    "Last completed item time": "Último artículo completado",
    "Enable remote monitoring?:": "¿Habilitar monitoreo remoto ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Una utilidad básica de evaluación comparativa creada principalmente para ver cómo se desempeñan más de 16 procesadores centrales utilizando múltiples instancias de HandBrake, aunque puede ejecutarse en cualquier tipo de procesador.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Esto descargará un archivo de muestra h265 4k (2.5MB) y ejecutará un punto de referencia utilizando 4 instancias de HandBrake con el ajuste preestablecido \"Muy rápido 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Los resultados se pueden cargar en hbbatchbeast.io si lo desea.",
    "Queue": "Cola",
    "Output this session": "Salida de esta sesión",
    "Media info viewer tool": "Herramienta de visor de información de medios",
    "View compress attempt cache": "Ver el intento de comprimir caché",
    "Clear compress attempt cache": "Borrar el intento de comprimir caché",
    "Save config": "Guardar config",
    "Scan only": "Solo escanear",
    "Scan and convert": "Escanear y convertir",
    "View scan/conversion summary log": "Ver registro de resumen de escaneo / conversión",
    "View individual file check/conversion log": "Ver archivo individual de verificación / registro de conversión",
    "View worker console output": "Ver la salida de la consola de trabajo",
    "Health check": "Chequeo de salud",
    "Clear healthy file cache": "Borrar caché de archivos saludables",
    "View error log": "Ver registro de errores",
    "Email test": "Prueba de correo electrónico",
    "View master log": "Ver registro maestro",
    "Wiki help": "Ayuda de wiki",
    "An application by HaveAGitGat": "Una aplicación por HaveAGitGat",
    "New": "Nuevo",
    "Launch": "Lanzamiento",
    "Benchmark": "Punto de referencia",
    "See results": "Ver resultados",
    "Pause queue": "Hacer una pausa en la cola",
    "Continue queue": "Continuar cola",
    "Stop queue": "Detener la cola",
    "Convert selected files": "Convertir archivos seleccionados",
    "Toggle queue view": "Alternar vista de cola",
    "Deselect all": "Deseleccionar todo",
    "Invert all": "Invertir todo",
    "Select all": "Seleccionar todo",
    "Toggle output view": "Alternar vista de salida"
}