{"The number of custom presets does not match the number of source folders!":"Kohandatud eelseadete arv ei vasta allika kaustade arvule!","source folders have been detected.":"allika kaustad on avastatud.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"on tuvastatud kohandatud eelseatud read. Kontrollige, kas nähtamatu reavahetusi ei ole. Iga rida kohta peaks olema üks kausta tee või eelseadistatud. Veenduge, et te pole kogemata tühja rida.","The number of filename suffixes does not match the number of source folders! ":"Failinime sufikside arv ei vasta allika kaustade arvule!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"tuvastatud failinime sufiksi read. Kontrollige, kas nähtamatu reavahetusi ei ole. Iga rea kohta peaks olema üks kausta tee või failinime sufiks. Veenduge, et te pole kogemata tühja rida.","The number of source folders does not match the number of destination folders!":"Allika kaustade arv ei vasta sihtkaustade arvule!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"sihtkoha kaustad on avastatud. Kontrollige, kas nähtamatu reavahetusi ei ole. Iga rea kohta peaks olema üks kaustatee. Veenduge, et te pole kogemata tühja rida.","The number of source folders does not match the number of temporary conversion folders!":"Allika kaustade arv ei vasta ajutiste konversioonikaustade arvule!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"ajutised konversioonikaustad on avastatud. Kontrollige, kas nähtamatu reavahetusi ei ole. Iga rea kohta peaks olema üks kaustatee. Veenduge, et te pole kogemata tühja rida.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Sisestage kehtiv konteiner, näiteks \".mp4\". Lisage kindlasti '.'","Corrupt file folder":"Rikutud faili kaust","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ei eksisteeri! Veenduge, et enne / pärast teed pole tühikuid või peidetud märke","Source folder":"Lähtekataloog","Temporary conversion folder":"Ajutine konversioonikaust","appears to be the same as or is within source folder":"tundub olevat sama kui allikate kaustas","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"mis takistab HBBatchBeast toimimist. Palun muutke ajutist konversioonikausta kaustaks väljaspool lähtekataloogi. Kui soovite kasutada \"Asenda originaalfaile\" funktsiooni, valige sihtkaust, mis ei ole lähtekataloogi sees või sees, ja seejärel märkige märkeruut \"Asendage algsed failid alati\" täiustatud sätete jaotises. . Tühjendage märkeruut ajutise \"Ajutise konversiooni kausta\" märkega, kuna see ei kasuta antud juhul mingit kasu. Failid teisendatakse sihtkaustaks ja liigutatakse seejärel allika kausta.","Destination folder":"Sihtkaust","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"mis takistab HBBatchBeast toimimist. Palun muutke sihtkaust kausta, mis asub väljaspool lähtekataloogi. Kui soovite kasutada \"Asenda originaalfaile\" funktsiooni, valige sihtkaust, mis ei ole lähtekataloogi sees või sees, ja seejärel märkige märkeruut \"Asendage algsed failid alati\" täiustatud sätete jaotises. . Tühjendage märkeruut ajutise \"Ajutise konversiooni kausta\" märkega, kuna see ei kasuta antud juhul mingit kasu. Failid teisendatakse sihtkaustaks ja liigutatakse seejärel allika kausta.","Error creating temporary conversion folder":"Viga ajutise konversioonikausta loomisel","Error creating destination folder":"Viga sihtkausta loomisel","Please select to use HandBrake or FFmpeg!":"Palun valige, kas kasutada HandBrake või FFmpeg!","Please select a standard preset or input a custom one!":"Palun vali standardne eelseadistus või sisesta kohandatud!","Please select a scan interval of 5 seconds or greater!":"Palun valige 5 sekundi või pikem skaneerimisintervall!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Veenduge, et üheaegselt kasutatavate HandBrake / FFmpeg'i juhtumite arv on üks või suurem!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Kehtetu API-võti! Uue võtme loomiseks klõpsake kaugseire vahekaardil „Uus”.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Sisestage 24 tunni formaadis igapäevane skaneerimisaeg: hh: mm (näiteks 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"VÄLJAKUTSE JÄRGI VÄLJA JÄRGI! Palun kontrollige enne nõuetekohast kasutamist!","Benchmark failed!":"Võrdlusindeks ebaõnnestus!","Log does not exist!":"Logi ei ole olemas!","Folder does not exist!":"Kaust ei eksisteeri!","Error sending email! Please check your settings.":"Viga e-posti saatmisel! Palun kontrollige oma seadeid.","Test email sent!":"Testi e-kiri saadetud!","All worker processes have been stopped.":"Kõik töötajate protsessid on peatatud.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Järjekord peatatakse, kui praegused üksused on töötlemise lõpetanud. Kas soovite kindlasti järjekorda peatada?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Queue pause algatatud. '' Jätka '' nupp ilmub, kui kõik töötajad on peatunud.","Healthy file cache cleared!":"Terve faili vahemälu tühjendati!","Cache cleared!":"Vahemälu tühjendati!","Cancel item":"Tühista üksus","Please check the above checkbox to use this feature.":"Selle funktsiooni kasutamiseks kontrollige ülalolevat märkeruutu.","Configuration":"Konfiguratsioon","Source folders":"Allikate kaustad","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"See on lähtekataloog, mida skaneeritakse meedia jaoks. Kaust tuleb sisestada ilma kaldkriipsuta. Näiteks:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Lähtekataloogi teekast on laiendatav (uue rea loomiseks vajutage enter). Kui soovite määrata mitu allika kausta, veenduge, et iga lähtekataloogi tee on oma real, näiteks:","Video health check":"Video tervisekontroll","Batch conversion and Folder watching":"Partii teisendamine ja kausta vaatamine","Remote Monitoring (Beta)":"Kaugseire (beeta)","Benchmark (Beta)":"Benchmark (Beta)","System":"Süsteem","Help":"Abi","Temporary conversion folders":"Ajutised konversioonikaustad","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Kui \"Ajutine konversioonikaust?\" kontrollitakse, siis HandBrake teisendab failid sellesse kausta. Kui konversioon on lõppenud, teisaldatakse fail oma \"sihtkoha kausta\". Peate määrama lähtekataloogidena nii palju ajutisi konversioonikaustu. Teie esimene allika kaust teisendatakse teie esimeseks ajutiseks konversioonikaustaks, teine allikakaustaks teiseks ajutiseks konversioonikaustaks jne. Veenduge, et iga ajutise konversiooni kausta tee on oma real.","Destination folders":"Sihtkaustad","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Määrake sihtkausta teed. Jällegi peate määrama allikakaustadena nii palju sihtkaustu. Teie esimesest allika kaustast pärit failid jõuavad teie esimesele sihtkaustale, teise allika kausta failid teisele sihtkaustale ja nii edasi.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Esimene allika kaust ---------> Esimene ajutine konversioonikaust ---------> Esimene sihtkaust","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Teine allika kaust ---------> Teine ajutine konversioonikaust ---------> Teine sihtkaust","etc":"jne","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast ei tööta korralikult, kui määrate sihtkoha kausta allika kausta või selle sees.","Standard preset:":"Standardne eelseadistus:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Valige käsipiduri eelseade, millega soovite failid teisendada. Kui on valitud \"Standardne eelseadistus\", teisendatakse kõik valitud kaustade failid määratud käepide eelseadistusega. HandBrake'i eelseadete kohta leiate lisateavet siit:","Custom preset:":"Kohandatud eelseadistus:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Kui \"Custom preset\", siis peate sisestama oma kohandatud eelseadistuse. HBBatchBeast hõlmab HandBrakeCLI sisendi \"HandBrakeCLI -i allika-sihtpunkti\" osa, nii et peate sisestama konversiooniparameetrid. Näiteks:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"FFmpegi kasutamisel peate eraldama sisend- ja väljundparameetrid komaga. Nagu näiteks:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Võite linkida ka kohandatud eelseadistusele, mis on eksporditud ametlikust HandBrake GUI rakendusest, näiteks:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Kui teil on probleeme eelseadistustega, võib see olla tingitud teadaolevast veast HandBrakeCLI-ga (fikseeritakse järgmises HandBrakeCLI-versioonis). Palun vaadake seda ajutise lahenduse saamiseks:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Iga kohandatud eelseadistus peab olema oma rida ja sarnaselt kaustadele peab lähtekataloogidega olema sama palju kohandatud eelseadeid.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Esimene allika kaust ---------> Esimene ajutine konversioonikaust ---------> Esimene sihtkaust @ Kohandatud eelseadistus 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Teine allika kaust ---------> Teine ajutine konversioonikaust ---------> Teine sihtkaust @ Kohandatud eelseadistus 2","See the following image for guidance:":"Vaadake järgmist pilti juhendamiseks:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Kui kasutate graafikakaardi kodeeringut (nt NVENC), peate VRAMi piirangute tõttu tõenäoliselt vähendama HandBrake eksemplaride arvu (proovige 2 või vähem).","Select standard preset:":"Valige standardne eelseadistus:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Avastati NVENC, veenduge, et alandate HandBrakeCLI eksemplaride arvu 2-le või alla selle (enamiku graafikakaartide puhul) või VRAMi puudumise tõttu võib tekkida vigu. Seda sätet leiate vahekaardilt \"Süsteem\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Imporditud eelseadistatud tuvastamine.Kui teil on imporditud kohandatud eelseadistustega probleeme, võib see olla tingitud teadaolevast veast HandBrakeCLI-ga (see kinnitatakse järgmises HandBrakeCLI-versioonis). Ajutine lahendus on eemaldada \"PictureRotate\": \"0: 0\" .json-failist. Rohkem infot siit:","Container:":"Konteiner:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Määrake konteiner, millele soovite väljundfaili olla, näiteks \".mp4\". Konteinerite kohta saate lisateavet aadressil:","Enable periodic scanning:":"Luba perioodiline skaneerimine:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast suudab jälgida teie allika kaustu ja käivitada uute failide skaneerimist kindlaksmääratud intervalliga. Ajavahemik on sekundites, kusjuures vaikimisi on 300 sekundit (5 minutit). Kui see valik on valitud, siis siis, kui vajutate \"Scan and convert\", teisendab programm kõik uued failid ja seejärel algab taimer. See lõpeb lõputult kuni peatumiseni. Skaneerimisintervall on täpsemate sätete osas.","Enable daily scanning:":"Luba igapäevane skaneerimine:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Perioodilise skaneerimise asemel saate valida, kas skannimine käivitatakse üks kord päevas. Skaneerimisaeg sisestatakse hh: mm formaadis täpsustatud seadistuste sektsioonis, näiteks '18: 30'. Kui \"Scan and convert\" on valitud, ootab programm kuni määratud ajani kuni skaneerimis- ja konversiooniprotsessi käivitamiseni. Jällegi, see lõpeb lõpmatuseni kuni peatumiseni.","Show/hide advanced:":"Näita / peida edasi:","Scan interval (minimum 5 seconds):":"Skaneerimisintervall (vähemalt 5 sekundit):","Daily run time (hh:mm):":"Päevane tööaeg (hh: mm):","Output filename suffix:":"Väljundfaili nime sufiks:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"See on valikuline. Teil on võimalik määrata järelliide, mis lisatakse failinime lõppu nagu '_1080p' või '_testconversion' jne","If 'standard preset' is selected then all output files will have the same suffix.":"Kui valitud on „standardne eelseadistus”, siis on kõigil väljundfailidel sama sufiks.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Kui valitud on 'custom preset', saate määrata ühe sufiksi iga lähtekataloogi / kohandatud eelseadistuse kohta. Veenduge, et iga sufiks on oma real. Näiteks kui teil on 2 allika kausta ja kasutate 'kohandatud eelseadistust', võite selle panna failinime sufiksi kasti:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Esimese allika kausta failid lisatakse väljundfaili nimele '_720p'. Teise allika kausta failid lisatakse väljundfaili nimele jne.","Include these file containers:":"Lisage need failikonteinerid:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Sisestage skaneeritavad failikonteinerid. Iga tüüp tuleb eraldada komaga. Vaikimisi kirje on:","Exclude files smaller than (MB):":"Välista (MB) väiksemaid faile:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Määrake, kas konversioonist (megabaitides) välistada teatud suurusest väiksemad failid","Exclude files larger than (MB):":"Välista (MB) suuremad failid:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Määrake, kas konversioonist välja arvata teatud suurusest suuremad failid (megabaitides)","Exclude filenames which include any of these words:":"Välista failinimed, mis sisaldavad mõnda järgmistest sõnadest:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Sisestage failide skaneerimisel välja filtreeritavad märksõnad. Näiteks, kui sisestatakse \"720p\", siis ei muudeta pealkirja \"720p\" faile. Jällegi tuleb märksõnad eraldada komaga. Sisestage näiteks filtri lahtrisse järgmine:","Include files with any ":"Lisage failid failidega"," or all ":"või kõik"," of these":"nendest","properties:":"omadused:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Siin saab sisestada video- ja heliomadusi, mida failid peavad konverteerimiseks olema (info ekstraheeritakse FFprobe abil). Omadused tuleb eraldada komaga. Kasutage meediainfo vaataja tööriista, et aidata määrata, milliseid omadusi soovite lisada. Veenduge, et olete viimase vara peale koma. Näiteks selleks, et teisendada ainult h264- ja aac-stereoheliga kodeeritud faile:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Väärib märkimist, et see omaduste kontroll tehakse siis, kui konversiooniprotsess algab (et säästa aega järjekorda ehitamisel), nii et kuigi konversioonijärjekord võib ilmuda, jäetakse need õigete tingimuste täitmisel vahele / kaasas.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Kui FFprobe on võimeline omadusi ekstraheerima, ilmub järjekorra vaates \"FFprobe\" veerus \"OK\".","Exclude files with any ":"Välista failid mis tahes"," of these ":"nendest","The opposite of 'Include files with any or all of these properties'":"Vastupidi „Sisesta faile mis tahes või kõigi nende omadustega”","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"See on väike tööriist failide atribuutide analüüsimiseks, et aidata teil kindlaks määrata, milliseid omadusi soovite ülaltoodud valikutesse lisada / välja jätta. Ta kasutab informatsiooni tagastamiseks FFprobe. Nende analüüsimiseks lohistage failid hallisse kasti. Näiteks võib testfailisse kukkumise tulemuseks olla järgmine:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Kui soovite, et sellised failid konverteeritaks välja, siis saate lisada mitu faili atribuuti \"Välista failid mis tahes või kõigi nende omadustega\" ja märkida märkeruut \"kõik\" asemel \"kõik\", meeldib nii:","Copy excluded files to destination:":"Kopeerige välistatud failid sihtkohta:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Kui valite selle valiku, kopeeritakse konversioonist välja jäetud failid otse sihtkausta. See kehtib järgmiste filtrite kohta:","Exclude filenames which include any of these words":"Välista failinimed, mis sisaldavad mõnda neist sõnadest","Include files with any or all of these properties":"Lisage failid mis tahes või kõigi nende omadustega","Exclude files with any or all of these properties":"Välista failid mis tahes või kõigi nende omadustega","Exclude files smaller than (MB)":"Välista (MB) väiksemaid faile","Exclude files larger than (MB)":"Välista (MB) suuremaid faile","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Pange tähele, et see kehtib ka väljajäetud failide kohta, kuna need ei vasta ülaltoodud omaduste \"Kaasa\" tingimustele, nii et te ei kopeeri kogemata kogu teeki, kui proovite mõnda faili teisendada.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Kopeerimisfunktsioon ei kehti järgmiste filtrite kohta (st filtrite tõttu välistatud failid)","Include these file types":"Lisage need failitüübid","Delete source files after conversion:":"Allikate failide kustutamine pärast konversiooni:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Kui see on valitud, siis konversiooni katse õnnestumisel kustutatakse lähtefail. See protsess viiakse lõpule pärast kõigi failide konverteerimist. See tähendab, et sama lähtefaili saab teisendada mitme eelseadistusega, kõik korraga. Seejärel kustutatakse allikate failid.","Replace original file if converted file is smaller?(Compress attempt)":"Asendage algne fail, kui konverteeritud fail on väiksem?","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Valige see märkeruut, kui soovite, et HBBatchBeast asendaks algse lähtefaili automaatselt, kui uus fail on väiksem. Kui uus fail ei ole väiksem, jääb see sihtkausta.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Veenduge, et teie sihtkaust ei oleks sama, mis / või sees, teie lähtekataloogis või see ei tööta korralikult.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Kui HBBatchBeast on püüdnud teatud faili tihendada, lisab ta selle faili tee vahemällu, et seda tulevikus uuesti proovida. Vahemälu saate vaadata / muuta / kustutada kollaste nuppude abil.","Replace original file always?":"Asendage algne fail alati?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Algne fail asendatakse olenemata sellest, kas uus fail on suurem või väiksem.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Jällegi veenduge, et teie sihtkaust ei oleks sama, mis / või sees, teie lähtekataloogis või see ei tööta korralikult.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Kui HBBatchBeast on teatud faili ümberkodeerinud, lisab ta selle faili tee vahemällu, et seda tulevikus uuesti proovida. Vahemälu saate vaadata / muuta / kustutada kollaste nuppude abil.","Copy subtitle (srt) files to destination?":"Kopeerige subtiitrite (srt) failid sihtkohta?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Subtiitrite \".srt\" failid kopeeritakse automaatselt sihtkausta.","Automatically create temporary/destination folders if they don't exist?":"Loo automaatselt ajutised / sihtkaustad, kui neid ei ole?","Custom bat path to run after each conversion (leave blank if not using):":"Igale konversioonile kulgev kohandatud batitee (jätke tühjaks, kui seda ei kasutata):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Sisestage kohandatud partiifaili tee, mida soovite pärast iga konversiooni täita. Näiteks:","Batch files with timeout statements won't work. More info here:":"Ajastuse avaldustega partiifailid ei tööta. Rohkem infot siit:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Kui te ei soovi seda valikut kasutada, jätke kast täiesti tühjaks (veenduge, et lahtrisse ei ole peidetud märke)","Run processes at low priority?":"Käivitage madala prioriteediga protsessid?","All conversion processes will be run at low priority, reducing processor usage.":"Kõik konversiooniprotsessid töötavad madala prioriteediga, vähendades protsessori kasutamist.","Remove apostrophes from filenames:":"Eemaldage failinimede apostrofid:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Konversioonide / tervisekontrolli skaneeringud võivad ebaõnnestuda, kui failinimedel on apostrofe."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"See funktsioon võib skannida korrumpeerunud videofaile, kasutades HandBrake'i \"- scan\" funktsiooni, kuigi see ei ole alati täpne. Samuti kasutab ta teise võrdluspunkti saamiseks FFprobe. Kui nii FFprobe kui ka HandBrake ebaõnnestuvad, on suur tõenäosus, et fail on rikutud.","Move corrupt files into the following folder:":"Viige rikutud failid järgmisse kausta:"," If checked, then any files which give errors will be moved into the specified folder.":"Kui see on märgitud, liiguvad kõik vead andvad failid määratud kausta.","Corrupt file folder:":"Rikutud faili kaust:","Run thorough file health check:":"Käivitage põhjalik faili tervisekontroll:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Kui see on kontrollitud, käivitatakse FBmpeg asemel HandBrake asemel palju aeglasem, põhjalikum video tervisekontroll."," Based on Desani's 'ScanMedia.ps1' found at:":"Põhineb Desani 'ScanMedia.ps1'l, mis leiti aadressilt:","Attempt to repair files after thorough check:":"Proovige faile pärast põhjalikku kontrollimist parandada:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Märkimise korral üritab HBBatchBeast faile FFmpegiga parandada. Algfailiga samas kaustas luuakse uus fail sufiksiga \"_repaired\".","'CRF' value to use when attempting to repair files:":"\"CRF\" väärtus, mida kasutada failide parandamiseks:","The default 'CRF' value is 23. Please see the following for more information:":"Vaikimisi CRF-väärtus on 23. Palun vaadake lisateabe saamiseks järgmist.","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"CRF skaala vahemik on 0–51, kus 0 on kadudeta, 23 on vaikimisi ja 51 halvim kvaliteet. Madalam väärtus toob üldiselt kaasa kõrgema kvaliteedi ja subjektiivselt mõistlik vahemik on 17–28. Mõtle 17 või 18 visuaalselt kadudeta või peaaegu nii; see peaks olema sama või peaaegu sama kui sisend, kuid see ei ole tehniliselt kadudeta.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast salvestab skaneeritud failiradade loendi, mis on teatatud vigastamata. Tühjendage vahemälu, et teha kõik failid uuesti.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Kasutatavate samaaegsete HandBrake / FFmpeg-juhtumite arv (soovitatav 4 või vähem):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"See säte kehtib nii \"Video tervisekontrolli\" kui ka \"Scan and convert\" protsesside kohta. Määrake, mitu HandBrake'i niidit kasutada. Maksimaalset väärtust ei ole, kuigi soovitatav on mitte kasutada rohkem kui 4. Suuremat summat võib teie arvuti külmutada, kui see ei ole väga võimas.","Queue size view limit?(Recommended 1000 or fewer):":"Järjekorra suuruse vaatamise piir? (Soovitatav 1000 või vähem):","Automatically start \"Scan and convert\" when program opened?:":"Käivitab \"Scan and convert\" automaatselt, kui programm avatakse ?:","Save verbose logs?:":"Salvestage verbid logid ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Märkige see märkeruut üksikasjalike alamprotsessi logide salvestamiseks. See hõlmab ka töötajate konsooli. See põhjustab väga suuri palke.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Täitke e-posti andmed, et saada e-posti teateid, kui tervisekontrolli või konversiooni / kausta vaatamise ajal tekib viga. Ei tööta kontodega, mis nõuavad 2FA-d. Peate lubama juurdepääsu vähem turvalistele rakendustele Gmaili kontodel.","Email address:":"E-posti aadress:","For example:":"Näiteks:","Email password(not saved):":"E-posti parool (pole salvestatud):","SMTP server:":"SMTP-server:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"See funktsioon võimaldab konversiooni / tervisekontrolli olekut jälgida mis tahes veebibrauseri abil. Kasulik serverite käitamisel jne. Failinimesid ei saadeta.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Kui see on lubatud, saadetakse HBBatchBeast.io-le järgmised anonüümsed andmed:","API key":"API-võti","Current status ('Searching', 'Running', 'Finished' etc)":"Praegune olek (otsimine, jooksmine, lõpetatud jne)","Number of:":"Mitu:","Remaining items":"Ülejäänud üksused","Successful items":"Edukad elemendid","Errored items":"Viga","Cancelled items":"Tühistatud üksused","Worker percentages":"Töötajate protsendid","Last completed item time":"Viimati täidetud üksuse aeg","Enable remote monitoring?:":"Luba kaugseire ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Peamine võrdlusuuringute utiliit, mis on ehitatud peamiselt selleks, et näha, kuidas 16+ põhiprotsessorid kasutavad mitmeid HandBrake'i juhtumeid, kuigi seda saab kasutada mis tahes tüüpi protsessoril.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"See laadib alla h265 4k proovifaili (2,5 MB) ja käivitab võrdlusuuringu, kasutades 4 HandBrake eksemplari, millel on eelseadistatud \"väga kiire 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Tulemusi saab üles laadida hbbatchbeast.io.","Queue":"Järjekord","Output this session":"Väljundi see seanss","Media info viewer tool":"Meediainfo vaataja tööriist","View replaced file cache":"Vaata asendatud failipuhvrit","Clear replaced file cache":"Tühjenda asendatud faili vahemälu","Save config":"Salvesta konfig","Scan only":"Scan ainult","Scan and convert":"Skaneeri ja teisenda","View scan/conversion summary log":"Vaata skaneerimise / konversiooni kokkuvõtte logi","View individual file check/conversion log":"Vaadake üksikute failide kontrollimise / konversiooni logi","View worker console output":"Vaadake töötajate konsooli väljundit","Health check":"Tervise kontroll","Clear healthy file cache":"Tühjendage terve failivahemälu","View error log":"Vaadake vigade logi","Email test":"E-posti test","View master log":"Vaadake põhipäevikut","Wiki help":"Wiki abi","An application by HaveAGitGat":"HaveAGitGati taotlus","New":"Uus","Launch":"Käivita","Benchmark":"Võrdlusalus","See results":"Vaadake tulemusi","Pause queue":"Peatage järjekord","Continue queue":"Jätka järjekorda","Stop queue":"Lõpetage järjekord","Convert selected files":"Teisendage valitud failid","Toggle queue view":"Lülitab järjekorda","Deselect all":"Tühistage kõik","Invert all":"Pöörake kõik","Select all":"Vali kõik","Toggle output view":"Lülita väljundvaade sisse"}