{
    "The number of custom presets does not match the number of source folders!": "Aurrezarpen pertsonalizatuen kopurua ez dator bat iturrien karpetan!",
    "source folders have been detected.": "iturburuko karpetak detektatu dira.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "aurrez zehaztutako linea pertsonalizatuak detektatu dira. Mesedez, egiaztatu bikoitza gelditzen den ikusezina. Karpeta bide bat edo linea lehenetsia egon behar du. Egiaztatu lerro huts bat ez duzula ustekabean sortu.",
    "The number of filename suffixes does not match the number of source folders! ": "Fitxategi-izenen atalen kopurua ez dator bat iturburuko karpeten kopurua!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "fitxategi izenen atzizkiaren lineak detektatu dira. Mesedez, egiaztatu bikoitza gelditzen den ikusezina. Karpeta bide bat edo fitxategi izenen atzizkia egon behar luke. Egiaztatu lerro huts bat ez duzula ustekabean sortu.",
    "The number of source folders does not match the number of destination folders!": "Jatorri-karpeten kopurua ez dator bat helmugako karpeten kopurua!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "helmuga karpetak detektatu dira. Mesedez, egiaztatu bikoitza gelditzen den ikusezina. Karpeta bide bat eduki beharko luke linea bakoitzeko. Egiaztatu lerro huts bat ez duzula ustekabean sortu.",
    "The number of source folders does not match the number of temporary conversion folders!": "Jatorri-karpeten kopurua ez dator bat aldi baterako bihurketa karpetako kopurua!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "aldi baterako bihurketa karpetak detektatu dira. Mesedez, egiaztatu bikoitza gelditzen den ikusezina. Karpeta bide bat eduki beharko luke linea bakoitzeko. Egiaztatu lerro huts bat ez duzula ustekabean sortu.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Mesedez, sartu baliozko edukia, esate baterako \".mp4\". Ziurtatu '.'",
    "Corrupt file folder": "Kaltetutako fitxategien karpeta",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "ez da existitzen! Mesedez, ziurtatu ez dago espazioik edo ezkutuko karaktererik bide-izenaren aurretik eta ondoren",
    "Source folder": "Iturburuko karpeta",
    "Temporary conversion folder": "Aldi baterako bihurketa karpeta",
    "appears to be the same as or is within source folder": "badirudi iturburu karpetan dagoen edo berdina dela",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "HBBatchBeast-k ondo funtzionatzea eragozten du. Mesedez aldatu aldi baterako bihurketa karpeta iturburuko karpeta ez den karpeta batera. 'Ordeztu jatorrizko fitxategien eginbidea' erabili nahi baduzu, hautatu iturburuko karpeta berdina edo barruan dagoen helburuko karpeta bat, eta gero hautatu 'Ordeztu jatorrizko fitxategiak beti' kontrol-laukia ezarpen aurreratuen atalean. . Desmarkatu 'Aldi baterako bihurketa karpeta' aldi baterako kontrol laukia, kasu honetan ez du erabilgarri egongo. Fitxategiak helburuko karpeta bihurtuko dira eta gero iturburu karpetan itzuliko dira.",
    "Destination folder": "Helburuko karpeta",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "HBBatchBeast-k ondo funtzionatzea eragozten du. Mesedez, aldatu helmugako karpeta iturburuko karpetatik kanpo. 'Ordeztu jatorrizko fitxategien eginbidea' erabili nahi baduzu, hautatu iturburuko karpeta berdina edo barruan dagoen helburuko karpeta bat, eta gero hautatu 'Ordeztu jatorrizko fitxategiak beti' kontrol-laukia ezarpen aurreratuen atalean. . Desmarkatu 'Aldi baterako bihurketa karpeta' aldi baterako kontrol laukia, kasu honetan ez du erabilgarri egongo. Fitxategiak helburuko karpeta bihurtuko dira eta gero iturburu karpetan itzuliko dira.",
    "Error creating temporary conversion folder": "Errorea aldi baterako bihurketa karpeta sortzean",
    "Error creating destination folder": "Errorea helburuko karpeta sortzean",
    "Please select to use HandBrake or FFmpeg!": "Hautatu HandBrake edo FFmpeg erabiltzeko!",
    "Please select a standard preset or input a custom one!": "Aukeratu pertsonalizatutako aurrezarpen estandar bat.",
    "Please select a scan interval of 5 seconds or greater!": "Hautatu 5 segundo edo gehiago eskaneatzeko tarte bat!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Mesedez, ziurtatu aldi berean erabiltzeko HandBrake / FFmpeg instantzia kopurua bat edo handiagoa dela!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "API gako baliogabea! Sakatu 'Berria' urruneko jarraipen fitxan, gako berri bat sortzeko.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Sartu eguneko eskaneatze denbora 24 ordu formatuan: hh: mm (adibidez, 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "AURREIKUSPEGIEN KONTZERTUAK KOKATZEA KOKATUKO DU! Mesedez, probatu aurretik erabili aurretik!",
    "Benchmark failed!": "Benchmark huts egin du!",
    "Log does not exist!": "Erregistroa ez da existitzen!",
    "Folder does not exist!": "Karpeta ez da existitzen!",
    "Error sending email! Please check your settings.": "Errorea mezu elektronikoa bidaltzean! Egiaztatu zure ezarpenak.",
    "Test email sent!": "Probatutako mezu elektronikoa bidali da!",
    "All worker processes have been stopped.": "Langileen prozesu guztiak gelditu dira.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Uneko elementuak prozesatu ondoren, ilarak pausatuko dira. Ziur zaude ilara gelditu nahi duzula?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Ilarako etetea abiarazi da. 'Jarraitu' botoia agertuko da langile guztiak gelditu ondoren.",
    "Healthy file cache cleared!": "Fitxategi osasuntsu cachea garbitu da!",
    "Cache cleared!": "Cache-a garbitu da!",
    "Cancel item": "Utzi elementua",
    "Please check the above checkbox to use this feature.": "Egiaztatu goiko kontrol-laukia funtzio hau erabiltzeko.",
    "Configuration": "konfigurazioa",
    "Source folders": "Iturburuko karpetak",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Multimedia fitxategiak eskaneatuko diren iturburuko karpeta da. Karpetak barra amaierarik gabe sartu behar da. Adibidez:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Iturburuko karpetaren bide-koadroa handitu daiteke (sakatu enter lerro berri bat sortzeko). Iturburuko hainbat karpeta zehaztu nahi badituzu, ziurtatu iturburuko karpeta bide bakoitzak bere lerroan dagoela, adibidez:",
    "Video health check": "Bideo sanitarioa",
    "Batch conversion and Folder watching": "Multzoen bihurketa eta karpeten behaketa",
    "Remote Monitoring (Beta)": "Urruneko jarraipena (Beta)",
    "Benchmark (Beta)": "Erreferentzia (Beta)",
    "System": "Sistema",
    "Help": "Laguntza",
    "Temporary conversion folders": "Aldi baterako bihurketa-karpetak",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "\"Aldi baterako bihurketa karpeta?\" hautatuta dago, gero HandBrake-k fitxategiak karpeta horretan bihurtzen ditu. Bihurketa amaitu ondoren, fitxategia \"Helmuga karpetan\" eramango da. Behin-behineko bihurketa karpeta zehaztu beharko dituzu iturburuko karpetak bezala. Zure lehen iturburuko karpeta zure lehen aldi baterako bihurketa karpeta bihurtuko da, zure bigarren iturburuko karpeta zure bigarren aldi baterako bihurketa karpetan eta abar. Egiaztatu aldi baterako bihurketa karpetaren bide bakoitza bere lerroan dagoela.",
    "Destination folders": "Helmuga karpetak",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Zehaztu helmugako karpetaren bide-izenak. Berriro ere, helmuga karpetak iturburu-karpetak zehaztu beharko dituzu. Zure lehen iturburuko karpetako fitxategiak zure helmugako lehen karpetan amaituko dira, zure bigarren helburuko karpeta fitxategiak zure bigarren helburuko karpetan eta abar.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Lehenengo iturburuko karpeta ---------> Lehenengo aldi baterako bihurketa karpeta ---------> Lehen helmuga karpeta",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Bigarren iturburuko karpeta ---------> Bigarren mailako bihurketa karpeta ---------> Bigarren helburuko karpeta",
    "etc": "etab",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast-ek ez du behar bezala funtzionatuko helmugako karpeta iturburu karpeta edo barruan kokatzen baduzu.",
    "Standard preset:": "Aurrezarpen estandarra:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Hautatu zure fitxategiak bihurtzea nahi duzun HandBrake aurrezarpena. \"Aurrezarpen estandarra\" hautatuta badago, hautatutako karpeten fitxategi guztiak zehaztuko dira eskuzko Handbrake aurrez ezarritakoarekin. HandBrake aurrezarpenak hemen aurki ditzakezu:",
    "Custom preset:": "Aurrezarpen pertsonalizatua:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "\"Aurrezarpen pertsonalizatua\" bada, zure aurrezarpen pertsonalizatua sartu behar duzu. HBBatchBeast-k \"HandBrakeCLI -i iturria -o helmuga\" eskuineko estaldura hartzen du HandBrakeCLI sarreraren bitartez, beraz, bihurketa parametroak sartu behar dituzu. Adibidez:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "FFmpeg erabiltzen baduzu, sarrerako eta irteerako parametroak komaz batekin bereiztu behar dituzu. Esate baterako:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Adibidez HandBrake GUI aplikazio ofizialetik esportatutako aurrezarpen pertsonalizatua esteka dezakezu:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Aurrezarpen pertsonalizatuak dituzten arazoak badituzu, agian HandBrakeCLI-rekin egindako akats jakin baten ondorioz (HandBrakeCLI hurrengo oharrean konpondu egingo da). Mesedez, ikusi hau aldi baterako konponbidea lortzeko:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Aurrezarpen pertsonalizatu bakoitzak bere lerroan egon behar du eta karpeten antzekoak, aurrezarpen pertsonalizatuak izan behar ditu iturburuko karpeta gisa.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Lehen iturburuko karpeta ---------> Lehenengo aldirako behin-behineko karpeta ---------> Lehenengo helmuga karpeta @ Aurrezarpen pertsonalizatua 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Bigarren iturburuko karpeta ---------> Bigarren mailako bihurketa karpeta ---------> Bigarren helburuko karpeta @ Aurrezarpen pertsonalizatua 2",
    "See the following image for guidance:": "Ikusi honako irudia orientatzeko:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Txartel grafikoen kodeketa erabiltzen baduzu (adibidez, NVENC), baliteke Handbrakeen kopurua murriztu (2 saiatu edo gutxiago) VRAM mugak direla eta.",
    "Select standard preset:": "Hautatu aurrez zehaztutako estandarra:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC detektatu da. Mesedez, ziurtatu HandBrakeCLI instantzia gutxiago edo txikiagoa dela (txartel grafiko gehienetarako), edo akatsak sor ditzakezu nahikoa ez den VRAM dela eta. Ezarpen hau \"Sistema\" fitxan aurki daiteke.",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Inportatutako aurrez ezarritako ezarpenak. Inportatutako aurrezarpen pertsonalizatuak dituzten arazoak badituzu, agian HandBrakeCLI-rekin (ezarritako akatsa) hurrengo errore baten ondorioz (HandBrakeCLI hurrengo oharrean konpondu egingo da). Aldi baterako irtenbide bat '\"PictureRotate\" kentzea da: \"0: 0\"' .json fitxategitik. Informazio gehiago hemen:",
    "Container:": "edukiontzi:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Zehaztu irteerako fitxategia '.mp4' bezalako edukiontzia. Edukiontziei buruz gehiago jakin dezakezu:",
    "Enable periodic scanning:": "Gaitu aldizkako eskaneatzea:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast-k zure iturburuko karpeten jarraipena egin dezake eta zehaztutako tarte batean fitxategi berriak exekutatu ditzake. Denbora tarte segundotan 300 segundoko lehenetsia da (5 minutu). Aukera hau hautatuta badago, \"Eskaneatu eta bihurtzen\" sakatzen duzunean, programak fitxategi berri guztiak bihurtuko ditu eta atzerako kontaketa tenporizadorea hasiko da. Hau infinituki begiztatu egingo da gelditu arte. Analisi tarteak ezarpen aurreratuen atalean dago.",
    "Enable daily scanning:": "Gaitu eguneroko eskaneatzea:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Aldian-aldian eskaneatzearen ordez, eskaneatzea egunean behin egitea aukera dezakezu. Eskaneatze ordua ezarpen aurreratuen atalean sartzen da hh: mm formatuan, hala nola '18: 30'. \"Eskaneatu eta bihurtzea\" hautatuta dagoenean, programak zehaztutako denbora arte itxaron beharko du eskaneatze eta bihurketa prozesu bat exekutatu arte. Berriz ere, hau infinituki begizta egingo da gelditu arte.",
    "Show/hide advanced:": "Erakutsi / ezkutatu aurreratua:",
    "Scan interval (minimum 5 seconds):": "Analisi tartea (gutxienez 5 segundo):",
    "Daily run time (hh:mm):": "Eguneko exekuzio denbora (hh: mm):",
    "Output filename suffix:": "Irteerako fitxategi-izenaren atzizkia:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Aukerakoa da. Zure fitxategi-izenaren amaieran gehitzeko atzizkia zehatz dezakezu, '_1080p' edo '_testconversion' etab.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "'Aurrezarpen estandarra' hautatuta badago, irteerako fitxategi guztiak atzizkia bera izango dute.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "'Aurrezarpen pertsonalizatua' hautatuta badago, iturburu karpeta / aurrezarpen pertsonalizatuak atzitu ditzakezu. Egiaztatu atzizkia bakoitza bere lerroan dagoela. Adibidez, 2 iturburuko karpetak badituzu eta 'aurrezarpen pertsonalizatua' erabiltzen baduzu, fitxategi-izenaren atzizkiaren laukian jar dezakezu:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Lehenengo iturburuko karpetan dauden fitxategiak '_720p' agertuko dira irteerako fitxategi-izenarekin. Bigarren iturburuko karpetan dauden fitxategiak '_1080p' izango dira irteerako fitxategi-izenari gehitutakoak eta abar",
    "Include these file types:": "Sartu fitxategi mota hauek:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Sartu eskaneatzeko fitxategi motak. Mota bakoitzak komaz bidez bereizita egon behar du. Lehenetsitako sarrera:",
    "Exclude files smaller than (MB):": "Baztertu (MB) baino txikiagoa duten fitxategiak:",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Zehaztu tamaina jakin bat baino txikiagoa duten fitxategiak bihurtzeko (megabyteetan)",
    "Exclude files larger than (MB):": "Baztertu fitxategiak (MB) baino handiagoak:",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Zehaztu tamaina jakin bat baino gehiagoko fitxategiak bihurtzeko alderdiak baztertu behar diren ala ez (megabyte)",
    "Exclude filenames which include any of these words:": "Baztertu izen hauetako edozein fitxategi-izenak:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Sartu iragazten dituzun gako-hitzak fitxategiak bilatzeko. Adibidez, \"720p\" sartu bada, izenburuan \"720p\" duten fitxategiak ez dira bihurtuko. Berriro ere, gako-hitzak komaz bereiztu behar dira. Adibidez, idatzi hau iragazki koadroan:",
    "Include files with any ": "Sartu fitxategiak edozein",
    " or all ": "edo guztiak",
    " of these": "horien artean",
    "properties:": "propietate:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Hemen bideoak eta audio propietateak sartu ditzakezu fitxategiak bihurtu ahal izateko (informazioa ateratzen da FFprobe erabiliz). Propietateak komaz bereizita egon behar dira. Erabili multimedia info ikustailea tresna, zeintzuk izan nahi dituzun zehazteko. Ziurtatu koma bat jarri duzula azken jabetza ondoren. Adibidez, h264 eta aac estereo audioa erabiliz kodetuta dauden fitxategiak bakarrik bihurtzeko:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Aipagarria da jabetza-egiaztapen hau bihurketa prozesua hasten denean (denbora ilaran eraikitzen den denbora aurrezteko), beraz, bihurketa ilara batean fitxategiak ager daitezke arren, saltatu / sartuko dira baldintza egokiak betetzen badira.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "FFprobe propietatea ateratzeko gai bada, 'OK' bat agertuko da \"FFprobe\" zutabean ilararen ikuspegian.",
    "Exclude files with any ": "Baztertu fitxategiak edozein",
    " of these ": "horien artean",
    "The opposite of 'Include files with any or all of these properties'": "'Propietateak hauetako bat edo guztiak dituzten fitxategiak barne' aurkakoa",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Fitxategi-propietateak aztertzeko tresna txiki bat da, aurreko aukerak aipatu nahi dituzun propietateak zehaztu nahi dituzun zehazteko. Informazioa itzultzeko FFprobe erabiltzen du. Arrastatu eta jaregin fitxategiak lauki grisean aztertzeko. Adibidez, proba fitxategi batean jareginez gero honako hau itzul dezakezu:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Hau bezalako fitxategiak bihurtu ezean baztertzea nahi baduzu, fitxategi-propietate batzuk jarri ditzakezu \"Ezaugarri hauetako edo fitxategi hauekin batera ezabatu fitxategiak\" koadroan eta hautatu \"guztiak\" ondoan dagoen \"laukitxoa\" -ren ordez. horrela:",
    "Copy excluded files to destination:": "Kopiatu ezabatutako fitxategiak helmugara:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Aukera hau hautatzen baduzu, bihurketa baztertutako fitxategiak zuzenean kopiatuko dira helmugako karpetara. Honako iragazkiei aplikatzen zaie:",
    "Exclude filenames which include any of these words": "Baztertu hitz hauetako edozein fitxategi-izenak",
    "Include files with any or all of these properties": "Sartu edozein propietate edo fitxategi fitxategiak",
    "Exclude files with any or all of these properties": "Baztertu fitxategiak edozein propietate hauekin edo guztiekin",
    "Exclude files smaller than (MB)": "Baztertu fitxategiak (MB) baino txikiagoak",
    "Exclude files larger than (MB)": "Baztertu fitxategiak (MB) baino handiagoak",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Kontuan izan hau ere baztertutako fitxategiei aplikatzen zaie, aurrekoen \"Sartu\" propietate baldintzak betetzen ez baitituzte, beraz, ez duzu ustekabean kopiatu liburutegi osoa fitxategi batzuk bihurtzen saiatzen zarenean.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Kopiatu eginbidea ez da honako iragazki hauetan aplikatzen (hau da, iragazki batengatik kanpo geratutako fitxategiak).",
    "Include these file types": "Sartu fitxategi mota hauek",
    "Delete source files after conversion:": "Ezabatu iturburu fitxategiak bihurketa ondoren:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Hau hautatzen bada, bihurketa saiakera arrakastatsua bada, iturburu fitxategia ezabatuko da. Prozesu hau amaieran egiten da, fitxategi guztiak bihurtu ondoren. Horrek esan nahi du iturburuko fitxategi berak aurrezarpen ugari erabiliz bihur ditzakezula, guztiak aldi berean. Orduan iturburu fitxategiak ezabatuko dira.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Ordeztu jatorrizko fitxategia bihurtutako fitxategia txikiagoa bada (konprimitu saiakera)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Hautatu kontrol-laukia HBBatchBeast-ek jatorrizko fitxategia automatikoki ordeztu nahi baduzu, fitxategi berria txikiagoa bada. Fitxategi berria ez bada txikiagoa, helburuko karpetan geratuko da.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Egiaztatu zure helburuko karpeta ez dela / edo barruan dagoen iturburuko karpeta bera edo ez duela behar bezala funtzionatuko.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Behin HBBatchBeast-ek fitxategi zehatz bat konprimatzen saiatu da, fitxategi-bide hori cacheari gehituko dio etorkizunean berriro saiatu ez dadin. Cachea botoi horiak erabiliz cachea ikusi edo editatu dezakezu.",
    "Replace original file always?": "Ordeztu beti jatorrizko fitxategia?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Jatorrizko fitxategia ordeztuko da, fitxategi berria handiagoa edo txikiagoa den kontuan hartu gabe.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Berriro, ziurtatu zure helmugako karpeta ez dela / edo barruan dagoen iturburuko karpeta edo ez duela behar bezala funtzionatuko.",
    "Copy subtitle (srt) files to destination?": "Kopiatu azpitituluak (srt) fitxategiak helmugara?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Azpitituluen '.srt' fitxategiak helburuko karpetan automatikoki kopiatuko dira.",
    "Automatically create temporary/destination folders if they don't exist?": "Sortu aldi baterako / helmugako karpetak automatikoki sortzen ez badira?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Bihurketa bakoitzaren ibilbide pertsonalizatua (utzi hutsik erabiltzen ez baduzu):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Bihurtu bihurketa bakoitzaren ondoren exekutatu nahi duzun batch fitxategi pertsonalizatua. Adibidez:",
    "Batch files with timeout statements won't work. More info here:": "Iraupen luzeko adierazpenekin egindako fitxategiek ez dute funtzionatuko. Informazio gehiago hemen:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Utzi kutxa erabat hutsik aukera hau erabili nahi ez baduzu (ziurtatu ezkutuko karaktere ez dago koadroan)",
    "Run processes at low priority?": "Exekutatu prozesuak lehentasun baxuetan?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Bihurketa prozesu guztiek lehentasun baxuko exekutatuko dira, prozesadorearen erabilera murriztuz.",
    "Remove apostrophes from filenames:": "Kendu apostrofoa fitxategi-izenetatik:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Conversions / health check bilaketak huts egin dezake fitxategi-izenak apostrofoa badute. Egiaztatu apostrofoa automatikoki ezabatzeko fitxategi-izenetatik.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Ezaugarri honek hondatuta dauden bideo fitxategiak eskaneatu ditu HandBrake-ren '--scan' funtzioarekin, baina hori ez da beti zehatza. FFprobe ere erabiltzen du bigarren erreferentzia puntu bat emateko. FFprobe eta HandBrake huts egiten badute, fitxategi hori hondatuta dagoela aukera handia dago.",
    "Move corrupt files into the following folder:": "Eraman fitxategiak hondatutako karpetan:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Hautatuta badago, akatsak ematen dituzten fitxategiak zehaztutako karpetan eramango dira.",
    "Corrupt file folder:": "Hondatutako fitxategien karpeta:",
    "Run thorough file health check:": "Exekutatu fitxategi osoko azterketa sakona:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Hautatuta badago, bideoaren osasun kontrol luzeagoa eta sakonagoa exekutatuko da FFmpeg erabiliz HandBrake ordez.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Desani-ren \"ScanMedia.ps1\" -en oinarrituta dago:",
    "Attempt to repair files after thorough check:": "Egiaztapen zehatza egin ondorengo fitxategiak konpontzen saiatzea:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Hautatuta badago, HBBatchBeast FFmpeg erabiliz fitxategiak konpontzen saiatuko da. Fitxategi berri bat '_parpired' atzipenarekin sortuko da iturburu fitxategiaren karpeta berean.",
    "'CRF' value to use when attempting to repair files:": "'CRF' balioa fitxategiak konpontzen saiatzean erabiltzeko:",
    "The default 'CRF' value is 23. Please see the following for more information:": "'CRF' balio lehenetsia 23 da. Mesedez, ikusi honako informazio gehiago lortzeko:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "CRF eskalaren eremua 0-51 da, 0 galerarik gabe, 23 lehenetsia eta 51 kalitate okerrena. Balio txikiago batek, oro har, kalitate handiagoa sortzen du eta 17-28 arteko zentzuzkoa da. Kontuan hartu 17 edo 18 ikusmen galerak izan edo ia horrela; sarrera berdina edo ia berdina izan beharko luke baina ez da teknikoki galerarik.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeastk eskaneatu gabeko fitxategien zerrenda gordetzen du. Garbitu cachea fitxategi guztietan eskaneatze berria egiteko.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Erabiltzeko aldi bereko HandBrake / FFmpeg instantzien kopurua? (Gomendatutako 4 edo gutxiago):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Ezarpen hau \"Bideoaren osasun egiaztatzea\" eta \"Eskaneatu eta bihurtzeko\" prozesuei aplikatzen zaie. Zehaztu erabili beharreko HandBrake hariak. Ez dago gehienezko kopurua, baina 4 baino gehiago ez erabiltzea gomendatzen da. Zenbategi handiagoak ordenagailua izoztu dezake, oso indartsua ez bada.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Ilararen tamaina ikuspegiaren muga? (Gomendatutako 1000 edo gutxiago):",
    "Automatically start \"Scan and convert\" when program opened?": "Hasi automatikoki \"Eskaneatu eta bihurtzea\" programa ireki denean?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Bete posta elektronikoaren xehetasunak posta elektroniko bidezko jakinarazpenak jasotzeko, errore bat gertatu bada osasun kontrol edo bihurketa / karpeta ikusten ari zaren bitartean. Ezingo 2FA eskatzen duten kontuekin lan egin. Gmail-eko kontuetako aplikazio seguruen sarbidea gaitu behar duzu.",
    "Email address:": "Posta elektroniko helbidea:",
    "For example:": "Adibidez:",
    "Email password(not saved):": "Posta elektronikoaren pasahitza (ez da gorde):",
    "SMTP server:": "SMTP zerbitzaria:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Ezaugarri honek bihurketa / osasun egoera egiaztatu ahal izango du edozein web-arakatzaile erabiliz. Erabilgarria da zerbitzariak exekutatzerakoan",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Gaituta badago, datu anonimo hauek HBBatchBeast.io helbidera bidaliko dira:",
    "API key": "API gakoa",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Uneko egoera ('Bilatu', \"Exekutatzen\", \"Bukatu\" eta abar)",
    "Number of:": "Zenbakia:",
    "Remaining items": "Gainerako elementuak",
    "Successful items": "Arrakastatsuak",
    "Errored items": "Errore elementuak",
    "Cancelled items": "Baliogabetutako elementuak",
    "Worker percentages": "Langileen ehunekoak",
    "Last completed item time": "Osatutako azken ordua",
    "Enable remote monitoring?:": "Gaitu urruneko jarraipena ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Oinarrizko benchmarking erabilgarritasun bat eraiki zen, batez ere, 16+ core prozesadoreek burutzen duten HandBrake hainbat instantziaz nola egiten duten ikusteko, nahiz eta edozein motako prozesadoreetan exekutatu daiteke.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Honek h265 4k lagin-fitxategia (2.5MB) deskargatuko du eta erreferentzia bat exekutatu 4 HandBrake instantzia erabiliz \"1080p30 oso azkar\" aurrez ezarritakoarekin.",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Emaitzak hbbatchbeast.io helbidean kargatu daitezke.",
    "Queue": "Ilaran",
    "Output this session": "Irteera saio hau",
    "Media info viewer tool": "Media info ikustaile tresna",
    "View compress attempt cache": "Ikusi konprimitzeko saiakera cachea",
    "Clear compress attempt cache": "Garbitu konprimatze saiakera cachea",
    "Save config": "Gorde konfigurazioa",
    "Scan only": "Eskaneatu soilik",
    "Scan and convert": "Eskaneatu eta bihurtu",
    "View scan/conversion summary log": "Ikusi eskaneatze / bihurketa laburpenen erregistroa",
    "View individual file check/conversion log": "Ikusi banakako fitxategiak egiaztatu / bihurketa erregistroa",
    "View worker console output": "Ikusi langileen kontsolaren irteera",
    "Health check": "Osasun txekea",
    "Clear healthy file cache": "Garbitu fitxategi osasuntsuaren cachea",
    "View error log": "Ikusi erroreen erregistroa",
    "Email test": "Posta elektronikoaren proba",
    "View master log": "Ikusi master erregistroa",
    "Wiki help": "Wiki laguntza",
    "An application by HaveAGitGat": "HaveAGitGat-en aplikazioa",
    "New": "New",
    "Launch": "Launch",
    "Benchmark": "benchmark",
    "See results": "Ikusi emaitzak",
    "Pause queue": "Eten ilaran",
    "Continue queue": "Jarraitu ilaran",
    "Stop queue": "Gelditu ilaran",
    "Convert selected files": "Bihurtu hautatutako fitxategiak",
    "Toggle queue view": "Txandakatu ilararen ikuspegia",
    "Deselect all": "Desautatu guztiak",
    "Invert all": "Alderantziz guztiak",
    "Select all": "Hautatu guztiak",
    "Toggle output view": "Aldatu irteera ikuspegia"
}