{"The number of custom presets does not match the number of source folders!":"تعدادی از پیش تنظیمات سفارشی با تعداد پوشه های منبع مطابقت ندارد!","source folders have been detected.":"پوشه های منبع شناسایی شده اند.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"خطوط پیش فرض سفارشی شناسایی شده اند. لطفا برای شکستن خط های نامرئی چک کنید باید یک مسیر پوشه یا پیش فرض در هر خط وجود داشته باشد. اطمینان حاصل کنید که به طور تصادفی یک خط خالی ایجاد نکرده اید.","The number of filename suffixes does not match the number of source folders! ":"تعداد پسوندهای فایل نامی با تعداد پوشه های منبع مطابقت ندارد!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"خطوط پسوند filename شناسایی شده اند. لطفا برای شکستن خط های نامرئی چک کنید باید یک مسیر پوشه یا نام پسوند فایل در هر خط وجود داشته باشد. اطمینان حاصل کنید که به طور تصادفی یک خط خالی ایجاد نکرده اید.","The number of source folders does not match the number of destination folders!":"تعداد پوشه های منبع با تعداد پوشه های مقصد مطابقت ندارد!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"پوشه های مقصد شناسایی شده اند. لطفا برای شکستن خط های نامرئی چک کنید در هر خط باید یک مسیر پوشه وجود داشته باشد. اطمینان حاصل کنید که به طور تصادفی یک خط خالی ایجاد نکرده اید.","The number of source folders does not match the number of temporary conversion folders!":"تعداد پوشه های منبع با تعداد پوشه های تبدیل موقت مطابقت ندارد!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"پوشه های موقت تبدیل شده اند شناسایی شده اند. لطفا برای شکستن خط های نامرئی چک کنید در هر خط باید یک مسیر پوشه وجود داشته باشد. اطمینان حاصل کنید که به طور تصادفی یک خط خالی ایجاد نکرده اید.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"لطفا یک ظرف معتبر مانند '.mp4' وارد کنید اطمینان حاصل کنید که شامل '.'","Corrupt file folder":"پوشه فایل خراب","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"وجود ندارد! لطفا مطمئن شوید که هیچ فضایی یا شخصیت های پنهان قبل یا بعد از مسیر وجود ندارد","Source folder":"پوشه منبع","Temporary conversion folder":"پرونده تبدیل موقت","appears to be the same as or is within source folder":"به نظر می رسد همانند یا در داخل پوشه منبع است","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"که HBBatchBeast را از عملکرد صحیح جلوگیری می کند. لطفا پوشه موقت تبدیل را به پوشه خارج از پوشه منبع تغییر دهید. اگر میخواهید از «ویژگی فایلهای اصلی جایگزین» را استفاده کنید، لطفا یک پوشه مقصد را انتخاب کنید که در پوشه منبع مشابه نیست یا در پوشه منبع نیست، و سپس گزینه «تغییر نام فایلهای همیشه اصلی» را در قسمت تنظیمات پیشرفته . کادر تأیید موقت \"پوشه تبدیل موقت\" را علامت بزنید زیرا در این مورد هیچ استفاده ای نخواهد کرد. فایل ها به پوشه مقصد تبدیل می شوند و سپس به پوشه منبع منتقل می شوند.","Destination folder":"پوشه مقصد","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"که HBBatchBeast را از عملکرد صحیح جلوگیری می کند. لطفا پوشه مقصد را به پوشه خارج از پوشه منبع تغییر دهید. اگر میخواهید از «ویژگی فایلهای اصلی جایگزین» را استفاده کنید، لطفا یک پوشه مقصد را انتخاب کنید که در پوشه منبع مشابه نیست یا در پوشه منبع نیست، و سپس گزینه «تغییر نام فایلهای همیشه اصلی» را در قسمت تنظیمات پیشرفته . کادر تأیید موقت \"پوشه تبدیل موقت\" را علامت بزنید زیرا در این مورد هیچ استفاده ای نخواهد کرد. فایل ها به پوشه مقصد تبدیل می شوند و سپس به پوشه منبع منتقل می شوند.","Error creating temporary conversion folder":"خطا در ایجاد پرونده تبدیل موقت","Error creating destination folder":"خطا در ایجاد پوشه مقصد","Please select to use HandBrake or FFmpeg!":"لطفا از HandBrake یا FFmpeg استفاده کنید","Please select a standard preset or input a custom one!":"لطفا یک پیش فرض استاندارد یا ورودی یک سفارشی را انتخاب کنید!","Please select a scan interval of 5 seconds or greater!":"لطفا یک فاصله اسکن 5 ثانیه یا بیشتر انتخاب کنید!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"لطفا مطمئن شوید که تعداد موارد همزمان HandBrake / FFmpeg برای استفاده یک یا بیشتر است!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"کلید API نامعتبر است! لطفا کلید جدید را بر روی زبانه نظارت از راه دور کلیک کنید تا کلید جدیدی ایجاد شود.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"لطفا یک اسکن روزانه در قالب 24 ساعته وارد کنید: hh: mm (به عنوان مثال 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"پرونده های منبع حذف خواهد شد پس از تبدیل! لطفا قبل از استفاده درست آزمایش کنید","Benchmark failed!":"معیار شکست خورد!","Log does not exist!":"ورودی وجود ندارد!","Folder does not exist!":"پوشه وجود ندارد!","Error sending email! Please check your settings.":"خطا در ارسال ایمیل! لطفا تنظیمات خود را بررسی کنید.","Test email sent!":"ایمیل تست فرستاده شد!","All worker processes have been stopped.":"تمام فرآیندهای کارگر متوقف شده اند.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"صف زمانی زمانی که موارد فعلی پردازش به پایان رسید متوقف خواهد شد. آیا مطمئن هستید که میخواهید صف را متوقف کنید؟","Queue pause initiated.'Continue' button will appear once all workers have paused.":"توقف مکالمه آغاز شده است. دکمه \"Continue\" هنگامی که تمام کارکنان متوقف شده اند ظاهر می شوند.","Healthy file cache cleared!":"حافظه فایل سالم پاک شده است!","Cache cleared!":"کش پاک شده!","Cancel item":"لغو مورد","Please check the above checkbox to use this feature.":"برای استفاده از این ویژگی، کادر انتخاب بالا را بررسی کنید.","Configuration":"پیکربندی","Source folders":"پوشه های منبع","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"این پوشه منبع است که برای رسانه ها اسکن می شود. پوشه باید بدون هیچ علامت عقبی وارد شود. مثلا:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"کادر مسیر پوشه منبع قابل گسترش است (برای ایجاد یک خط جدید، وارد شوید). اگر می خواهید پوشه های چند منبع را مشخص کنید، مطمئن شوید که هر مسیر منبع پوشه در خط خودش مانند:","Video health check":"بررسی سلامت ویدیو","Batch conversion and Folder watching":"تبدیل دسته ای و تماشای پوشه","Remote Monitoring (Beta)":"نظارت از راه دور (بتا)","Benchmark (Beta)":"معیار (بتا)","System":"سیستم","Help":"کمک","Temporary conversion folders":"پوشه های موقت تبدیل","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"اگر \"پرونده تبدیل موقت؟\" چک شده است، سپس HandBrake فایل ها را به آن پوشه تبدیل می کند. پس از پایان تبدیل، فایل به \"مقصد پوشه\" شما منتقل می شود. شما باید پوشه های موقت تبدیل به عنوان پوشه های منبع را مشخص کنید. اولین پوشه منبع شما به پوشه اول تبدیل موقت تبدیل می شود، پوشه دوم خود را به پوشه دوم تبدیل موقت و غیره تبدیل می کند. اطمینان حاصل کنید که هر مسیر پوشه تبدیل موقت در خط خود است.","Destination folders":"پوشه های مقصد","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"مسیرهای پوشه مقصد را مشخص کنید. مجددا باید پوشه های مقصد را به عنوان پوشه های منبع تعیین کنید. فایل های از اول پوشه اصلی شما در پوشه اول مقصد شما، فایل های پوشه دوم منبع شما در پوشه مقصد دوم شما و غیره به پایان خواهد رسید.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"پوشه اول منبع ---------> اولین پوشه تبدیل موقت ---------> پوشه اول مقصد","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"پوشه دوم منبع ---------> دوم پوشه تبدیل موقت دوم ---------> پوشه دوم دوم","etc":"و غیره","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast به درستی کار نخواهد کرد اگر پوشه مقصد را همانطور که در پوشه منبع قرار دارد قرار دهید.","Standard preset:":"پیش فرض استاندارد:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"مجموعه پیش فرض HandBrake که می خواهید فایل های خود را با استفاده از آن تبدیل کنید. اگر \"پیش فرض استاندارد\" انتخاب شده باشد، تمام فایل های موجود در پوشه های انتخاب شده با استفاده از پیش تعیین شده HandBrake مورد استفاده قرار می گیرند. در اینجا میتوانید از پیش تنظیمات HandBrake بیشتر بدانید:","Custom preset:":"پیش فرض سفارشی:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"اگر \"پیش تنظیم سفارشی\"، پس شما نیاز دارید که پیش فرض خود را وارد کنید. HBBatchBeast بخشی از HandBrakeCLI -i source -o destination را از ورودی HandBrakeCLI پوشش می دهد بنابراین شما نیاز به وارد کردن پارامترهای تبدیل دارید. مثلا:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"اگر با استفاده از FFmpeg، شما باید پارامتر ورودی و خروجی را با کاما جدا کنید. مانند:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"شما همچنین می توانید به پیش تنظیم سفارشی که از نرم افزار GUI HandBrake رسمی صادر شده پیوند دهید:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"اگر شما با تنظیمات پیش فرض سفارشی مشکل دارید، ممکن است به علت یک اشکال شناخته شده با HandBrakeCLI (در نسخه HandBrakeCLI بعدی تنظیم شود). لطفا این را برای یک راه حل موقت ببینید","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"هر یک از پیش تنظیم های سفارشی باید بر روی خط خود باشد و، مشابه پرونده ها، باید همانند بسیاری از تنظیمات پیش فرض سفارشی به عنوان پوشه های منبع باشد.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"پوشه اول منبع ---------> اولین فولدر تبدیل موقت ---------> پوشه اول مقصد @ سفارشی از پیش تعیین شده 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"پوشه دوم منبع ---------> دوم پوشه تبدیل موقت دوم ---------> پوشه دوم دوم @ سفارشی پیش فرض 2","See the following image for guidance:":"تصویر زیر را برای راهنمایی مشاهده کنید:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"در صورت استفاده از رمزگذاری کارت گرافیکی (مانند NVENC)، ممکن است نیاز به کاهش تعداد موارد HandBrake (2 یا کمتر را امتحان کنید) به دلیل محدودیت های VRAM.","Select standard preset:":"پیش فرض استاندارد را انتخاب کنید:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENCE تشخیص داده شده، لطفا مطمئن شوید که تعداد نمونه های HandBrakeCLI را به 2 یا کمتر (برای اکثر کارت های گرافیکی) کاهش دهید و یا ممکن است با توجه به VRAM کافی نداشته باشید. این تنظیم را می توان در زبانه \"System\" یافت.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"پیش فرض وارد شده شناسایی شده است. اگر با ایستگاه از پیش تنظیم سفارشی وارد شده مشکل دارید، ممکن است به علت یک اشکال شناخته شده با HandBrakeCLI (در نسخه HandBrakeCLI بعدی تنظیم شود). یک راه حل موقت حذف \"PictureRotate\": \"0: 0\" از فایل json است. اطلاعات بیشتر در اینجا:","Container:":"کانتینر:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"ظرفی را که می خواهید فایل خروجی مانند \".mp4\" را انتخاب کنید مشخص کنید. شما می توانید اطلاعات بیشتر در مورد ظروف را در:","Enable periodic scanning:":"اسکن دوره ای را فعال کنید:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast می تواند پوشه های منبع خود را نظارت و اسکن برای فایل های جدید را در یک فاصله زمانی مشخص اجرا کند. فاصله زمانی در ثانیه با پیش فرض 300 ثانیه (5 دقیقه) است. اگر این گزینه انتخاب شده باشد، سپس وقتی \"Scan and convert\" را فشار دهید، برنامه هر فایل جدیدی را تبدیل می کند و سپس یک تایمر شمارش معکوس شروع خواهد شد. این تا زمانی که متوقف شود، بی نهایت حلقه می شود. فاصله اسکن در قسمت تنظیمات پیشرفته است.","Enable daily scanning:":"اسکن روزانه را فعال کنید:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"به جای اسکن مجدد، شما می توانید اسکن یک بار در روز را انتخاب کنید. زمان اسکن در بخش تنظیمات پیشرفته در قالب hh: mm مانند '18: 30 'وارد می شود. هنگامی که «اسکن و تبدیل» انتخاب می شود، برنامه تا زمانی که زمان خاصی را اجرا می کند تا زمانی که یک فرآیند اسکن و تبدیل انجام نشود، منتظر بماند. باز هم، تا زمانی که متوقف شود، آن را بی نهایت حلقه می کند.","Show/hide advanced:":"نمایش / مخفی کردن پیشرفته:","Scan interval (minimum 5 seconds):":"فاصله اسکن (حداقل 5 ثانیه):","Daily run time (hh:mm):":"زمان اجرا روزانه (hh: mm):","Output filename suffix:":"خروجی نام فایل پسوند:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"این اختیاری است شما می توانید یک پسوند را برای افزودن نام فایل به عنوان \"_1080p\" یا \"_testconversion\" و غیره اضافه کنید.","If 'standard preset' is selected then all output files will have the same suffix.":"اگر \"پیش فرض استاندارد\" انتخاب شده باشد، تمام فایلهای خروجی یک پسوند مشابهی را خواهند داشت.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"اگر 'پیش فرض سفارشی' انتخاب شده باشد، می توانید یک پسوند را در هر پوشه منبع یا پیش فرض سفارشی مشخص کنید. اطمینان حاصل کنید که هر پسوند در خط خود است. برای مثال، اگر شما 2 پوشه منبع داشته باشید و از «پیش فرض سفارشی» استفاده می کنید، می توانید این را در جعبه پسوند فایل نامگذاری کنید:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"فایل ها در پوشه اول منبع '_720p' اضافه شده به خروجی نام فایل. فایل ها در پوشه منبع دوم '_1080p' اضافه خواهد شد به نام فایل خروجی و غیره","Include these file containers:":"این ظروف فایل را وارد کنید:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"ظروف فایل را برای اسکن وارد کنید. هر نوع باید با کاما از هم جدا شود. ورودی پیش فرض:","Exclude files smaller than (MB):":"فایلهای کوچکتر از (MB) را حذف کنید:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"مشخص کنید که آیا فایلهای کوچکتر از یک اندازه مشخص از تبدیل (در مگابایت) حذف شوند","Exclude files larger than (MB):":"حذف فایل های بزرگتر از (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"تعیین اینکه آیا فایلهای بزرگتر از یک اندازه مشخص از تبدیل (در مگابایت) حذف شوند","Exclude filenames which include any of these words:":"Exclude نامهای فایل که شامل هر کدام از این کلمات هستند:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"هنگام جستجو برای فایل ها، کلمات کلیدی را وارد کنید. به عنوان مثال، اگر \"720p\" وارد شده باشد، هر گونه فایل با \"720p\" در عنوان تبدیل نمی شود. باز هم، کلمات کلیدی باید با کاما جدا شوند. به عنوان مثال، در جعبه فیلتر زیر را وارد کنید:","Include files with any ":"شامل فایل ها با هر"," or all ":"یا همه"," of these":"از اینها","properties:":"خواص:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"در اینجا می توانید ویژگی های ویدئویی و صوتی را که فایل ها باید برای تبدیل شدن (اطلاعات استخراج شده با استفاده از FFprobe) وارد کنید. خواص باید با کاما جدا شوند. از ابزار ابزار مشاهده اطلاعات رسانه استفاده کنید تا بتوانید مشخص کنید کدام خواص را می خواهید اضافه کنید. اطمینان حاصل کنید که بعد از آخرین اموال کاما قرار دهید. برای مثال، فقط برای تبدیل فایل هایی که با استفاده از صوتی صوتی H264 و AAC رمزگذاری می شوند:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"شایان ذکر است که این بررسی املاک پس از اتمام فرایند تبدیل انجام می شود (برای صرفه جویی در وقت در حال ساختن صف)، بنابراین اگرچه فایل ها ممکن است در صف تبدیل ظاهر شوند، اگر شرایط صحیح برآورده شوند، آن ها حذف می شوند / شامل می شوند.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"اگر FFprobe بتواند خواص را استخراج کند، در «ستون« FFprobe »در نمای صف« OK »ظاهر می شود.","Exclude files with any ":"فایلها را با هرکدام جدا کنید"," of these ":"از اینها","The opposite of 'Include files with any or all of these properties'":"مخالفت با \"شامل فایل با هر یا همه از این خواص\"","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"این یک ابزار کوچک برای تجزیه و تحلیل خواص فایل است تا شما بتوانید تعیین کنید کدام ویژگی های مورد علاقه خود را در گزینه های بالا شامل / حذف کنید. از FFprobe برای بازگشت اطلاعات استفاده می کند. برای تجزیه و تحلیل آنها، فایل ها را به جعبه خاکستری بکشید و رها کنید. به عنوان مثال، افتادن در یک فایل تست ممکن است به موارد زیر بازگردد:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"اگر قصد دارید اینگونه فایلها را از تبدیل شدن حذف کنید، میتوانید چندین ویژگی فایل را در کادر «Exclude files with any or all these properties» قرار دهید و کادر انتخاب کنار «all» به جای «any» را علامت بزنید مانند:","Copy excluded files to destination:":"کپی فایل های منقضی شده به مقصد:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"اگر این گزینه را انتخاب کنید، فایل هایی که از تبدیل حذف شده اند به طور مستقیم به پوشه مقصد کپی می شوند. این برای فیلترهای زیر اعمال می شود:","Exclude filenames which include any of these words":"Exclude نامهای فایل که شامل هر یک از این کلمات است","Include files with any or all of these properties":"شامل فایل هایی با هر یک از این ویژگی ها یا همه آنها باشد","Exclude files with any or all of these properties":"فایلها را با هر یک از این ویژگیها یا همه آنها حذف کنید","Exclude files smaller than (MB)":"حذف فایلهای کوچکتر از (MB)","Exclude files larger than (MB)":"حذف فایلهای بزرگتر از (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"توجه داشته باشید که این موضوع نیز در مورد فایل های حذف شده اعمال می شود زیرا آنها شرایط ملک \"Include\" را در بالا ذکر نمی کنند، به طوری که به طور تصادفی شما کل کتابخانه را کپی نمی کنید زمانی که فقط سعی در تبدیل چند فایل دارید.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"ویژگی کپی به فیلترهای زیر اعمال نمی شود (به عنوان مثال فایل ها به علت فیلتر حذف شده اند)","Include these file types":"شامل این انواع فایل ها","Delete source files after conversion:":"حذف فایل های منبع پس از تبدیل:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"اگر این انتخاب شده باشد، پس اگر تلاش تبدیل موفق باشد، فایل منبع حذف خواهد شد. پس از تبدیل تمام فایلها، این فرایند در انتهای انجام می شود. این به این معنی است که شما می توانید فایل های منبع مشابه را با استفاده از ایستگاه از پیش تنظیم چندگانه، همه در یک حرکت تبدیل کنید. سپس فایلهای منبع پس از آن حذف خواهند شد.","Replace original file if converted file is smaller?(Compress attempt)":"جایگزین فایل اصلی اگر فایل تبدیل کوچکتر است (تلاش فشرده سازی)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"این گزینه را انتخاب کنید اگر می خواهید HBBatchBeast به طور خودکار فایل منبع اصلی را جایگزین کند، اگر فایل جدید کوچکتر باشد. اگر فایل جدید کوچکتر نباشد، در پوشه مقصد باقی خواهد ماند.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"اطمینان حاصل کنید که پوشه مقصد شما مشابه / یا در داخل نیست، پوشه منبع شما یا آن کار درستی نخواهد کرد.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"هنگامی که HBBatchBeast تلاش کرد برای فشرده سازی یک فایل خاص، آن مسیر فایل را به یک حافظه کش اضافه می کند تا دوباره در آینده تلاش نشود. شما می توانید با استفاده از دکمه های زرد مشاهده / ویرایش / پاک کردن کش را مشاهده کنید.","Replace original file always?":"همیشه فایل اصلی را جایگزین کنید","The original file will be replaced regardless of whether the new file is larger or smaller.":"فایل اصلی بدون توجه به اینکه آیا فایل جدید بزرگتر یا کوچکتر است جایگزین خواهد شد.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"دوباره مطمئن شوید که پوشه مقصد شما همانند / یا در داخل نیست، پوشه منبع شما یا آن کار درست نخواهد کرد.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"هنگامی که HBBatchBeast فایل خاصی را انتقال داده است، مسیر مسیر فایل را به یک حافظه کش اضافه می کند تا دوباره در آینده تلاش نشود. شما می توانید با استفاده از دکمه های زرد مشاهده / ویرایش / پاک کردن کش را مشاهده کنید.","Copy subtitle (srt) files to destination?":"کپی زیرنویس (srt) فایل ها به مقصد؟","Subtitle '.srt' files will be copied to the destination folder automatically.":"فایل های subtitle '.srt' به صورت خودکار به پوشه مقصد کپی می شوند.","Automatically create temporary/destination folders if they don't exist?":"به طور خودکار پوشه های موقت / مقصد ایجاد کنید، اگر آنها وجود نداشته باشند؟","Custom bat path to run after each conversion (leave blank if not using):":"مسیر سفارشی خفاش پس از هر تبدیل، اجرا می شود (اگر با استفاده از آن خالی بگذارید):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"مسیر را به یک فایل دسته ای سفارشی که می خواهید پس از هر تبدیل انجام دهید وارد کنید. مثلا:","Batch files with timeout statements won't work. More info here:":"فایل های دسته ای با اظهارات تعطیلات کار نخواهند کرد. اطلاعات بیشتر در اینجا:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"اگر نمیخواهید از این گزینه استفاده کنید، کادر را کاملا خالی کنید (مطمئن شوید که هیچ شخصیت مخفی در جعبه وجود ندارد)","Run processes at low priority?":"فرآیندهای را در اولویت کم اجرا کنید؟","All conversion processes will be run at low priority, reducing processor usage.":"تمام فرایندهای تبدیل در اولویت کم اجرا خواهند شد و مصرف پردازنده کاهش خواهد یافت.","Remove apostrophes from filenames:":"حذف apostrophes از نام فایل:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"اسکنهای تبدیل / بررسی سلامتی ممکن است با شکست مواجه شوند در صورتی که نامهای پرونده در آپستروپ قرار داشته باشند. این را بررسی کنید تا آپوستروفها را از نام فایلها حذف کنید."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"این ویژگی می تواند فایل های فاسد فایلی را با استفاده از قابلیت 'sscan' HandBrake اسکن کند، هرچند این همیشه دقیق نیست. این همچنین از FFprobe برای ارائه نقطه مرجع دوم استفاده می کند. اگر هر دو FFprobe و HandBrake خراب شوند، احتمالا فایلی وجود دارد که فایل خراب است.","Move corrupt files into the following folder:":"فایل های فاسد را به پوشه زیر انتقال دهید:"," If checked, then any files which give errors will be moved into the specified folder.":"اگر چک شده باشد، سپس هر پرونده ای که خطا را ارائه می دهد، به پوشه مشخص منتقل می شود.","Corrupt file folder:":"پوشه فایل خراب","Run thorough file health check:":"بررسی کامل فایل پرونده را انجام دهید:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"اگر چک شود، پس از بررسی دقیق تر سلامت ویدئو، با استفاده از FFmpeg به جای HandBrake اجرا می شود."," Based on Desani's 'ScanMedia.ps1' found at:":"بر اساس ScanMedia.ps1 داسانی در:","Attempt to repair files after thorough check:":"تلاش برای تعمیر فایل ها پس از بررسی کامل:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"در صورت بررسی، HBBatchBeast تلاش خواهد کرد که فایل ها را با استفاده از FFmpeg تعمیر کند. یک فایل جدید با پسوند _repaired در همان فولدر به عنوان فایل منبع ایجاد می شود.","'CRF' value to use when attempting to repair files:":"مقدار 'CRF' برای استفاده در هنگام تلاش برای تعمیر فایل ها:","The default 'CRF' value is 23. Please see the following for more information:":"مقدار پیش فرض 'CRF' 23 است. لطفا برای اطلاعات بیشتر زیر را مشاهده کنید:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"محدوده مقیاس CRF 0-51 است، جایی که 0 از دست رفته است، 23 پیش فرض است، و 51 بدترین کیفیت ممکن است. مقدار پایین تر به طور کلی به کیفیت بالاتر منجر می شود و محدوده ی ذهنی مناسبی 17 تا 28 است. 17 یا 18 را در نظر بگیرید که از دست دادن بصری یا تقریبا چنین است؛ باید به همان یا تقریبا همان ورودی نگاه کند، اما از لحاظ فنی از دست نداده است.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast لیستی از مسیرهای فایل اسکن شده را که به صورت غیرقانونی گزارش شده است را ذخیره می کند. پاک کردن کش برای انجام یک اسکن تازه در تمام فایل ها.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"تعداد موارد همزمان HandBrake / FFmpeg برای استفاده؟ (توصیه 4 یا کمتر):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"این تنظیم برای هر دو \"بررسی سلامت ویدئو\" و \"فرآیند اسکن و تبدیل\" اعمال می شود. مشخص کنید که چه تعداد Threadbrands برای استفاده استفاده می شود. حداکثر حداکثر وجود ندارد، اگر چه توصیه می شود از بیش از 4 استفاده نکنید. مقدار بالاتری ممکن است کامپیوتر شما را فریب دهد، اگر آنقدر قدرتمند نیست.","Queue size view limit?(Recommended 1000 or fewer):":"حد نمایش نمایش در صف (توصیه 1000 یا کمتر):","Automatically start \"Scan and convert\" when program opened?:":"هنگامی که برنامه باز می شود، به طور خودکار \"اسکن و تبدیل\" شروع می شود:","Save verbose logs?:":"صرفه جویی در سیاهههای مربوط؟","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"برای تأیید سیاهههای مربوط به زیر فرآیند، این گزینه را علامت بزنید. این شامل خروجی کنسول کارگر است. این باعث می شود که سیاهچاله ها بسیار بزرگ شوند.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"جزئیات ایمیل را برای دریافت اعلان های ایمیل پر کنید اگر خطا در هنگام بررسی سلامت یا تماشای تبدیل / پوشه رخ دهد. با حسابهایی که نیاز به 2FA دارند کار نخواهد کرد. شما باید دسترسی به برنامه های امن تر را در حساب های Gmail فعال کنید.","Email address:":"آدرس ایمیل:","For example:":"مثلا:","Email password(not saved):":"رمز عبور ایمیل (ذخیره نشده):","SMTP server:":"سرور SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"این ویژگی امکان نظارت بر وضعیت تبدیل / بررسی وضعیت سلامت را با استفاده از هر مرورگر وب فراهم می کند. در هنگام اجرای سرورها و غیره مفید نیست. نامهای فایل ارسال نمیشوند.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"اگر فعال باشد، داده های ناشناس زیر به HBBatchBeast.io ارسال خواهد شد:","API key":"کلید ای پی ای","Current status ('Searching', 'Running', 'Finished' etc)":"وضعیت فعلی ('جستجو'، 'در حال اجرا'، 'پایان' و غیره)","Number of:":"تعداد:","Remaining items":"موارد باقی مانده","Successful items":"موارد موفق","Errored items":"موارد خطا","Cancelled items":"موارد لغو شده","Worker percentages":"درصد کارگر","Last completed item time":"آخرین مورد زمان تکمیل شده","Enable remote monitoring?:":"نظارت از راه دور را فعال کنید ؟:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"یکی از ابزارهای پایهی سنجی که به طور عمده برای دیدن نحوه عملکرد 16+ پردازندههای اصلی با استفاده از چند نمونه HandBrake انجام شده است، هرچند که در هر نوع پردازنده اجرا می شود.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"این یک پرونده نمونه 4k h265 (2.5 مگابایت) را دانلود کرده و یک معیار را با استفاده از 4 نمونه HandBrake با پیش فرض \"بسیار سریع 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"نتایج را می توان به hbbatchbeast.io آپلود کرد اگر انتخاب کردید.","Queue":"صف","Output this session":"خروجی این جلسه","Media info viewer tool":"ابزار مشاهده اطلاعات اطلاعات","View replaced file cache":"مشاهده جایگزین حافظه پنهان","Clear replaced file cache":"پاک کردن جایگزین حافظه فایل","Save config":"صرفه جویی در تنظیمات","Scan only":"فقط اسکن کنید","Scan and convert":"اسکن و تبدیل","View scan/conversion summary log":"مشاهده گزارش خلاصه اسکن / تبدیل","View individual file check/conversion log":"مشاهده پرونده بررسی / تبدیل فایل شخصی","View worker console output":"مشاهده خروجی کنسول کارگر","Health check":"بررسی سلامت","Clear healthy file cache":"پاک کردن حافظه فایل سالم","View error log":"مشاهده ورود به سیستم خطا","Email test":"آزمون ایمیل","View master log":"مشاهده ورودی اصلی","Wiki help":"ویکی کمک","An application by HaveAGitGat":"یک برنامه توسط HaveAGitGat","New":"جدید","Launch":"راه اندازی","Benchmark":"معیار","See results":"نتایج را ببینید","Pause queue":"مکث صف","Continue queue":"ادامه صف","Stop queue":"صف را متوقف کنید","Convert selected files":"تبدیل فایل های انتخاب شده","Toggle queue view":"نمایش صف را تغییر دهید","Deselect all":"همه را حذف کنید","Invert all":"همه را ببند","Select all":"انتخاب همه","Toggle output view":"نمایش خروجی را تغییر دهید"}