{"The number of custom presets does not match the number of source folders!":"Mukautettujen esiasetusten määrä ei vastaa lähdekansioiden määrää!","source folders have been detected.":"lähdekansiot on havaittu.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"räätälöityjä rivejä on havaittu. Tarkista, näkyykö näkymätön rivinvaihto. Jokaisella rivillä pitäisi olla yksi kansiopolku tai esiasetus. Varmista, että et ole vahingossa luonut tyhjää riviä.","The number of filename suffixes does not match the number of source folders! ":"Tiedostotunnisteiden lukumäärä ei vastaa lähdekansioiden määrää!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"tiedostotunnisteiden rivit on havaittu. Tarkista, näkyykö näkymätön rivinvaihto. Jokaisella rivillä tulisi olla yksi kansiopolku tai tiedostonimen suffiksi. Varmista, että et ole vahingossa luonut tyhjää riviä.","The number of source folders does not match the number of destination folders!":"Lähdekansioiden määrä ei vastaa kohdekansioiden määrää!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"kohdekansiot on havaittu. Tarkista, näkyykö näkymätön rivinvaihto. Jokaisella rivillä pitäisi olla yksi kansiopolku. Varmista, että et ole vahingossa luonut tyhjää riviä.","The number of source folders does not match the number of temporary conversion folders!":"Lähdekansioiden määrä ei vastaa väliaikaisten muunnoskansioiden määrää!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"väliaikaisia muunnoskansioita on havaittu. Tarkista, näkyykö näkymätön rivinvaihto. Jokaisella rivillä pitäisi olla yksi kansiopolku. Varmista, että et ole vahingossa luonut tyhjää riviä.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Anna kelvollinen kontti, kuten \".mp4\". Muista sisällyttää \".\"","Corrupt file folder":"Virheellinen tiedoston kansio","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ei ole olemassa! Varmista, että ennen polkua tai sen jälkeen ei ole välilyöntejä tai piilotettuja merkkejä","Source folder":"Lähdekansio","Temporary conversion folder":"Väliaikainen muokkauskansio","appears to be the same as or is within source folder":"näyttää olevan sama kuin lähdekansiossa","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"joka estää HBBatchBeastin toimimisen oikein. Muuta väliaikainen muunnoskansio lähdekansion ulkopuolelle. Jos haluat käyttää Korvaa alkuperäiset tiedostot -toimintoa, valitse kohdekansio, joka ei ole sama kuin lähdekansiossa tai sisällä, ja valitse sitten Korvaa alkuperäiset tiedostot -valintaruutu Lisäasetukset-osiossa . Poista tilapäinen \"väliaikainen muuntokansio\" -valintaruutu, koska se ei käytä mitään tässä tapauksessa. Tiedostot muunnetaan kohdekansioon ja siirretään sitten lähdekansioon.","Destination folder":"Kohdekansio","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"joka estää HBBatchBeastin toimimisen oikein. Muuta kohdekansio lähdekansion ulkopuolella olevaan kansioon. Jos haluat käyttää Korvaa alkuperäiset tiedostot -toimintoa, valitse kohdekansio, joka ei ole sama kuin lähdekansiossa tai sisällä, ja valitse sitten Korvaa alkuperäiset tiedostot -valintaruutu Lisäasetukset-osiossa . Poista tilapäinen \"väliaikainen muuntokansio\" -valintaruutu, koska se ei käytä mitään tässä tapauksessa. Tiedostot muunnetaan kohdekansioon ja siirretään sitten lähdekansioon.","Error creating temporary conversion folder":"Virhe tilapäisen muuntokansion luomisessa","Error creating destination folder":"Virhe luotaessa kohdekansiota","Please select to use HandBrake or FFmpeg!":"Valitse käyttääksesi HandBrake tai FFmpeg!","Please select a standard preset or input a custom one!":"Valitse vakioasetus tai tulosta mukautettu asetus!","Please select a scan interval of 5 seconds or greater!":"Valitse 5 sekunnin tai suurempi skannausväli!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Varmista, että samanaikaisesti käytettyjen HandBrake / FFmpeg-esiintymien määrä on yksi tai suurempi!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Virheellinen API-avain! Luo uusi avain napsauttamalla etävalvonta-välilehden Uusi-painiketta.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Anna päivittäinen skannausaika 24 tunnin muodossa: hh: mm (esimerkiksi 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"LÄHTEEN TIEDOT VÄLITTÄVÄN KONVERSIONIN JÄLKEEN! Testaa ennen käyttöä!","Benchmark failed!":"Benchmark epäonnistui!","Log does not exist!":"Loki ei ole olemassa!","Folder does not exist!":"Kansiota ei ole!","Error sending email! Please check your settings.":"Virhe sähköpostin lähettämisessä! Tarkista asetukset.","Test email sent!":"Testattu sähköposti lähetetään!","All worker processes have been stopped.":"Kaikki työntekijän prosessit on pysäytetty.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Jonot keskeytetään, kun nykyiset kohteet ovat päättyneet. Haluatko varmasti keskeyttää jonon?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Queue pause inited. \"Jatka\" -painike tulee näkyviin, kun kaikki työntekijät ovat keskeyttäneet.","Healthy file cache cleared!":"Terve tiedostojen välimuisti tyhjennetty!","Cache cleared!":"Välimuisti tyhjennetty!","Cancel item":"Peruuta kohde","Please check the above checkbox to use this feature.":"Käytä tätä valintaruutua, jos haluat käyttää tätä ominaisuutta.","Configuration":"kokoonpano","Source folders":"Lähdekansiot","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Tämä on lähdekansio, joka skannataan medialle. Kansio on syötettävä ilman peräkkäistä viivaa. Esimerkiksi:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Lähdekansion polku-ruutu on laajennettavissa (luo uusi rivi painamalla Enter-näppäintä). Jos haluat määrittää useita lähdekansioita, varmista, että jokainen lähdekansion polku on omalla rivillään, kuten:","Video health check":"Videon terveystarkastus","Batch conversion and Folder watching":"Erämuunnos ja kansioiden katselu","Remote Monitoring (Beta)":"Etävalvonta (beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"järjestelmä","Help":"auta","Temporary conversion folders":"Väliaikaiset muunnoskansiot","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Jos \"väliaikainen muokkauskansio?\" on valittu, sitten HandBrake muuntaa tiedostot kansioon. Kun muunnos on valmis, tiedosto siirretään \"Kohde-kansioon\". Sinun on määritettävä niin monta väliaikaista muunnoskansiota kuin lähdekansiot. Ensimmäinen lähdekansiosi muunnetaan ensimmäiseksi väliaikaiseksi muuntokansioksi, toinen lähdekansiosi toiseen väliaikaiseen muunnoskansioon ja niin edelleen. Varmista, että jokainen väliaikaisen muuntokansion polku on omalla rivillään.","Destination folders":"Kohdekansiot","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Määritä kohdekansion polut. Jälleen sinun on määritettävä niin monta kohdekansiota kuin lähdekansiot. Ensimmäisen lähdekansion tiedostot päättyvät ensimmäiseen kohdekansioon, toinen lähdekansion tiedostot toiseen kohdekansioon ja niin edelleen.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Ensimmäinen lähdekansio ---------> Ensimmäinen väliaikainen muuntokansio ---------> Ensimmäinen kohdekansio","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Toinen lähdekansio ---------> Toinen väliaikainen muuntokansio ---------> Toinen kohdekansio","etc":"jne","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast ei toimi oikein, jos asetat kohdekansion samaksi kuin lähdekansion tai sen sisällä.","Standard preset:":"Vakioasetus:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Valitse HandBrake-esiasetus, johon haluat muuntaa tiedostot. Jos \"Standard preset\" on valittu, kaikki valitut kansiotiedostot muunnetaan käyttämällä määritettyä Handbrrake-asetusta. Lisätietoja HandBrake-esiasetuksista löydät täältä:","Custom preset:":"Mukautettu esiasetus:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Jos \"Mukautettu esiasetus\", sinun on annettava oma mukautettu esiasetus. HBBatchBeast kattaa HandBrakeCLI-syötteen \"HandBrakeCLI -i source -o-kohde\" -osan, joten sinun täytyy syöttää muunnosparametrit. Esimerkiksi:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Jos käytät FFmpeg-toimintoa, sinun täytyy erottaa tulo- ja lähtöparametrit pilkulla. Kuten:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Voit myös linkittää mukautetun esiasetuksen, joka on viety virallisesta HandBrake GUI -sovelluksesta, esimerkiksi:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Jos sinulla on vaikeuksia mukautettujen esiasetusten kanssa, se voi johtua tunnetusta virheestä HandBrakeCLI: n kanssa (se vahvistetaan seuraavassa HandBrakeCLI-julkaisussa). Katso tämä tilapäinen ratkaisu:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Jokaisen mukautetun esiasetuksen on oltava omalla rivillään, ja kansioiden tavoin on oltava yhtä monta mukautettua esiasetusta kuin lähdekansiot.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Ensimmäinen lähdekansio ---------> Ensimmäinen väliaikainen muuntokansio ---------> Ensimmäinen kohdekansio @ Mukautettu esiasetus 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Toinen lähdekansio ---------> Toinen väliaikainen muuntokansio ---------> Toinen kohdekansio @ Mukautettu esiasetus 2","See the following image for guidance:":"Katso seuraava kuva ohjausta varten:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Jos käytät grafiikkakortin koodausta (kuten NVENC), saatat joutua vähentämään HandBrake-esiintymien määrää (kokeile 2 tai vähemmän) VRAM-rajoitusten vuoksi.","Select standard preset:":"Valitse vakioasetus:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC havaittu, varmista, että pienennät HandBrakeCLI-esiintymien määrää 2: een tai alle (useimpien grafiikkakorttien osalta) tai saatat kohdata virheitä, koska VRAM ei ole riittävä. Tämä asetus löytyy \"Järjestelmä\" -välilehdestä.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Tuodut esiasetukset on havaittu.Jos sinulla on ongelmia tuotujen mukautettujen esiasetusten kanssa, se saattaa johtua tunnetusta vikasta HandBrakeCLI: llä (se vahvistetaan seuraavassa HandBrakeCLI-julkaisussa). Väliaikainen ratkaisu on poistaa \"\" PictureRotate \":\" 0: 0 \".json-tiedostosta. Lisätietoja täältä:","Container:":"container:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Määritä säiliö, johon haluat tiedoston olevan .mp4. Saat lisätietoja säiliöistä osoitteessa:","Enable periodic scanning:":"Ota käyttöön säännöllinen skannaus:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast voi seurata lähdekansioita ja suorittaa skannauksia uusille tiedostoille tietyllä aikavälillä. Aikaväli on sekunneissa oletusarvona 300 sekuntia (5 minuuttia). Jos tämä vaihtoehto on valittuna, kun skannaat ja muunnetaan, ohjelma muuntaa kaikki uudet tiedostot ja alkaa ajastin. Tämä silmukkaa loputtomasti, kunnes se pysähtyy. Skannausväli on lisäasetusten osassa.","Enable daily scanning:":"Ota päivittäinen skannaus käyttöön:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Säännöllisen skannauksen sijasta voit valita, suoritetaanko skannaus kerran päivässä. Skannausaika syötetään lisäasetusten osaan hh: mm-muodossa, kuten '18: 30'. Kun \"Skannaus ja muuntaminen\" on valittu, ohjelma odottaa määritetyn ajan kunnes skannaus- ja muuntoprosessi on suoritettu. Jälleen tämä silmukkaa loputtomasti, kunnes se pysähtyy.","Show/hide advanced:":"Näytä / piilota edistynyt:","Scan interval (minimum 5 seconds):":"Skannausväli (vähintään 5 sekuntia):","Daily run time (hh:mm):":"Päivittäinen ajoaika (hh: mm):","Output filename suffix:":"Tulostustiedoston nimi:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Tämä on valinnainen. Voit määrittää suffiksin lisätäksesi tiedostonimen loppuun, kuten '_1080p' tai '_testconversion' jne.","If 'standard preset' is selected then all output files will have the same suffix.":"Jos valitaan \"vakioasetukset\", kaikilla tulostustiedostoilla on sama sufiksi.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Jos olet valinnut 'custom preset', voit määrittää yhden päätteen jokaiselle lähdekansion / mukautetun esiasetuksen kohdalle. Varmista, että jokainen sufiksi on omalla rivillään. Jos sinulla on esimerkiksi 2 lähdekansiota ja käytät 'mukautettua esiasetusta', voit asettaa sen tiedostonimen suffiksiruutuun:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Ensimmäisessä lähdekansiossa oleviin tiedostoihin lisätään '_720p' lähdön tiedostonimelle. Toisessa lähdekansiossa olevilla tiedostoilla on '_1080p' lisätty tulostustiedoston nimeen jne.","Include these file types:":"Lisää nämä tiedostotyypit:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"Anna tarkistettavat tiedostotyypit. Jokainen tyyppi on erotettava pilkulla. Oletusmerkintä on:","Exclude files smaller than (MB):":"Sulje (MB) pienemmät tiedostot:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Määritä, poistetaanko tietystä koosta pienemmät tiedostot muunnoksesta (megatavuina)","Exclude files larger than (MB):":"Sulje (MB) suuremmat tiedostot pois:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Määritä, poistetaanko tietystä koosta suuremmat tiedostot muunnoksesta (megatavuina)","Exclude filenames which include any of these words:":"Sulje pois tiedostonimet, joihin sisältyy jokin seuraavista sanoista:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Syötä suodattavat avainsanat tiedostoja skannattaessa. Jos esimerkiksi syötetään \"720p\", niin nimikkeessä \"720p\" olevia tiedostoja ei muunneta. Avainsanat on jälleen erotettava pilkulla. Kirjoita esimerkiksi seuraavat tiedot suodatinlaatikkoon:","Include files with any ":"Lisää tiedostoja mihin tahansa"," or all ":"tai kaikki"," of these":"Näiden","properties:":"ominaisuudet:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Täällä voit syöttää videon ja äänen ominaisuuksia, joiden tiedostojen täytyy olla, jotta ne voidaan muuntaa (tiedot uutetaan FFproben avulla). Ominaisuudet on erotettava pilkulla. Voit määrittää mediatietojen katseluohjelman avulla, mitä ominaisuuksia haluat sisällyttää. Muista laittaa pilkku viimeisen omaisuuden jälkeen. Voit esimerkiksi muuntaa vain h264- ja aac-stereoäänellä koodattuja tiedostoja:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"On syytä huomata, että tämä ominaisuuden tarkistus tehdään, kun muuntoprosessi alkaa (säästää aikaa jonon rakentamisen aikana), joten vaikka tiedostot saattavat näkyä muunnosjonossa, ne ohitetaan / sisällytetään, jos oikeat ehdot täyttyvät.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Jos FFprobe pystyy poistamaan ominaisuuksia, \"OK\" näkyy jononäkymässä \"FFprobe\" -sarakkeessa.","Exclude files with any ":"Poista tiedostot millä tahansa"," of these ":"Näiden","The opposite of 'Include files with any or all of these properties'":"Vastakohta 'Sisällytä tiedostot johonkin tai kaikkiin näistä ominaisuuksista'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Tämä on pieni työkalu tiedostojen ominaisuuksien analysointiin, jotta voit määrittää, mitkä ominaisuudet haluat sisällyttää / jättää pois yllä olevista vaihtoehdoista. Se käyttää FFprobeä palauttamaan tietoja. Vedä ja pudota tiedostot harmaaseen laatikkoon analysoitaaksesi ne. Esimerkiksi testitiedostoon pudottaminen saattaa palauttaa seuraavat tiedot:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Jos et halua sulkea tällaisia tiedostoja muuntamasta, voit laittaa useita tiedostoominaisuuksia \"Sulje tiedostot, joissa on kaikki tai kaikki näistä ominaisuuksista\" -ruutu, ja valitse \"kaikki\" -kohdan vieressä oleva valintaruutu \"kaikki\", niin kuin:","Copy excluded files to destination:":"Kopioi poissuljetut tiedostot kohteeseen:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Jos valitset tämän vaihtoehdon, tiedostot, jotka on poistettu muuntamisesta, kopioidaan suoraan kohdekansioon. Tämä koskee seuraavia suodattimia:","Exclude filenames which include any of these words":"Sulje pois tiedostonimet, joihin sisältyy jokin näistä sanoista","Include files with any or all of these properties":"Sisällytä tiedostot, joissa on kaikki tai kaikki näistä ominaisuuksista","Exclude files with any or all of these properties":"Sulje tiedostot, joilla on jokin tai kaikki näistä ominaisuuksista","Exclude files smaller than (MB)":"Poista (MB) pienemmät tiedostot","Exclude files larger than (MB)":"Sulje (MB) suuremmat tiedostot pois","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Huomaa, että tämä koskee myös poissuljettuja tiedostoja, koska ne eivät täytä ylläolevia \"Sisällytä\" -ominaisuuksia, joten älä vahingossa kopioi koko kirjastoa, kun yrität muuntaa muutamia tiedostoja.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Kopiointitoiminto ei koske seuraavia suodattimia (esim. Suodattimen vuoksi poissuljettuja tiedostoja)","Include these file types":"Lisää nämä tiedostotyypit","Delete source files after conversion:":"Poista lähdetiedostot muuntamisen jälkeen:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Jos tämä on valittuna, jos tulosyritys onnistuu, lähdetiedosto poistetaan. Tämä prosessi suoritetaan loppujen lopuksi kaikkien tiedostojen muuntamisen jälkeen. Tämä tarkoittaa, että voit muuntaa samat lähdetiedostot käyttämällä useita esiasetuksia, kaikki yhdellä kertaa. Lähdetiedostot poistetaan sen jälkeen.","Replace original file if converted file is smaller?(Compress attempt)":"Vaihda alkuperäinen tiedosto, jos muunnettu tiedosto on pienempi? (Pakkaa yritys)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Valitse tämä valintaruutu, jos haluat, että HBBatchBeast korvaa alkuperäisen lähdetiedoston automaattisesti, jos uusi tiedosto on pienempi. Jos uusi tiedosto ei ole pienempi, se jätetään kohdekansioon.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Varmista, että kohdekansio ei ole sama kuin lähdekansiosi tai sen sisällä tai se ei toimi oikein.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Kun HBBatchBeast on yrittänyt pakata tiettyä tiedostoa, se lisää tiedoston polun välimuistiin niin, että sitä ei yritetä uudelleen tulevaisuudessa. Voit tarkastella / muokata / tyhjentää välimuistin keltaisten painikkeiden avulla.","Replace original file always?":"Vaihda alkuperäinen tiedosto aina?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Alkuperäinen tiedosto korvataan riippumatta siitä, onko uusi tiedosto suurempi tai pienempi.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Varmista jälleen, että kohdekansio ei ole sama kuin lähdekansiosi tai sen sisällä tai se ei toimi oikein.","Copy subtitle (srt) files to destination?":"Kopioi tekstityksen (srt) tiedostot kohteeseen?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Tekstityksen \".srt\" tiedostot kopioidaan automaattisesti kohdekansioon.","Automatically create temporary/destination folders if they don't exist?":"Luo automaattisesti väliaikaiset / kohdekansiot, jos niitä ei ole?","Custom bat path to run after each conversion (leave blank if not using):":"Mukautettu bat-polku, joka suoritetaan jokaisen muunnoksen jälkeen (jätä tyhjä, jos et käytä):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Syötä polku muokattuun erätiedostoon, jonka haluat suorittaa jokaisen muunnoksen jälkeen. Esimerkiksi:","Batch files with timeout statements won't work. More info here:":"Erätiedostot, joissa on aikakatkaisuilmoitukset, eivät toimi. Lisätietoja täältä:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Jätä ruutu täysin tyhjäksi, jos et halua käyttää tätä vaihtoehtoa (varmista, että ruudussa ei ole piilotettuja merkkejä)","Run processes at low priority?":"Suorita prosessit matalalla prioriteetilla?","All conversion processes will be run at low priority, reducing processor usage.":"Kaikki muuntoprosessit suoritetaan alhaisella prioriteetilla, mikä vähentää prosessorin käyttöä.","Remove apostrophes from filenames:":"Poista apostrofit tiedostonimistä:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Muunnokset / terveystarkastukset voivat epäonnistua, jos tiedostonimissä on apostrofeja. Tarkista tämä, jos haluat poistaa apostrofit automaattisesti tiedostonimistä."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Tämä ominaisuus voi skannata korruptoituneita videotiedostoja käyttämällä HandBraken ”- scan” -ominaisuutta, vaikka tämä ei ole aina tarkka. Se käyttää myös FFprobeä toisen vertailupisteen aikaansaamiseksi. Jos sekä FFprobe että HandBrake epäonnistuvat, on suuri mahdollisuus, että tiedosto on vioittunut.","Move corrupt files into the following folder:":"Siirrä vioittuneet tiedostot seuraavaan kansioon:"," If checked, then any files which give errors will be moved into the specified folder.":"Jos tämä on valittuna, kaikki virheet antavat tiedostot siirretään määritettyyn kansioon.","Corrupt file folder:":"Virheellinen tiedoston kansio:","Run thorough file health check:":"Suorita perusteellinen tiedoston terveystarkastus:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Jos valitaan, suoritetaan paljon hitaampi, perusteellisempi video-terveystarkistus FFmpegin avulla HandBraken sijasta."," Based on Desani's 'ScanMedia.ps1' found at:":"Perustuu Desanin ScanMedia.ps1-sivustoon osoitteessa:","Attempt to repair files after thorough check:":"Yritä korjata tiedostoja perusteellisen tarkastuksen jälkeen:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Jos tämä on valittuna, HBBatchBeast yrittää korjata tiedostoja FFmpegillä. Uusi tiedosto, johon on liitetty '_repaired', luodaan samaan kansioon kuin lähdetiedosto.","'CRF' value to use when attempting to repair files:":"CRF-arvo, jota käytetään tiedostojen korjaamiseen:","The default 'CRF' value is 23. Please see the following for more information:":"Oletusarvo \"CRF\" on 23. Katso lisätietoja seuraavista:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"CRF-asteikon alue on 0–51, jossa 0 on häviötön, 23 on oletusarvo ja 51 huonoin laatu on mahdollista. Alhaisempi arvo johtaa yleensä parempaan laatuun, ja subjektiivisesti järkevä alue on 17–28. Ajattele 17 tai 18 olevan visuaalisesti häviöttömiä tai lähes niin; sen pitäisi näyttää samalta tai melkein sama kuin panos, mutta se ei ole teknisesti häviöttömän.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast tallentaa luettelon skannatuista tiedostojen poluista, jotka raportoidaan virheettömiksi. Tyhjennä välimuisti, kun haluat suorittaa uuden tarkistuksen kaikissa tiedostoissa.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Useiden samanaikaisesti käytettyjen HandBrake / FFmpeg-esiintymien määrä (suositeltu 4 tai vähemmän):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Tämä asetus koskee sekä \"Video health check\" että \"Scan and convert\" prosesseja. Määritä, kuinka monta HandBrake-säiettä käytetään. Maksimikaan ei ole, vaikka on suositeltavaa olla käyttämättä enempää kuin 4. Suurempi määrä saattaa jäädyttää tietokoneen, jos se ei ole kovin tehokas.","Queue size view limit?(Recommended 1000 or fewer):":"Jonon koko-näkymän rajoitus? (Suositus 1000 tai vähemmän):","Automatically start \"Scan and convert\" when program opened?":"Käynnistä skannaus ja muuntaminen automaattisesti, kun ohjelma avataan?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Täytä sähköpostitiedot, jos haluat saada sähköposti-ilmoituksia, jos terveystarkastuksen tai muuntamisen / kansion katselun aikana ilmenee virhe. Ei toimi tileillä, jotka vaativat 2FA: ta. Sinun täytyy ottaa käyttöön vähemmän turvallisia sovelluksia Gmail-tileillä.","Email address:":"Sähköpostiosoite:","For example:":"Esimerkiksi:","Email password(not saved):":"Sähköpostin salasana (ei tallennettu):","SMTP server:":"SMTP-palvelin:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"Tämä ominaisuus mahdollistaa muuntamisen / terveystarkastuksen tilan valvonnan millä tahansa web-selaimella. Hyödyllistä, kun käytät palvelimia jne.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Jos tämä on käytössä, seuraavat anonyymit tiedot lähetetään HBBatchBeast.io: lle:","API key":"API-avain","Current status ('Searching', 'Running', 'Finished' etc)":"Nykyinen tila (\"Haku\", \"Juoksu\", \"Valmis\" jne.)","Number of:":"Määrä:","Remaining items":"Jäljellä olevat kohteet","Successful items":"Onnistuneet kohteet","Errored items":"Virheelliset kohteet","Cancelled items":"Peruutetut kohteet","Worker percentages":"Työntekijöiden prosenttiosuudet","Last completed item time":"Viimeinen täytetty ajankohta","Enable remote monitoring?:":"Ota etävalvonta käyttöön ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Perusmarkkinointityökalu, joka on rakennettu pääasiassa sen selvittämiseksi, miten 16+ ydinprosessorit suorittavat useita HandBrake-esimerkkejä, vaikka niitä voidaan käyttää minkä tahansa tyyppisellä prosessorilla.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Tämä lataa h265 4k -näytötiedoston (2,5 Mt) ja suorittaa vertailuarvon käyttämällä 4 HandBrake-esiintymää, joissa on esiasetus \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Tulokset voidaan ladata osoitteeseen hbbatchbeast.io, jos valitset.","Queue":"Jonottaa","Output this session":"Suorita tämä istunto","Media info viewer tool":"Mediainfo-katseluohjelma","View compress attempt cache":"Näytä pakkaus yrittää välimuistia","Clear compress attempt cache":"Tyhjennä pakkausyrityksen välimuisti","Save config":"Tallenna konfig","Scan only":"Vain skannaus","Scan and convert":"Skannaa ja muunna","View scan/conversion summary log":"Tarkastele skannaus- / muunnosraporttia","View individual file check/conversion log":"Tarkastele yksittäisiä tiedostojen tarkistus- / muuntolokia","View worker console output":"Näytä työntekijäkonsolin ulostulo","Health check":"Terveystarkastus","Clear healthy file cache":"Tyhjennä terve tiedostojen välimuisti","View error log":"Näytä virheraportti","Email test":"Sähköpostitesti","View master log":"Näytä pääkirja","Wiki help":"Wiki-ohje","An application by HaveAGitGat":"HaveAGitGatin hakemus","New":"Uusi","Launch":"Tuoda markkinoille","Benchmark":"benchmark","See results":"Katso tulokset","Pause queue":"Keskeytä jono","Continue queue":"Jatka jonoa","Stop queue":"Pysäytä jono","Convert selected files":"Muunna valitut tiedostot","Toggle queue view":"Vaihda jononäkymä","Deselect all":"Poista kaikki valinnat","Invert all":"Käännä kaikki","Select all":"Valitse kaikki","Toggle output view":"Vaihda lähtönäkymä"}