{"The number of custom presets does not match the number of source folders!":"Le nombre de préréglages personnalisés ne correspond pas au nombre de dossiers source!","source folders have been detected.":"les dossiers sources ont été détectés.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"des lignes prédéfinies personnalisées ont été détectées. Veuillez vérifier les sauts de ligne invisibles. Il devrait y avoir un chemin de dossier ou un préréglage par ligne. Assurez-vous de ne pas avoir créé accidentellement une ligne vide.","The number of filename suffixes does not match the number of source folders! ":"Le nombre de suffixes de nom de fichier ne correspond pas au nombre de dossiers source!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"les lignes de suffixe de nom de fichier ont été détectées. Veuillez vérifier les sauts de ligne invisibles. Il devrait y avoir un chemin de dossier ou un suffixe de nom de fichier par ligne. Assurez-vous de ne pas avoir créé accidentellement une ligne vide.","The number of source folders does not match the number of destination folders!":"Le nombre de dossiers source ne correspond pas au nombre de dossiers de destination!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"les dossiers de destination ont été détectés. Veuillez vérifier les sauts de ligne invisibles. Il devrait y avoir un chemin de dossier par ligne. Assurez-vous de ne pas avoir créé accidentellement une ligne vide.","The number of source folders does not match the number of temporary conversion folders!":"Le nombre de dossiers source ne correspond pas au nombre de dossiers de conversion temporaires!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"des dossiers de conversion temporaires ont été détectés. Veuillez vérifier les sauts de ligne invisibles. Il devrait y avoir un chemin de dossier par ligne. Assurez-vous de ne pas avoir créé accidentellement une ligne vide.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Veuillez entrer un conteneur valide tel que '.mp4'. Assurez-vous d'inclure le '.'","Corrupt file folder":"Dossier corrompu","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"n'existe pas! Assurez-vous qu'il n'y a pas d'espaces ou de caractères cachés avant / après le chemin.","Source folder":"Dossier d'origine","Temporary conversion folder":"Dossier de conversion temporaire","appears to be the same as or is within source folder":"semble être identique ou se trouve dans le dossier source","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ce qui empêchera HBBatchBeast de fonctionner correctement. Veuillez modifier le dossier de conversion temporaire en un dossier situé en dehors du dossier source. Si vous souhaitez utiliser la fonctionnalité 'Remplacer les fichiers d'origine', sélectionnez un dossier de destination différent du dossier source ou à l'intérieur de celui-ci, puis cochez la case 'Remplacer les fichiers d'origine toujours' dans la section des paramètres avancés. . Décochez la case temporaire \"Dossier de conversion temporaire\", car elle ne servira à rien dans ce cas. Les fichiers seront convertis dans le dossier de destination, puis replacés dans le dossier source.","Destination folder":"Dossier de destination","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ce qui empêchera HBBatchBeast de fonctionner correctement. Veuillez modifier le dossier de destination en un dossier situé en dehors du dossier source. Si vous souhaitez utiliser la fonctionnalité 'Remplacer les fichiers d'origine', sélectionnez un dossier de destination différent du dossier source ou à l'intérieur de celui-ci, puis cochez la case 'Remplacer les fichiers d'origine toujours' dans la section des paramètres avancés. . Décochez la case temporaire \"Dossier de conversion temporaire\", car elle ne servira à rien dans ce cas. Les fichiers seront convertis dans le dossier de destination, puis replacés dans le dossier source.","Error creating temporary conversion folder":"Erreur lors de la création du dossier de conversion temporaire","Error creating destination folder":"Erreur lors de la création du dossier de destination","Please select to use HandBrake or FFmpeg!":"Veuillez choisir d'utiliser HandBrake ou FFmpeg!","Please select a standard preset or input a custom one!":"Veuillez sélectionner un préréglage standard ou en saisir un personnalisé!","Please select a scan interval of 5 seconds or greater!":"Veuillez sélectionner un intervalle de balayage de 5 secondes ou plus!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Assurez-vous que le nombre d'instances simultanées HandBrake / FFmpeg à utiliser est égal ou supérieur à 1!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Clé API invalide! Veuillez cliquer sur \"Nouveau\" dans l'onglet de surveillance à distance pour générer une nouvelle clé.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Veuillez saisir une heure d'analyse quotidienne au format 24 heures: hh: mm (par exemple 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"LES FICHIERS SOURCE SERONT SUPPRIMÉS APRÈS LA CONVERSION! S'il vous plaît tester avant utilisation appropriée!","Benchmark failed!":"Le benchmark a échoué!","Log does not exist!":"Le journal n'existe pas!","Folder does not exist!":"Le dossier n'existe pas!","Error sending email! Please check your settings.":"Erreur d'envoi d'email! S'il vous plaît vérifier vos paramètres.","Test email sent!":"Test email envoyé!","All worker processes have been stopped.":"Tous les processus de travail ont été arrêtés.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"La file d'attente sera suspendue une fois le traitement des éléments en cours terminé. Êtes-vous sûr de vouloir mettre la file d'attente en pause?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"La pause dans la file d'attente est lancée. Le bouton 'Continuer' apparaîtra une fois que tous les employés se seront arrêtés.","Healthy file cache cleared!":"Cache de fichiers en bonne santé effacé!","Cache cleared!":"Cache effacé!","Cancel item":"Annuler l'article","Please check the above checkbox to use this feature.":"Veuillez cocher la case ci-dessus pour utiliser cette fonctionnalité.","Configuration":"Configuration","Source folders":"Dossiers source","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"C'est le dossier source qui sera analysé pour le média. Le dossier doit être entré sans barre oblique. Par exemple:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"La zone de chemin du dossier source est extensible (appuyez sur Entrée pour créer une nouvelle ligne). Si vous souhaitez spécifier plusieurs dossiers source, assurez-vous que chaque chemin de dossier source est sur sa propre ligne, par exemple:","Video health check":"Bilan de santé vidéo","Batch conversion and Folder watching":"Conversion par lots et surveillance des dossiers","Remote Monitoring (Beta)":"Surveillance à distance (bêta)","Benchmark (Beta)":"Indice de référence (bêta)","System":"Système","Help":"Aidez-moi","Temporary conversion folders":"Dossiers de conversion temporaires","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Si \"Dossier de conversion temporaire?\" est cochée, HandBrake convertira les fichiers dans ce dossier. Une fois la conversion terminée, le fichier sera déplacé dans votre \"Dossier de destination\". Vous devrez spécifier autant de dossiers de conversion temporaires que de dossiers source. Votre premier dossier source sera converti dans votre premier dossier de conversion temporaire, votre deuxième dossier source dans votre deuxième dossier de conversion temporaire, etc. Assurez-vous que chaque chemin de dossier de conversion temporaire est sur sa propre ligne.","Destination folders":"Dossiers de destination","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Spécifiez les chemins des dossiers de destination. De nouveau, vous devrez spécifier autant de dossiers de destination que de dossiers sources. Les fichiers de votre premier dossier source se retrouveront dans votre premier dossier de destination, vos deuxièmes fichiers de dossier source dans votre deuxième dossier de destination, etc.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Premier dossier source ---------> Premier dossier de conversion temporaire ---------> Premier dossier de destination","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Deuxième dossier source ---------> Deuxième dossier de conversion temporaire ---------> Deuxième dossier de destination","etc":"etc","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast ne fonctionnera pas correctement si vous définissez le dossier de destination comme identique ou dans le dossier source.","Standard preset:":"Preset standard:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Sélectionnez le préréglage HandBrake avec lequel vous souhaitez convertir vos fichiers. Si \"Standard preset\" est sélectionné, tous les fichiers des dossiers sélectionnés seront convertis à l'aide du préréglage HandBrake spécifié. Vous trouverez plus d'informations sur les préréglages HandBrake ici:","Custom preset:":"Préréglage personnalisé:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Si \"Préréglage personnalisé\", vous devez entrer votre propre préréglage personnalisé. HBBatchBeast couvre la partie \"Entrée HandBrakeCLI\" de la source HandBrakeCLI - vous devez donc entrer les paramètres de conversion. Par exemple:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Si vous utilisez FFmpeg, vous devez séparer les paramètres d’entrée et de sortie par une virgule. Tel que:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Vous pouvez également créer un lien vers un préréglage personnalisé exporté à partir de l'application officielle HandBrake GUI, par exemple:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Si vous rencontrez des problèmes avec les préréglages personnalisés, cela peut être dû à un bogue connu de HandBrakeCLI (ce problème sera résolu dans la prochaine version de HandBrakeCLI). Veuillez voir ceci pour une solution temporaire:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Chaque préréglage personnalisé doit être sur sa propre ligne et, comme les dossiers, il doit y avoir autant de préréglages personnalisés que de dossiers sources.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Premier dossier source ---------> Premier dossier de conversion temporaire ---------> Premier dossier de destination @ Préréglage personnalisé 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Deuxième dossier source ---------> Deuxième dossier de conversion temporaire ---------> Deuxième dossier de destination @ Préréglage personnalisé 2","See the following image for guidance:":"Voir l'image suivante pour vous guider:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Si vous utilisez un encodage de carte graphique (tel que NVENC), vous devrez peut-être réduire le nombre d'instances HandBrake (essayez 2 ou moins) en raison des limites de la VRAM.","Select standard preset:":"Sélectionnez le préréglage standard:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC détecté, veillez à réduire le nombre d'instances HandBrakeCLI à 2 ou moins (pour la plupart des cartes graphiques), sinon vous risquez de rencontrer des erreurs en raison d'un manque de mémoire VRAM. Ce paramètre se trouve dans l'onglet \"Système\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Présélection importée détectée. Si vous rencontrez des problèmes avec les présélections personnalisées importées, cela peut être dû à un bogue connu de HandBrakeCLI (ce problème sera résolu dans la prochaine version de HandBrakeCLI). Une solution temporaire consiste à supprimer \"\" PictureRotate \":\" 0: 0 \"\" du fichier .json. Plus d'infos ici:","Container:":"Récipient:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Spécifiez le conteneur que vous souhaitez attribuer au fichier de sortie, tel que '.mp4'. Vous pouvez en savoir plus sur les conteneurs à:","Enable periodic scanning:":"Activer l'analyse périodique:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast peut surveiller vos dossiers source et exécuter des analyses pour les nouveaux fichiers à un intervalle spécifié. La durée de l'intervalle est en secondes, la valeur par défaut étant 300 secondes (5 minutes). Si cette option est sélectionnée, lorsque vous appuyez sur \"Numériser et convertir\", le programme convertira tous les nouveaux fichiers, puis un compte à rebours commencera. Cela fera une boucle infinie jusqu’à l’arrêt. L'intervalle d'analyse est dans la section des paramètres avancés.","Enable daily scanning:":"Activer l'analyse quotidienne:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Au lieu d'une analyse périodique, vous pouvez choisir de lancer une analyse une fois par jour. Le temps de numérisation est entré dans la section des paramètres avancés au format hh: mm, tel que «18: 30». Une fois que \"Analyser et convertir\" est sélectionné, le programme attendra l'heure spécifiée avant d'exécuter un processus d'analyse et de conversion. Encore une fois, cette boucle sera infinie jusqu'à ce qu'elle soit arrêtée.","Show/hide advanced:":"Afficher / masquer avancé:","Scan interval (minimum 5 seconds):":"Intervalle de balayage (minimum 5 secondes):","Daily run time (hh:mm):":"Durée de fonctionnement quotidienne (hh: mm):","Output filename suffix:":"Suffixe du fichier de sortie:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Ceci est optionnel Vous pouvez spécifier un suffixe à ajouter à la fin de votre nom de fichier, tel que '_1080p' ou '_testconversion' etc.","If 'standard preset' is selected then all output files will have the same suffix.":"Si «Preset standard» est sélectionné, tous les fichiers de sortie auront le même suffixe.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Si «préréglage personnalisé» est sélectionné, vous pouvez spécifier un suffixe par dossier source / préréglage personnalisé. Assurez-vous que chaque suffixe est sur sa propre ligne. Par exemple, si vous avez 2 dossiers source et utilisez le \"préréglage personnalisé\", vous pouvez le mettre dans la zone suffixe du nom de fichier:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"«_720p» sera ajouté au nom de fichier de sortie dans les fichiers du premier dossier source. «_1080p» sera ajouté aux fichiers du nom de fichier de sortie, etc., dans le deuxième dossier source.","Include these file types:":"Inclure ces types de fichiers:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"Entrez les types de fichiers à analyser. Chaque type doit être séparé par une virgule. L'entrée par défaut est:","Exclude files smaller than (MB):":"Exclure les fichiers de taille inférieure à (Mo):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Spécifiez s'il faut exclure de la conversion les fichiers d'une taille inférieure à une certaine taille (en mégaoctets)","Exclude files larger than (MB):":"Exclure les fichiers de plus de (Mo):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Spécifiez s'il faut exclure de la conversion les fichiers d'une taille supérieure à une certaine taille (en mégaoctets)","Exclude filenames which include any of these words:":"Exclure les noms de fichiers qui contiennent l’un des mots suivants:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Entrez les mots-clés à filtrer lors de la recherche de fichiers. Par exemple, si \"720p\" est entré, tous les fichiers avec \"720p\" dans le titre ne seront pas convertis. Encore une fois, les mots clés doivent être séparés par une virgule. Par exemple, entrez ce qui suit dans la boîte de filtre:","Include files with any ":"Inclure des fichiers avec"," or all ":"ou tous"," of these":"de ces","properties:":"Propriétés:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Ici, vous pouvez entrer les propriétés vidéo et audio que les fichiers doivent avoir pour pouvoir être convertis (informations extraites à l'aide de FFprobe). Les propriétés doivent être séparées par une virgule. Utilisez l'outil d'affichage des informations sur les médias pour déterminer les propriétés à inclure. Assurez-vous de mettre une virgule après la dernière propriété. Par exemple, pour convertir uniquement les fichiers encodés à l’aide de l’audio stéréo h264 et aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Il convient de noter que cette vérification de propriété est effectuée une fois le processus de conversion lancé (pour gagner du temps lors de la création de la file d'attente). Ainsi, même si des fichiers peuvent apparaître dans la file d'attente de conversion, ils seront ignorés / inclus si les conditions requises sont remplies.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Si FFprobe est capable d'extraire des propriétés, un «OK» apparaît dans la colonne \"FFprobe\" de la vue de la file d'attente.","Exclude files with any ":"Exclure les fichiers avec"," of these ":"de ces","The opposite of 'Include files with any or all of these properties'":"L'opposé de 'Inclure les fichiers avec l'une ou l'ensemble de ces propriétés'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"C’est un petit outil pour analyser les propriétés de fichier afin de vous aider à déterminer les propriétés que vous souhaitez inclure / exclure dans les options ci-dessus. Il utilise FFprobe pour renvoyer des informations. Glissez et déposez les fichiers dans la zone grise pour les analyser. Par exemple, déposer dans un fichier de test peut renvoyer les éléments suivants:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Si vous souhaitez exclure de tels fichiers de la conversion, vous pouvez définir plusieurs propriétés de fichier dans la zone \"Exclure les fichiers avec l'une ou l'ensemble de ces propriétés\" et cochez la case en regard de \"tous\" au lieu de \"tous\", ainsi:","Copy excluded files to destination:":"Copier les fichiers exclus vers la destination:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Si vous sélectionnez cette option, les fichiers exclus de la conversion seront copiés directement dans le dossier de destination. Ceci s'applique aux filtres suivants:","Exclude filenames which include any of these words":"Exclure les noms de fichiers contenant l'un de ces mots","Include files with any or all of these properties":"Inclure les fichiers avec une ou plusieurs de ces propriétés","Exclude files with any or all of these properties":"Exclure les fichiers avec une ou plusieurs de ces propriétés","Exclude files smaller than (MB)":"Exclure les fichiers plus petits que (Mo)","Exclude files larger than (MB)":"Exclure les fichiers de plus de (Mo)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Notez que cela s'applique également aux fichiers exclus, car ils ne répondent pas aux conditions de propriété \"Inclure\" de ce qui précède. Par conséquent, ne copiez pas accidentellement toute votre bibliothèque lorsque vous essayez uniquement de convertir quelques fichiers.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"La fonctionnalité de copie ne s'applique pas aux filtres suivants (c.-à-d. Fichiers exclus en raison du filtre)","Include these file types":"Inclure ces types de fichiers","Delete source files after conversion:":"Supprimer les fichiers source après la conversion:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Si cette option est sélectionnée, le fichier source sera supprimé si une tentative de conversion aboutit. Ce processus est effectué à la toute fin, après la conversion de tous les fichiers. Cela signifie que vous pouvez convertir les mêmes fichiers source en utilisant plusieurs préréglages, en une seule fois. Les fichiers sources seront ensuite supprimés.","Replace original file if converted file is smaller?(Compress attempt)":"Remplacer le fichier d'origine si le fichier converti est plus petit? (Tentative de compression)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Cochez cette case si vous souhaitez que HBBatchBeast remplace automatiquement le fichier source d'origine si le nouveau fichier est plus petit. Si le nouveau fichier n'est pas plus petit, il sera laissé dans le dossier de destination.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Assurez-vous que votre dossier de destination n’est pas identique à / ou dans votre dossier source, sinon il ne fonctionnera pas correctement.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Une fois que HBBatchBeast a tenté de compresser un fichier spécifique, il ajoute ce chemin de fichier à un cache afin qu'il ne soit plus utilisé à l'avenir. Vous pouvez visualiser / éditer / effacer le cache en utilisant les boutons jaunes.","Replace original file always?":"Remplacer le fichier d'origine toujours?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Le fichier d'origine sera remplacé, que le nouveau fichier soit plus volumineux ou plus petit.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Encore une fois, assurez-vous que votre dossier de destination n’est pas identique à / ou au sein de votre dossier source, sinon il ne fonctionnera pas correctement.","Copy subtitle (srt) files to destination?":"Copier les fichiers de sous-titres (srt) vers la destination?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Les fichiers de sous-titres '.srt' seront automatiquement copiés dans le dossier de destination.","Automatically create temporary/destination folders if they don't exist?":"Créer automatiquement des dossiers temporaires / de destination s'ils n'existent pas?","Custom bat path to run after each conversion (leave blank if not using):":"Chemin d'accès personnalisé à exécuter après chaque conversion (laissez ce champ vide si vous ne l'utilisez pas):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Entrez le chemin d'accès à un fichier de commandes personnalisé que vous souhaitez exécuter après chaque conversion. Par exemple:","Batch files with timeout statements won't work. More info here:":"Les fichiers batch avec des instructions de délai d'attente ne fonctionneront pas. Plus d'infos ici:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Laissez la case complètement vide si vous ne souhaitez pas utiliser cette option (assurez-vous qu'il n'y a pas de caractères cachés dans la case)","Run processes at low priority?":"Exécuter des processus en basse priorité?","All conversion processes will be run at low priority, reducing processor usage.":"Tous les processus de conversion seront exécutés avec une priorité basse, réduisant ainsi l'utilisation du processeur.","Remove apostrophes from filenames:":"Supprimez les apostrophes des noms de fichiers:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Les analyses de conversions / contrôle de santé peuvent échouer si les noms de fichiers comportent des apostrophes. Cochez cette option pour supprimer automatiquement les apostrophes des noms de fichiers."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Cette fonctionnalité peut rechercher des fichiers vidéo corrompus à l’aide de la fonction '--scan' de HandBrake, bien que cela ne soit pas toujours précis. Il utilise également FFprobe pour fournir un deuxième point de référence. Si FFprobe et HandBrake échouent, il y a de fortes chances que le fichier soit corrompu.","Move corrupt files into the following folder:":"Déplacez les fichiers corrompus dans le dossier suivant:"," If checked, then any files which give errors will be moved into the specified folder.":"Si cette case est cochée, tous les fichiers contenant des erreurs seront déplacés dans le dossier spécifié.","Corrupt file folder:":"Dossier corrompu:","Run thorough file health check:":"Exécuter une vérification approfondie du fichier:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Si cette case est cochée, une vérification de l'intégrité vidéo beaucoup plus lente et plus approfondie sera effectuée à l'aide de FFmpeg au lieu de HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Basé sur le 'ScanMedia.ps1' de Desani trouvé sur:","Attempt to repair files after thorough check:":"Essayez de réparer les fichiers après une vérification approfondie:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Si coché, HBBatchBeast tentera de réparer les fichiers en utilisant FFmpeg. Un nouveau fichier portant le suffixe «_repaired» sera créé dans le même dossier que le fichier source.","'CRF' value to use when attempting to repair files:":"Valeur 'CRF' à utiliser lors d'une tentative de réparation de fichiers:","The default 'CRF' value is 23. Please see the following for more information:":"La valeur par défaut \"CRF\" est 23. Veuillez consulter les informations suivantes pour plus d'informations:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"La plage de l'échelle CRF va de 0 à 51, 0 étant sans perte, 23 par défaut et 51 de qualité médiocre. Une valeur inférieure conduit généralement à une qualité supérieure et une plage subjectivement saine est comprise entre 17 et 28. Considérez 17 ou 18 ans comme étant visuellement sans perte ou presque; il devrait ressembler ou presque à l'entrée, mais il n'est pas techniquement sans perte.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast enregistre une liste des chemins de fichiers analysés signalés comme non corrompus. Effacez le cache pour effectuer une nouvelle analyse de tous les fichiers.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Nombre d'instances simultanées HandBrake / FFmpeg à utiliser? (Recommandé 4 ou moins):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Ce paramètre s'applique aux processus \"Contrôle de l'intégrité de la vidéo\" et \"Analyser et convertir\". Spécifiez le nombre de threads HandBrake à utiliser. Il n'y a pas de maximum bien qu'il soit recommandé de ne pas utiliser plus de 4. Une quantité plus élevée risque de geler votre ordinateur s'il n'est pas très puissant.","Queue size view limit?(Recommended 1000 or fewer):":"Limite d'affichage de la taille de la file d'attente? (1000 recommandés ou moins):","Automatically start \"Scan and convert\" when program opened?":"Démarrer automatiquement \"Scan and convert\" quand le programme est ouvert?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Renseignez les détails de l'e-mail pour recevoir des notifications par e-mail si une erreur survient lors d'une vérification de l'état ou de la conversion / l'observation d'un dossier. Ne fonctionnera pas avec les comptes nécessitant 2FA. Vous devez activer l'accès à des applications moins sécurisées sur des comptes Gmail.","Email address:":"Adresse électronique:","For example:":"Par exemple:","Email password(not saved):":"Email mot de passe (non enregistré):","SMTP server:":"Serveur SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"Cette fonctionnalité permet de surveiller l’état de la conversion et de l’état de santé à l’aide de tout navigateur Web. Utile lors de l'exécution de serveurs, etc.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Si activé, les données anonymes suivantes seront envoyées à HBBatchBeast.io:","API key":"Clé API","Current status ('Searching', 'Running', 'Finished' etc)":"Statut actuel (\"Recherche\", \"En cours\", \"Terminé\" etc.)","Number of:":"Nombre de:","Remaining items":"Articles restants","Successful items":"Articles réussis","Errored items":"Articles erronés","Cancelled items":"Articles annulés","Worker percentages":"Pourcentages de travailleurs","Last completed item time":"Dernier élément complété","Enable remote monitoring?:":"Activer la surveillance à distance ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Un utilitaire d'analyse comparative de base conçu principalement pour connaître les performances de plus de 16 processeurs principaux à l'aide de plusieurs instances HandBrake, bien qu'il puisse être exécuté sur tout type de processeur.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Cela téléchargera un exemple de fichier h265 4k (2,5 Mo) et exécutera un point de repère en utilisant 4 instances de HandBrake avec le préréglage \"Très rapide 1080p30\".","Results can be uploaded to hbbatchbeast.io if you choose.":"Les résultats peuvent être téléchargés sur hbbatchbeast.io si vous le souhaitez.","Queue":"Queue","Output this session":"Sortie de cette session","Media info viewer tool":"Outil d'affichage des informations sur les médias","View compress attempt cache":"Afficher le cache des tentatives de compression","Clear compress attempt cache":"Effacer le cache des tentatives de compression","Save config":"Enregistrer la configuration","Scan only":"Numériser uniquement","Scan and convert":"Numériser et convertir","View scan/conversion summary log":"Afficher le journal récapitulatif d'analyse / conversion","View individual file check/conversion log":"Afficher le journal de vérification / conversion de fichier individuel","View worker console output":"Afficher la sortie de la console de travail","Health check":"Bilan de santé","Clear healthy file cache":"Effacer le cache de fichiers sains","View error log":"Voir le journal des erreurs","Email test":"Test de messagerie","View master log":"Voir le journal principal","Wiki help":"Aide Wiki","An application by HaveAGitGat":"Une application de HaveAGitGat","New":"Nouveau","Launch":"lancement","Benchmark":"Référence","See results":"Voir les résultats","Pause queue":"Queue d'attente","Continue queue":"Continuer la file d'attente","Stop queue":"Arrêter la file d'attente","Convert selected files":"Convertir les fichiers sélectionnés","Toggle queue view":"Basculer l'affichage de la file d'attente","Deselect all":"Tout déselectionner","Invert all":"Inverser tout","Select all":"Tout sélectionner","Toggle output view":"Basculer l'affichage de la sortie"}