{"The number of custom presets does not match the number of source folders!":"Ní mheaitseálann líon na réamhshocruithe saincheaptha líon na bhfillteán foinse!","source folders have been detected.":"aimsíodh fillteáin foinse.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"Braitheadh línte réamhshocraithe saincheaptha. Déan seiceáil le do thoil le haghaidh sosanna dofheicthe líne. Ba chóir go mbeadh cosán fillteáin amháin nó réamhshocair in aghaidh na líne. Déan cinnte nach bhfuil líne bhán cruthaithe agat de thaisme.","The number of filename suffixes does not match the number of source folders! ":"Ní mheaitseálann líon na n-iarmhíreanna ainm comhaid líon na bhfillteán foinse!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"Braitheadh línte iarmhír ainmneacha. Déan seiceáil le do thoil le haghaidh sosanna dofheicthe líne. Ba chóir go mbeadh cosán fillteáin amháin nó iarmhír ainm comhaid in aghaidh an líne. Déan cinnte nach bhfuil líne bhán cruthaithe agat de thaisme.","The number of source folders does not match the number of destination folders!":"Ní hionann líon na bhfillteán foinse agus líon na bhfillteán ceann scríbe!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"aimsíodh fillteáin cheann scríbe. Déan seiceáil le do thoil le haghaidh sosanna dofheicthe líne. Ba chóir go mbeadh cosán fillteáin amháin in aghaidh na líne. Déan cinnte nach bhfuil líne bhán cruthaithe agat de thaisme.","The number of source folders does not match the number of temporary conversion folders!":"Ní hionann líon na bhfillteán foinse agus líon na bhfillteán comhshó sealadach!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"Braitheadh fillteáin chomhshó shealadacha. Déan seiceáil le do thoil le haghaidh sosanna dofheicthe líne. Ba chóir go mbeadh cosán fillteáin amháin in aghaidh na líne. Déan cinnte nach bhfuil líne bhán cruthaithe agat de thaisme.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Iontráil coimeádán bailí mar '.mp4'. Déan cinnte go gcuirfidh tú an '.' San áireamh.","Corrupt file folder":"Fillteán comhaid truaillithe","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"Gan a bheith ann! Déan cinnte nach bhfuil aon spásanna ná carachtair i bhfolach roimh / tar éis an chosáin","Source folder":"Fillteán foinse","Temporary conversion folder":"Fillteán comhshó sealadach","appears to be the same as or is within source folder":"dealraíonn sé go bhfuil sé mar an gcéanna le nó i bhfillteán foinse","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"a chuirfidh cosc ar HBBatchBeast feidhmiú i gceart. Athraigh an fillteán comhshó sealadach go fillteán taobh amuigh den fhillteán foinse. Má tá tú ag iarraidh an ghné 'Athsholáthar bunchomhaid' a úsáid, roghnaigh fillteán cinn scríbe nach bhfuil mar an gcéanna leis an bhfillteán foinse, nó laistigh de, agus ansin seiceáil an ticbhosca sna rannóga ardshuímh i gcónaí. . Díthiceáil an ticbhosca sealadach 'Fillteán comhshó sealadach' mar ní bheidh aon úsáid aige sa chás seo. Athrófar na comhaid isteach san fhillteán cinn scríbe agus ansin aistreofar ar ais iad go dtí an fillteán foinse.","Destination folder":"Fillteán ceann scríbe","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"a chuirfidh cosc ar HBBatchBeast feidhmiú i gceart. Athraigh an fillteán cinn scríbe chuig fillteán taobh amuigh den fhillteán foinse. Má tá tú ag iarraidh an ghné 'Athsholáthar bunchomhaid' a úsáid, roghnaigh fillteán cinn scríbe nach bhfuil mar an gcéanna leis an bhfillteán foinse, nó laistigh de, agus ansin seiceáil an ticbhosca sna rannóga ardshuímh i gcónaí. . Díthiceáil an ticbhosca sealadach 'Fillteán comhshó sealadach' mar ní bheidh aon úsáid aige sa chás seo. Athrófar na comhaid isteach san fhillteán cinn scríbe agus ansin aistreofar ar ais iad go dtí an fillteán foinse.","Error creating temporary conversion folder":"Earráid ag cruthú fillteán comhshó sealadach","Error creating destination folder":"Earráid ag cruthú fillteáin cheann scríbe","Please select to use HandBrake or FFmpeg!":"Roghnaigh le do thoil HandBrake nó FFmpeg a úsáid!","Please select a standard preset or input a custom one!":"Roghnaigh réamhshocrú caighdeánach nó ionchur saincheaptha!","Please select a scan interval of 5 seconds or greater!":"Roghnaigh eatramh scanála de 5 soicind nó níos mó le do thoil!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Cinntigh le do thoil go bhfuil líon na gcásanna HandBrake / FFmpeg comhuaineach atá le húsáid ar cheann nó níos mó!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Eochair API neamhbhailí! Cliceáil le do thoil ar 'Nua' ar an táb monatóireachta iargúlta chun eochair nua a ghiniúint.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Cuir isteach am scanadh laethúil i bhformáid 24 uair: hh: mm (mar shampla 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"IS FÉIDIR TORTHAÍ FOINSE TAR ÉIS AN TÚS! Le do thoil tástáil roimh úsáid cheart!","Benchmark failed!":"Theip ar thagarmharc!","Log does not exist!":"Ní ann do logáil isteach!","Folder does not exist!":"Níl an fillteán ann!","Error sending email! Please check your settings.":"Earráid ag seoladh ríomhphoist! Déan seiceáil ar do chuid socruithe.","Test email sent!":"Seol ríomhphost tástála!","All worker processes have been stopped.":"Cuireadh deireadh le gach próiseas oibrí.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Sosfar scuaine nuair a bheidh an phróiseáil déanta ar na míreanna reatha. An bhfuil tú cinnte go dteastaíonn uait an scuaine a stopadh?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Cuireadh tús le sos scuaine.Beidh an cnaipe 'leanúint' le feiceáil nuair a bheidh gach oibrí sos.","Healthy file cache cleared!":"Glanadh comhad taisce sláintiúil!","Cache cleared!":"Glanadh an taisce!","Cancel item":"Cuir an mhír ar ceal","Please check the above checkbox to use this feature.":"Seiceáil le do thoil an ticbhosca thuas chun an ghné seo a úsáid.","Configuration":"Cumraíocht","Source folders":"Fillteáin fhoinse","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Is é seo an fillteán foinse a dhéanfar a scanadh do na meáin. Ní mór an fillteán a chur isteach gan aon slais trailing. Mar shampla:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Is féidir an bosca cosáin fillteáin foinse a leathnú (brúigh isteach chun líne nua a chruthú). Más mian leat fillteáin ilfhoinse a shonrú, déan cinnte go bhfuil gach cosán fillteáin foinse ar a líne féin mar:","Video health check":"Seiceáil sláinte físeáin","Batch conversion and Folder watching":"Comhshó baisc agus faire Fillteán","Remote Monitoring (Beta)":"Monatóireacht cianda (Beta)","Benchmark (Beta)":"Tagarmharc (Beta)","System":"Córas","Help":"Cabhrú","Temporary conversion folders":"Fillteáin chomhshó shealadacha","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Más \"fillteán comhshó sealadach?\" Seiceáiltear, ansin tiontóidh HandBrake comhaid san fhillteán sin. Nuair a bheidh an tiontú críochnaithe, aistreofar an comhad isteach i do \"fhillteán ceann scríbe\". Beidh ort an oiread fillteán comhshó sealadach a shonrú mar fhillteáin foinse. Athrófar do chéad fhillteán foinse isteach i do chéad fhillteán comhshó sealadach, do fhillteán dara foinse isteach i do dara fillteán comhshó sealadach agus mar sin de. Déan cinnte go bhfuil gach cosán fillteáin comhshó sealadach ar a líne féin.","Destination folders":"Fillteáin cheann scríbe","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Sonraigh cosáin na bhfillteán ceann scríbe. Arís, beidh ort an oiread fillteán cinn scríbe a shonrú mar fhillteáin foinse. Beidh comhaid ó do chéad fhillteán foinse i do fhillteán cinn scríbe, do chomhaid fillteáin dara foinse i do dara fillteán ceann scríbe agus mar sin de.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"An fillteán chéad fhoinse ---------> An chéad fhillteán comhshó sealadach ---------> An chéad fhillteán cinn scríbe","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Fillteán dara foinse ---------> An dara fillteán comhshó sealadach ---------> An dara fillteán scríbe","etc":"srl","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"Ní oibreoidh HBBatchBeast i gceart má shocraíonn tú an fillteán ceann scríbe mar an gcéanna leis an bhfillteán foinse, nó laistigh de.","Standard preset:":"Réamhshocrú caighdeánach:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Roghnaigh an réamhshocrú HandBrake gur mhaith leat do chuid comhad a thiontú leis. Má roghnaítear \"réamhshocrú caighdeánach\", ansin déanfar na comhaid go léir sna fillteáin a roghnófar a thiontú ag úsáid an réamhshocraithe HandBrake sonraithe. Is féidir leat tuilleadh a fháil faoi HandBrake presets anseo:","Custom preset:":"Réamhshocrú saincheaptha:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Más \"réamhshocraigh réamhshocraithe\" is gá duit do réamhshocrú féin a iontráil. Clúdaíonn HBBatchBeast an chuid “HandBrakeCLI -i foinse -o” den ionchur HandBrakeCLI mar sin ní mór duit dul isteach sna paraiméadair chomhshó. Mar shampla:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Má úsáideann tú FFmpeg, ní mór duit na paraiméadair ionchuir agus aschuir a dheighilt le camóg. Mar:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Is féidir leat nasc a dhéanamh le réamhshocrú saincheaptha a onnmhairíodh ón iarratas oifigiúil GUBrake GUI mar shampla:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Má tá deacracht agat le réamhshocruithe, d’fhéadfadh sé go bhfuil sé mar thoradh ar fhabht ar eolas leis an Lámhcheardaíocht (socrófar é sa chéad scaoileadh eile de chuid HandBrakeCLI). Féach ar an réiteach seo le do thoil:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Ní mór do gach réamhshocrú a bheith ar a líne féin agus, cosúil leis na fillteáin, ní mór go mbeadh a lán réamhshocruithe saincheaptha mar fhillteáin foinse.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"An fillteán chéad fhoinse ---------> An chéad fhillteán comhshó sealadach ---------> An chéad fhillteán ceann scríbe @ Custom preset 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Fillteán dara foinse ---------> An dara fillteán comhshó sealadach ---------> An dara fillteán ceann scríbe @ Custom preset 2","See the following image for guidance:":"Féach an íomhá seo a leanas chun treoir a fháil:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Má tá tú ag baint úsáide as ionchódú cárta grafaicí (ar nós NVENC), ansin b'fhéidir go mbeidh ort líon na gcásanna HandBrake a laghdú (bain triail as 2 nó níos lú) mar gheall ar theorainneacha VRAM.","Select standard preset:":"Roghnaigh réamhshocair chaighdeánach:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Braitheadh NVENC, bí cinnte go laghdaítear líon na gcásanna HandBrakeCLI go 2 nó níos lú (don chuid is mó de na cártaí grafaice) nó go bhféadfadh earráidí teacht ort mar gheall ar nach leor VRAM. Is féidir an suíomh seo a fháil sa chluaisín \"Córas\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Má tá deacracht agat le réamhshocruithe allmhairithe, d’fhéadfadh sé go bhfuil sé mar gheall ar fhabht ar eolas leis an HandBrakeCLI (socrófar é sa chéad scaoileadh eile HandBrakeCLI). Is é atá i dtuaslagán sealadach \"\" PictureRotate \"a bhaint:\" 0: 0 \"ó chomhad .json. Tuilleadh eolais anseo:","Container:":"Coimeádán:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Sonraigh an coimeádán ar mhaith leat go mbeadh an comhad aschuir mar '.mp4' aige. Is féidir leat tuilleadh a fháil amach faoi choimeádáin ag:","Enable periodic scanning:":"Cumasaigh scanadh tréimhsiúil:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"Is féidir le HBBatchBeast monatóireacht a dhéanamh ar fhillteáin do fhoinse agus scans a reáchtáil do chomhaid nua ag eatramh sonraithe. Tá an t-am eatraimh i soicind agus is é 300 soicind (5 nóiméad) an mhainneachtain. Má roghnaítear an rogha seo, ansin nuair a bhrúnn tú \"Scan and convert\", tiontóidh an clár aon chomhaid nua agus ansin tosóidh amadóir comhaireamh síos. Beidh sé seo lúb go dtí go stopfar é. Tá an t-eatramh scanála i rannóg na réamhshocruithe.","Enable daily scanning:":"Cumasaigh scanadh laethúil:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"In ionad scanadh tréimhsiúil, is féidir leat scanadh a reáchtáil uair sa lá. Cuirtear an t-am scanála isteach i rannóg na réamhshocruithe i bhformáid hh: mm ar nós '18: 30 '. Nuair a roghnaítear \"Scan and convert\", fanfaidh an clár go dtí an t-am sonraithe go dtí go rithfidh sé scanadh agus próiseas tiontaithe. Arís, beidh lúb mhór ann go dtí go stopfar é.","Show/hide advanced:":"Taispeáin / cuir i bhfolach chun cinn:","Scan interval (minimum 5 seconds):":"Scan eatramh (5 soicind ar a laghad):","Daily run time (hh:mm):":"Am rith laethúil (hh: mm):","Output filename suffix:":"Iarmhír ainmneacha aschuir:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Tá sé seo roghnach. Is féidir leat iarmhír a shonrú le cur le deireadh do ainm comhaid mar '_1080p' nó '_testconversion' srl.","If 'standard preset' is selected then all output files will have the same suffix.":"Má roghnaítear 'réamhshocrú caighdeánach' ansin beidh an iarmhír chéanna ag gach comhad aschuir.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Má roghnaítear 'custom preset' ansin is féidir leat iarmhír amháin a shonrú in aghaidh an fhillteáin foinse / réamhshocraithe. Déan cinnte go bhfuil gach iarmhír ar a líne féin. Mar shampla, má tá 2 fhillteán foinse agat agus má tá 'réamhshocrú' á úsáid agat, d'fhéadfá é seo a chur sa bhosca iarmhír ainm comhaid:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Beidh “_720p” curtha le comhaid ainm sa chéad fhillteán foinse leis an ainm aschuir. Beidh “_1080p” curtha le comhaid sa fhillteán dara foinse le hainm comhaid aschuir srl.","Include these file types:":"Cuir na cineálacha comhaid seo san áireamh:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"Cuir isteach na cineálacha comhaid le scanadh dóibh. Ní mór camóg a dheighilt idir gach cineál. Is é an iontráil réamhshocraithe:","Exclude files smaller than (MB):":"Fág comhaid atá níos lú ná (MB) san áireamh:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Sonraigh cé acu ba cheart comhaid atá níos lú ná méid áirithe a eisiamh ó chomhshó (i meigibheart)","Exclude files larger than (MB):":"Fág comhaid nach mó ná (MB) a eisiamh:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Sonraigh cé acu ba cheart comhaid atá níos mó ná méid áirithe a eisiamh ó chomhshó (i meigibheart)","Exclude filenames which include any of these words:":"Fág amach ainmneacha comhaid lena n-áirítear aon cheann de na focail seo:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Cuir isteach na heochairfhocail atá le scagadh amach agus tú ag scanadh do chomhaid. Mar shampla, má iontráiltear \"720p\", ní dhéanfar aon chomhad le \"720p\" sa teideal a chomhshó. Arís, ní mór camóga a scaradh le heochairfhocail. Mar shampla, cuir isteach an méid seo a leanas sa bhosca scagaire:","Include files with any ":"Cuir comhaid leis"," or all ":"nó go léir"," of these":"díobh seo","properties:":"airíonna:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Anseo is féidir leat airíonna físe agus fuaime a chaithfidh comhaid a bheith acu a ionchur chun iad a chomhshó (eolas bainte as FFprobe). Ní mór camóg a bheith scartha idir na hairíonna. Bain úsáid as an uirlis breathnóir faisnéise meán chun cabhrú leat a fháil amach cad iad na hairíonna ar mhaith leat a chur san áireamh. Déan cinnte go gcuirfidh tú camóg tar éis na maoine deiridh. Mar shampla, gan comhaid a ionchódú ach a thiontú ag baint úsáide as fuaim steirió h264 agus aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Is fiú a thabhairt faoi deara go ndéantar an tseiceáil réadmhaoine seo nuair a thosaíonn an próiseas comhshó (chun am a shábháil ag tógáil na scuaine), mar sin cé go bhféadfadh comhaid a bheith sa scuaine tiontaithe, déanfar iad a sceitheadh / a chur san áireamh má chomhlíontar na coinníollacha cearta.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Má tá FFprobe in ann réadmhaoin a bhaint, ansin taispeánfar 'OK' sa cholún \"FFprobe\" sa radharc scuaine.","Exclude files with any ":"Fág comhaid le haon cheann"," of these ":"díobh seo","The opposite of 'Include files with any or all of these properties'":"A mhalairt de 'Cuir comhaid le haon cheann nó gach ceann de na hairíonna seo san áireamh'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Is uirlis bheag é seo chun anailís a dhéanamh ar airíonna comhaid chun cabhrú leat a chinneadh cé na hairíonna ar mhaith leat a chur san áireamh / a eisiamh sna roghanna thuas. Baineann sé úsáid as FFprobe chun faisnéis a thabhairt ar ais. Tarraing agus scaoil comhaid isteach sa bhosca liath chun iad a anailísiú. Mar shampla, d'fhéadfá an méid seo a leanas a thabhairt ar ais i gcomhad tástála:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Má tá tú ag iarraidh comhaid mar seo a eisiamh ó bheith comhshóite, is féidir leat roinnt airíonna comhaid a chur isteach sa bhosca \"Eisigh na comhaid le haon cheann nó gach ceann de na boscaí maoine seo\" agus seiceáil an ticbhosca in aice le 'all' in ionad 'aon' mar sin:","Copy excluded files to destination:":"Cóipeáil na comhaid eisiata go dtí an ceann scríbe:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Má roghnaíonn tú an rogha seo, ansin déanfar comhaid atá eisiata ó thiontú a chóipeáil go díreach chuig an bhfillteán cinn scríbe. Baineann sé seo leis na scagairí seo a leanas:","Exclude filenames which include any of these words":"Fág amach ainmneacha comhaid lena n-áirítear aon cheann de na focail seo","Include files with any or all of these properties":"Cuir comhaid le haon cheann nó gach ceann de na hairíonna seo","Exclude files with any or all of these properties":"Fág comhaid le haon cheann nó gach ceann de na hairíonna seo","Exclude files smaller than (MB)":"Fág comhaid níos lú ná (MB)","Exclude files larger than (MB)":"Fág comhaid nach mó ná (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Tabhair faoi deara go mbaineann sé seo le comhaid atá eisiata mar gheall nach gcomhlíonann siad coinníollacha maoine “Cuir san áireamh” an méid thuas, mar sin ná déan cóip de do leabharlann ar fad nuair a bhíonn tú ag iarraidh cúpla comhad a thiontú.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Ní bhaineann an ghné chóip leis na scagairí seo a leanas (ie comhaid eisiata mar gheall ar an scagaire)","Include these file types":"Cuir na cineálacha comhaid seo san áireamh","Delete source files after conversion:":"Scrios comhaid foinse tar éis an chomhshó:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Má roghnaítear é seo, ansin má éiríonn le hiarracht chomhshó, scriosfar an comhad foinse. Déantar an próiseas seo ag an deireadh, tar éis gach comhad a chomhshó. Ciallaíonn sé seo gur féidir leat na comhaid foinse chéanna a thiontú ag baint úsáide as réamhshocruithe, gach aon uair amháin. Scriosfar na comhaid foinse ansin ina dhiaidh sin.","Replace original file if converted file is smaller?(Compress attempt)":"Ionadaigh an comhad bunaidh má tá an comhad tiontaithe níos lú? (Iarracht chomhbhrúite)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Roghnaigh an ticbhosca seo más mian leat HBBatchBeast a chur in ionad an chomhaid bhunaidh go huathoibríoch má tá an comhad nua níos lú. Mura bhfuil an comhad nua níos lú, fágfar é sa bhfillteán cinn scríbe.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Cinntigh nach ionann an fillteán cinn scríbe agus / nó laistigh de, do fhillteán foinse nó nach n-oibreoidh sé i gceart.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Nuair atá iarracht déanta ag HBBatchBeast comhad sonrach a chomhbhrú, cuirfidh sé an cosán sin le taisce ionas nach ndéanfar iarracht air arís sa todhchaí. Is féidir leat an taisce a fheiceáil / chur in eagar / soiléir / ag baint úsáide as na cnaipí buí.","Replace original file always?":"Cuir an comhad bunaidh in áit i gcónaí?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Athrófar an comhad bunaidh beag beann ar cibé an bhfuil an comhad nua níos mó nó níos lú.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Arís, déan cinnte nach ionann an fillteán cinn scríbe agus / nó laistigh de, do fhillteán foinse nó nach n-oibreoidh sé i gceart.","Copy subtitle (srt) files to destination?":"Cóipeáil na comhaid fotheideal (srt) go dtí an ceann scríbe?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Cóipeálfar comhaid fhotheideal '.srt' chuig an bhfillteán cinn scríbe go huathoibríoch.","Automatically create temporary/destination folders if they don't exist?":"Cruthaigh fillteáin shealadacha / cheann scríbe go huathoibríoch mura bhfuil siad ann?","Custom bat path to run after each conversion (leave blank if not using):":"Cosán ialtóg le rith tar éis gach tiontaithe (fág bán é mura n-úsáideann tú):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Cuir an cosán isteach i mbaiscchomhad saincheaptha ar mhaith leat a fhorghníomhú tar éis gach comhshó. Mar shampla:","Batch files with timeout statements won't work. More info here:":"Ní oibreoidh comhaid bhaisc le ráitis ó am go ham. Tuilleadh eolais anseo:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Fág an bosca folamh go hiomlán mura mian leat an rogha seo a úsáid (déan cinnte nach bhfuil aon charachtair i bhfolach sa bhosca)","Run processes at low priority?":"Próisis íseal a reáchtáil ar bhonn íseal?","All conversion processes will be run at low priority, reducing processor usage.":"Beidh tosaíocht íseal ag baint le gach próiseas tiontaithe, ag laghdú úsáid an phróiseálaí.","Remove apostrophes from filenames:":"Bain as apostrophes ó ainmneacha comhaid:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Is féidir go n-éireoidh le comhshó / scans seiceála sláinte má bhíonn astaí isteach in ainmneacha comhaid."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Is féidir leis an ngné seo scanadh a dhéanamh le haghaidh comhaid físe truaillithe ag baint úsáide as gné '-scan' HandBrake, cé nach bhfuil sé seo cruinn i gcónaí. Baineann sé úsáid as FFprobe freisin chun an dara pointe tagartha a sholáthar. Má theipeann ar FFprobe agus HandBrake araon tá seans ard ann go bhfuil an comhad truaillithe.","Move corrupt files into the following folder:":"Bog comhaid truaillithe isteach san fhillteán seo a leanas:"," If checked, then any files which give errors will be moved into the specified folder.":"Má dhéantar iad a sheiceáil, ansin aistreofar aon chomhaid a thugann earráidí isteach san fhillteán sonraithe.","Corrupt file folder:":"Fillteán comhaid truaillithe:","Run thorough file health check:":"Seiceáil go críochnúil seiceáil sláinte comhad:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Má sheiceálfar é, déanfar seiceáil físe físe i bhfad níos moille agus níos críochnúla a reáchtáil ag úsáid FFmpeg in ionad HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Bunaithe ar 'ScanMedia.ps1' Desani le fáil ag:","Attempt to repair files after thorough check:":"Iarracht a dhéanamh comhaid a dheisiú tar éis seiceála críochnúla:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Má sheiceáiltear é, déanfaidh HBBatchBeast iarracht comhaid a dheisiú ag úsáid FFmpeg. Cruthófar comhad nua leis an iarmhír '_repaired' san fhillteán céanna leis an gcomhad foinse.","'CRF' value to use when attempting to repair files:":"Luach 'CRF' le húsáid agus tú ag iarraidh comhaid a dheisiú:","The default 'CRF' value is 23. Please see the following for more information:":"Is é an luach réamhshocraithe 'CRF' ná 23. Féach an méid seo a leanas le haghaidh tuilleadh eolais:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Is é raon scála CRF ná 0-51, áit a bhfuil 0 gan chailliúint, is é 23 an mhainneachtain, agus is é 51 an caighdeán is measa is féidir. De ghnáth bíonn caighdeán níos airde mar thoradh ar luach níos ísle, agus is é raon 17 \\ t Smaoinigh ar 17 nó 18 a bheith gan chailliúint ó thaobh amhairc de nó beagnach; ba chóir go mbeadh sé mar an gcéanna nó beagnach mar an gcéanna leis an ionchur ach níl sé gan chall go teicniúil.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"Sábhálann HBBatchBeast liosta de chosáin chomhaid scanta a thuairiscítear a bheith neamhbhriste. Glan an taisce chun scanadh úr a dhéanamh ar gach comhad.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Líon na gcásanna HandBrake / FFmpeg comhuaineach le húsáid? (4 nó níos lú molta):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Baineann an suíomh seo leis na próisis \"seiceáil sláinte fístéipe\" agus \"Scanáil agus tiontú\" araon. Sonraigh cé mhéad snáithe HandBrake atá le húsáid. Níl aon uasmhéid ann ach moltar gan níos mó ná 4 a úsáid. Is féidir le méid níos airde do ríomhaire a reo mura bhfuil sé an-chumhachtach.","Queue size view limit?(Recommended 1000 or fewer):":"Teorainn radhairc méid an scuaine (1000 nó níos lú molta):","Automatically start \"Scan and convert\" when program opened?":"Tosaigh \"Scan and convert\" go huathoibríoch nuair a osclaíodh an clár?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Líon isteach na sonraí ríomhphoist chun fógraí ríomhphoist a fháil má tharlaíonn earráid le linn seiceála sláinte nó faire ar chomhshó / fhillteán. Ní oibreoidh siad le cuntais a éilíonn 2FA. Ní mór duit rochtain a chumasú ar aipeanna nach bhfuil chomh slán ar chuntais Gmail.","Email address:":"Seoladh ríomhphoist:","For example:":"Mar shampla:","Email password(not saved):":"Focal faire ríomhphoist (nár sábháladh):","SMTP server:":"Freastalaí SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"Ceadaíonn an ghné seo monatóireacht a dhéanamh ar stádas comhshó / seiceála sláinte trí úsáid a bhaint as aon bhrabhsálaí gréasáin. Úsáideacha agus freastalaithe á reáchtáil agat etc.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Má tá sé ar chumas, seolfar na sonraí gan ainm seo a leanas chuig HBBatchBeast.io:","API key":"Eochair API","Current status ('Searching', 'Running', 'Finished' etc)":"Stádas reatha ('Cuardach', 'Rith', 'Críochnaithe' srl)","Number of:":"Uimhir le:","Remaining items":"Na hítimí atá fágtha","Successful items":"Míreanna rathúla","Errored items":"Míreanna a cuireadh i leataobh","Cancelled items":"Míreanna curtha ar ceal","Worker percentages":"Céatadáin oibrithe","Last completed item time":"Am críochnaithe na hítime críochnaithe","Enable remote monitoring?:":"Cumasaigh monatóireacht iargúlta ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Tógadh fóntais bhunúsach tagarmharcála go príomha chun a fháil amach conas a fheidhmíonn croíphróiseálaithe 16+ ag úsáid cásanna il-HandBrake cé gur féidir é a reáchtáil ar aon chineál próiseálaí.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Íoslódálfaidh sé seo comhad samplach h265 4k (2.5MB) agus rithfidh sé tagarmharc ag úsáid 4 chás HandBrake le réamhshocruithe \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Is féidir na torthaí a uaslódáil chuig hbbatchbeast.io má roghnaíonn tú.","Queue":"Scuaine","Output this session":"Aschur an seisiún seo","Media info viewer tool":"Uirlis breathnóir info Media","View compress attempt cache":"Féach ar an taisce iarracht compress","Clear compress attempt cache":"Glan an taisce iarracht compress","Save config":"Sábháil cumraíocht","Scan only":"Scan amháin","Scan and convert":"Scan agus tiontaigh","View scan/conversion summary log":"Féach ar scanadh / logáil achoimre chomhshó","View individual file check/conversion log":"Féach ar logáil comhad aonair / logáil chomhshó","View worker console output":"Féach aschur console an oibrí","Health check":"Seiceáil sláinte","Clear healthy file cache":"Glan taisce comhad sláintiúil","View error log":"Féach logáil earráid","Email test":"Tástáil ríomhphoist","View master log":"Féach máistir-log","Wiki help":"Cabhair Wiki","An application by HaveAGitGat":"Iarratas ó HaveAGitGat","New":"Nua","Launch":"Seoladh","Benchmark":"Tagarmharc","See results":"Féach na torthaí","Pause queue":"Sos scuaine","Continue queue":"Lean ar aghaidh le scuaine","Stop queue":"Stop scuaine","Convert selected files":"Tiontaigh comhaid roghnaithe","Toggle queue view":"Scoráil amharc na scuaine","Deselect all":"Dírigh gach duine","Invert all":"Seachain gach rud","Select all":"Roghnú go léir","Toggle output view":"Scrios dearcadh aschuir"}