{
    "The number of custom presets does not match the number of source folders!": "¡O número de presets personalizados non coincide co número de cartafoles de orixe!",
    "source folders have been detected.": "detectáronse os cartafoles de orixe.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "detectáronse liñas predefinidas personalizadas. Verifique se hai saltos de liña invisibles. Debe haber un camiño ao cartafol ou predefinido por liña. Asegúrese de que non creou accidentalmente unha liña en branco.",
    "The number of filename suffixes does not match the number of source folders! ": "¡O número de sufixos de nome de ficheiro non coincide co número de cartafoles de orixe!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "detectáronse as liñas do sufixo do ficheiro. Verifique se hai saltos de liña invisibles. Debe haber un camiño de cartafol ou sufixo de nome de ficheiro por liña. Asegúrese de que non creou accidentalmente unha liña en branco.",
    "The number of source folders does not match the number of destination folders!": "¡O número de cartafoles de orixe non coincide co número de cartafoles de destino!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "detectáronse cartafoles de destino. Verifique se hai saltos de liña invisibles. Debe haber un camiño de carpeta por liña. Asegúrese de que non creou accidentalmente unha liña en branco.",
    "The number of source folders does not match the number of temporary conversion folders!": "¡O número de cartafoles de orixe non coincide co número de cartafoles de conversión temporal!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "detectáronse cartafoles de conversión temporal. Verifique se hai saltos de liña invisibles. Debe haber un camiño de carpeta por liña. Asegúrese de que non creou accidentalmente unha liña en branco.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Introduza un contedor válido como \".mp4\". Asegúrese de incluír o '.'",
    "Corrupt file folder": "Cartafol de ficheiros corrupto",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "non existe! Asegúrese de que non hai espazos nin caracteres ocultos antes / despois do camiño",
    "Source folder": "Cartafol de orixe",
    "Temporary conversion folder": "Cartafol temporal de conversión",
    "appears to be the same as or is within source folder": "parece ser o mesmo ou está dentro do cartafol de orixe",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "que impedirá que HBBatchBeast funcione correctamente. Cambie o cartafol de conversión temporal a un cartafol fóra do cartafol de orixe. Se queres usar a función \"Substituír os ficheiros orixinais\", selecciona un cartafol de destino que non é o mesmo ou dentro do cartafol de orixe e marca a caixa de verificación \"Substituír os ficheiros orixinais\" na sección de configuración avanzada. . Desmarque a caixa de verificación temporal \"Carpeta de conversión temporal\" xa que non servirá neste caso. Os ficheiros converteranse no cartafol de destino e despois volven ao cartafol de orixe.",
    "Destination folder": "Cartafol de destino",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "que impedirá que HBBatchBeast funcione correctamente. Cambie o cartafol de destino a un cartafol fóra do cartafol de orixe. Se queres usar a función \"Substituír os ficheiros orixinais\", selecciona un cartafol de destino que non é o mesmo ou dentro do cartafol de orixe e marca a caixa de verificación \"Substituír os ficheiros orixinais\" na sección de configuración avanzada. . Desmarque a caixa de verificación temporal \"Carpeta de conversión temporal\" xa que non servirá neste caso. Os ficheiros converteranse no cartafol de destino e despois volven ao cartafol de orixe.",
    "Error creating temporary conversion folder": "Erro ao crear o cartafol de conversión temporal",
    "Error creating destination folder": "Erro ao crear o cartafol de destino",
    "Please select to use HandBrake or FFmpeg!": "Escolla usar HandBrake ou FFmpeg!",
    "Please select a standard preset or input a custom one!": "Selecciona un valor predeterminado estándar ou introduce un personalizado!",
    "Please select a scan interval of 5 seconds or greater!": "Seleccione un intervalo de exploración de 5 segundos ou máis.",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Asegúrese de que o número de instancias simultáneas de HandBrake / FFmpeg sexa un ou máis.",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "A chave da API non é válida. Fai clic en \"Novo\" na pestana de monitorización remota para xerar unha nova chave.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Introduce un tempo de exploración diario en formato de 24 horas: hh: mm (por exemplo, 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "A ARQUIVO DE FICHEIROS SERá eliminado despois da conversión. Proba antes do uso correcto.",
    "Benchmark failed!": "Fallou o benchmark!",
    "Log does not exist!": "¡O rexistro non existe!",
    "Folder does not exist!": "¡O cartafol non existe!",
    "Error sending email! Please check your settings.": "Erro ao enviar o correo electrónico! Verifique a configuración.",
    "Test email sent!": "Enviar o correo electrónico de proba.",
    "All worker processes have been stopped.": "Paráronse todos os procesos dos traballadores.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "A cola pausará unha vez que os elementos actuais rematarán de procesar. Está seguro de que quere deter a cola?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Iniciada a pausa de cola. Botón 'Continuar' aparecerá cando todos os traballadores fixesen unha pausa.",
    "Healthy file cache cleared!": "¡Limpouse o caché de ficheiros saudable!",
    "Cache cleared!": "Borrado a caché!",
    "Cancel item": "Cancelar o elemento",
    "Please check the above checkbox to use this feature.": "Marque a caixa de verificación anterior para usar esta función.",
    "Configuration": "Configuración",
    "Source folders": "Cartafoles de orixe",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Este é o cartafol de orixe que se analizará para os medios. É preciso introducir o cartafol sen barra obliqua. Por exemplo:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "A caixa do camiño da carpeta de orixe é expandible (prema Intro para crear unha nova liña). Se desexa especificar varios cartafoles de orixe, asegúrese de que cada camiño do cartafol de orixe estea na súa propia liña, como por exemplo:",
    "Video health check": "Comprobación de vídeo en vídeo",
    "Batch conversion and Folder watching": "Conversión por lotes e visualización de cartafoles",
    "Remote Monitoring (Beta)": "Monitorización remota (Beta)",
    "Benchmark (Beta)": "Benchmark (Beta)",
    "System": "Sistema",
    "Help": "Axuda",
    "Temporary conversion folders": "Cartafoles temporais de conversión",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Se \"Cartafol de conversión temporal?\" está marcado, entón HandBrake converterá ficheiros nese cartafol. Unha vez rematada a conversión, o ficheiro moverase ao \"cartafol de destino\". Deberá especificar tantos cartafoles de conversión como cartafoles de orixe. O teu primeiro cartafol de orixe converterase no teu primeiro cartafol de conversión temporal, o teu segundo cartafol de orixe na túa segunda carpeta de conversión temporal e así sucesivamente. Asegúrese de que cada camiño da carpeta de conversión temporal estea na súa propia liña.",
    "Destination folders": "Cartafoles de destino",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Especifique os camiños do cartafol de destino. De novo, terás que especificar tantos cartafoles de destino como cartafoles de orixe. Os ficheiros do seu primeiro cartafol de orixe acabarán no seu primeiro cartafol de destino, os seus ficheiros de segunda carpeta de orixe no seu segundo cartafol de destino e así por diante.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Primeiro cartafol de fonte ---------> Primeiro cartafol de conversión temporal ---------> Primeiro cartafol de destino",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Segundo cartafol de fonte ---------> Segunda carpeta de conversión temporal ---------> Segundo cartafol de destino",
    "etc": "etc",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast non funcionará correctamente se configura o cartafol de destino igual ou dentro do cartafol de orixe.",
    "Standard preset:": "Predefinido estándar:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Seleccione a predefinición de HandBrake con que desexa converter os seus ficheiros. Se está seleccionado \"Presetado estándar\", entón todos os ficheiros dos cartafoles seleccionados converteranse usando o valor predefinido de HandBrake especificado. Podes atopar máis información sobre os presets de HandBrake aquí:",
    "Custom preset:": "Predefinido personalizado:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Se \"Preset personalizado\", entón tes que introducir a túa propia configuración personalizada. HBBatchBeast cobre a parte de \"HandBrakeCLI -i destino -o\" da entrada HandBrakeCLI polo que precisa introducir os parámetros de conversión. Por exemplo:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Se usa FFmpeg, ten que separar os parámetros de entrada e saída cunha coma. Tales como:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Tamén pode ligar a unha configuración personalizada que foi exportada da aplicación GUI oficial de HandBrake, por exemplo:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Se tes problemas con presets personalizados, pode que se deba a un erro coñecido co HandBrakeCLI (corrixirase na próxima versión de HandBrakeCLI). Consulte isto para unha solución temporal:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Cada predefinido personalizado debe estar na súa propia liña e, do mesmo xeito que os cartafoles, hai que haber tantos presets personalizados como cartafoles de orixe.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Primeiro cartafol de fonte ---------> Primeiro cartafol de conversión temporal ---------> Primeiro cartafol de destino @ Preset personalizado 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Segundo cartafol de fonte ---------> Segunda carpeta de conversión temporal ---------> Segunda carpeta de destino @ Preset personalizado 2",
    "See the following image for guidance:": "Consulte a seguinte imaxe para obter orientación:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Se está a usar a codificación da tarxeta gráfica (como a NVENC), é posible que necesite reducir o número de instancias de HandBrake (probe 2 ou menos) debido ás limitacións de VRAM.",
    "Select standard preset:": "Seleccionar un valor predefinido estándar:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC detectado, por favor asegúrese de reducir o número de instancias de HandBrakeCLI a 2 ou máis abaixo (para a maioría das tarxetas gráficas) ou pode atoparse con erros debido a que non hai suficiente VRAM. Esta configuración pódese atopar na pestana \"Sistema\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Detectouse un valor predeterminado importado. Se tes problemas con presets personalizados importados, pode que se deba a un erro coñecido co HandBrakeCLI (corrixirase na próxima versión de HandBrakeCLI). Unha solución temporal é eliminar \"PictureRotate\": \"0: 0\" 'do ficheiro .json. Máis información aquí:",
    "Container:": "Envase:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Especifique o contedor que desexa que teña o ficheiro de saída como \".mp4\". Podes obter máis información sobre os contedores en:",
    "Enable periodic scanning:": "Activar a exploración periódica:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast pode supervisar os seus cartafoles de orixe e executar escaneos para novos ficheiros nun intervalo especificado. O intervalo de tempo está en segundos coa predeterminada de 300 segundos (5 minutos). Se se selecciona esta opción, cando preme \"Escanear e converter\", o programa converterá todos os ficheiros novos e comezará un temporizador. Isto fará un loop infinito ata que se deteña. O intervalo de exploración está na sección de axustes avanzados.",
    "Enable daily scanning:": "Habilitar a dixitalización diaria:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "No canto de exploración periódica, pode escoller que se realice un escaneo unha vez ao día. O tempo de exploración introdúcese na sección de axustes avanzados en formato hh: mm como '18: 30'. Unha vez seleccionada a opción \"Escanear e converter\", o programa agardará o tempo especificado ata que executa un proceso de dixitalización e conversión. De novo, isto farase un loop infinito ata que se deteña.",
    "Show/hide advanced:": "Mostrar / ocultar avanzado:",
    "Scan interval (minimum 5 seconds):": "Intervalo de exploración (mínimo 5 segundos):",
    "Daily run time (hh:mm):": "Tempo de execución diario (hh: mm):",
    "Output filename suffix:": "Sufixo do nome de ficheiro de saída:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Isto é opcional. Pode especificar un sufixo para engadir ao final do seu nome de ficheiro como '_1080p' ou '_testconversión', etc.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Se se selecciona 'predefinido estándar', todos os ficheiros de saída terán o mesmo sufixo.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Se se selecciona \"predefinido personalizado\", pode especificar un sufixo por cartafol de orixe / predefinido personalizado. Asegúrese de que cada sufixo estea na súa propia liña. Por exemplo, se tes dous cartafoles de orixe e estás a usar \"predefinido personalizado\", poderías poñelo no cadro de sufixo do nome do ficheiro:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Os ficheiros do primeiro cartafol de orixe terán \"_720p\" engadido ao nome do ficheiro de saída. Os ficheiros do segundo cartafol de orixe terán \"_1080p\" engadido ao nome do ficheiro de saída, etc.",
    "Include these file types:": "Incluír estes tipos de ficheiros:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Introduza os tipos de ficheiro a analizar. Cada tipo ten que ser separado por vírgulas. A entrada por defecto é:",
    "Exclude files smaller than (MB):": "Excluir ficheiros menores a (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Especifique se excluír ficheiros menores dun determinado tamaño da conversión (en megabytes)",
    "Exclude files larger than (MB):": "Excluir ficheiros maiores que (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Especifica se hai que excluír ficheiros maiores dun determinado tamaño da conversión (en megabytes)",
    "Exclude filenames which include any of these words:": "Excluír os nomes de ficheiro que inclúan calquera destas palabras:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Introduza as palabras clave que se deben filtrar ao buscar ficheiros. Por exemplo, se se introduce \"720p\", os ficheiros con \"720p\" no título non se converterán. De novo, as palabras clave deben estar separadas por comas. Por exemplo, introduza o seguinte no cadro de filtros:",
    "Include files with any ": "Incluír ficheiros con calquera",
    " or all ": "ou todo",
    " of these": "destes",
    "properties:": "propiedades:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Aquí pode introducir propiedades de vídeo e son que os ficheiros deben ter para converterse (información extraída usando FFprobe). As propiedades deben estar separadas por vírgulas. Use a ferramenta de visualización de información multimedia para axudar a determinar que propiedades desexa incluír. Asegúrese de colocar unha coma despois da última propiedade. Por exemplo, para converter ficheiros só codificados usando o son estéreo h264 e aac:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Paga a pena notar que esta comprobación de propiedade realízase unha vez que se inicia o proceso de conversión (para aforrar tempo mentres se constrúe a cola), polo que aínda que poden aparecer arquivos na cola de conversión, ignoraranse / incluiranse se se cumpren as condicións correctas.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Se FFprobe é capaz de extraer propiedades, entón aparecerá un 'Aceptar' na columna \"FFprobe\" na vista de cola.",
    "Exclude files with any ": "Excluír ficheiros con calquera",
    " of these ": "destes",
    "The opposite of 'Include files with any or all of these properties'": "O contrario de \"Incluír ficheiros con algunha ou todas estas propiedades\"",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Esta é unha pequena ferramenta para analizar as propiedades dos ficheiros para axudarche a determinar as propiedades que queres incluír / excluír nas opcións anteriores. Usa FFprobe para devolver información. Arrastre e solte os ficheiros na caixa gris para analizalos. Por exemplo, deixar un ficheiro de proba pode devolver o seguinte:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Se queres excluír ficheiros coma este de ser convertidos, entón podes poñer varias propiedades de ficheiro no cadro \"Excluir ficheiros con calquera ou todas estas propiedades\" e marcar a caixa de verificación xunto a \"todo\" en vez de \"calquera\", así:",
    "Copy excluded files to destination:": "Copia os ficheiros excluídos no destino:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Se selecciona esta opción, os ficheiros excluídos da conversión copiaranse directamente no cartafol de destino. Isto aplícase aos seguintes filtros:",
    "Exclude filenames which include any of these words": "Excluír os nomes de ficheiro que inclúan calquera destas palabras",
    "Include files with any or all of these properties": "Incluír ficheiros con calquera ou todas estas propiedades",
    "Exclude files with any or all of these properties": "Excluir ficheiros con calquera ou todas estas propiedades",
    "Exclude files smaller than (MB)": "Excluir ficheiros menores a (MB)",
    "Exclude files larger than (MB)": "Excluir ficheiros maiores que (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Teña en conta que isto tamén se aplica aos ficheiros excluídos porque non cumpren as condicións de propiedade \"Incluír\" dos anteriores, de modo que non copie accidentalmente a biblioteca enteira cando só está a tentar converter algúns ficheiros.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "A función de copia non se aplica aos seguintes filtros (é dicir, os ficheiros excluídos debido ao filtro)",
    "Include these file types": "Incluír estes tipos de ficheiros",
    "Delete source files after conversion:": "Eliminar ficheiros de orixe despois da conversión:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Se está seleccionado, entón se un intento de conversión ten éxito, o ficheiro de orixe eliminarase. Este proceso realízase ao final, tras a conversión de todos os ficheiros. Isto significa que pode converter os mesmos ficheiros de orixe empregando varias configuracións previas, todo dunha vez. Os ficheiros de orixe eliminaranse despois.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Substituír o ficheiro orixinal se o ficheiro convertido é menor? (Intento de compresión)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Seleccione esta caixa de verificación se desexa que HBBatchBeast substitúa automaticamente o ficheiro de orixe orixinal se o novo ficheiro é menor. Se o novo ficheiro non é menor, quedará no cartafol de destino.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Asegúrese de que o cartafol de destino non é o mesmo ou dentro do seu cartafol de orixe ou non funcionará correctamente.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Unha vez que HBBatchBeast intentou comprimir un ficheiro específico, engadirá ese camiño ao ficheiro de caché para que non o intente de novo no futuro. Podes ver / editar / borrar a caché usando os botóns amarelos.",
    "Replace original file always?": "Substituír sempre o ficheiro orixinal?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "O ficheiro orixinal será substituído sen importar se o novo ficheiro é maior ou menor.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "De novo, asegúrate de que o teu cartafol de destino non é o mesmo ou dentro do teu cartafol de orixe ou non funcionará correctamente.",
    "Copy subtitle (srt) files to destination?": "Copiar ficheiros de subtítulos (srt) no destino?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Os ficheiros .trt dos subtítulos copiaranse automaticamente no cartafol de destino.",
    "Automatically create temporary/destination folders if they don't exist?": "Cree automaticamente cartafoles temporais / de destino se non existen?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Ruta de batear personalizada para executar despois de cada conversión (deixe en branco se non o está)",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Introduza o camiño cara a un ficheiro de lote personalizado que quere executar despois de cada conversión. Por exemplo:",
    "Batch files with timeout statements won't work. More info here:": "Os ficheiros de lote con instrucións de tempo de espera non funcionan. Máis información aquí:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Deixe a caixa completamente baleira se non desexas usar esta opción (asegúrate de que non hai caracteres ocultos na caixa)",
    "Run processes at low priority?": "Executar procesos con baixa prioridade?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Todos os procesos de conversión executaranse con prioridade baixa, reducindo o uso do procesador.",
    "Remove apostrophes from filenames:": "Elimina os apóstrofes dos nomes dos ficheiros:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "As análises de conversións / comprobacións de saúde poden fallar se os nomes de ficheiros teñen apóstrofes",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Esta función pode buscar ficheiros de vídeo corruptos usando a función '--scan' de HandBrake, aínda que isto non sempre é preciso. Tamén usa FFprobe para proporcionar un segundo punto de referencia. Se FFprobe e HandBrake fallan, entón hai unha gran probabilidade de que o ficheiro sexa corrupto.",
    "Move corrupt files into the following folder:": "Move os ficheiros corruptos ao seguinte cartafol:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Se está marcado, os ficheiros que dean erros moveranse ao cartafol especificado.",
    "Corrupt file folder:": "Cartafol de ficheiros corrupto:",
    "Run thorough file health check:": "Executa un control de saúde completo do ficheiro:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Se está marcado, entón realizarase un exame de saúde de vídeo moito máis lento e máis profundo usando FFmpeg no canto de HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Baseado no \"ScanMedia.ps1\" de Desani atopado en:",
    "Attempt to repair files after thorough check:": "Intentar reparar os ficheiros despois dunha comprobación completa:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Se está marcado, HBBatchBeast intentará arranxar ficheiros usando FFmpeg. Crearase un novo ficheiro co sufixo '_repaired' no mesmo cartafol que o ficheiro de orixe.",
    "'CRF' value to use when attempting to repair files:": "Valor 'CRF' para usar ao intentar arranxar ficheiros:",
    "The default 'CRF' value is 23. Please see the following for more information:": "O valor \"CRF\" predeterminado é 23. Vexa o seguinte para máis información:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "O rango da escala CRF é 0–51, onde 0 é sen perda, 23 é o predeterminado e 51 é a peor calidade posible. Un valor máis baixo xeralmente leva a unha maior calidade e un rango subjetivamente sensato é de 17-28. Considere 17 ou 18 para ser visualmente perdidas ou case así; debería ter o mesmo aspecto ou case o mesmo que a entrada, pero non é tecnicamente sen perda.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast garda unha lista de rutas de ficheiros dixitalizados sinaladas como sen correr. Borrar a caché para realizar unha nova exploración de todos os ficheiros.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Número de instancias simultáneas de HandBrake / FFmpeg que se usarán (recomendadas 4 ou menos):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Esta configuración aplícase tanto aos procesos \"Comprobación de saúde de vídeo\" como \"Escanear e converter\". Especifique cantos fíos de HandBrake usar. Non hai máximo aínda que se recomenda non usar máis de 4. Unha cantidade máis alta pode conxelar o seu ordenador se non é moi poderoso.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Límite de vista do tamaño da cola? (Recoméndase 1000 ou menos):",
    "Automatically start \"Scan and convert\" when program opened?": "Iniciar automaticamente \"Analizar e converter\" cando se abre o programa?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Encha os detalles do correo electrónico para recibir notificacións por correo electrónico se se atopa un erro durante un control de saúde ou a visualización de conversión / cartafol. Non funcionará con contas que requiran 2FA. Debe habilitar o acceso a aplicacións menos seguras nas contas de Gmail.",
    "Email address:": "Enderezo electrónico:",
    "For example:": "Por exemplo:",
    "Email password(not saved):": "Contrasinal de correo electrónico (non gardado):",
    "SMTP server:": "Servidor SMTP:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Esta función permite monitorizar o estado da conversión / comprobación da saúde mediante calquera navegador web. Útil ao executar servidores etc.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Se está activado, os seguintes datos anónimos serán enviados a HBBatchBeast.io:",
    "API key": "Chave da API",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Estado actual (\"Procura\", \"Execución\", \"Rematado\", etc)",
    "Number of:": "Número de:",
    "Remaining items": "Elementos restantes",
    "Successful items": "Elementos exitosos",
    "Errored items": "Elementos errados",
    "Cancelled items": "Elementos cancelados",
    "Worker percentages": "Porcentaxes dos traballadores",
    "Last completed item time": "Última hora do elemento completado",
    "Enable remote monitoring?:": "Activar o seguimento remoto ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Unha utilidade básica de benchmarking construída principalmente para ver como executan 16+ procesadores básicos usando varios casos HandBrake, aínda que pode ser executado en calquera tipo de procesador.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Isto descargará un ficheiro de mostra de 4k h265 (2.5MB) e executará un punto de referencia usando 4 instancias de HandBrake con preset \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Pódense cargar os resultados en hbbatchbeast.io se o prefires.",
    "Queue": "Cola",
    "Output this session": "Saída desta sesión",
    "Media info viewer tool": "Ferramenta de visor de información multimedia",
    "View compress attempt cache": "Ver a caché do intento de comprimir",
    "Clear compress attempt cache": "Borrar a caché de intento de compresión",
    "Save config": "Gardar a configuración",
    "Scan only": "Escanear só",
    "Scan and convert": "Escanear e converter",
    "View scan/conversion summary log": "Ver rexistro de resumo de comprobación / conversión",
    "View individual file check/conversion log": "Ver rexistro de conversión / conversión de ficheiros individual",
    "View worker console output": "Ver a saída da consola de traballador",
    "Health check": "Chequeo de saúde",
    "Clear healthy file cache": "Borrar a caché de ficheiro sa",
    "View error log": "Ver rexistro de erros",
    "Email test": "Proba de correo electrónico",
    "View master log": "Ver rexistro mestre",
    "Wiki help": "Axuda de Wiki",
    "An application by HaveAGitGat": "Unha aplicación de HaveAGitGat",
    "New": "Novo",
    "Launch": "Inicia",
    "Benchmark": "Benchmark",
    "See results": "Ver resultados",
    "Pause queue": "Pausa de cola",
    "Continue queue": "Continuar cola",
    "Stop queue": "Pare a cola",
    "Convert selected files": "Converter ficheiros seleccionados",
    "Toggle queue view": "Activar a vista de cola",
    "Deselect all": "Deselecciona todo",
    "Invert all": "Invertir todo",
    "Select all": "Seleccionar todo",
    "Toggle output view": "Cambiar a vista de saída"
}