{"The number of custom presets does not match the number of source folders!":"કસ્ટમ પ્રીસેટ્સની સંખ્યા સ્રોત ફોલ્ડર્સની સંખ્યાથી મેળ ખાતી નથી!","source folders have been detected.":"સ્રોત ફોલ્ડર્સ શોધી કાઢવામાં આવ્યા છે.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"કસ્ટમ પ્રીસેટ રેખાઓ શોધી કાઢવામાં આવી છે. અદ્રશ્ય લાઇન વિરામ માટે કૃપા કરીને બે વાર તપાસ કરો. લાઇન દીઠ એક ફોલ્ડર પાથ અથવા પ્રીસેટ હોવું જોઈએ. ખાતરી કરો કે તમે આકસ્મિક રીતે ખાલી રેખા બનાવ્યું નથી.","The number of filename suffixes does not match the number of source folders! ":"ફાઇલનામ ઉપસર્ગોની સંખ્યા સ્રોત ફોલ્ડર્સની સંખ્યાથી મેળ ખાતી નથી!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"ફાઇલનામ પ્રત્યય રેખાઓ શોધી કાઢવામાં આવી છે. અદ્રશ્ય લાઇન વિરામ માટે કૃપા કરીને બે વાર તપાસ કરો. લાઇન દીઠ એક ફોલ્ડર પાથ અથવા ફાઇલનામ પ્રત્યય હોવું જોઈએ. ખાતરી કરો કે તમે આકસ્મિક રીતે ખાલી રેખા બનાવ્યું નથી.","The number of source folders does not match the number of destination folders!":"સ્રોત ફોલ્ડર્સની સંખ્યા લક્ષ્ય ફોલ્ડર્સની સંખ્યાથી મેળ ખાતી નથી!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"ગંતવ્ય ફોલ્ડરો શોધી કાઢવામાં આવ્યા છે. અદ્રશ્ય લાઇન વિરામ માટે કૃપા કરીને બે વાર તપાસ કરો. લાઇન દીઠ એક ફોલ્ડર પાથ હોવું જોઈએ. ખાતરી કરો કે તમે આકસ્મિક રીતે ખાલી રેખા બનાવ્યું નથી.","The number of source folders does not match the number of temporary conversion folders!":"સ્રોત ફોલ્ડર્સની સંખ્યા અસ્થાયી રૂપાંતરણ ફોલ્ડર્સની સંખ્યાથી મેળ ખાતી નથી!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"અસ્થાયી રૂપાંતરણો ફોલ્ડર્સ શોધાયા છે. અદ્રશ્ય લાઇન વિરામ માટે કૃપા કરીને બે વાર તપાસ કરો. લાઇન દીઠ એક ફોલ્ડર પાથ હોવું જોઈએ. ખાતરી કરો કે તમે આકસ્મિક રીતે ખાલી રેખા બનાવ્યું નથી.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"કૃપા કરીને '.mp4' જેવા માન્ય કન્ટેનર દાખલ કરો. '.' શામેલ કરવાનું સુનિશ્ચિત કરો.","Corrupt file folder":"ભ્રષ્ટ ફાઇલ ફોલ્ડર","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"અસ્તિત્વમાં નથી! કૃપા કરીને ખાતરી કરો કે પાથ પહેલા / પછી કોઈ જગ્યાઓ અથવા છુપાયેલા અક્ષરો નથી","Source folder":"સ્રોત ફોલ્ડર","Temporary conversion folder":"અસ્થાયી રૂપાંતરણ ફોલ્ડર","appears to be the same as or is within source folder":"તે સ્રોત ફોલ્ડરમાં સમાન છે અથવા તે જ દેખાય છે","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"જે HBBatchBeast ને યોગ્ય રીતે કાર્ય કરવાથી અટકાવશે. મહેરબાની કરીને અસ્થાયી રૂપાંતર ફોલ્ડરને સ્રોત ફોલ્ડરની બહારના ફોલ્ડરમાં ફેરવો. જો તમે 'મૂળ ફાઇલોની સુવિધા બદલો' નો ઉપયોગ કરવા માંગતા હો, તો કૃપા કરીને કોઈ ગંતવ્ય ફોલ્ડર પસંદ કરો જે સ્રોત ફોલ્ડરની જેમ અથવા અંદર નથી, અને પછી અદ્યતન સેટિંગ્સ વિભાગમાં 'મૂળ ફાઇલોને હંમેશાં બદલો' ચેકબૉક્સને તપાસો. . અસ્થાયી 'અસ્થાયી રૂપાંતરણ ફોલ્ડર' ચેકબૉક્સને અનચેક કરો કેમ કે તે આ સ્થિતિમાં કોઈ ઉપયોગ કરશે નહીં. ફાઇલોને ગંતવ્ય ફોલ્ડરમાં રૂપાંતરિત કરવામાં આવશે અને પછી સ્રોત ફોલ્ડરમાં પાછા ખસેડવામાં આવશે.","Destination folder":"લક્ષ્યસ્થાન ફોલ્ડર","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"જે HBBatchBeast ને યોગ્ય રીતે કાર્ય કરવાથી અટકાવશે. કૃપા કરીને સ્રોત ફોલ્ડરની બહારના ફોલ્ડરમાં ગંતવ્ય ફોલ્ડર બદલો. જો તમે 'મૂળ ફાઇલોની સુવિધા બદલો' નો ઉપયોગ કરવા માંગતા હો, તો કૃપા કરીને કોઈ ગંતવ્ય ફોલ્ડર પસંદ કરો જે સ્રોત ફોલ્ડરની જેમ અથવા અંદર નથી, અને પછી અદ્યતન સેટિંગ્સ વિભાગમાં 'મૂળ ફાઇલોને હંમેશાં બદલો' ચેકબૉક્સને તપાસો. . અસ્થાયી 'અસ્થાયી રૂપાંતરણ ફોલ્ડર' ચેકબૉક્સને અનચેક કરો કેમ કે તે આ સ્થિતિમાં કોઈ ઉપયોગ કરશે નહીં. ફાઇલોને ગંતવ્ય ફોલ્ડરમાં રૂપાંતરિત કરવામાં આવશે અને પછી સ્રોત ફોલ્ડરમાં પાછા ખસેડવામાં આવશે.","Error creating temporary conversion folder":"અસ્થાયી રૂપાંતર ફોલ્ડર બનાવતી વખતે ભૂલ","Error creating destination folder":"ગંતવ્ય ફોલ્ડર બનાવવામાં ભૂલ","Please select to use HandBrake or FFmpeg!":"કૃપા કરીને હેન્ડબ્રેક અથવા એફએફએમપીજીનો ઉપયોગ કરવા માટે પસંદ કરો!","Please select a standard preset or input a custom one!":"કૃપા કરીને પ્રમાણભૂત પ્રીસેટ પસંદ કરો અથવા કસ્ટમ ઇનપુટ કરો!","Please select a scan interval of 5 seconds or greater!":"કૃપા કરીને સ્કેન અંતરાલ 5 સેકંડ અથવા વધુ પસંદ કરો!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"કૃપા કરીને ખાતરી કરો કે એકસાથે હેન્ડ બ્રેક / FFmpeg ઉદાહરણોનો ઉપયોગ એક અથવા વધુ છે!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"અમાન્ય API કી! કૃપા કરીને નવી કી જનરેટ કરવા માટે રીમોટ મોનિટરિંગ ટૅબ પર 'નવું' ક્લિક કરો.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"કૃપા કરીને 24 કલાકના ફોર્મેટમાં દૈનિક સ્કેન સમય દાખલ કરો: hh: mm (ઉદાહરણ તરીકે 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"સ્રોત ફાઇલો વિવાદ પછી કાઢી નાખવામાં આવશે! યોગ્ય ઉપયોગ પહેલાં પરીક્ષણ કરો!","Benchmark failed!":"બેન્ચમાર્ક નિષ્ફળ!","Log does not exist!":"લૉગ અસ્તિત્વમાં નથી!","Folder does not exist!":"ફોલ્ડર અસ્તિત્વમાં નથી!","Error sending email! Please check your settings.":"ઇમેઇલ મોકલવામાં ભૂલ! કૃપા કરીને તમારી સેટિંગ્સ તપાસો.","Test email sent!":"પરીક્ષણ ઇમેઇલ મોકલ્યો!","All worker processes have been stopped.":"બધી કાર્યકર પ્રક્રિયાઓ બંધ કરવામાં આવી છે.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"એકવાર વર્તમાન વસ્તુઓની પ્રક્રિયા પૂર્ણ થઈ જાય તે પછી કતાર રોકવામાં આવશે. શું તમે ખરેખર કતારને અટકાવવા માંગો છો?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"કતાર વિરામ શરૂ થયો. એકવાર બધા કાર્યકર્તાઓએ થોભ્યા પછી 'ચાલુ રાખો' બટન દેખાશે.","Healthy file cache cleared!":"તંદુરસ્ત ફાઇલ કેશ સાફ!","Cache cleared!":"કેશ સાફ!","Cancel item":"આઇટમ રદ કરો","Please check the above checkbox to use this feature.":"કૃપા કરીને આ સુવિધાનો ઉપયોગ કરવા માટે ઉપરોક્ત ચેકબૉક્સને તપાસો.","Configuration":"રૂપરેખાંકન","Source folders":"સોર્સ ફોલ્ડર્સ","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"આ સ્રોત ફોલ્ડર છે જે મીડિયા માટે સ્કેન કરવામાં આવશે. કોઈ પાછળની સ્લેશ વગર ફોલ્ડર દાખલ કરવાની જરૂર છે. દાખ્લા તરીકે:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"સ્રોત ફોલ્ડર પાથ બૉક્સ વિસ્તૃત કરવા યોગ્ય છે (નવી લાઇન બનાવવા માટે એન્ટર દબાવો). જો તમે બહુવિધ સ્રોત ફોલ્ડર્સનો ઉલ્લેખ કરવા માંગો છો, તો ખાતરી કરો કે દરેક સ્રોત ફોલ્ડર પાથ તેની પોતાની લાઇન પર છે જેમ કે:","Video health check":"વિડિઓ આરોગ્ય તપાસ","Batch conversion and Folder watching":"બેચ રૂપાંતરણ અને ફોલ્ડર જોવાનું","Remote Monitoring (Beta)":"દૂરસ્થ મોનીટરીંગ (બીટા)","Benchmark (Beta)":"બેંચમાર્ક (બીટા)","System":"સિસ્ટમ","Help":"મદદ","Temporary conversion folders":"અસ્થાયી રૂપાંતરણ ફોલ્ડર્સ","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"જો \"અસ્થાયી રૂપાંતરણ ફોલ્ડર?\" ચકાસાયેલ છે, પછી હેન્ડબેકે ફાઇલોને તે ફોલ્ડરમાં રૂપાંતરિત કરશે. એકવાર રૂપાંતરણ સમાપ્ત થઈ જાય, પછી ફાઇલ તમારા \"લક્ષ્યસ્થાન ફોલ્ડરમાં\" ખસેડવામાં આવશે. તમને સ્રોત ફોલ્ડર્સ તરીકે ઘણા અસ્થાયી રૂપાંતરણો ફોલ્ડર્સને ઉલ્લેખિત કરવાની જરૂર પડશે. તમારું પ્રથમ સ્રોત ફોલ્ડર તમારા પ્રથમ અસ્થાયી રૂપાંતરણ ફોલ્ડરમાં રૂપાંતરિત કરવામાં આવશે, તમારું બીજું સ્રોત ફોલ્ડર તમારા બીજા અસ્થાયી રૂપાંતરણ ફોલ્ડરમાં અને તેથી આગળ. ખાતરી કરો કે દરેક અસ્થાયી રૂપાંતર ફોલ્ડર પાથ તેની પોતાની લાઇન પર છે.","Destination folders":"લક્ષ્ય ફોલ્ડર્સ","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"ગંતવ્ય ફોલ્ડર પાથોને સ્પષ્ટ કરો. ફરીથી, તમારે સ્રોત ફોલ્ડર્સ તરીકે ઘણા ગંતવ્ય ફોલ્ડર્સને નિર્દિષ્ટ કરવાની જરૂર પડશે. તમારા પ્રથમ સ્રોત ફોલ્ડરમાંથી ફાઇલો તમારા પ્રથમ લક્ષ્ય ફોલ્ડરમાં સમાપ્ત થશે, તમારા બીજા ગંતવ્ય ફોલ્ડરમાં તમારી બીજી સ્રોત ફોલ્ડર ફાઇલો અને બીજું.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"પ્રથમ સ્રોત ફોલ્ડર ---------> પ્રથમ અસ્થાયી રૂપાંતર ફોલ્ડર ---------> પ્રથમ ગંતવ્ય ફોલ્ડર","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"બીજું સ્રોત ફોલ્ડર ---------> બીજું અસ્થાયી રૂપાંતર ફોલ્ડર ---------> બીજું ગંતવ્ય ફોલ્ડર","etc":"વગેરે","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"જો તમે ગંતવ્ય ફોલ્ડર, સ્રોત ફોલ્ડરની અંદર અથવા અંદર જ સેટ કરો છો, તો HBBatchBeast યોગ્ય રીતે કાર્ય કરશે નહીં.","Standard preset:":"માનક પ્રીસેટ:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"તમારી ફાઇલોને કન્વર્ટ કરવા માંગો છો તે હેન્ડબ્રેક પ્રીસેટ પસંદ કરો. જો \"માનક પ્રીસેટ\" પસંદ કરેલું છે, તો પસંદ કરેલા ફોલ્ડર્સમાંની બધી ફાઇલો ઉલ્લેખિત હેન્ડબ્રેક પ્રીસેટનો ઉપયોગ કરીને રૂપાંતરિત કરવામાં આવશે. તમે અહીં હેન્ડબ્રૅક પ્રીસેટ્સ વિશે વધુ શોધી શકો છો:","Custom preset:":"કસ્ટમ પ્રીસેટ","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"જો \"કસ્ટમ પ્રીસેટ\" હોય તો તમારે તમારા પોતાના કસ્ટમ પ્રીસેટને દાખલ કરવાની જરૂર છે. HBBatchBeast હેન્ડબ્રૅકસીઆઈ ઇનપુટના \"હેન્ડ બ્રેકસીઆઇઆઇ-સ્ત્રોત-ગંતવ્ય\" ભાગને આવરી લે છે જેથી તમારે રૂપાંતર પરિમાણો દાખલ કરવાની જરૂર છે. દાખ્લા તરીકે:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"જો એફએફએમપીજીનો ઉપયોગ કરી રહ્યા હોય, તો તમારે ઇનપુટ અને આઉટપુટ પરિમાણોને અલ્પવિરામથી અલગ કરવાની જરૂર છે. જેમ કે:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"તમે અધિકૃત હેન્ડ બ્રેક GUI એપ્લિકેશનમાંથી નિકાસ કરવામાં આવેલ કસ્ટમ પ્રીસેટને પણ લિંક કરી શકો છો ઉદાહરણ તરીકે:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"જો તમને કસ્ટમ પ્રીસેટ્સમાં મુશ્કેલી આવી રહી છે, તો તે હેન્ડબ્રૅકસીઆઈ (જાણીતી હેન્ડબ્રૅકસીએલ રીલીઝમાં સુધારાઈ જશે) સાથે જાણીતી બગને કારણે હોઈ શકે છે. અસ્થાયી ઉકેલ માટે કૃપા કરીને આ જુઓ:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"દરેક કસ્ટમ પ્રીસેટને તેની પોતાની લાઇન પર હોવી જોઈએ અને ફોલ્ડર્સની જેમ, સ્રોત ફોલ્ડર્સ તરીકે ઘણા કસ્ટમ પ્રીસેટ્સ હોવા જોઈએ.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"પ્રથમ સ્રોત ફોલ્ડર ---------> પ્રથમ અસ્થાયી રૂપાંતર ફોલ્ડર ---------> પ્રથમ ગંતવ્ય ફોલ્ડર @ કસ્ટમ પ્રીસેટ 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"બીજું સ્રોત ફોલ્ડર ---------> બીજું અસ્થાયી રૂપાંતર ફોલ્ડર ---------> બીજું ગંતવ્ય ફોલ્ડર @ કસ્ટમ પ્રીસેટ 2","See the following image for guidance:":"માર્ગદર્શન માટે નીચેની છબી જુઓ:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"જો ગ્રાફિક્સ કાર્ડ એન્કોડિંગ (જેમ કે એનવીએનસીસી) નો ઉપયોગ કરતા હોય, તો તમારે વીઆરએએમ મર્યાદાઓને કારણે હેન્ડબે્રેક ઉદાહરણોની સંખ્યા ઘટાડવા (2 અથવા ઓછા પ્રયાસ) કરવાની જરૂર પડી શકે છે.","Select standard preset:":"માનક પ્રીસેટ પસંદ કરો:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"એનવીએનસીસીએ શોધી કાઢ્યું છે, કૃપા કરીને હેન્ડબ્રૅકસીઆઇએલ ઘટકોની સંખ્યા 2 અથવા નીચે (મોટાભાગના ગ્રાફિક્સ કાર્ડ્સ માટે) ને ઘટાડવાનું સુનિશ્ચિત કરો અથવા તમને પૂરતી VRAM ના કારણે ભૂલો આવી શકે છે. આ સેટિંગ \"સિસ્ટમ\" ટૅબમાં મળી શકે છે.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"આયાત કરેલ પ્રીસેટ શોધ્યું. જો તમને આયાત કરેલા કસ્ટમ પ્રીસેટ્સમાં મુશ્કેલી આવી રહી છે, તો તે હેન્ડબ્રૅકસીઆઈ (જાણીતી હેન્ડબ્રૅકસીએલ રીલીઝમાં સુધારાઈ જશે) સાથે જાણીતી ભૂલને કારણે હોઈ શકે છે. .Json ફાઇલમાંથી \"પિક્ચરરૉટ\" દૂર કરવા માટેનો અસ્થાયી ઉકેલ છે: \"0: 0\". અહીં વધુ માહિતી:","Container:":"કન્ટેનર","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"આઉટપુટ ફાઇલ જેવી કે '.mp4' હોય તે કન્ટેનરને સ્પષ્ટ કરો. તમે અહીં કન્ટેનર વિશે વધુ શોધી શકો છો:","Enable periodic scanning:":"સમયાંતરે સ્કેનિંગ સક્ષમ કરો:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast તમારા સ્રોત ફોલ્ડર્સનું નિરીક્ષણ કરી શકે છે અને ચોક્કસ ફાઇલો પર નવી ફાઇલો માટે સ્કેન ચલાવી શકે છે. અંતરાલનો સમય ડિફૉલ્ટમાં 300 સેકંડ (5 મિનિટ) હોય છે. જો આ વિકલ્પ પસંદ કરવામાં આવે છે, તો જ્યારે તમે \"સ્કેન કરો અને કન્વર્ટ કરો\" દબાવો છો, ત્યારે પ્રોગ્રામ કોઈપણ નવી ફાઇલોને કન્વર્ટ કરશે અને પછી કાઉન્ટડાઉન ટાઇમર પ્રારંભ થશે. બંધ થતાં સુધી આ લૂપ અનંત રૂપે આવશે. સ્કેન અંતરાલ અદ્યતન સેટિંગ્સ વિભાગમાં છે.","Enable daily scanning:":"દૈનિક સ્કેનિંગ સક્ષમ કરો:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"સમયાંતરે સ્કેનીંગને બદલે, તમે દિવસમાં એક વાર ચલાવવા માટે સ્કેન પસંદ કરી શકો છો. એચ.એન.એમ. ફોર્મેટમાં '18: 30' જેવા અદ્યતન સેટિંગ્સ વિભાગમાં સ્કેન સમય દાખલ થયો છે. એકવાર \"સ્કેન અને કન્વર્ટ\" પસંદ થઈ જાય, ત્યારે પ્રોગ્રામ કોઈ સ્કેન અને કન્વર્ઝન પ્રક્રિયા ચલાવતા સુધી નિર્દિષ્ટ સમય સુધી રાહ જુએ છે. ફરીથી, આ બંધ થતાં સુધી અનંત રૂપે લૂપ કરશે.","Show/hide advanced:":"અદ્યતન બતાવો / છુપાવો:","Scan interval (minimum 5 seconds):":"અંતરાલ સ્કેન (ન્યૂનતમ 5 સેકંડ):","Daily run time (hh:mm):":"દૈનિક રન સમય (એચએચ: એમએમ):","Output filename suffix:":"આઉટપુટ ફાઇલનામ પ્રત્યય:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"આ વૈકલ્પિક છે. તમે '_1080p' અથવા '_testconversion' વગેરે જેવા ફાઇલનામના અંતમાં ઉમેરવા માટે પ્રત્યયનો ઉલ્લેખ કરી શકો છો.","If 'standard preset' is selected then all output files will have the same suffix.":"જો 'સ્ટાન્ડર્ડ પ્રીસેટ' પસંદ થયેલ છે તો બધી આઉટપુટ ફાઇલો સમાન પ્રત્યય હશે.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"જો 'કસ્ટમ પ્રીસેટ' પસંદ કરેલું છે, તો તમે પ્રત્યેક સ્રોત ફોલ્ડર / કસ્ટમ પ્રીસેટનો ઉલ્લેખ કરી શકો છો. ખાતરી કરો કે દરેક પ્રત્યય તેની પોતાની લાઇન પર છે. ઉદાહરણ તરીકે, જો તમારી પાસે 2 સ્રોત ફોલ્ડર્સ છે અને 'કસ્ટમ પ્રીસેટ' નો ઉપયોગ કરી રહ્યાં છે, તો તમે તેને ફાઇલનામ પ્રત્યય બૉક્સમાં મૂકી શકો છો:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"પ્રથમ સ્રોત ફોલ્ડરમાં ફાઇલો '_720p' આઉટપુટ ફાઇલનામમાં ઉમેરવામાં આવશે. બીજા સ્રોત ફોલ્ડરમાં ફાઇલો '_1080p' આઉટપુટ ફાઇલનામ વગેરેમાં ઉમેરવામાં આવશે.","Include these file containers:":"આ ફાઇલ કન્ટેનર શામેલ કરો:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"સ્કેન કરવા માટે ફાઇલ કન્ટેનર દાખલ કરો. દરેક પ્રકારને અલ્પવિરામથી અલગ કરવાની જરૂર છે. ડિફોલ્ટ એન્ટ્રી છે:","Exclude files smaller than (MB):":"(MB) કરતા નાની ફાઇલોને બાકાત કરો:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"કન્ફર્મેશન (ચોક્કસ મેગાબાઇટ્સમાં) માંથી કોઈ ચોક્કસ કદ કરતા નાની ફાઇલોને બાકાત કરવી કે કેમ તે સ્પષ્ટ કરો.","Exclude files larger than (MB):":"(MB) કરતા મોટી ફાઇલોને બાકાત કરો:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"કન્ફિગરેશન (ચોક્કસ મેગાબાઇટ્સમાં) થી ચોક્કસ કદ કરતા મોટી ફાઇલોને બાકાત રાખવી કે કેમ તે સ્પષ્ટ કરો.","Exclude filenames which include any of these words:":"ફાઇલનામોને બાકાત કરો જેમાં આમાંથી કોઈપણ શબ્દ શામેલ છે:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"ફાઇલો માટે સ્કેન કરતી વખતે ફિલ્ટર કરવા માટે કીવર્ડ્સ દાખલ કરો. ઉદાહરણ તરીકે, જો \"720 પી\" દાખલ થયો છે, તો શીર્ષકમાં \"720p\" ધરાવતી કોઈપણ ફાઇલો રૂપાંતરિત થશે નહીં. ફરીથી, કીવર્ડ્સને અલ્પવિરામથી અલગ કરવાની જરૂર છે. ઉદાહરણ તરીકે, નીચેના ફિલ્ટર બૉક્સમાં દાખલ કરો:","Include files with any ":"કોઈપણ સાથે ફાઇલો શામેલ કરો"," or all ":"અથવા બધા"," of these":"આનું","properties:":"ગુણધર્મો","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"અહીં તમે વિડિઓ અને ઑડિઓ પ્રોપર્ટીઝને ઇનપુટ કરી શકો છો જે રૂપાંતરિત થવા માટે ફાઇલોમાં હોવી આવશ્યક છે (FFprobe નો ઉપયોગ કરીને પ્રાપ્ત માહિતી). ગુણધર્મો અલ્પવિરામથી અલગ હોવી આવશ્યક છે. તમે કયા ગુણધર્મોને શામેલ કરવા માંગો છો તે નિર્ધારિત કરવામાં સહાય માટે મીડિયા માહિતી દર્શક સાધનનો ઉપયોગ કરો. છેલ્લી મિલકત પછી અલ્પવિરામ મૂકવાની ખાતરી કરો. ઉદાહરણ તરીકે, ફક્ત ફાઇલોને કન્વર્ટ કરવા માટે જે એચ 264 અને એએસી સ્ટીરિઓ ઑડિઓનો ઉપયોગ કરીને એન્કોડેડ છે:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"કન્વર્ઝન પ્રક્રિયા શરૂ થાય તે પછી આ પ્રોપર્ટી ચેક કરવામાં આવે છે (કતાર બનાવવા વખતે સમય બચાવવા), તેથી જો ફાઇલો કન્વર્ટિંગ કતારમાં દેખાઈ શકે છે, તો યોગ્ય શરતોને પૂર્ણ કરવામાં આવે તો તેને છોડવામાં આવશે / શામેલ કરવામાં આવશે.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"જો FFprobe પ્રોપર્ટીને કાઢવામાં સક્ષમ છે, તો 'કતાર દૃશ્ય' સ્તંભમાં 'ઓકે' દેખાશે.","Exclude files with any ":"કોઈપણ સાથે ફાઇલોને બાકાત કરો"," of these ":"આનું","The opposite of 'Include files with any or all of these properties'":"'કોઈપણ અથવા બધી આ ગુણધર્મો સાથેની ફાઇલો શામેલ કરો' ની વિરુદ્ધ","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"ઉપરના વિકલ્પોમાં તમે કયા ગુણધર્મોને શામેલ / બાકાત રાખવા માંગો છો તે નિર્ધારિત કરવામાં સહાય માટે ફાઇલ ગુણધર્મોનું વિશ્લેષણ કરવા માટે આ એક નાનો ટૂલ છે. તે માહિતી પરત કરવા માટે FFprobe નો ઉપયોગ કરે છે. ફાઇલોનું વિશ્લેષણ કરવા માટે ગ્રે બૉક્સમાં ખેંચો અને છોડો. ઉદાહરણ તરીકે, પરીક્ષણ ફાઇલમાં ડ્રોપ કરવાનું નીચે આપેલું છે:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"જો તમે રૂપાંતરિત થવાથી આ પ્રકારની ફાઇલોને બાકાત રાખવા માંગતા હો, તો તમે \"કોઈપણ અથવા બધી જ સંપત્તિઓ સાથે ફાઇલોને બાકાત કરો\" બૉક્સમાં અનેક ફાઇલ ગુણધર્મો મૂકી શકો છો અને 'કોઈપણ' ની જગ્યાએ 'બધા' ની પાસેના ચેકબૉક્સને ચેક કરી શકો છો, આના જેવું:","Copy excluded files to destination:":"બાકાત ફાઇલોને ગંતવ્ય પર કૉપિ કરો:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"જો તમે આ વિકલ્પ પસંદ કરો છો, તો ફાઇલો કે જે રૂપાંતરમાંથી બાકાત કરવામાં આવી છે તે સીધા જ ગંતવ્ય ફોલ્ડરમાં કૉપિ કરવામાં આવશે. આ નીચેના ફિલ્ટર્સ પર લાગુ પડે છે:","Exclude filenames which include any of these words":"ફાઇલનામોને બાકાત કરો જેમાં આમાંથી કોઈપણ શબ્દ શામેલ છે","Include files with any or all of these properties":"આમાંની કોઈપણ અથવા બધી સંપત્તિઓ સાથે ફાઇલો શામેલ કરો","Exclude files with any or all of these properties":"કોઈપણ અથવા બધી આ ગુણધર્મો સાથે ફાઇલોને બાકાત કરો","Exclude files smaller than (MB)":"(MB) કરતા નાની ફાઇલોને બાકાત કરો","Exclude files larger than (MB)":"(MB) કરતા મોટી ફાઇલોને બાકાત કરો","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"નોંધ કરો કે આ બાકાત ફાઇલો પર પણ લાગુ પડે છે કારણ કે તેઓ ઉપરોક્ત \"શામેલ કરો\" સંપત્તિની શરતોને પૂર્ણ કરતા નથી તેથી તમે કેટલીક ફાઇલોને કન્વર્ટ કરવાનો પ્રયાસ કરી રહ્યા હો ત્યારે આકસ્મિક રૂપે કૉપિ બનાવશો નહીં.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"કૉપિ સુવિધા નીચે આપેલા ફિલ્ટર્સ પર લાગુ થતી નથી (એટલે ફિલ્ટરને કારણે ફાઇલોને બાકાત રાખવામાં આવી છે)","Include these file types":"આ ફાઇલ પ્રકારોને શામેલ કરો","Delete source files after conversion:":"રૂપાંતરણ પછી સ્રોત ફાઇલો કાઢી નાખો:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"જો આ પસંદ કરવામાં આવે છે, તો જો કોઈ રૂપાંતરણ પ્રયાસ સફળ થાય, તો સ્રોત ફાઇલ કાઢી નાખવામાં આવશે. બધી પ્રક્રિયાઓના રૂપાંતરણ પછી, આ પ્રક્રિયા ખૂબ જ અંતમાં થઈ છે. આનો અર્થ એ છે કે તમે એક જ સ્રોત ફાઇલોને બહુવિધ પ્રીસેટ્સનો ઉપયોગ કરીને કન્વર્ટ કરી શકો છો. ત્યારબાદ સ્રોત ફાઇલો કાઢી નાખવામાં આવશે.","Replace original file if converted file is smaller?(Compress attempt)":"રૂપાંતર કરેલી ફાઇલ નાની હોય તો મૂળ ફાઇલને બદલો? (પ્રયાસને સંકોચો)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"જો નવી ફાઇલ નાની હોય તો HBBatchBeast મૂળ સ્ત્રોત ફાઇલને આપમેળે બદલવાની ઇચ્છા હોય તો આ ચેક બૉક્સ પસંદ કરો. જો નવી ફાઇલ નાની નથી, તો તે ગંતવ્ય ફોલ્ડરમાં છોડી દેશે.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"ખાતરી કરો કે તમારું ગંતવ્ય ફોલ્ડર તમારા સ્રોત ફોલ્ડર જેવું નથી અથવા તે અંદર નથી અથવા તે યોગ્ય રીતે કાર્ય કરશે નહીં.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"એકવાર HBBatchBeast એ કોઈ ચોક્કસ ફાઇલને સંકોચવાનો પ્રયાસ કર્યો છે, તે ફાઇલને કેશમાં ઉમેરશે જેથી ભવિષ્યમાં ફરીથી પ્રયાસ કરવામાં નહીં આવે. તમે પીળા બટનોનો ઉપયોગ કરીને કૅશને જોઈ / સંપાદિત / સાફ કરી શકો છો.","Replace original file always?":"હંમેશાં મૂળ ફાઇલને બદલો?","The original file will be replaced regardless of whether the new file is larger or smaller.":"નવી ફાઇલ મોટી અથવા નાની છે કે નહીં તે ધ્યાનમાં લીધા વિના મૂળ ફાઇલને બદલવામાં આવશે.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"ફરીથી, ખાતરી કરો કે તમારું ગંતવ્ય ફોલ્ડર તમારા સ્રોત ફોલ્ડરની અંદર અથવા અંદર સમાન નથી અથવા તે યોગ્ય રીતે કાર્ય કરશે નહીં.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"એકવાર HBBatchBeast એ કોઈ ચોક્કસ ફાઇલને ટ્રાંસ્કોડ કરી લીધા પછી, તે કેશમાં ફાઇલ પાથ ઉમેરશે જેથી ભવિષ્યમાં ફરીથી પ્રયાસ કરવામાં આવશે નહીં. તમે પીળા બટનોનો ઉપયોગ કરીને કૅશને જોઈ / સંપાદિત / સાફ કરી શકો છો.","Copy subtitle (srt) files to destination?":"સબટાઇટલ (SRT) ફાઇલોને ગંતવ્ય પર કૉપિ કરીએ?","Subtitle '.srt' files will be copied to the destination folder automatically.":"ઉપશીર્ષક '.srt' ફાઇલો આપમેળે ગંતવ્ય ફોલ્ડરમાં કૉપિ કરવામાં આવશે.","Automatically create temporary/destination folders if they don't exist?":"જો અસ્તિત્વમાં ન હોય તો આપમેળે અસ્થાયી / ગંતવ્ય ફોલ્ડર્સ બનાવો?","Custom bat path to run after each conversion (leave blank if not using):":"દરેક રૂપાંતરણ પછી ચલાવવા માટેનો કસ્ટમ બૅટ પાથ (ઉપયોગ ન કરવામાં આવે તો ખાલી છોડો):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"એક કસ્ટમ બેચ ફાઇલનો પાથ ઇનપુટ કરો કે જેને તમે દરેક રૂપાંતર પછી ચલાવવા માંગો છો. દાખ્લા તરીકે:","Batch files with timeout statements won't work. More info here:":"સમયસમાપ્તિ નિવેદનો સાથે બેચ ફાઇલો કામ કરશે નહીં. અહીં વધુ માહિતી:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"જો તમે આ વિકલ્પનો ઉપયોગ ન કરવા માંગતા હોવ તો બૉક્સને ખાલી છોડો (ખાતરી કરો કે બૉક્સમાં કોઈ છુપાયેલા અક્ષરો નથી)","Run processes at low priority?":"ઓછી પ્રાધાન્યતા પર પ્રક્રિયાઓ ચલાવો?","All conversion processes will be run at low priority, reducing processor usage.":"બધી રૂપાંતર પ્રક્રિયાઓ ઓછી પ્રાધાન્યતા પર ચાલશે, પ્રોસેસરનો ઉપયોગ ઘટાડે છે.","Remove apostrophes from filenames:":"ફાઇલનામોમાંથી એપોસ્ટ્રોફ્સ દૂર કરો:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"ફાઇલનામોમાં એપોસ્ટ્રોફ્સ હોય તો રૂપાંતરણ / સ્વાસ્થ્ય તપાસ સ્કેન નિષ્ફળ થઈ શકે છે. ફાઇલનામોમાંથી ઑટોપ્રોફેસને આપમેળે દૂર કરવા માટે આ તપાસો."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"આ સુવિધા હેન્ડબ્રેકની '--સ્કન' સુવિધાનો ઉપયોગ કરીને ભ્રષ્ટ વિડિઓ ફાઇલો માટે સ્કેન કરી શકે છે, જો કે આ હંમેશાં સચોટ હોતી નથી. તે બીજો સંદર્ભ બિંદુ પૂરો પાડવા માટે FFprobe નો પણ ઉપયોગ કરે છે. જો એફએફપ્રોબ અને હેન્ડ બ્રેક બંને નિષ્ફળ જાય તો ફાઇલ દૂષિત થવાની ઉચ્ચ તક મળે છે.","Move corrupt files into the following folder:":"નીચેનાં ફોલ્ડરમાં દૂષિત ફાઇલોને ખસેડો:"," If checked, then any files which give errors will be moved into the specified folder.":"જો ચેક કરેલું છે, તો કોઈપણ ફાઇલો જે ભૂલો આપે છે તે નિર્દિષ્ટ ફોલ્ડરમાં ખસેડવામાં આવશે.","Corrupt file folder:":"ભ્રષ્ટ ફાઇલ ફોલ્ડર:","Run thorough file health check:":"સંપૂર્ણ ફાઇલ આરોગ્ય તપાસ ચલાવો:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"જો ચેક કરેલું છે, તો ખૂબ ધીમું, વધુ સંપૂર્ણ વિડિઓ હેલ્થ ચેક હેન્ડ બ્રેકની જગ્યાએ FFmpeg નો ઉપયોગ કરીને ચલાવવામાં આવશે."," Based on Desani's 'ScanMedia.ps1' found at:":"Desani માતાનો 'ScanMedia.ps1' પર આધારિત છે:","Attempt to repair files after thorough check:":"સંપૂર્ણ તપાસ કર્યા પછી ફાઇલો સુધારવા માટે પ્રયાસ:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"જો ચેક કરેલું છે, તો એચબીબેચબેસ્ટ FFmpeg નો ઉપયોગ કરીને ફાઇલોને સુધારવા માટે પ્રયત્ન કરશે. પ્રત્યક્ષ '_repaired' સાથેની નવી ફાઇલ સ્રોત ફાઇલ જેવી જ ફોલ્ડરમાં બનાવવામાં આવશે.","'CRF' value to use when attempting to repair files:":"ફાઇલો સુધારવા માટે પ્રયાસ કરતી વખતે 'સીઆરએફ' મૂલ્ય:","The default 'CRF' value is 23. Please see the following for more information:":"ડિફૉલ્ટ 'સીઆરએફ' મૂલ્ય 23 છે. વધુ માહિતી માટે કૃપા કરીને નીચેના જુઓ:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"સીઆરએફ સ્કેલની શ્રેણી 0-51 છે, જ્યાં 0 ખોટુ છે, 23 ડિફૉલ્ટ છે, અને 51 સૌથી ખરાબ ગુણવત્તા શક્ય છે. નિમ્ન મૂલ્ય સામાન્ય રીતે ઉચ્ચ ગુણવત્તા તરફ દોરી જાય છે, અને વિષયવસ્તુની સન શ્રેણી 17-28 છે. 17 અથવા 18 ને દૃષ્ટિથી ક્ષીણ થવું અથવા લગભગ એટલું જ વિચારવું; તે ઇનપુટ જેટલું જ અથવા લગભગ સમાન લાગતું હોવું જોઈએ પરંતુ તે તકનીકી રીતે ક્ષતિગ્રસ્ત નથી.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast બિનઅનુભવી તરીકે અહેવાલ સ્કેન કરેલ ફાઇલ પાથની સૂચિને સાચવે છે. બધી ફાઇલો પર તાજી સ્કેન કરવા માટે કેશ સાફ કરો.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"એકસાથે હેન્ડ બ્રેક / FFmpeg ઉદાહરણોનો ઉપયોગ કરવા માટે? (ભલામણ કરેલ 4 અથવા ઓછી):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"આ સેટિંગ \"વિડિઓ આરોગ્ય તપાસ\" અને \"સ્કેન અને કન્વર્ટ\" પ્રક્રિયાઓ બંને પર લાગુ થાય છે. કેટલા હેન્ડબે્રેક થ્રેડોનો ઉપયોગ કરવો તે નિર્દિષ્ટ કરો. ત્યાં કોઈ મહત્તમ નથી, જો કે તે 4 થી વધુનો ઉપયોગ ન કરવાની ભલામણ કરવામાં આવે છે. જો તે ખૂબ જ શક્તિશાળી ન હોય તો તમારા કમ્પ્યુટરને વધુ પ્રમાણમાં સ્થિર કરી શકાય છે.","Queue size view limit?(Recommended 1000 or fewer):":"કતાર કદ દૃશ્ય મર્યાદા (ભલામણ 1000 અથવા ઓછી):","Automatically start \"Scan and convert\" when program opened?:":"પ્રોગ્રામ ખોલ્યા પછી આપમેળે \"સ્કેન કરો અને કન્વર્ટ કરો\" પ્રારંભ કરો ?:","Save verbose logs?:":"વર્બોઝ લોગ સાચવો ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"વિગતવાર ઉપ-પ્રક્રિયા લૉગ સાચવવા માટે આ ચેકબૉક્સને ચેક કરો. આમાં કાર્યકર કન્સોલ ઑપુટ શામેલ છે. આ ખૂબ મોટા લોગનું કારણ બનશે.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"જો આરોગ્ય તપાસ અથવા રૂપાંતરણ / ફોલ્ડર જોવામાં ભૂલ આવે તો ઇમેઇલ સૂચનાઓ પ્રાપ્ત કરવા માટે ઇમેઇલ વિગતો ભરો. 2FA ની આવશ્યકતાવાળા એકાઉન્ટ્સ સાથે કામ કરશે નહીં. તમારે Gmail એકાઉન્ટ્સ પર ઓછી સુરક્ષિત એપ્લિકેશન્સની ઍક્સેસ સક્ષમ કરવાની જરૂર છે.","Email address:":"ઈ - મેઈલ સરનામું:","For example:":"દાખ્લા તરીકે:","Email password(not saved):":"ઇમેઇલ પાસવર્ડ (સાચવ્યો નથી):","SMTP server:":"એસએમટીપી સર્વર:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"આ સુવિધા કોઈપણ વેબ-બ્રાઉઝરનો ઉપયોગ કરીને રૂપાંતરણ / આરોગ્ય તપાસની સ્થિતિની દેખરેખને મંજૂરી આપે છે. સર્વર્સ ચલાવતી વખતે ઉપયોગી. કોઈ ફાઇલનામો મોકલવામાં આવ્યાં નથી.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"જો સક્ષમ હોય, તો નીચેનો અનામ ડેટા HBBatchBeast.io ને મોકલવામાં આવશે:","API key":"API કી","Current status ('Searching', 'Running', 'Finished' etc)":"વર્તમાન સ્થિતિ ('શોધ', 'ચાલી રહેલ', 'સમાપ્ત' વગેરે)","Number of:":"સંખ્યા:","Remaining items":"બાકીની વસ્તુઓ","Successful items":"સફળ વસ્તુઓ","Errored items":"ભૂલ થયેલ વસ્તુઓ","Cancelled items":"રદ કરેલી આઇટમ્સ","Worker percentages":"કામદાર ટકાવારી","Last completed item time":"છેલ્લે સમાપ્ત થયેલ સમયનો સમય","Enable remote monitoring?:":"રીમોટ મોનિટરિંગ સક્ષમ કરીએ ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"મૂળભૂત બેંચમાર્કિંગ ઉપયોગિતા મુખ્યત્વે 16+ કોર પ્રોસેસર્સ બહુવિધ હેન્ડબે્રેક ઉદાહરણોનો ઉપયોગ કરીને કેવી રીતે કરે છે તે જોવા માટે બનાવવામાં આવી છે, જોકે તે કોઈપણ પ્રકારના પ્રોસેસર પર ચલાવી શકાય છે.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"આ H265 4k નમૂના ફાઇલ (2.5MB) ડાઉનલોડ કરશે અને પ્રીસેટ \"ખૂબ ઝડપી 1080p30\" સાથે 4 હેન્ડ બ્રેક ઉદાહરણોનો ઉપયોગ કરીને બેંચમાર્ક ચલાવશે.","Results can be uploaded to hbbatchbeast.io if you choose.":"જો તમે પસંદ કરો તો પરિણામો hbbatchbeast.io પર અપલોડ કરી શકાય છે.","Queue":"કતાર","Output this session":"આ સત્ર આઉટપુટ","Media info viewer tool":"મીડિયા માહિતી દર્શક ટૂલ","View replaced file cache":"ફાઇલ કેશ બદલીને જુઓ","Clear replaced file cache":"ફાઇલ કૅશ સાફ કરો","Save config":"રૂપરેખાંકન સાચવો","Scan only":"ફક્ત સ્કેન કરો","Scan and convert":"સ્કેન અને કન્વર્ટ","View scan/conversion summary log":"સ્કેન / રૂપાંતરણ સારાંશ લૉગ જુઓ","View individual file check/conversion log":"વ્યક્તિગત ફાઇલ તપાસ / રૂપાંતર લૉગ જુઓ","View worker console output":"કાર્યકર કન્સોલ આઉટપુટ જુઓ","Health check":"સ્વાસ્થ્ય તપાસ","Clear healthy file cache":"સ્વસ્થ ફાઇલ કેશ સાફ કરો","View error log":"ભૂલ લોગ જુઓ","Email test":"ઇમેઇલ પરીક્ષણ","View master log":"માસ્ટર લોગ જુઓ","Wiki help":"વિકી મદદ કરે છે","An application by HaveAGitGat":"હૅનાગિટગેટ દ્વારા એપ્લિકેશન","New":"નવું","Launch":"લોંચ કરો","Benchmark":"બેંચમાર્ક","See results":"પરિણામો જુઓ","Pause queue":"કતાર વિરામ","Continue queue":"કતાર ચાલુ રાખો","Stop queue":"કતાર બંધ કરો","Convert selected files":"પસંદ કરેલી ફાઇલો કન્વર્ટ કરો","Toggle queue view":"કતાર દૃશ્ય ટૉગલ કરો","Deselect all":"બધા નાપસંદ કરો","Invert all":"બધા અવગણો","Select all":"બધા પસંદ કરો","Toggle output view":"આઉટપુટ દૃશ્ય ટૉગલ કરો"}