{
    "The number of custom presets does not match the number of source folders!": "कस्टम प्रीसेट की संख्या स्रोत फ़ोल्डरों की संख्या से मेल नहीं खाती है!",
    "source folders have been detected.": "स्रोत फ़ोल्डर का पता चला है।",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "कस्टम प्रीसेट लाइनों का पता लगाया गया है। कृपया अदृश्य लाइन ब्रेक के लिए दोहरी जांच करें। प्रति पंक्ति एक फ़ोल्डर पथ या पूर्व निर्धारित होना चाहिए। सुनिश्चित करें कि आपने गलती से एक रिक्त रेखा नहीं बनाई है।",
    "The number of filename suffixes does not match the number of source folders! ": "फ़ाइल नाम प्रत्ययों की संख्या स्रोत फ़ोल्डरों की संख्या से मेल नहीं खाती है!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "फ़ाइल नाम प्रत्यय लाइनों का पता लगाया गया है। कृपया अदृश्य लाइन ब्रेक के लिए दोहरी जांच करें। प्रति पंक्ति एक फ़ोल्डर पथ या फ़ाइल नाम प्रत्यय होना चाहिए। सुनिश्चित करें कि आपने गलती से एक रिक्त रेखा नहीं बनाई है।",
    "The number of source folders does not match the number of destination folders!": "स्रोत फ़ोल्डरों की संख्या गंतव्य फ़ोल्डर्स की संख्या से मेल नहीं खाती है!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "गंतव्य फ़ोल्डर का पता लगाया गया है। कृपया अदृश्य लाइन ब्रेक के लिए दोहरी जांच करें। प्रति पंक्ति एक फ़ोल्डर पथ होना चाहिए। सुनिश्चित करें कि आपने गलती से एक रिक्त रेखा नहीं बनाई है।",
    "The number of source folders does not match the number of temporary conversion folders!": "स्रोत फ़ोल्डरों की संख्या अस्थायी रूपांतरण फ़ोल्डरों की संख्या से मेल नहीं खाती है!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "अस्थायी रूपांतरण फ़ोल्डर का पता लगाया गया है। कृपया अदृश्य लाइन ब्रेक के लिए दोहरी जांच करें। प्रति पंक्ति एक फ़ोल्डर पथ होना चाहिए। सुनिश्चित करें कि आपने गलती से एक रिक्त रेखा नहीं बनाई है।",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "कृपया valid .mp4 ’जैसे मान्य कंटेनर दर्ज करें। 'को शामिल करना सुनिश्चित करें।'",
    "Corrupt file folder": "भ्रष्ट फ़ाइल फ़ोल्डर",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "अस्तित्व में नहीं है! कृपया सुनिश्चित करें कि पथ के पहले / बाद में कोई रिक्त स्थान या छिपे हुए अक्षर नहीं हैं",
    "Source folder": "सोर्स फोल्डर",
    "Temporary conversion folder": "अस्थायी रूपांतरण फ़ोल्डर",
    "appears to be the same as or is within source folder": "स्रोत फ़ोल्डर के भीतर या के समान ही प्रतीत होता है",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "जो HBBatchBeast को सही ढंग से कार्य करने से रोकेगा। कृपया स्रोत फ़ोल्डर के बाहर एक फ़ोल्डर में अस्थायी रूपांतरण फ़ोल्डर बदलें। यदि आप 'मूल फ़ाइल सुविधा बदलें' का उपयोग करना चाहते हैं, तो कृपया एक गंतव्य फ़ोल्डर चुनें जो स्रोत फ़ोल्डर के समान या भीतर नहीं है, और फिर उन्नत सेटिंग्स अनुभाग में 'मूल फ़ाइलें हमेशा बदलें' चेकबॉक्स की जाँच करें । अस्थायी 'अस्थायी रूपांतरण फ़ोल्डर' चेकबॉक्स को अनचेक करें क्योंकि यह इस मामले में कोई उपयोग नहीं करेगा। फ़ाइलों को गंतव्य फ़ोल्डर में परिवर्तित किया जाएगा और फिर स्रोत फ़ोल्डर में वापस ले जाया जाएगा।",
    "Destination folder": "गंतव्य फ़ोल्डर",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "जो HBBatchBeast को सही ढंग से कार्य करने से रोकेगा। कृपया स्रोत फ़ोल्डर के बाहर गंतव्य फ़ोल्डर को फ़ोल्डर में बदलें। यदि आप 'मूल फ़ाइल सुविधा बदलें' का उपयोग करना चाहते हैं, तो कृपया एक गंतव्य फ़ोल्डर चुनें जो स्रोत फ़ोल्डर के समान या भीतर नहीं है, और फिर उन्नत सेटिंग्स अनुभाग में 'मूल फ़ाइलें हमेशा बदलें' चेकबॉक्स की जाँच करें । अस्थायी 'अस्थायी रूपांतरण फ़ोल्डर' चेकबॉक्स को अनचेक करें क्योंकि यह इस मामले में कोई उपयोग नहीं करेगा। फ़ाइलों को गंतव्य फ़ोल्डर में परिवर्तित किया जाएगा और फिर स्रोत फ़ोल्डर में वापस ले जाया जाएगा।",
    "Error creating temporary conversion folder": "अस्थायी रूपांतरण फ़ोल्डर बनाने में त्रुटि",
    "Error creating destination folder": "गंतव्य फ़ोल्डर बनाने में त्रुटि",
    "Please select to use HandBrake or FFmpeg!": "कृपया हैंडब्रेक या FFmpeg का उपयोग करने का चयन करें!",
    "Please select a standard preset or input a custom one!": "कृपया एक मानक प्रीसेट चुनें या एक कस्टम इनपुट करें!",
    "Please select a scan interval of 5 seconds or greater!": "कृपया 5 सेकंड या उससे अधिक के स्कैन अंतराल का चयन करें!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "कृपया सुनिश्चित करें कि उपयोग करने के लिए एक साथ हैंडब्रेक / एफएफएमपीपी इंस्टेंसेस की संख्या एक या अधिक है!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "अमान्य API कुंजी! एक नई कुंजी उत्पन्न करने के लिए कृपया रिमोट मॉनिटरिंग टैब पर 'न्यू' पर क्लिक करें।",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "कृपया 24 घंटे प्रारूप में दैनिक स्कैन समय दर्ज करें: hh: mm (उदाहरण के लिए 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "स्रोत फिल्मों के माध्यम से हटाए जाने की संभावना है! कृपया उचित उपयोग से पहले परीक्षण करें!",
    "Benchmark failed!": "बेंचमार्क विफल!",
    "Log does not exist!": "लॉग मौजूद नहीं है!",
    "Folder does not exist!": "फ़ोल्डर मौजूद नहीं है!",
    "Error sending email! Please check your settings.": "ईमेल भेजने में त्रुटि! कृपया अपनी सेटिंग्स जांचें।",
    "Test email sent!": "परीक्षण ईमेल भेजा गया!",
    "All worker processes have been stopped.": "सभी कार्यकर्ता प्रक्रियाओं को रोक दिया गया है।",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "एक बार वर्तमान वस्तुओं के प्रसंस्करण समाप्त हो जाने के बाद कतार को रोक दिया जाएगा। क्या आप वाकई कतार को रोकना चाहते हैं?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "सभी श्रमिकों के रुके जाने पर कतार रोक दिया गया। 'बंद करो' बटन दिखाई देगा।",
    "Healthy file cache cleared!": "स्वस्थ फ़ाइल कैश साफ़!",
    "Cache cleared!": "कैश क्लियर हो गया!",
    "Cancel item": "वस्तु को रद्द करो",
    "Please check the above checkbox to use this feature.": "कृपया इस सुविधा का उपयोग करने के लिए उपरोक्त चेकबॉक्स देखें।",
    "Configuration": "विन्यास",
    "Source folders": "स्रोत फ़ोल्डर",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "यह स्रोत फ़ोल्डर है जिसे मीडिया के लिए स्कैन किया जाएगा। फ़ोल्डर को बिना अनुगामी स्लैश के साथ दर्ज करने की आवश्यकता है। उदाहरण के लिए:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "स्रोत फ़ोल्डर पथ बॉक्स विस्तार योग्य है (नई लाइन बनाने के लिए एंटर दबाएं)। यदि आप कई स्रोत फ़ोल्डर निर्दिष्ट करना चाहते हैं, तो सुनिश्चित करें कि प्रत्येक स्रोत फ़ोल्डर पथ अपनी लाइन पर है जैसे:",
    "Video health check": "वीडियो स्वास्थ्य जांच",
    "Batch conversion and Folder watching": "बैच रूपांतरण और फ़ोल्डर देखना",
    "Remote Monitoring (Beta)": "रिमोट मॉनिटरिंग (बीटा)",
    "Benchmark (Beta)": "बेंचमार्क (बीटा)",
    "System": "प्रणाली",
    "Help": "मदद",
    "Temporary conversion folders": "अस्थायी रूपांतरण फ़ोल्डर",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "यदि \"अस्थायी रूपांतरण फ़ोल्डर?\" जाँच की जाती है, फिर हैंडब्रेक फ़ाइलों को उस फ़ोल्डर में बदल देगा। रूपांतरण समाप्त होने के बाद, फ़ाइल को आपके \"गंतव्य फ़ोल्डर\" में ले जाया जाएगा। आपको स्रोत फ़ोल्डर के रूप में कई अस्थायी रूपांतरण फ़ोल्डर निर्दिष्ट करने की आवश्यकता होगी। आपका पहला स्रोत फ़ोल्डर आपके पहले अस्थायी रूपांतरण फ़ोल्डर में परिवर्तित हो जाएगा, आपका दूसरा स्रोत फ़ोल्डर आपके दूसरे अस्थायी रूपांतरण फ़ोल्डर और इतने पर। सुनिश्चित करें कि प्रत्येक अस्थायी रूपांतरण फ़ोल्डर पथ अपनी लाइन पर है।",
    "Destination folders": "गंतव्य फ़ोल्डर",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "गंतव्य फ़ोल्डर पथ निर्दिष्ट करें। फिर, आपको स्रोत फ़ोल्डर के रूप में कई गंतव्य फ़ोल्डर निर्दिष्ट करने की आवश्यकता होगी। आपके पहले स्रोत फ़ोल्डर की फाइलें आपके पहले गंतव्य फ़ोल्डर में, आपके दूसरे स्रोत फ़ोल्डर की फ़ाइलें आपके दूसरे गंतव्य फ़ोल्डर में और इसी तरह समाप्त होंगी।",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "पहला स्रोत फ़ोल्डर ---------> पहला अस्थायी रूपांतरण फ़ोल्डर ---------> पहला गंतव्य फ़ोल्डर",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "दूसरा स्रोत फ़ोल्डर ---------> दूसरा अस्थायी रूपांतरण फ़ोल्डर ---------> दूसरा गंतव्य फ़ोल्डर",
    "etc": "आदि",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "यदि आप गंतव्य फ़ोल्डर को उसी तरह या स्रोत फ़ोल्डर में सेट करते हैं, तो HBBatchBeast ठीक से काम नहीं करेगा।",
    "Standard preset:": "मानक पूर्व निर्धारित:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "उस हैंडब्रेक प्रीसेट का चयन करें जिसे आप अपनी फ़ाइलों के साथ बदलना चाहते हैं। यदि \"मानक प्रीसेट\" चुना गया है, तो चयनित फ़ोल्डर में सभी फाइलें निर्दिष्ट हैंडब्रेक प्रीसेट का उपयोग करके परिवर्तित की जाएंगी। आप हैंडब्रेक प्रीसेट के बारे में अधिक जानकारी यहाँ पा सकते हैं:",
    "Custom preset:": "कस्टम पूर्व निर्धारित:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "यदि \"कस्टम प्रीसेट\" है तो आपको अपना कस्टम प्रीसेट दर्ज करना होगा। HBBatchBeast ने HandBrakeCLI इनपुट के \"हैंडब्रेकसीएलआई -i स्रोत-ओ डेस्टिनेशन\" भाग को कवर किया है ताकि आपको रूपांतरण मापदंडों में प्रवेश करने की आवश्यकता हो। उदाहरण के लिए:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "यदि FFmpeg का उपयोग करते हैं, तो आपको इनपुट और आउटपुट पैरामीटर को अल्पविराम से अलग करने की आवश्यकता है। जैसे कि:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "आप एक कस्टम प्रीसेट से भी लिंक कर सकते हैं जिसे उदाहरण के लिए आधिकारिक हैंडब्रेक GUI एप्लिकेशन से निर्यात किया गया है:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "यदि आप कस्टम प्रीसेट से परेशान हैं, तो यह हैंडब्रेकसीएलआई के साथ एक ज्ञात बग के कारण हो सकता है (अगले हैंडब्रेकसीएलआई रिलीज में तय किया जाएगा)। कृपया इसे अस्थायी समाधान के लिए देखें:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "प्रत्येक कस्टम प्रीसेट को अपनी लाइन पर होना चाहिए और, फ़ोल्डर्स की तरह, स्रोत फ़ोल्डर के रूप में कई कस्टम प्रीसेट होने चाहिए।",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "पहला स्रोत फ़ोल्डर ---------> पहला अस्थायी रूपांतरण फ़ोल्डर ---------> पहला गंतव्य फ़ोल्डर @ कस्टम प्रीसेट 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "दूसरा स्रोत फ़ोल्डर ---------> दूसरा अस्थायी रूपांतरण फ़ोल्डर ---------> दूसरा गंतव्य फ़ोल्डर @ कस्टम प्रीसेट 2",
    "See the following image for guidance:": "मार्गदर्शन के लिए निम्नलिखित छवि देखें:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "यदि ग्राफिक्स कार्ड एन्कोडिंग (जैसे NVENC) का उपयोग कर रहे हैं, तो आपको VRAM सीमाओं के कारण हैंडब्रेक इंस्टेंसेस (2 या उससे कम) की संख्या कम करने की आवश्यकता हो सकती है।",
    "Select standard preset:": "मानक प्रीसेट चुनें:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC ने पता लगाया, कृपया हैंडब्रेककली इंस्टेंस की संख्या को 2 या उससे कम (अधिकांश ग्राफिक्स कार्ड के लिए) कम करें या आप पर्याप्त वीआरएएम नहीं होने के कारण त्रुटियों का सामना कर सकते हैं। यह सेटिंग \"सिस्टम\" टैब में पाई जा सकती है।",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "आयातित प्रीसेट का पता लगाया गया है। यदि आप आयातित कस्टम प्रीसेट से परेशान हैं, तो यह हैंडब्रेकेलीआई के साथ एक ज्ञात बग के कारण हो सकता है (अगले हैंडब्रेकसीएलआई रिलीज में तय किया जाएगा)। एक अस्थायी समाधान .json फ़ाइल से \"\" PictureRotate \":\" 0: 0 \"\" को निकालना है। अधिक जानकारी यहाँ:",
    "Container:": "कंटेनर:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "उस कंटेनर को निर्दिष्ट करें जिसे आप आउटपुट फ़ाइल जैसे '.mp4' के लिए चाहते हैं। आप कंटेनरों के बारे में अधिक जानकारी प्राप्त कर सकते हैं:",
    "Enable periodic scanning:": "आवधिक स्कैनिंग सक्षम करें:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast आपके स्रोत फ़ोल्डरों की निगरानी कर सकता है और एक निर्दिष्ट अंतराल पर नई फ़ाइलों के लिए स्कैन चला सकता है। अंतराल का समय सेकंड में होता है, जिसमें डिफ़ॉल्ट 300 सेकंड (5 मिनट) होता है। यदि यह विकल्प चुना जाता है, तो जब आप \"स्कैन और कन्वर्ट\" दबाते हैं, तो प्रोग्राम किसी भी नई फ़ाइल को कनवर्ट करेगा और फिर एक उलटी गिनती शुरू होगी। यह बंद होने तक असीम रूप से लूप करेगा। स्कैन अंतराल उन्नत सेटिंग्स अनुभाग में है।",
    "Enable daily scanning:": "दैनिक स्कैनिंग सक्षम करें:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "आवधिक स्कैनिंग के बजाय, आप एक दिन में एक बार स्कैन करने के लिए चुन सकते हैं। स्कैन समय hh: mm प्रारूप जैसे उन्नत सेटिंग्स अनुभाग में '18: 30 'में दर्ज किया गया है। एक बार जब \"स्कैन और कन्वर्ट\" का चयन किया जाता है, तो प्रोग्राम स्कैन और रूपांतरण प्रक्रिया चलाने तक निर्दिष्ट समय तक इंतजार करेगा। फिर, यह बंद होने तक असीम रूप से लूप करेगा।",
    "Show/hide advanced:": "उन्नत दिखाएं / छिपाएँ:",
    "Scan interval (minimum 5 seconds):": "स्कैन अंतराल (न्यूनतम 5 सेकंड):",
    "Daily run time (hh:mm):": "दैनिक चलाने का समय (hh: mm):",
    "Output filename suffix:": "आउटपुट फ़ाइल नाम प्रत्यय:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "यह वैकल्पिक है। आप अपने फ़ाइल नाम के अंत में जोड़ने के लिए एक प्रत्यय निर्दिष्ट कर सकते हैं जैसे '_1080p' या '_testconconersion' आदि।",
    "If 'standard preset' is selected then all output files will have the same suffix.": "यदि 'मानक पूर्व निर्धारित' चुना जाता है, तो सभी आउटपुट फाइलों में एक ही प्रत्यय होगा।",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "यदि 'कस्टम प्रीसेट' चुना जाता है, तो आप प्रति स्रोत फ़ोल्डर / कस्टम प्रीसेट में एक प्रत्यय निर्दिष्ट कर सकते हैं। सुनिश्चित करें कि प्रत्येक प्रत्यय अपनी लाइन पर है। उदाहरण के लिए, यदि आपके पास 2 स्रोत फ़ोल्डर हैं और 'कस्टम प्रीसेट' का उपयोग कर रहे हैं, तो आप इसे फ़ाइल नाम प्रत्यय बॉक्स में डाल सकते हैं:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "पहले स्रोत फ़ोल्डर में फ़ाइलें आउटपुट फ़ाइलनाम में '_720p' जोड़ी जाएंगी। दूसरे स्रोत फ़ोल्डर की फ़ाइलों में आउटपुट फ़ाइलनाम आदि में '_1080p' जोड़ा जाएगा।",
    "Include these file types:": "इन फ़ाइल प्रकारों को शामिल करें:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "के लिए स्कैन करने के लिए फ़ाइल प्रकार दर्ज करें। प्रत्येक प्रकार को अल्पविराम से अलग करने की आवश्यकता है। डिफ़ॉल्ट प्रविष्टि है:",
    "Exclude files smaller than (MB):": "(MB) से छोटी फ़ाइलों को छोड़ दें:",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "यह निर्दिष्ट करें कि रूपांतरण से एक निश्चित आकार से छोटी फ़ाइलों को बाहर करना है (मेगाबाइट में)",
    "Exclude files larger than (MB):": "(MB) से बड़ी फ़ाइलों को बाहर निकालें:",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "यह निर्दिष्ट करें कि रूपांतरण से एक निश्चित आकार से बड़ी फ़ाइलों को बाहर करना है (मेगाबाइट में)",
    "Exclude filenames which include any of these words:": "उन फ़ाइलनामों को छोड़ दें जिनमें इनमें से कोई भी शब्द शामिल हैं:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "फ़ाइलों को स्कैन करते समय फ़िल्टर किए जाने वाले कीवर्ड दर्ज करें। उदाहरण के लिए, यदि \"720p\" दर्ज किया गया है, तो शीर्षक में \"720p\" के साथ किसी भी फाइल को परिवर्तित नहीं किया जाएगा। फिर से, कीवर्ड को अल्पविराम से अलग करने की आवश्यकता है। उदाहरण के लिए, फ़िल्टर बॉक्स में निम्नलिखित दर्ज करें:",
    "Include files with any ": "किसी भी फाइल को शामिल करें",
    " or all ": "या सभी",
    " of these": "इनमे से",
    "properties:": "गुण:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "यहां आप वीडियो और ऑडियो संपत्तियों को इनपुट कर सकते हैं जिन्हें परिवर्तित करने के लिए फाइलें होनी चाहिए (जानकारी FFprobe का उपयोग करके निकाली गई)। संपत्तियों को अल्पविराम द्वारा अलग किया जाना चाहिए। मीडिया जानकारी दर्शक टूल का उपयोग करके यह निर्धारित करने में सहायता करें कि आप किन गुणों को शामिल करना चाहते हैं। अंतिम संपत्ति के बाद अल्पविराम लगाना सुनिश्चित करें। उदाहरण के लिए, केवल उन फ़ाइलों को परिवर्तित करें जो h264 और aac स्टीरियो ऑडियो का उपयोग करके एन्कोडेड हैं:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "यह ध्यान देने योग्य है कि रूपांतरण की प्रक्रिया शुरू होने के बाद (कतार बनाने के दौरान समय बचाने के लिए) यह संपत्ति जांच की जाती है, इसलिए यदि फाइलें रूपांतरण कतार में दिखाई दे सकती हैं, तो उन्हें सही स्थिति मिलने पर छोड़ दिया जाएगा / शामिल किया जाएगा।",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "यदि FFprobe गुण निकालने में सक्षम है, तो कतार दृश्य में \"FFprobe\" कॉलम में एक 'OK' दिखाई देगा।",
    "Exclude files with any ": "फ़ाइलों को किसी के साथ छोड़ दें",
    " of these ": "इनमे से",
    "The opposite of 'Include files with any or all of these properties'": "'इनमें से किसी भी या सभी गुणों वाली फ़ाइलों को शामिल करें' के विपरीत",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "यह फ़ाइल गुण का विश्लेषण करने के लिए एक छोटा सा उपकरण है जिससे आपको यह निर्धारित करने में मदद मिलेगी कि आप किन विकल्पों को उपरोक्त विकल्पों में शामिल करना चाहते हैं / शामिल करना चाहते हैं। यह जानकारी वापस करने के लिए FFprobe का उपयोग करता है। उन्हें विश्लेषण करने के लिए ग्रे बॉक्स में फ़ाइलों को खींचें और छोड़ें। उदाहरण के लिए, एक परीक्षण फ़ाइल में छोड़ने से निम्नलिखित वापस आ सकते हैं:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "यदि आप फ़ाइलों को इस तरह परिवर्तित होने से बचाना चाहते हैं, तो आप कई फ़ाइल गुणों को \"किसी भी या इन सभी गुणों वाली फ़ाइलों को छोड़ दें\" बॉक्स में डाल सकते हैं और 'सभी' के बजाय 'सभी' के बगल में स्थित चेकबॉक्स को चेक कर सकते हैं। इस तरह:",
    "Copy excluded files to destination:": "गंतव्य के लिए बाहर रखी गई फ़ाइलों की प्रतिलिपि बनाएँ:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "यदि आप इस विकल्प का चयन करते हैं, तो जिन फ़ाइलों को रूपांतरण से बाहर रखा गया है, उन्हें सीधे गंतव्य फ़ोल्डर में कॉपी किया जाएगा। यह निम्नलिखित फिल्टरों पर लागू होता है:",
    "Exclude filenames which include any of these words": "फाइलनेम को छोड़ दें जिसमें इनमें से कोई भी शब्द शामिल हो",
    "Include files with any or all of these properties": "इनमें से किसी भी या सभी गुणों वाली फ़ाइलों को शामिल करें",
    "Exclude files with any or all of these properties": "इनमें से किसी भी या सभी गुणों वाली फ़ाइलों को छोड़ दें",
    "Exclude files smaller than (MB)": "(MB) से छोटी फ़ाइलों को छोड़ दें",
    "Exclude files larger than (MB)": "(MB) से बड़ी फ़ाइलों को छोड़ दें",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "ध्यान दें कि यह उन फ़ाइलों पर भी लागू होता है, क्योंकि वे ऊपर के \"शामिल करें\" संपत्ति की शर्तों को पूरा नहीं करते हैं इसलिए गलती से कॉपी न करें आप पूरी लाइब्रेरी में हैं जब आप केवल कुछ फाइलों को बदलने की कोशिश कर रहे हैं।",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "प्रतिलिपि सुविधा निम्न फ़िल्टरों पर लागू नहीं होती (अर्थात फ़िल्टर के कारण बाहर रखी गई फ़ाइलें)",
    "Include these file types": "इन फ़ाइल प्रकारों को शामिल करें",
    "Delete source files after conversion:": "रूपांतरण के बाद स्रोत फ़ाइलें हटाएं:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "यदि यह चुना जाता है, तो यदि कोई रूपांतरण प्रयास सफल होता है, तो स्रोत फ़ाइल हटा दी जाएगी। सभी फ़ाइलों के रूपांतरण के बाद, यह प्रक्रिया बहुत अंत में की जाती है। इसका मतलब है कि आप एक ही स्रोत फ़ाइलों को एक ही बार में एकाधिक प्रीसेट का उपयोग करके परिवर्तित कर सकते हैं। स्रोत फ़ाइलों को बाद में हटा दिया जाएगा।",
    "Replace original file if converted file is smaller?(Compress attempt)": "यदि परिवर्तित फ़ाइल छोटी है, तो मूल फ़ाइल बदलें। (संपीड़ित प्रयास करें)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "यदि आप HBBatchBeast को नई फ़ाइल छोटी है, तो मूल स्रोत फ़ाइल को स्वचालित रूप से बदलने के लिए इस चेक बॉक्स का चयन करें। यदि नई फ़ाइल छोटी नहीं है, तो उसे गंतव्य फ़ोल्डर में छोड़ दिया जाएगा।",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "सुनिश्चित करें कि आपका गंतव्य फ़ोल्डर आपके स्रोत फ़ोल्डर के समान / या भीतर नहीं है, या यह ठीक से काम नहीं करेगा।",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "एक बार HBBatchBeast ने एक विशिष्ट फ़ाइल को संपीड़ित करने का प्रयास किया है, यह उस फ़ाइल पथ को कैश में जोड़ देगा ताकि भविष्य में इसे फिर से प्रयास न किया जाए। आप पीले बटन का उपयोग करके कैश को देख / संपादित / साफ़ कर सकते हैं।",
    "Replace original file always?": "मूल फ़ाइल हमेशा बदलें?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "मूल फ़ाइल को बदल दिया जाएगा चाहे नई फ़ाइल बड़ी हो या छोटी।",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "फिर से, सुनिश्चित करें कि आपका गंतव्य फ़ोल्डर आपके स्रोत फ़ोल्डर के समान / या भीतर नहीं है, या यह ठीक से काम नहीं करेगा।",
    "Copy subtitle (srt) files to destination?": "गंतव्य के लिए उपशीर्षक (srt) फ़ाइलों की प्रतिलिपि बनाएँ?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "उपशीर्षक '.srt' फ़ाइलों को गंतव्य फ़ोल्डर में स्वचालित रूप से कॉपी किया जाएगा।",
    "Automatically create temporary/destination folders if they don't exist?": "यदि वे मौजूद नहीं हैं, तो स्वचालित रूप से अस्थायी / गंतव्य फ़ोल्डर बनाएँ?",
    "Custom bat path to run after each conversion (leave blank if not using):": "प्रत्येक रूपांतरण के बाद चलने के लिए कस्टम बैट पथ (यदि उपयोग न किया जाए तो खाली छोड़ दें):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "एक कस्टम बैच फ़ाइल का पथ इनपुट करें जिसे आप प्रत्येक रूपांतरण के बाद निष्पादित करना चाहते हैं। उदाहरण के लिए:",
    "Batch files with timeout statements won't work. More info here:": "टाइमआउट स्टेटमेंट वाली बैच फाइलें काम नहीं करेंगी। अधिक जानकारी यहाँ:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "यदि आप इस विकल्प का उपयोग नहीं करना चाहते हैं तो बॉक्स को पूरी तरह से खाली छोड़ दें (सुनिश्चित करें कि बॉक्स में कोई छिपा हुआ पात्र नहीं है)",
    "Run processes at low priority?": "कम प्राथमिकता पर प्रक्रियाएं चलाएं?",
    "All conversion processes will be run at low priority, reducing processor usage.": "सभी रूपांतरण प्रक्रियाओं को प्रोसेसर के उपयोग को कम करते हुए, कम प्राथमिकता पर चलाया जाएगा।",
    "Remove apostrophes from filenames:": "फ़ाइल नाम से apostrophes निकालें:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "यदि फ़ाइलनाम में अपॉस्ट्रोफ़ हैं, तो रूपांतरण / स्वास्थ्य जांच स्कैन विफल हो सकते हैं। फ़ाइनल से अपोस्ट्रोफ़ को स्वचालित रूप से हटाने के लिए इसे जांचें।",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "यह सुविधा हैंडब्रेक के '--स्कैन' फीचर का उपयोग करके भ्रष्ट वीडियो फ़ाइलों के लिए स्कैन कर सकती है, हालांकि यह हमेशा सटीक नहीं होती है। यह दूसरे संदर्भ बिंदु प्रदान करने के लिए FFprobe का भी उपयोग करता है। यदि FFprobe और HandBrake दोनों विफल होते हैं, तो एक उच्च संभावना है कि फ़ाइल भ्रष्ट है।",
    "Move corrupt files into the following folder:": "निम्न फ़ोल्डर में भ्रष्ट फ़ाइलें ले जाएँ:",
    " If checked, then any files which give errors will be moved into the specified folder.": "यदि जाँच की जाती है, तो त्रुटियां देने वाली कोई भी फाइल निर्दिष्ट फ़ोल्डर में चली जाएगी।",
    "Corrupt file folder:": "भ्रष्ट फ़ाइल फ़ोल्डर:",
    "Run thorough file health check:": "पूरी तरह से फ़ाइल स्वास्थ्य जांच चलाएं:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "अगर जांच की जाए, तो हैंडब्रेक के बजाय एफएफएमपीपी का उपयोग करके बहुत धीमी, अधिक गहन वीडियो स्वास्थ्य जांच की जाएगी।",
    " Based on Desani's 'ScanMedia.ps1' found at:": "देसानी की 'ScanMedia.ps1' पर आधारित:",
    "Attempt to repair files after thorough check:": "पूरी तरह से जाँच के बाद फ़ाइलों की मरम्मत करने का प्रयास करें:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "यदि जाँच की जाती है, तो HBBatchBeast FFmpeg का उपयोग करके फ़ाइलों की मरम्मत करने का प्रयास करेगा। प्रत्यय '_repaired' के साथ एक नई फ़ाइल स्रोत फ़ाइल के समान फ़ोल्डर में बनाई जाएगी।",
    "'CRF' value to use when attempting to repair files:": "फ़ाइलों की मरम्मत करने का प्रयास करते समय उपयोग करने के लिए 'CRF' मान:",
    "The default 'CRF' value is 23. Please see the following for more information:": "डिफ़ॉल्ट 'CRF' का मान 23 है। कृपया अधिक जानकारी के लिए निम्नलिखित देखें:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "सीआरएफ पैमाने की सीमा 0–51 है, जहां 0 दोषरहित है, 23 डिफ़ॉल्ट है, और 51 सबसे खराब गुणवत्ता संभव है। एक कम मूल्य आम तौर पर उच्च गुणवत्ता की ओर जाता है, और एक विषयगत रूप से सीमा 17-28 है। 17 या 18 को नेत्रहीन दोषरहित मानें या लगभग ऐसा ही; यह इनपुट के समान या लगभग समान होना चाहिए, लेकिन यह तकनीकी रूप से दोषरहित नहीं है।",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast स्कैन किए गए फ़ाइल पथों की सूची सहेजता है जिन्हें रिपोर्ट नहीं किया गया है। सभी फ़ाइलों पर एक ताज़ा स्कैन करने के लिए कैश साफ़ करें।",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "उपयोग करने के लिए एक साथ हैंडब्रेक / एफएफएमपीई इंस्टेंसेस की संख्या? (अनुशंसित 4 या उससे कम) -",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "यह सेटिंग \"वीडियो स्वास्थ्य जांच\" और \"स्कैन और कन्वर्ट\" दोनों प्रक्रियाओं पर लागू होती है। निर्दिष्ट करें कि कितने हैंडब्रेक धागे का उपयोग करना है। कोई अधिकतम नहीं है, हालांकि यह 4 से अधिक का उपयोग नहीं करने की सिफारिश की गई है। यदि यह बहुत शक्तिशाली नहीं है तो एक उच्च राशि आपके कंप्यूटर को फ्रीज कर सकती है।",
    "Queue size view limit?(Recommended 1000 or fewer):": "कतार आकार दृश्य सीमा (अनुशंसित 1000 या उससे कम):",
    "Automatically start \"Scan and convert\" when program opened?": "प्रोग्राम खुलने पर स्वचालित रूप से \"स्कैन और कन्वर्ट\" शुरू करें?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "यदि स्वास्थ्य जांच या रूपांतरण / फ़ोल्डर देखने के दौरान कोई त्रुटि आई है तो ईमेल सूचनाएं प्राप्त करने के लिए ईमेल विवरण भरें। 2FA की आवश्यकता वाले खातों के साथ काम नहीं करेंगे। आपको Gmail खातों पर कम सुरक्षित ऐप्स तक पहुंच सक्षम करने की आवश्यकता है।",
    "Email address:": "ईमेल पता:",
    "For example:": "उदाहरण के लिए:",
    "Email password(not saved):": "ईमेल पासवर्ड (सहेजा नहीं गया):",
    "SMTP server:": "SMTP सर्वर:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "यह सुविधा किसी भी वेब-ब्राउज़र का उपयोग करके रूपांतरण / स्वास्थ्य जांच की स्थिति की निगरानी की अनुमति देती है। सर्वर आदि चलाते समय उपयोगी।",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "यदि सक्षम हो, तो निम्न अनाम डेटा HBBatchBeast.io पर भेजा जाएगा:",
    "API key": "एपीआई कुंजी",
    "Current status ('Searching', 'Running', 'Finished' etc)": "वर्तमान स्थिति ('खोज', 'चल रहा है', 'समाप्त' आदि)",
    "Number of:": "की संख्या:",
    "Remaining items": "बची हुई वस्तुएं",
    "Successful items": "सफल आइटम",
    "Errored items": "त्रुटिपूर्ण आइटम",
    "Cancelled items": "रद्द आइटम",
    "Worker percentages": "कार्यकर्ता प्रतिशत",
    "Last completed item time": "अंतिम पूर्ण आइटम समय",
    "Enable remote monitoring?:": "दूरस्थ निगरानी सक्षम करें ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "एक बुनियादी बेंचमार्किंग उपयोगिता मुख्य रूप से यह देखने के लिए बनाई गई है कि 16+ कोर प्रोसेसर कई हैंडब्रेक इंस्टेंस का उपयोग करके कैसे प्रदर्शन करते हैं हालांकि इसे किसी भी प्रकार के प्रोसेसर पर चलाया जा सकता है।",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "यह h265 4k नमूना फ़ाइल (2.5MB) डाउनलोड करेगा और प्रीसेट \"वेरी फ़ास्ट 1080p30\" के साथ 4 हैंडब्रेक इंस्टेंस का उपयोग करके एक बेंचमार्क चलाएगा।",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "यदि आप चुनते हैं तो परिणाम hbbatchbeast.io पर अपलोड किए जा सकते हैं।",
    "Queue": "पंक्ति",
    "Output this session": "आउटपुट इस सत्र",
    "Media info viewer tool": "मीडिया जानकारी दर्शक उपकरण",
    "View compress attempt cache": "संपीड़ित प्रयास कैश देखें",
    "Clear compress attempt cache": "स्पष्ट संपीड़ित प्रयास कैश",
    "Save config": "कॉन्फ़िगरेशन सहेजें",
    "Scan only": "केवल स्कैन करें",
    "Scan and convert": "स्कैन करें और कन्वर्ट करें",
    "View scan/conversion summary log": "स्कैन / रूपांतरण सारांश लॉग देखें",
    "View individual file check/conversion log": "व्यक्तिगत फ़ाइल चेक / रूपांतरण लॉग देखें",
    "View worker console output": "वर्कर कंसोल आउटपुट देखें",
    "Health check": "स्वास्थ्य जांच",
    "Clear healthy file cache": "स्वस्थ फ़ाइल कैश साफ़ करें",
    "View error log": "त्रुटि लॉग देखें",
    "Email test": "ईमेल परीक्षण",
    "View master log": "मास्टर लॉग देखें",
    "Wiki help": "विकी की मदद",
    "An application by HaveAGitGat": "HaveAGitGat द्वारा एक आवेदन",
    "New": "नया",
    "Launch": "प्रक्षेपण",
    "Benchmark": "बेंचमार्क",
    "See results": "परिणाम देखें",
    "Pause queue": "पंक्ति रोकें",
    "Continue queue": "कतार जारी रखें",
    "Stop queue": "कतार बंद करो",
    "Convert selected files": "चयनित फ़ाइलों को कनवर्ट करें",
    "Toggle queue view": "कतार का दृश्य टॉगल करें",
    "Deselect all": "सभी को अचिन्हिंत करें",
    "Invert all": "सब उलटा करो",
    "Select all": "सभी का चयन करे",
    "Toggle output view": "आउटपुट दृश्य टॉगल करें"
}