{
    "The number of custom presets does not match the number of source folders!": "Broj prilagođenih postavki ne odgovara broju izvornih mapa!",
    "source folders have been detected.": "otkrivene su izvorne mape.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "otkrivene su prilagođene unaprijed postavljene linije. Provjerite nevidljive prijelaze redaka. Trebala bi postojati jedna staza mape ili unaprijed određena linija. Provjerite jeste li slučajno stvorili prazan redak.",
    "The number of filename suffixes does not match the number of source folders! ": "Broj sufiksa naziva datoteka ne odgovara broju izvornih mapa!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "Otkriveni su sufiksi za nazive datoteka. Provjerite nevidljive prijelaze redaka. Trebalo bi postojati jedan put za mapu ili sufiks imena datoteke u retku. Provjerite jeste li slučajno stvorili prazan redak.",
    "The number of source folders does not match the number of destination folders!": "Broj izvornih mapa ne odgovara broju odredišnih mapa!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "Otkrivene su odredišne mape. Provjerite nevidljive prijelaze redaka. Trebao bi postojati jedan put mape po retku. Provjerite jeste li slučajno stvorili prazan redak.",
    "The number of source folders does not match the number of temporary conversion folders!": "Broj izvornih mapa ne odgovara broju privremenih mapa za pretvorbu!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "otkrivene su privremene mape za pretvorbu. Provjerite nevidljive prijelaze redaka. Trebao bi postojati jedan put mape po retku. Provjerite jeste li slučajno stvorili prazan redak.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Unesite valjani spremnik kao što je \".mp4\". Svakako uključite \".\"",
    "Corrupt file folder": "Oštećena mapa datoteke",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "ne postoji! Provjerite nema li razmaka ili skrivenih znakova prije / nakon putanje",
    "Source folder": "Izvorna mapa",
    "Temporary conversion folder": "Privremena mapa za konverziju",
    "appears to be the same as or is within source folder": "čini se da je ista ili je unutar izvorne mape",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "što će spriječiti ispravno funkcioniranje HBBatchBeast-a. Promijenite privremenu mapu za pretvorbu u mapu izvan izvorne mape. Ako želite koristiti značajku \"Zamijeni izvorne datoteke\", odaberite odredišnu mapu koja nije ista kao izvorna mapa ili unutar nje, a zatim označite potvrdni okvir \"Zamijeni uvijek izvorne datoteke\" u odjeljku naprednih postavki , Isključite potvrdni okvir privremene mape \"Privremena konverzija\" jer u ovom slučaju neće koristiti. Datoteke će se pretvoriti u odredišnu mapu, a zatim vratiti u izvornu mapu.",
    "Destination folder": "Odredišna mapa",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "što će spriječiti ispravno funkcioniranje HBBatchBeast-a. Promijenite odredišnu mapu u mapu izvan izvorne mape. Ako želite koristiti značajku \"Zamijeni izvorne datoteke\", odaberite odredišnu mapu koja nije ista kao izvorna mapa ili unutar nje, a zatim označite potvrdni okvir \"Zamijeni uvijek izvorne datoteke\" u odjeljku naprednih postavki , Isključite potvrdni okvir privremene mape \"Privremena konverzija\" jer u ovom slučaju neće koristiti. Datoteke će se pretvoriti u odredišnu mapu, a zatim vratiti u izvornu mapu.",
    "Error creating temporary conversion folder": "Pogreška pri izradi privremene mape konverzije",
    "Error creating destination folder": "Pogreška pri izradi odredišne mape",
    "Please select to use HandBrake or FFmpeg!": "Odaberite za korištenje HandBrake ili FFmpeg!",
    "Please select a standard preset or input a custom one!": "Odaberite standardnu postavku ili unesite prilagođenu!",
    "Please select a scan interval of 5 seconds or greater!": "Odaberite interval skeniranja od 5 sekundi ili više!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Provjerite je li broj istodobnih HandBrake / FFmpeg primjeraka jedan ili veći!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Nevažeći API ključ! Kliknite \"Novo\" na kartici za daljinsko praćenje da biste generirali novi ključ.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Unesite vrijeme skeniranja u 24-satnom formatu: hh: mm (na primjer 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "FILE IZVORA bit će izbrisane nakon konverzije! Molimo provjerite prije pravilne uporabe!",
    "Benchmark failed!": "Benchmark nije uspio!",
    "Log does not exist!": "Dnevnik ne postoji!",
    "Folder does not exist!": "Mapa ne postoji!",
    "Error sending email! Please check your settings.": "Pogreška prilikom slanja e-pošte! Provjerite svoje postavke.",
    "Test email sent!": "Poslana je testna e-pošta!",
    "All worker processes have been stopped.": "Svi radnički procesi su zaustavljeni.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Red čekanja će biti pauziran nakon završetka obrade trenutnih stavki. Jeste li sigurni da želite zaustaviti red čekanja?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Kada se svi radnici pauziraju, pojavit će se gumb \"Nastavi\".",
    "Healthy file cache cleared!": "Izbačena je zdrava datoteka u kešu!",
    "Cache cleared!": "Cache je izbrisan!",
    "Cancel item": "Otkaži stavku",
    "Please check the above checkbox to use this feature.": "Provjerite gornji potvrdni okvir da biste koristili ovu značajku.",
    "Configuration": "Konfiguracija",
    "Source folders": "Izvorne mape",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Ovo je izvorna mapa koja će biti skenirana za medije. Potrebno je unijeti mapu bez kose crte. Na primjer:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Polje putanje izvorne mape je moguće proširiti (pritisnite enter da biste stvorili novi redak). Ako želite navesti više izvornih mapa, provjerite je li svaka staza izvorne mape na vlastitoj liniji kao što je:",
    "Video health check": "Provjera zdravlja videozapisa",
    "Batch conversion and Folder watching": "Batch konverzija i gledanje mape",
    "Remote Monitoring (Beta)": "Daljinski nadzor (Beta)",
    "Benchmark (Beta)": "Benchmark (beta)",
    "System": "sistem",
    "Help": "Pomozite",
    "Temporary conversion folders": "Privremene mape za pretvorbu",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Ako je \"Privremena mapa za konverziju?\" je označeno, a zatim će HandBrake pretvoriti datoteke u tu mapu. Nakon dovršetka pretvorbe datoteka će se premjestiti u mapu \"Odredište\". Kao izvorne mape trebate navesti onoliko privremenih mapa za pretvorbu. Vaša prva izvorna mapa pretvorit će se u vašu prvu privremenu mapu za pretvorbu, drugu izvornu mapu u drugu privremenu mapu za pretvorbu i tako dalje. Provjerite je li svaka putanja privremene mape konverzije na vlastitom retku.",
    "Destination folders": "Odredišne mape",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Navedite putanje odredišne mape. Opet, morat ćete odrediti što je više mapa odredišta kao izvornih mapa. Datoteke iz vaše prve izvorne mape završit će u vašoj prvoj odredišnoj mapi, u drugim mapama izvora u drugoj odredišnoj mapi i tako dalje.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Prva izvorna mapa ---------> Prva privremena mapa za pretvorbu ---------> Prva odredišna mapa",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Druga mapa izvora ---------> Druga privremena mapa za pretvorbu ---------> Druga odredišna mapa",
    "etc": "itd",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast neće ispravno raditi ako odredišnu mapu postavite na istu ili unutar izvorne mape.",
    "Standard preset:": "Standardna postavka:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Odaberite unaprijed postavljenu ručnu blokadu koju želite pretvoriti s datotekama. Ako je odabrano \"Standard preset\", sve datoteke u odabranim mapama će se konvertirati pomoću zadane predodžbe HandBrake. Ovdje možete pronaći više o presetima za HandBrake:",
    "Custom preset:": "Prilagođeno unaprijed postavljeno:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Ako je \"Custom preset\" tada morate unijeti vlastitu prilagođenu postavku. HBBatchBeast pokriva \"HandBrakeCLI -i izvor-to odredište\" dio HandBrakeCLI ulaza tako da trebate unijeti parametre konverzije. Na primjer:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Ako koristite FFmpeg, trebate odvojiti ulazne i izlazne parametre zarezom. Kao što su:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Možete se povezati i na prilagođenu postavku koja je izvezena iz službene GUI aplikacije za HandBrake, na primjer:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Ako imate problema s prilagođenim unaprijed postavljenim postavkama, to može biti zbog poznatog problema s HandBrakeCLI (bit će ispravljen u sljedećem izdanju HandBrakeCLI). Pogledajte ovo za privremeno rješenje:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Svaka prilagođena postavka mora biti na vlastitoj liniji i, slično mapama, mora postojati onoliko prilagođenih preseta kao izvornih mapa.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Prva izvorna mapa ---------> Prva privremena mapa za pretvorbu ---------> Prva odredišna mapa @ Custom preset 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Druga mapa izvora ---------> Druga privremena mapa za pretvorbu ---------> Druga odredišna mapa @ Custom preset 2",
    "See the following image for guidance:": "Pogledajte sljedeću sliku za upute:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Ako koristite kodiranje grafičke kartice (kao što je NVENC), možda ćete morati smanjiti broj primjeraka HandBrake (pokušati 2 ili manje) zbog ograničenja VRAM-a.",
    "Select standard preset:": "Odaberite standardnu postavku:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC detektirao, molimo pobrinite se da smanjite broj HandBrakeCLI instance na 2 ili ispod (za većinu grafičkih kartica) ili možete naići na pogreške zbog nedovoljnog VRAM-a. Ovu postavku možete pronaći na kartici \"Sustav\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Otkriven je uvezeni pretprogram. Ako imate problema s uvezenim prilagođenim unaprijed postavljenim postavkama, to može biti zbog poznatog buga s HandBrakeCLI (bit će ispravljen u sljedećem izdanju HandBrakeCLI). Privremeno rješenje je ukloniti \"PictureRotate\": \"0: 0\" iz .json datoteke. Više informacija ovdje:",
    "Container:": "kontejnera:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Navedite spremnik koji želite imati izlaznu datoteku kao što je \".mp4\". Više o kontejnerima možete saznati na:",
    "Enable periodic scanning:": "Omogući periodično skeniranje:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast može pratiti vaše izvorne mape i pokrenuti skeniranje za nove datoteke u određenom intervalu. Vrijeme intervala je u sekundama, a zadano je 300 sekundi (5 minuta). Ako odaberete ovu opciju, kada pritisnete \"Skeniraj i konvertiraj\", program će pretvoriti sve nove datoteke i tada će početi odbrojavanje vremena. To će se beskonačno skratiti dok se ne zaustavi. Interval skeniranja nalazi se u odjeljku naprednih postavki.",
    "Enable daily scanning:": "Omogući dnevno skeniranje:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Umjesto povremenog skeniranja, možete odabrati da se skeniranje izvodi jednom dnevno. Vrijeme skeniranja upisuje se u odjeljku naprednih postavki u formatu hh: mm kao što je '18: 30 '. Nakon odabira opcije \"Skeniraj i konvertiraj\" program će čekati do zadanog vremena dok ne pokrene postupak skeniranja i pretvorbe. Ponavljam, to će se beskonačno skratiti dok se ne zaustavi.",
    "Show/hide advanced:": "Prikaži / sakrij napredne:",
    "Scan interval (minimum 5 seconds):": "Interval skeniranja (najmanje 5 sekundi):",
    "Daily run time (hh:mm):": "Dnevno vrijeme rada (hh: mm):",
    "Output filename suffix:": "Izlazni sufiks naziva datoteke:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Ovo je opcionalno. Možete odrediti sufiks za dodavanje na kraj naziva datoteke kao \"_1080p\" ili \"_testconversion\" itd.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Ako je odabrano 'standard preset' tada će sve izlazne datoteke imati isti sufiks.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Ako je odabrano 'custom preset', tada možete navesti jedan sufiks po izvornoj mapi / prilagođenom podešavanju. Provjerite je li svaki sufiks na svojoj liniji. Na primjer, ako imate 2 izvorne mape i upotrebljavate \"prilagođene postavke\", možete ih staviti u okvir za sufiks naziva datoteke:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Datoteke u prvoj izvornoj mapi imat će '_720p' u izlaznom nazivu datoteke. Datoteke u drugoj izvornoj mapi imat će \"_1080p\" u izlaznom nazivu datoteke itd.",
    "Include these file types:": "Uključi ove vrste datoteka:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Unesite vrste datoteka za skeniranje. Svaka vrsta mora biti odvojena zarezom. Zadani unos je:",
    "Exclude files smaller than (MB):": "Isključi datoteke manje od (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Odredite želite li iz pretvorbe izuzeti datoteke manje od određene veličine (u megabajtima)",
    "Exclude files larger than (MB):": "Isključi datoteke veće od (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Odredite želite li iz konverzije izuzeti datoteke veće od određene veličine (u megabajtima)",
    "Exclude filenames which include any of these words:": "Izuzmi nazive datoteka koji uključuju bilo koju od ovih riječi:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Unesite ključne riječi koje će se filtrirati prilikom skeniranja datoteka. Na primjer, ako je \"720p\" uneseno, tada sve datoteke s \"720p\" u naslovu neće biti konvertirane. I opet, ključne riječi moraju biti odvojene zarezom. Na primjer, u okvir filtra unesite sljedeće:",
    "Include files with any ": "Uključite datoteke s bilo kojim",
    " or all ": "ili sve",
    " of these": "od njih",
    "properties:": "svojstva:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Ovdje možete unijeti video i audio svojstva koje datoteke moraju imati da bi bile pretvorene (informacije izvučene pomoću FFprobe). Svojstva moraju biti odvojena zarezom. Pomoću alata za pregledavanje medijskih informacija odredite koja svojstva želite uključiti. Provjerite jeste li stavili zarez nakon zadnjeg svojstva. Na primjer, da biste konvertirali samo datoteke koje su kodirane pomoću h264 i aac stereo zvuka:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Važno je napomenuti da se ova provjera svojstava obavlja nakon što se proces pretvorbe pokrene (da bi se uštedjelo vrijeme pri izgradnji reda), tako da iako se datoteke mogu pojaviti u redu za pretvorbu, one će biti preskočene / uključene ako su ispunjeni ispravni uvjeti.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Ako FFprobe može izdvojiti svojstva, u stupcu \"FFprobe\" u prikazu reda pojavit će se 'OK'.",
    "Exclude files with any ": "Isključite datoteke s bilo kojim",
    " of these ": "od njih",
    "The opposite of 'Include files with any or all of these properties'": "Suprotno od \"Uključi datoteke s nekim ili svim tim svojstvima\"",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Ovo je mali alat za analiziranje svojstava datoteka kako bi vam pomogao odrediti koja svojstva želite uključiti / isključiti u gore navedene opcije. Koristi FFprobe za vraćanje informacija. Povucite i ispustite datoteke u sivi okvir da biste ih analizirali. Na primjer, ispuštanje u testnu datoteku može vratiti sljedeće:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Ako želite izuzeti datoteke kao što je ova iz konvertirane, tada možete staviti nekoliko svojstava datoteka u okvir \"Isključi datoteke s bilo kojim ili svim tim svojstvima\" i označite potvrdni okvir pored \"sve\" umjesto \"bilo koji\" ovako:",
    "Copy excluded files to destination:": "Kopiraj isključene datoteke na odredište:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Ako odaberete ovu opciju, datoteke koje su isključene iz pretvorbe bit će kopirane izravno u odredišnu mapu. To se odnosi na sljedeće filtre:",
    "Exclude filenames which include any of these words": "Isključite nazive datoteka koji sadrže bilo koju od ovih riječi",
    "Include files with any or all of these properties": "Uključite datoteke s bilo kojim ili svim tim svojstvima",
    "Exclude files with any or all of these properties": "Isključite datoteke s bilo kojim ili svim tim svojstvima",
    "Exclude files smaller than (MB)": "Isključi datoteke manje od (MB)",
    "Exclude files larger than (MB)": "Isključi datoteke veće od (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Napominjemo da se to odnosi i na datoteke koje su izuzete jer ne ispunjavaju uvjete \"Uključi\" gore navedenih, pa ne slučajno kopirajte cijelu biblioteku kada pokušavate pretvoriti samo nekoliko datoteka.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Značajka kopiranja ne odnosi se na sljedeće filtre (tj. Datoteke koje su isključene zbog filtra)",
    "Include these file types": "Uključite ove vrste datoteka",
    "Delete source files after conversion:": "Brisanje izvornih datoteka nakon pretvorbe:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Ako je to odabrano, ako je pokušaj pretvorbe uspješan, izvorna datoteka će biti izbrisana. Ovaj proces se obavlja na samom kraju, nakon pretvorbe svih datoteka. To znači da istu izvornu datoteku možete pretvoriti u više zadanih postavki, sve u jednom pokretu. Zatim će se izvorne datoteke izbrisati.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Zamijenite izvornu datoteku ako je pretvorena datoteka manja? (Pokušaj komprimiranja)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Označite ovaj potvrdni okvir ako želite da HBBatchBeast automatski zamijeni izvornu izvornu datoteku ako je nova datoteka manja. Ako nova datoteka nije manja, ostat će u odredišnoj mapi.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Provjerite nije li odredišna mapa ista kao izvorna mapa ili ne radi ispravno.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Nakon što je HBBatchBeast pokušao komprimirati određenu datoteku, ona će tu putanju dodati datoteku u predmemoriju, tako da u budućnosti neće biti ponovno pokušana. Možete pregledati / urediti / obrisati predmemoriju pomoću žutih gumba.",
    "Replace original file always?": "Uvijek zamijenite izvornu datoteku?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Izvorna datoteka bit će zamijenjena bez obzira je li nova datoteka veća ili manja.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Ponovno provjerite je li odredišna mapa ista kao / ili unutar izvorne mape ili neće raditi ispravno.",
    "Copy subtitle (srt) files to destination?": "Kopiranje datoteka srt (srt) na odredište?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Datoteke podnaslova '.srt' će se automatski kopirati u odredišnu mapu.",
    "Automatically create temporary/destination folders if they don't exist?": "Automatski stvorite privremene / odredišne mape ako ne postoje?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Korisnički staza šišmiša za pokretanje nakon svake konverzije (ostavite prazno ako ne koristite):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Unesite put do prilagođene datoteke skupne obrade koju želite izvršiti nakon svake pretvorbe. Na primjer:",
    "Batch files with timeout statements won't work. More info here:": "Batch datoteke s timeout izjavama neće raditi. Više informacija ovdje:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Ostavite okvir potpuno praznim ako ne želite koristiti tu opciju (provjerite da u okviru nema skrivenih znakova)",
    "Run processes at low priority?": "Pokrenuti procese s niskim prioritetom?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Svi procesi pretvorbe bit će pokrenuti s niskim prioritetom, smanjujući upotrebu procesora.",
    "Remove apostrophes from filenames:": "Ukloni apostrofe iz naziva datoteka:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Konverzije / skeniranje zdravstvenog pregleda možda neće uspjeti ako imena datoteka imaju apostrofe. Označite ovo da biste automatski uklonili apostrofe iz naziva datoteka.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Ova značajka može skenirati za korumpirane videodatoteke pomoću značajke \"--scan\" značajke HandBrake, iako to nije uvijek točno. Također koristi FFprobe kako bi osigurao drugu referentnu točku. Ako i FFprobe i HandBrake ne uspiju, postoji velika vjerojatnost da je datoteka oštećena.",
    "Move corrupt files into the following folder:": "Premjesti oštećene datoteke u sljedeću mapu:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Ako je označeno, sve datoteke koje daju pogreške premjestit će se u navedenu mapu.",
    "Corrupt file folder:": "Oštećena mapa datoteke:",
    "Run thorough file health check:": "Pokrenite detaljan pregled stanja datoteke:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Ako je označeno, tada će se mnogo sporije i temeljitije pregledavanje videozapisa izvoditi pomoću FFmpeg umjesto HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Na temelju Desanijeve \"ScanMedia.ps1\" pronađene na:",
    "Attempt to repair files after thorough check:": "Pokušajte popraviti datoteke nakon temeljite provjere:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Ako je označeno, HBBatchBeast će pokušati popraviti datoteke koristeći FFmpeg. Nova datoteka s sufiksom '_repaired' bit će izrađena u istoj mapi kao i izvorna datoteka.",
    "'CRF' value to use when attempting to repair files:": "Vrijednost \"CRF\" koju treba upotrijebiti prilikom pokušaja popravka datoteka:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Zadana vrijednost \"CRF\" je 23. Molimo pogledajte sljedeće za više informacija:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Raspon CRF ljestvice je 0-51, gdje je 0 bez gubitaka, 23 je zadana, a 51 je najgora moguća kvaliteta. Niža vrijednost općenito vodi višoj kvaliteti, a subjektivno zdravi raspon je 17-28. Razmotrite 17 ili 18 da budete bez gubitaka ili gotovo tako; trebala bi izgledati jednako ili gotovo isto kao i ulaz, ali tehnički nema gubitaka.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast sprema popis staza skeniranih datoteka koje su prijavljene kao nekorumpirane. Obrišite predmemoriju kako biste izvršili svježe skeniranje svih datoteka.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Broj istodobnih primjeraka HandBrake / FFmpeg (preporučeno 4 ili manje):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Ova se postavka primjenjuje na postupke \"Provjera zdravlja videozapisa\" i \"Skeniraj i konvertiraj\". Odredite koliko će se stranica koristiti za rad s ručnom blokadom. Nema maksimuma iako se preporuča da ne koristite više od 4. Veći iznos može zamrznuti vaše računalo ako nije jako moćno.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Ograničenje prikaza veličine reda? (Preporučeno 1000 ili manje):",
    "Automatically start \"Scan and convert\" when program opened?": "Automatski pokreni \"Skeniraj i konvertiraj\" kada se program otvori?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Ispunite pojedinosti e-pošte da biste primali obavijesti e-poštom ako dođe do pogreške tijekom pregleda ili pregleda konverzija / mapa. Neće raditi s računima koji zahtijevaju 2FA. Morate omogućiti pristup manje sigurnim aplikacijama na Gmail računima.",
    "Email address:": "Email adresa:",
    "For example:": "Na primjer:",
    "Email password(not saved):": "Lozinka e-pošte (nije spremljena):",
    "SMTP server:": "SMTP poslužitelj:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Ova značajka omogućuje praćenje stanja konverzije / zdravstvenog pregleda pomoću bilo kojeg web-preglednika. Korisno za pokretanje poslužitelja i sl.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Ako je omogućeno, sljedeći anonimni podaci bit će poslani na HBBatchBeast.io:",
    "API key": "API ključ",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Trenutni status (\"Pretraživanje\", \"Pokretanje\", \"Završeno\" itd.)",
    "Number of:": "Broj:",
    "Remaining items": "Preostale stavke",
    "Successful items": "Uspješne stavke",
    "Errored items": "Errored items",
    "Cancelled items": "Otkazane stavke",
    "Worker percentages": "Postotak radnika",
    "Last completed item time": "Vrijeme zadnje dovršene stavke",
    "Enable remote monitoring?:": "Omogući daljinski nadzor ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Osnovni uslužni program za benchmarking izgrađen je uglavnom kako bi se vidjelo kako 16+ jezgreni procesori rade pomoću višestrukih HandBrake instanci iako se mogu izvoditi na bilo kojoj vrsti procesora.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Ovo će preuzeti datoteku h265 4k (2.5MB) i pokrenuti benchmark pomoću 4 HandBrake instance s unaprijed postavljenom \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Rezultati se mogu prenijeti na hbbatchbeast.io ako odaberete.",
    "Queue": "Red",
    "Output this session": "Izvedite ovu sesiju",
    "Media info viewer tool": "Alat za pregledavanje informacija o medijima",
    "View compress attempt cache": "Pregled cache pokušaja komprimiranja",
    "Clear compress attempt cache": "Očisti predmemoriju pokušaja komprimiranja",
    "Save config": "Spremi konfiguraciju",
    "Scan only": "Samo skeniranje",
    "Scan and convert": "Skenirajte i pretvorite",
    "View scan/conversion summary log": "Pregled dnevnika skeniranja / konverzije",
    "View individual file check/conversion log": "Pogledajte pojedinačnu prijavu za provjeru / konverziju datoteka",
    "View worker console output": "Prikaz izlaza konzole za radnike",
    "Health check": "Provjera zdravlja",
    "Clear healthy file cache": "Očisti zdravu predmemoriju",
    "View error log": "Prikaz dnevnika pogrešaka",
    "Email test": "Test e-pošte",
    "View master log": "Prikaz glavnog dnevnika",
    "Wiki help": "Wiki pomoć",
    "An application by HaveAGitGat": "Aplikaciju HaveAGitGat",
    "New": "Novi",
    "Launch": "lansiranje",
    "Benchmark": "reper",
    "See results": "Pogledajte rezultate",
    "Pause queue": "Zaustavi red",
    "Continue queue": "Nastavite s redom",
    "Stop queue": "Zaustavi red",
    "Convert selected files": "Pretvori odabrane datoteke",
    "Toggle queue view": "Promijeni prikaz reda čekanja",
    "Deselect all": "Odznači sve",
    "Invert all": "Obrni sve",
    "Select all": "Odaberi sve",
    "Toggle output view": "Uključi / isključi prikaz prikaza"
}