{"The number of custom presets does not match the number of source folders!":"Nimewo a nan preregle koutim pa matche ak nimewo a nan dosye sous!","source folders have been detected.":"dosye sous te detekte.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"liy prereglaj koutim yo te detekte. Tanpri double tcheke pou repo liy envizib. Ta dwe gen yon chemen folder oswa prereglaj pou chak liy. Asire ou ke ou pa te aksidantèlman kreye yon liy vid.","The number of filename suffixes does not match the number of source folders! ":"Nimewo a nan SIFIX fichier pa matche ak kantite sous dosye!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"non dosye SIFIKS yo te detekte. Tanpri double tcheke pou repo liy envizib. Ta dwe gen yon chemen folder oswa fichier Sifiks pou chak liy. Asire ou ke ou pa te aksidantèlman kreye yon liy vid.","The number of source folders does not match the number of destination folders!":"Nimewo a nan sous dosye pa matche ak kantite dosye destinasyon!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"dosye destinasyon yo te detekte. Tanpri double tcheke pou repo liy envizib. Ta dwe gen yon chemen folder pou chak liy. Asire ou ke ou pa te aksidantèlman kreye yon liy vid.","The number of source folders does not match the number of temporary conversion folders!":"Nimewo a nan sous dosye pa matche ak kantite dosye tanporè konvèsyon!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"Dosye konvèsyon tanporè yo te detekte. Tanpri double tcheke pou repo liy envizib. Ta dwe gen yon chemen folder pou chak liy. Asire ou ke ou pa te aksidantèlman kreye yon liy vid.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Tanpri antre yon resipyan ki valab tankou '.mp4'. Asire ou ke ou mete '.'","Corrupt file folder":"Dosye dosye koripsyon an","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"pa egziste! Tanpri asire w ke pa gen okenn espas oswa karaktè kache anvan / apre chemen an","Source folder":"Katab Sous","Temporary conversion folder":"Katab konvèsyon tanporè","appears to be the same as or is within source folder":"parèt yo dwe menm jan ak oswa se nan kat sous","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ki pral anpeche HBBatchBeast nan fonksyone kòrèkteman. Tanpri chanje katab la konvèsyon tanporè nan yon katab deyò nan folder nan sous. Si w vle sèvi ak 'Ranplase prezante dosye orijinal yo', tanpri chwazi yon katab destinasyon ki pa menm jan ak, oswa nan, folder nan sous, ak Lè sa a, tcheke 'Ranplase dosye orijinal yo toujou' kare nan seksyon an anviwònman avanse. . Dezaktive tanporè 'Katye a konvèsyon Tanporè' kare kòm li pral sèvi pa gen okenn itilize nan ka sa a. Dosye yo pral konvèti nan katab la destinasyon ak Lè sa a, te deplase tounen nan katab la sous.","Destination folder":"Katab Destinasyon an","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ki pral anpeche HBBatchBeast nan fonksyone kòrèkteman. Tanpri chanje katab la destinasyon nan yon katab deyò nan folder nan sous. Si w vle sèvi ak 'Ranplase prezante dosye orijinal yo', tanpri chwazi yon katab destinasyon ki pa menm jan ak, oswa nan, folder nan sous, ak Lè sa a, tcheke 'Ranplase dosye orijinal yo toujou' kare nan seksyon an anviwònman avanse. . Dezaktive tanporè 'Katye a konvèsyon Tanporè' kare kòm li pral sèvi pa gen okenn itilize nan ka sa a. Dosye yo pral konvèti nan katab la destinasyon ak Lè sa a, te deplase tounen nan katab la sous.","Error creating temporary conversion folder":"Erè pou kreye katab konvèsyon tanporè","Error creating destination folder":"Erè pou kreye katab destinasyon an","Please select to use HandBrake or FFmpeg!":"Tanpri chwazi pou itilize HandBrake oswa FFmpeg!","Please select a standard preset or input a custom one!":"Tanpri chwazi yon prereglaj estanda oswa opinyon yon yon sèl koutim!","Please select a scan interval of 5 seconds or greater!":"Tanpri chwazi yon entèval eskanè nan 5 segonn oswa pi plis!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Tanpri asire w ke kantite ka similtane HandBrake / FFmpeg pou itilize se youn oswa plis!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Kle API valab! Tanpri klike sou 'New' sou tab la siveyans aleka jenere yon nouvo kle.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Tanpri antre yon tan eskanè chak jou nan fòma 24 èdtan: hh: mm (pou egzanp 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"SOURCE FILES pral retire LÈ KONVÈSYON! Tanpri teste anvan bon itilize!","Benchmark failed!":"Benchmark echwe!","Log does not exist!":"Log pa egziste!","Folder does not exist!":"Dosye pa egziste!","Error sending email! Please check your settings.":"Erè voye imèl! Tanpri tcheke anviwònman ou yo.","Test email sent!":"Tèt imèl voye!","All worker processes have been stopped.":"Tout pwosesis travayè yo te sispann.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Y ap mete yon poz yon poz yon poz yon sèl fwa yon fwa atik aktyèl te fini pwosesis. Èske ou sèten ou vle pran yon poz nan keu?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Keu pran yon poz ankò.'Continue 'bouton ap parèt yon fwa tout travayè yo te fè yon kanpe.","Healthy file cache cleared!":"Kachèt sante dosye netwaye!","Cache cleared!":"Cache netwaye!","Cancel item":"Anile atik la","Please check the above checkbox to use this feature.":"Tanpri tcheke kare ki anwo a pou itilize karakteristik sa a.","Configuration":"Nou konte genyen","Source folders":"Dosye Sous","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Sa a se katab la sous ki pral tcheke pou medya. Katab la bezwen antre nan ki pa gen okenn koupe fin. Pa egzanp:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Bwat postal chemen sous la agrandi (peze antre pou kreye yon nouvo liy). Si ou vle presize plizyè sous dosye, asire w ke chak katab sous dosye sou pwòp liy li yo tankou:","Video health check":"Chèk sante videyo","Batch conversion and Folder watching":"Pakèt konvèsyon ak Dosye ap gade","Remote Monitoring (Beta)":"Siveyans Remote (Beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"Sistèm","Help":"Ede","Temporary conversion folders":"Dosye konvèsyon tanporè","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Si \"Katab konvèsyon tanporè?\" se tcheke, Lè sa a, HandBrake pral konvèti dosye nan ki folder. Yon fwa yo fin konvèsyon an, dosye a ap deplase nan \"Katab Destinasyon an\" ou. Ou ap bezwen presize kòm anpil dosye tanporè konvèsyon kòm dosye sous. Katab premye sous ou a pral konvèti nan katab premye konvèsyon tanporè ou, katab dezyèm dosye ou nan katab dezyèm konvèsyon tanporè ou ... Asire w ke chak konvèsyon tanporè chemen folder se sou pwòp liy li yo.","Destination folders":"Dosye Destinasyon an","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Espesifye chemen folder destinasyon. Yon fwa ankò, ou pral bezwen presize kòm anpil destinasyon dosye kòm dosye sous. Dosye ki soti nan katab premye sous ou a pral fini nan katab premye destinasyon ou, dezyèm dosye folder dosye ou nan katab dezyèm destinasyon ou ...","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Premye katab sous ---------> Premye folder konvèsyon tanporè ---------> Premye katab destinasyon an","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Dosye dezyèm sous ---------> Dosye dezyèm konvèsyon tanporè ---------> Dezyèm katab destinasyon an","etc":"elatriye","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast pa pral travay byen si ou mete katab la destinasyon menm jan ak, oswa nan, katab la sous.","Standard preset:":"Creole prereglaj:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Chwazi prereglaj la fren ou ta renmen konvèti dosye ou a ak. Si \"Standard prereglaj\" se chwazi, Lè sa a, tout dosye nan dosye yo chwazi yo pral konvèti lè l sèvi avèk preskripsyon a HandBra espesifye. Ou ka jwenn plis enfòmasyon sou Prereglaj Brak isit la:","Custom preset:":"Custom prereglaj:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Si \"Custom Prereglaj\" Lè sa a, ou bezwen antre nan pwòp prereglaj koutim ou. HBBatchBeast kouvri \"HandBrakeCLI-i sous -o destinasyon an\" pati nan D 'a HandBrakeCLI konsa ou bezwen antre nan paramèt konvèsyon. Pa egzanp:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Si w ap itilize Fmpmpeg, ou bezwen separe opinyon an ak pwodiksyon paramèt ak yon vigil. Tankou:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Ou kapab tou lye ak yon prereglaj koutim sa a te ekspòte nan aplikasyon ofisyèl la HandBrake entèfas pou egzanp:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Si w ap gen pwoblèm ak preregle koutim, li ka akòz yon ensèk li te ye ak HandBrakeCLI a (yo pral fiks nan pwochen lage HandBrakeCLI). Tanpri gade sa a pou yon solisyon tanporè:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Chak prereglaj koutim bezwen yo dwe sou pwòp liy li yo ak, menm jan ak dosye yo, gen bezwen kòm anpil preregle koutim kòm dosye sous.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Premye katab sous---------> Premye folder konvèsyon tanporè ---------> Premye katab destinasyon @ Custom preset 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Dosye dezyèm sous ---------> Dosye dezyèm konvèsyon tanporè ---------> Dosye dezyèm destinasyon @ Custom preset 2","See the following image for guidance:":"Gade imaj sa a pou gidans:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Si w ap itilize kat grafik kodaj (tankou NVENC), lè sa a ou ka bezwen pou redwi kantite ka fray (eseye 2 ou mwens) akòz limit VRAM.","Select standard preset:":"Chwazi preset estanda:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC detekte, tanpri asire w ke ou bese kantite HandBrakeCLI ka yo nan 2 oswa pi ba (pou pifò kat grafik) oswa ou ka rankontre erè akòz pa ase VRAM. Anviwònman sa a ka jwenn nan \"Sistèm\" tab la.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Enpòte prereglaj detekte.Si w ap gen pwoblèm ak enpòte prereglaj koutim, li ka akòz yon ensèk li te ye ak HandBrakeCLI a (yo pral fiks nan pwochen lage HandBrakeCLI). Yon solisyon tanporè se yo retire '\"PictureRotate\": \"0: 0\"' soti nan dosye a .json. Plis enfòmasyon isit la:","Container:":"Veso:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Espesifye veso a ou ta renmen dosye a pwodiksyon gen tankou '.mp4'. Ou ka jwenn plis enfòmasyon sou resipyan nan:","Enable periodic scanning:":"Pèmèt optik peryodik:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast ka kontwole dosye sous ou ak kouri analiz pou dosye nouvo nan yon entèval ki espesifye. Tan an entèval se nan segonn ak default la yo te 300 segonn (5 minit). Si se opsyon sa a chwazi, Lè sa a, lè ou peze \"Fè enspeksyon ak konvèti\", pwogram lan pral konvèti nenpòt ki nouvo dosye ak Lè sa a, yon revèy dekont ap kòmanse. Sa a ap bouk enfiniman jiskaske sispann. Entèval nan eskanè se nan seksyon an anviwònman avanse.","Enable daily scanning:":"Pèmèt optik chak jou:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Olye pou yo optik peryodik, ou ka chwazi pou yon eskanè yo dwe kouri yon fwa chak jou. Se tan an eskanè antre nan seksyon an anviwònman avanse nan hh: fòma mm tankou '18: 30'. Yon fwa ke \"Fè enspeksyon ak konvèti\" te chwazi, pwogram lan ap rete tann jiskaske tan espesifye a jiskaske li kouri yon pwosesis eskanè ak konvèsyon. Ankò, sa a ap bouk enfiniman jiskaske sispann.","Show/hide advanced:":"Montre / kache avanse:","Scan interval (minimum 5 seconds):":"Entèval Scan (minimòm 5 segonn):","Daily run time (hh:mm):":"Chak jou kouri (hh: mm):","Output filename suffix:":"Siyati fichier sorti:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Sa a se si ou vle. Ou ka presize yon sifiks pou ajoute nan fen non ou tankou '_1080p' oswa '_testconversion' elatriye.","If 'standard preset' is selected then all output files will have the same suffix.":"Si se 'estanda prereglaj' chwazi Lè sa a, tout dosye pwodiksyon ap gen sifiks a menm.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Si 'prereglaj koutim' se chwazi Lè sa a, ou ka presize yon sèl sifiks pou chak dosye sous / prereglaj koutim. Asire w ke chak sifiks se sou liy pwòp li yo. Pou egzanp, si ou gen 2 sous dosye ak yo lè l sèvi avèk 'prereglaj koutim', ou ta ka mete sa a nan kaz bwat la sifiks:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Dosye nan katab premye sous la ap genyen '_720p' ajoute nan fichier fichier sorti. Dosye nan katab dezyèm dosye a ap genyen '_1080p' ajoute nan non fichier etc.","Include these file types:":"Mete sa yo kalite dosye:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"Antre nan kalite yo dosye eskanè pou. Chak kalite bezwen separe pa yon vigil. Antre nan default se:","Exclude files smaller than (MB):":"Eskli dosye ki pi piti pase (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Espesifye si wi ou non eskli dosye ki pi piti pase yon sèten gwosè nan konvèsyon (nan megabit)","Exclude files larger than (MB):":"Eskli dosye pi gwo pase (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Espesifye si wi ou non eskli dosye pi gwo pase yon sèten gwosè nan konvèsyon (nan megabit)","Exclude filenames which include any of these words:":"Eskli non ki gen ladan nenpòt nan mo sa yo:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Antre mo kle yo dwe filtre soti lè analysis pou dosye. Pou egzanp, si \"720p\" se antre nan, Lè sa a, nenpòt ki dosye ak \"720p\" nan tit la pa pral konvèti. Ankò, mo kle bezwen separe pa yon vigil. Pou egzanp, antre nan sa ki annapre yo nan bwat la filtre:","Include files with any ":"Mete dosye ak nenpòt ki"," or all ":"oswa tout"," of these":"nan sa yo","properties:":"pwopriyete:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Isit la ou ka D 'videyo ak pwopriyete odyo ke dosye yo dwe gen nan lòd yo dwe konvèti (info ekstrè lè l sèvi avèk FFprobe). Pwopriyete yo dwe separe pa yon vigil. Sèvi ak medya enfòmasyon visualiseur zouti pou ede detèmine ki pwopriyete ou ta renmen genyen ladan yo. Asire w ke ou mete yon vigil apre pwopriyete ki sot pase a. Pou egzanp, sèlman konvèti dosye ki kode lè l sèvi avèk h264 ak AAC stereo odyo:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Li nan vo anyen ke se sa a chèk pwopriyete fè yon fwa pwosesis la konvèsyon kòmanse (pou konsève pou tan pandan y ap bati keu la), se konsa malgre dosye ka parèt nan keu la konvèsyon yo, yo pral sote / enkli si kondisyon yo kòrèk yo te rankontre.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Si FFprobe se kapab ekstrè pwopriyete, Lè sa a, yon 'OK' ap parèt nan \"FFprobe\" kolòn nan nan gade nan keu.","Exclude files with any ":"Eskli dosye ak nenpòt ki"," of these ":"nan sa yo","The opposite of 'Include files with any or all of these properties'":"Opoze a nan 'Mete dosye ak nenpòt oswa tout pwopriyete sa yo'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Sa a se yon ti zouti yo analize pwopriyete dosye ak yo nan lòd yo ede w detèmine ki pwopriyete ou ta renmen genyen ladan yo / eskli nan opsyon ki anwo yo. Li itilize FFprobe yo retounen enfòmasyon. Trennen ak gout dosye nan bwat la gri analize yo. Pou egzanp, jete nan yon dosye tès ta ka retounen sa ki annapre yo:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Si w ap chèche eskli dosye tankou sa a soti nan ke yo te konvèti, Lè sa a, ou ka mete pwopriyete dosye plizyè nan \"Eskli dosye yo ak nenpòt oswa tout pwopriyete sa yo\" bwat ak tcheke toulède kaz la pwochen nan 'tout' olye pou yo 'nenpòt ki', konsa konsa:","Copy excluded files to destination:":"Kopi ekskli dosye nan destinasyon:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Si ou chwazi opsyon sa a, Lè sa a, dosye ki te eskli nan konvèsyon yo pral kopye dirèkteman nan katab la destinasyon. Sa aplike pou filtè sa yo:","Exclude filenames which include any of these words":"Eskli non ki gen ladan nenpòt nan mo sa yo","Include files with any or all of these properties":"Mete dosye ak nenpòt oswa tout pwopriyete sa yo","Exclude files with any or all of these properties":"Eskli dosye ak nenpòt oswa tout pwopriyete sa yo","Exclude files smaller than (MB)":"Eskli dosye ki pi piti pase (MB)","Exclude files larger than (MB)":"Eskli dosye pi gwo pase (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Remake byen sa a aplike tou nan dosye eskli paske yo pa satisfè kondisyon sa yo \"Mete\" pwopriyete nan pi wo a pou pa aksidantèlman kopye ou se tout bibliyotèk lè w ap sèlman eseye konvèti yon dosye kèk.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Karakteristik nan kopi pa aplike nan filtè sa yo (sètadi dosye eskli akòz filtè a)","Include these file types":"Mete sa yo kalite dosye","Delete source files after conversion:":"Efase dosye sous apre konvèsyon:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Si sa a se chwazi, Lè sa a, si yon tant konvèsyon gen siksè, yo pral dosye a sous dwe efase. Pwosesis sa a fèt nan fen anpil, apre konvèsyon nan tout dosye. Sa vle di ke ou ka konvèti dosye yo menm sous lè l sèvi avèk plizyè Prereglaj, tout nan yon sèl ale. Dosye sous yo pral Lè sa a, dwe efase apre sa.","Replace original file if converted file is smaller?(Compress attempt)":"Ranplase dosye orijinal la si dosye konvèti an pi piti?","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Chwazi sa a bwat chèk si ou ta renmen HBBatchBeast otomatikman ranplase dosye a sous orijinal si dosye a nouvo se pi piti. Si dosye a nouvo se pa pi piti, Lè sa a, li pral rete nan katab la destinasyon.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Asire w ke katab destinasyon ou an pa menm ak / oswa nan, katab sous ou a oswa li pa pral travay byen.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Yon fwa HBBatchBeast te eseye konpresyon yon dosye espesifik, li pral ajoute ke chemen dosye a yon kachèt pou ke li pa pral eseye fè ankò nan lavni. Ou ka wè / edite / klè kachèt la lè l sèvi avèk bouton yo jòn.","Replace original file always?":"Ranplase dosye orijinal la toujou?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Dosye orijinal la pral ranplase kèlkeswa si nouvo dosye a se pi gwo oswa pi piti.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Ankò, asire w ke katab destinasyon ou a pa menm ak / oswa nan, katab sous ou a oswa li pa pral travay byen.","Copy subtitle (srt) files to destination?":"Kopi dosye subtitles (srt) nan destinasyon?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Dosye .srt 'Subtitles yo pral kopye nan katab destinasyon la otomatikman.","Automatically create temporary/destination folders if they don't exist?":"Otomatikman kreye dosye tanporè / destinasyon si yo pa egziste?","Custom bat path to run after each conversion (leave blank if not using):":"Chemen baton Custom pou kouri apre chak konvèsyon (kite vid si ou pa itilize):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Antre chemen an nan yon dosye pakèt koutim ki ou ta renmen egzekite apre chak konvèsyon. Pa egzanp:","Batch files with timeout statements won't work. More info here:":"Dosye pakèt ak deklarasyon enèji pa pral travay. Plis enfòmasyon isit la:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Kite bwat konplètman vid si ou pa ta vle itilize opsyon sa a (asire w ke pa gen okenn karaktè kache nan bwat la)","Run processes at low priority?":"Kouri pwosesis nan priyorite ba?","All conversion processes will be run at low priority, reducing processor usage.":"Tout pwosesis konvèsyon yo pral kouri nan priyorite ki ba, diminye l 'processeur.","Remove apostrophes from filenames:":"Retire apostrof yo de non fichier:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Konvèsyon / chèk sante chèk ka echwe si non gen apostrof nan pous Tcheke sa a otomatikman retire apostrof yo soti nan non."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Karakteristik sa a ka analysis pou dosye videyo koripsyon lè l sèvi avèk '- Scan' karakteristik HandBrake, byenke sa a se pa toujou egzat. Li itilize tou FFprobe pou bay yon dezyèm pwen referans. Si tou de FFprobe ak HandBrake fail Lè sa a, gen yon gwo chans ke dosye a se koripsyon.","Move corrupt files into the following folder:":"Deplase dosye koripsyon nan katab sa a:"," If checked, then any files which give errors will be moved into the specified folder.":"Si tcheke, Lè sa a, nenpòt ki dosye ki bay erè yo pral deplase nan katab la espesifye.","Corrupt file folder:":"Katab dosye koripsyon:","Run thorough file health check:":"Kouri bonjan dosye chèk sante:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Si tcheke, Lè sa a, yon pi dousman, plis bon jan chèk sante videyo yo pral kouri lè l sèvi avèk FFmpeg olye pou yo fren."," Based on Desani's 'ScanMedia.ps1' found at:":"Baze sou 'ScanMedia.ps1' Desani yo te jwenn nan:","Attempt to repair files after thorough check:":"Eseye pou repare dosye yo apre yo fin tcheke konplètman:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Si tcheke, HBBatchBeast pral eseye repare dosye lè l sèvi avèk FFmpeg. Y ap kreye yon nouvo dosye ak sifiksis la '_repaired' nan menm katab kòm dosye sous la.","'CRF' value to use when attempting to repair files:":"Valè 'CRF' yo itilize lè eseye repare dosye:","The default 'CRF' value is 23. Please see the following for more information:":"Valè a default 'CRF' se 23. Tanpri gade sa ki annapre yo pou plis enfòmasyon:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Ranje a nan echèl la CRF se 0-51, kote 0 se pèdi san, 23 se default la, ak 51 ki pi move kalite posib. Yon valè pi ba jeneralman mennen nan pi wo bon jan kalite, ak yon seri seri seri se 17-28. Konsidere 17 oswa 18 yo dwe visless lossless oswa prèske konsa; li ta dwe gade menm bagay la tou oswa prèske menm jan ak opinyon an, men li se pa teknikman san pèdi tan.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast sove yon lis chemen dosye eskane rapòte kòm san koule. Klè kachèt la fè yon eskanè fre sou tout dosye yo.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Nimewo nan ka similtane / FBmpeg fwa yo sèvi ak? (Rekòmande 4 oswa mwens):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Anviwònman sa a aplike nan tou de \"Videyo sante chèk la\" ak \"Fè enspeksyon ak konvèti\" pwosesis. Espesifye konbyen fil HandBrake pou itilize. Pa gen okenn maksimòm byen ke li rekòmande pou pa sèvi ak plis pase 4. Yon kantite lajan ki pi wo pouvwa friz òdinatè w lan si li pa trè pwisan.","Queue size view limit?(Recommended 1000 or fewer):":"Limit gwosè View keu? (Rekòmande 1000 oswa mwens):","Automatically start \"Scan and convert\" when program opened?":"Otomatikman kòmanse \"Fè enspeksyon ak konvèti\" lè pwogram louvri?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Ranpli nan detay imel yo resevwa notifikasyon imel si se yon erè rankontre pandan yon chèk sante oswa konvèsyon / kat gade. Pa pral travay ak kont ki mande pou 2FA. Ou bezwen pèmèt aksè nan apps mwens sekirite sou kont Gmail.","Email address:":"Adrès imèl:","For example:":"Pa egzanp:","Email password(not saved):":"Modpas imèl (pa sove):","SMTP server:":"Sèvè SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"Karakteristik sa a pèmèt kontwole estati chèk konvèti / sante lè l sèvi avèk nenpòt ki navigatè entènèt. Itil lè wap kouri serveurs elatriye","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Si pèmèt, done sa yo anonim yo pral voye nan HBBatchBeast.io:","API key":"Kle API","Current status ('Searching', 'Running', 'Finished' etc)":"Estati aktyèl ('rechèch', 'Kouri', 'fini' elatriye)","Number of:":"Nimewo nan:","Remaining items":"Bagay ki rete yo","Successful items":"Atik siksè","Errored items":"Atik erè","Cancelled items":"Anile atik yo","Worker percentages":"Pousantaj Travayè","Last completed item time":"Dènye fwa atik konplete","Enable remote monitoring?:":"Pèmèt siveyans adistans ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Yon sèvis piblik benchmarking debaz bati sitou yo wè ki jan 16+ processeurs debaz fè lè l sèvi avèk plizyè ka HandBrake byenke li ka kouri sou nenpòt ki kalite processeur.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Sa a pral telechaje yon dosye echantiyon h265 4k (2.5MB) epi kouri nan yon referans lè l sèvi avèk 4 ka HandBrake ak prereglaj \"trè vit 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Rezilta yo ka Uploaded hbbatchbeast.io si ou chwazi pou ou.","Queue":"Keu","Output this session":"Sòti sesyon sa a","Media info viewer tool":"Zouti visualiseur medya","View compress attempt cache":"View konpresyon tantativ kachèt","Clear compress attempt cache":"Klè konpresyon tantativ kachèt","Save config":"Sove konfigirasyon","Scan only":"Fè enspeksyon sèlman","Scan and convert":"Fè enspeksyon ak konvèti","View scan/conversion summary log":"View eskane / konvèsyon rezime boutèy demi lit.","View individual file check/conversion log":"Gade dosye endividyèl dosye chèk / konvèsyon","View worker console output":"View travayè konsole pwodiksyon an","Health check":"Chèk sante","Clear healthy file cache":"Klè kach sante dosye yo","View error log":"View erè log","Email test":"Tès imèl","View master log":"View mèt boutèy demi lit.","Wiki help":"Ede Wiki","An application by HaveAGitGat":"Yon aplikasyon pa HaveAGitGat","New":"Nouvo","Launch":"Lanse","Benchmark":"Benchmark","See results":"Gade rezilta yo","Pause queue":"Pote keu","Continue queue":"Kontinye keu","Stop queue":"One Stop keu","Convert selected files":"Konvèti dosye chwazi yo","Toggle queue view":"Baskil wè pwent","Deselect all":"Déselection tout","Invert all":"Invert all","Select all":"Seleksyone tout","Toggle output view":"Baskile pwodiksyon an"}