{"The number of custom presets does not match the number of source folders!":"Az egyéni presetek száma nem egyezik a forrásmappák számával!","source folders have been detected.":"forráskatalógusokat észleltek.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"egyéni előre beállított sorokat észleltek. Kérjük, ellenőrizze a láthatatlan sorszakadásokat. Soronként egy mappa elérési útra vagy előre beállított értékre van szükség. Győződjön meg róla, hogy véletlenül nem hozott létre üres sort.","The number of filename suffixes does not match the number of source folders! ":"A fájlnév utótagok száma nem egyezik meg a forrásmappák számával!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"a fájlnév utótagvonalakat észlelték. Kérjük, ellenőrizze a láthatatlan sorszakadásokat. Soronként egy mappaútvonal vagy fájlnév utótag kell lennie. Győződjön meg róla, hogy véletlenül nem hozott létre üres sort.","The number of source folders does not match the number of destination folders!":"A forrásmappák száma nem egyezik meg a célmappák számával!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"észlelték a célmappa mappákat. Kérjük, ellenőrizze a láthatatlan sorszakadásokat. Soronként egy mappaútvonalnak kell lennie. Győződjön meg róla, hogy véletlenül nem hozott létre üres sort.","The number of source folders does not match the number of temporary conversion folders!":"A forrásmappák száma nem egyezik meg az ideiglenes konverziós mappák számával!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"ideiglenes konverziós mappákat észleltek. Kérjük, ellenőrizze a láthatatlan sorszakadásokat. Soronként egy mappaútvonalnak kell lennie. Győződjön meg róla, hogy véletlenül nem hozott létre üres sort.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Kérjük, adjon meg egy érvényes tartályt, például \".mp4\". Győződjön meg róla, hogy a \".\"","Corrupt file folder":"Hibás fájl mappa","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"nem létezik! Kérjük, győződjön meg róla, hogy az útvonal előtt / után nincsenek szóközt vagy rejtett karakterek","Source folder":"Forrás mappa","Temporary conversion folder":"Ideiglenes konverziós mappa","appears to be the same as or is within source folder":"úgy tűnik, hogy ugyanaz, mint a forráskatalógusban","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"amely megakadályozza a HBBatchBeast működését. Kérjük, módosítsa az ideiglenes konverziós mappát a forrásmappán kívüli mappába. Ha szeretné használni az \"Eredeti fájlok cseréje\" funkciót, válassza ki a célmappát, amely nem ugyanaz, mint a forrásmappában, vagy belül, és jelölje be az \"Eredeti fájlok cseréje mindig\" jelölőnégyzetet a speciális beállítások részben. . Törölje a jelölést az ideiglenes „Ideiglenes konverziós mappa” jelölőnégyzetből, mivel ebben az esetben nem használható. A fájlokat a célmappává konvertáljuk, majd visszaállítjuk a forrásmappába.","Destination folder":"Cél mappa","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"amely megakadályozza a HBBatchBeast működését. Kérjük, módosítsa a célmappát a forrásmappán kívüli mappába. Ha szeretné használni az \"Eredeti fájlok cseréje\" funkciót, válassza ki a célmappát, amely nem ugyanaz, mint a forrásmappában, vagy belül, és jelölje be az \"Eredeti fájlok cseréje mindig\" jelölőnégyzetet a speciális beállítások részben. . Törölje a jelölést az ideiglenes „Ideiglenes konverziós mappa” jelölőnégyzetből, mivel ebben az esetben nem használható. A fájlokat a célmappává konvertáljuk, majd visszaállítjuk a forrásmappába.","Error creating temporary conversion folder":"Hiba történt az ideiglenes konverziós mappa létrehozásakor","Error creating destination folder":"Hiba a célmappa létrehozásakor","Please select to use HandBrake or FFmpeg!":"Kérjük, válassza ki a HandBrake vagy az FFmpeg használatát!","Please select a standard preset or input a custom one!":"Kérjük, válasszon ki egy szabványos beállítást vagy adjon meg egy egyéni beállítást!","Please select a scan interval of 5 seconds or greater!":"Kérjük, válasszon egy 5 másodperces vagy annál hosszabb szkennelési intervallumot!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Kérjük, győződjön meg róla, hogy az egyidejűleg használt HandBrake / FFmpeg példányok száma egy vagy több!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Érvénytelen API kulcs! Új kulcs létrehozásához kattintson a távfelügyeleti lapon az \"Új\" gombra.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Kérjük, adja meg a napi beolvasási időt 24 órás formátumban: hh: mm (például 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"A FORGALMAZÁSI FOLYAMATOK KÖVETKEZŐ TÖRLÉSE! Kérjük, tesztelje a megfelelő használat előtt!","Benchmark failed!":"A benchmark sikertelen!","Log does not exist!":"A napló nem létezik!","Folder does not exist!":"A mappa nem létezik!","Error sending email! Please check your settings.":"Hiba az e-mail küldése során! Kérjük, ellenőrizze a beállításokat.","Test email sent!":"Teszt e-mail elküldve!","All worker processes have been stopped.":"Minden munkavállalói folyamat leállt.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"A sorok szünetelnek, ha az aktuális elemek befejeződtek. Biztosan szünetelteti a várólistát?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"A várakozási sor szüneteltetése megtörtént. A \"Folyamatos\" gomb akkor jelenik meg, ha az összes munkatárs szünetelteti.","Healthy file cache cleared!":"Az egészséges fájl gyorsítótár törölve!","Cache cleared!":"Gyorsítótár törölve!","Cancel item":"Elem törlése","Please check the above checkbox to use this feature.":"A funkció használatához jelölje be a fenti jelölőnégyzetet.","Configuration":"Configuration","Source folders":"Forrás mappák","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Ez az a forrásmappa, amelyet a médiára szkennel. A mappát be kell írni, anélkül, hogy az elejére kerülne. Például:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"A forrás mappa elérési útja bővíthető (új sor létrehozásához nyomja meg az Enter billentyűt). Ha több forrásmappát szeretne megadni, győződjön meg róla, hogy az egyes forrásmappák elérési útja a saját sorában van, például:","Video health check":"Videó-egészségügyi ellenőrzés","Batch conversion and Folder watching":"Batch átalakítás és a mappa nézése","Remote Monitoring (Beta)":"Távfelügyelet (Béta)","Benchmark (Beta)":"Benchmark (Beta)","System":"Rendszer","Help":"Segítség","Temporary conversion folders":"Ideiglenes konverziós mappák","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Ha \"Ideiglenes konverziós mappa?\" be van jelölve, majd a HandBrake fájlokat konvertálja a mappába. Miután a konverzió befejeződött, a fájl átkerül a \"Célmappába\". Meg kell adnia annyi ideiglenes konverziós mappát, mint a forrásmappák. Az első forrásmappát az első átmeneti konverziós mappává alakítja át, a második forrásmappát a második ideiglenes konverziós mappába és így tovább. Győződjön meg róla, hogy minden ideiglenes konverziós mappa elérési útja a saját sorában van.","Destination folders":"Célmappa","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Adja meg a célmappa útvonalát. Ismét meg kell adnia annyi célmappát, mint a forrásmappák. Az első forrásmappából érkező fájlok az első célmappába kerülnek, a második forrásfájlja a második célmappába és így tovább.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Első forráskatalógus ---------> Első ideiglenes konverziós mappa ---------> Első célmappát","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Második forráskatalógus ---------> Második ideiglenes konverziós mappa ---------> Második célmappát","etc":"stb.","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"A HBBatchBeast nem fog megfelelően működni, ha a célmappát ugyanúgy állítja be, mint a forrásmappát.","Standard preset:":"Alapbeállítás:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Válassza ki a HandBrake preset-et, amelyet a fájlokkal konvertálni szeretne. Ha a \"Standard preset\" van kiválasztva, akkor a kiválasztott mappákban lévő összes fájl a megadott HandBrake előbeállítással kerül átalakításra. További információ a HandBrake presets-ről itt található:","Custom preset:":"Egyéni beállítás:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Ha az \"Egyéni előbeállítás\", akkor meg kell adnia saját egyéni beállításait. A HBBatchBeast lefedi a HandBrakeCLI bemenet „HandBrakeCLI -i forrás-célhely” részét, így be kell írnia a konverziós paramétereket. Például:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"FFmpeg használata esetén a bemeneti és kimeneti paramétereket vesszővel kell elválasztani. Mint például:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Például a hivatalos HandBrake GUI alkalmazásból exportált egyéni előre beállított beállításra is hivatkozhat:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Ha problémái vannak az egyéni beállításokkal, akkor ez a HandBrakeCLI által ismert hiba miatt lehet (a következő HandBrakeCLI kiadásban lesz rögzítve). Kérjük, nézze meg ezt az ideiglenes megoldást:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Minden egyéni beállításnak saját sorban kell lennie, és a mappákhoz hasonlóan ugyanolyan számú egyéni beállításnak kell lennie, mint a forrásmappák.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Első forráskatalógus ---------> Első ideiglenes konverziós mappa ---------> Első célmappák @ Egyéni előbeállítás 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Második forráskatalógus ---------> Második ideiglenes konverziós mappa ---------> Második célmappát @ Egyéni preset 2","See the following image for guidance:":"Tekintse meg az alábbi képet útmutatásként:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Ha grafikus kártya kódolást használ (mint például az NVENC), akkor lehet, hogy csökkentenie kell a HandBrake példányok számát (próbálja meg 2 vagy kevesebbet) a VRAM korlátozások miatt.","Select standard preset:":"Válasszon szabványos beállítást:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Az NVENC észlelt, kérjük, győződjön meg róla, hogy a HandBrakeCLI példányok számát 2-re vagy annál alacsonyabbra csökkenti (a legtöbb grafikus kártya esetében), vagy hibákat okozhat a nem megfelelő VRAM miatt. Ez a beállítás megtalálható a \"Rendszer\" fülön.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Az importált előre beállított beállítás.Ha problémái vannak az importált egyéni beállításokkal, akkor lehet, hogy ez egy ismert hiba a HandBrakeCLI-vel (a következő HandBrakeCLI kiadásban lesz rögzítve). Az ideiglenes megoldás a \"PictureRotate\" eltávolítása: \"0: 0\" \"a .json fájlból. További információ itt:","Container:":"Tartály:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Adja meg azt a tartályt, amelyet a kimeneti fájlnak szeretne, például \".mp4\". A konténerekről további információ:","Enable periodic scanning:":"Az időszakos szkennelés engedélyezése:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"A HBBatchBeast nyomon követheti a források mappáit és futtathat új fájlokat a megadott időközönként. Az időintervallum másodpercben van, az alapértelmezett érték 300 másodperc (5 perc). Ha ezt az opciót választja, akkor a \"Szkennelés és konvertálás\" megnyomásakor a program új fájlokat konvertál, majd elindul a visszaszámlálás. Ez végtelenül véget ér, amíg meg nem áll. A beolvasási intervallum a speciális beállítások részben található.","Enable daily scanning:":"Napi szkennelés engedélyezése:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"A rendszeres szkennelés helyett választhat, hogy a beolvasást naponta egyszer kell futtatni. A beolvasási időt a speciális beállítások részben hh: mm formátumban, például '18: 30 'formátumban adjuk meg. A \"Szkennelés és konvertálás\" kiválasztása után a program a megadott időre vár, amíg egy szkennelési és konverziós folyamatot futtat. Ismét ez végtelenül véget ér, amíg meg nem áll.","Show/hide advanced:":"Megjelenítés / elrejtés:","Scan interval (minimum 5 seconds):":"Szkennelési intervallum (legalább 5 másodperc):","Daily run time (hh:mm):":"Napi futási idő (hh: mm):","Output filename suffix:":"Kimeneti fájlnév utótag:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Ez nem kötelező. Megadhat egy utótagot a fájlnév végéhez: '_1080p' vagy '_testconversion' stb.","If 'standard preset' is selected then all output files will have the same suffix.":"Ha a 'standard preset' opciót választja, akkor az összes kimeneti fájl ugyanaz lesz.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Ha az 'egyéni előbeállítás' van kiválasztva, akkor a forráskatalógusonként / egyéni előbeállításonként megadhat egy utótagot. Győződjön meg róla, hogy minden utótag saját sorában van. Ha például 2 forrásmappát használ, és az 'egyéni beállításokat' használja, akkor ezt a fájlnév utótag mezőbe helyezheti:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Az első forrásmappában lévő fájlok '_720p' hozzáadódnak a kimeneti fájlnévhez. A második forrásmappában lévő fájlok '_1080p' hozzáadódnak a kimeneti fájlnévhez stb.","Include these file containers:":"Tartalmazza ezeket a fájltartályokat:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Adja meg a keresendő fájltartályokat. Minden típust vesszővel kell elválasztani. Az alapértelmezett bejegyzés:","Exclude files smaller than (MB):":"A (MB) -nál kisebb fájlokat kizárja:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Adja meg, hogy kizárja-e a konverzióból bizonyos méretnél kisebb fájlokat (megabájtban)","Exclude files larger than (MB):":"A (MB) -nál nagyobb fájlokat kizárni:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Adja meg, hogy kizárja-e a konverzióból bizonyos méretnél nagyobb fájlokat (megabájtban)","Exclude filenames which include any of these words:":"Kizárja a fájlneveket, amelyek az alábbi szavakat tartalmazzák:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Adja meg a szűrni kívánt kulcsszavakat a fájlok beolvasásakor. Például, ha a \"720p\" be van írva, akkor a címben található \"720p\" fájlokat nem konvertáljuk. A kulcsszavakat ismét vesszővel kell elválasztani. Adja meg például a következőket a szűrőmezőbe:","Include files with any ":"Fájlok beszúrása bármelyikbe"," or all ":"vagy minden"," of these":"Ezeknek a","properties:":"tulajdonságok:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Itt olyan video- és hangtulajdonságokat adhat meg, amelyeket a fájloknak át kell alakítaniuk ahhoz, hogy az átalakításra kerüljön (az FFprobe-vel kivont információ). A tulajdonságokat vesszővel kell elválasztani. A médiainformációs megjelenítő eszköz segítségével meghatározhatja, hogy mely tulajdonságokat szeretné használni. Győződjön meg róla, hogy vessen egy vesszőt az utolsó tulajdonság után. Például a h264 és aac sztereó hangokkal kódolt fájlok konvertálásához:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Érdemes megjegyezni, hogy ez a tulajdonságellenőrzés a konverziós folyamat megkezdése után történik (az idő megtakarítása a várakozási sor építése során), így bár a konverziós sorban a fájlok megjelenhetnek, akkor a megfelelő feltételek teljesülése esetén kihagyják őket.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Ha az FFprobe képes kivonni a tulajdonságokat, akkor az \"OK\" jelenik meg a \"FFprobe\" oszlopban a sor nézetben.","Exclude files with any ":"A fájlok kizárása"," of these ":"Ezeknek a","The opposite of 'Include files with any or all of these properties'":"A \"Fájlok beillesztése az összes tulajdonsággal vagy az összes tulajdonsággal\" ellenkezője","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Ez egy kis eszköz a fájlok tulajdonságainak elemzésére annak érdekében, hogy meghatározza, hogy mely tulajdonságokat szeretné a fenti opciókban kizárni. FFprobe-t használ az információk visszajuttatásához. A fájlok elemzéséhez húzza át a fájlokat a szürke dobozba. Például a tesztfájlba való lemorzsolódás visszaadhatja a következőket:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Ha az ilyen fájlokat nem kívánja konvertálni, akkor több fájltulajdonságot is beilleszthet a \"Fájlok kizárása az összes tulajdonsággal vagy az összes tulajdonsággal\" mezőbe, és jelölje be a \"minden\" melletti jelölőnégyzetet a \"minden\" helyett. így tetszik:","Copy excluded files to destination:":"A kizárt fájlok másolása a célhelyre:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Ha ezt az opciót választja, akkor a konverzióból kizárt fájlok közvetlenül a célmappába kerülnek. Ez a következő szűrőkre vonatkozik:","Exclude filenames which include any of these words":"Kizárja azokat a fájlneveket, amelyek tartalmazzák az ilyen szavakat","Include files with any or all of these properties":"Tartalmazzon fájlokat bármelyik vagy mindegyik tulajdonsággal","Exclude files with any or all of these properties":"Kizárja azokat a fájlokat, amelyek mindegyikét vagy mindegyikét tartalmazzák","Exclude files smaller than (MB)":"A (MB) -nál kisebb fájlokat kizárni","Exclude files larger than (MB)":"A (MB) -nál nagyobb fájlokat kizárni","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Ne feledje, hogy ez vonatkozik a kizárt fájlokra is, mert nem felelnek meg a fentiekhez tartozó \"Tartalmazza\" tulajdonságfeltételeknek, így nem véletlenül másolsz egész könyvtárat, ha csak néhány fájlt akarsz konvertálni.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"A másolási funkció nem vonatkozik az alábbi szűrőkre (azaz a szűrő miatt kizárt fájlok)","Include these file types":"Tartalmazza ezeket a fájltípusokat","Delete source files after conversion:":"Forrásfájlok törlése az átalakítás után:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Ha ezt választja, akkor ha egy konverziós kísérlet sikeres, a forrásfájl törlődik. Ez a folyamat az összes fájl átalakítása után történik. Ez azt jelenti, hogy ugyanazt a forrásfájlt több előre beállított értékkel is konvertálhatja, mindegyik egy lépésben. A forrásfájlok ezután törlésre kerülnek.","Replace original file if converted file is smaller?(Compress attempt)":"Cserélje ki az eredeti fájlt, ha az átalakított fájl kisebb?","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Jelölje be ezt a jelölőnégyzetet, ha azt szeretné, hogy a HBBatchBeast automatikusan kicserélje az eredeti fájlfájlt, ha az új fájl kisebb. Ha az új fájl nem kisebb, akkor a célmappában marad.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Győződjön meg róla, hogy a célmappája nem ugyanaz, mint a / vagy a forrás mappában, vagy nem működik megfelelően.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Miután a HBBatchBeast megpróbálta tömöríteni egy adott fájlt, hozzáadja a fájl elérési útját egy gyorsítótárhoz, hogy a jövőben ne kísérelje meg újra. A gyorsítótárat a sárga gombok segítségével megtekintheti / szerkesztheti / törölheti.","Replace original file always?":"Cserélje ki mindig az eredeti fájlt?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Az eredeti fájl ki lesz cserélve, függetlenül attól, hogy az új fájl nagyobb vagy kisebb.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Ismét győződjön meg róla, hogy a célmappája nem ugyanaz, mint a / vagy a forrás mappában, vagy nem működik megfelelően.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Ha a HBBatchBeast egy adott fájlt átkódolt, akkor hozzáadja a fájl elérési útját egy gyorsítótárhoz, hogy a jövőben ne kísérelje meg újra. A gyorsítótárat a sárga gombok segítségével megtekintheti / szerkesztheti / törölheti.","Copy subtitle (srt) files to destination?":"Másolja a felirat (srt) fájlokat a rendeltetési helyre?","Subtitle '.srt' files will be copied to the destination folder automatically.":"A „.srt” feliratfájlok automatikusan a célmappába kerülnek.","Automatically create temporary/destination folders if they don't exist?":"Automatikusan hozzon létre ideiglenes / cél mappákat, ha nem léteznek?","Custom bat path to run after each conversion (leave blank if not using):":"Az egyes konverziók után futó egyéni ütemútvonal (üresen hagyja, ha nem használja):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Adja meg az egyéni kötegfájl elérési útját, amelyet minden konverzió után végre szeretne hajtani. Például:","Batch files with timeout statements won't work. More info here:":"Az időtúllépési utasításokkal rendelkező kötegfájlok nem működnek. További információ itt:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Ha nem kívánja használni ezt a lehetőséget, hagyja teljesen üresen a mezőt (győződjön meg róla, hogy nincsenek rejtett karakterek a dobozban)","Run processes at low priority?":"Folyamatok futtatása alacsony prioritású?","All conversion processes will be run at low priority, reducing processor usage.":"Minden konverziós folyamat alacsony prioritású, a processzor használatának csökkentése.","Remove apostrophes from filenames:":"Távolítsa el az aposztrófokat a fájlnevekből:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"A konverziók / állapotfelmérés ellenőrzése sikertelen lehet, ha a fájlnevek apostrófokkal vannak ellátva. Ellenőrizze, hogy a fájlnevekből automatikusan eltávolítja az apostrofokat."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Ez a funkció sérült videofájlokat kereshet a HandBrake '--scan' funkciójával, bár ez nem mindig pontos. FFprobe-t használ a második referenciapont biztosításához. Ha az FFprobe és a HandBrake sikertelen, akkor nagy a valószínűsége, hogy a fájl sérült.","Move corrupt files into the following folder:":"A sérült fájlok áthelyezése a következő mappába:"," If checked, then any files which give errors will be moved into the specified folder.":"Ha be van jelölve, akkor a fájlokat, amelyek hibákat adnak, áthelyezik a megadott mappába.","Corrupt file folder:":"Hibás fájlmappa:","Run thorough file health check:":"Alapos fájlellenőrzés futtatása:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Ha be van jelölve, akkor sokkal lassabb, alaposabb videó-egészségügyi ellenőrzés kerül végrehajtásra az FFmpeg használatával a HandBrake helyett."," Based on Desani's 'ScanMedia.ps1' found at:":"Desani „ScanMedia.ps1” alapján található:","Attempt to repair files after thorough check:":"Megpróbál javítani a fájlokat alapos ellenőrzés után:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Ha be van jelölve, a HBBatchBeast megpróbálja megjavítani az FFmpeg fájlokat. A '_repaired' utótaggal rendelkező új fájl ugyanabban a mappában jön létre, mint a forrásfájl.","'CRF' value to use when attempting to repair files:":"\"CRF\" érték, amelyet a fájlok javításakor használhat:","The default 'CRF' value is 23. Please see the following for more information:":"Az alapértelmezett \"CRF\" érték 23. További információkért lásd:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"A CRF skála tartománya 0–51, ahol a 0 veszteségmentes, 23 az alapértelmezett és 51 a legrosszabb minőség. Az alacsonyabb érték általában magasabb minőséget eredményez, és a szubjektív szándékos tartomány 17–28. Gondoljunk úgy, hogy a 17 vagy a 18 vizuálisan veszteségmentes, vagy csaknem annyira; ugyanaznak kell lennie, vagy közel azonosnak kell lennie a bemenettel, de technikailag veszteségmentes.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"A HBBatchBeast elmenti a szkennelt fájlútvonalak listáját, amelyeket nem korrigáltak. Törölje a gyorsítótárat az összes fájl friss vizsgálatához.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Egyidejűleg használt HandBrake / FFmpeg példányok száma (ajánlott 4 vagy kevesebb):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Ez a beállítás egyaránt vonatkozik a \"Video-egészségellenőrzés\" és a \"Szkennelés és konvertálás\" folyamatokra. Adja meg, hogy hány HandBrake szálat használjon. Nincs maximum, bár ajánlott, hogy ne használjon 4-nél többet. A nagyobb összeg befagyaszthatja a számítógépet, ha nem túl erős.","Queue size view limit?(Recommended 1000 or fewer):":"Queue size view limit (ajánlott 1000 vagy kevesebb):","Automatically start \"Scan and convert\" when program opened?:":"Automatikusan elindítja a \"Szkennelés és konvertálás\" funkciót a program megnyitásakor ?:","Save verbose logs?:":"Helyes naplók mentése ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Jelölje be ezt a jelölőnégyzetet a részletes alfolyamatnaplók mentéséhez. Ez magában foglalja a munkavállalók konzolját is. Ez nagyon nagy naplókhoz vezet.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Töltse ki az e-mail adatait, ha e-mail értesítéseket szeretne kapni, ha egy egészségügyi ellenőrzés vagy konverzió / mappa nézése során hiba történt. Nem fog működni olyan fiókokkal, amelyek 2FA-t igényelnek. Engedélyeznie kell a hozzáférést a kevésbé biztonságos alkalmazásokhoz a Gmail-fiókokban.","Email address:":"Email cím:","For example:":"Például:","Email password(not saved):":"E-mail jelszó (nem mentve):","SMTP server:":"SMTP-kiszolgáló:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Ez a funkció lehetővé teszi az átalakítás / egészségellenőrzés állapotának ellenőrzését bármely webböngésző segítségével. Hasznos a szerverek futtatásakor stb. Nincsenek fájlnevek.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Ha engedélyezve van, a következő névtelen adatok kerülnek elküldésre a HBBatchBeast.io-hoz:","API key":"API-kulcs","Current status ('Searching', 'Running', 'Finished' etc)":"Jelenlegi állapot (\"Keresés\", \"Futás\", \"Kész\" stb.)","Number of:":"Száma:","Remaining items":"Megmaradt tételek","Successful items":"Sikeres elemek","Errored items":"Hibás elemek","Cancelled items":"Törölt elemek","Worker percentages":"Munkavállalói százalékok","Last completed item time":"Utolsó befejezett tételidő","Enable remote monitoring?:":"Távfelügyelet engedélyezése ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Alapvető benchmarking segédprogram, amely elsősorban annak megértésére szolgál, hogy a 16+ processzorok több HandBrake példányt használjanak, bár bármilyen típusú processzoron futtatható.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Ez letölti a h265 4k mintafájlt (2,5 MB) és egy referenciaértéket futtat a 4 HandBrake példány használatával, a \"Nagyon gyors 1080p30\" előbeállítással","Results can be uploaded to hbbatchbeast.io if you choose.":"Ha úgy dönt, az eredményeket feltöltheti a hbbatchbeast.io-ra.","Queue":"sorban áll","Output this session":"Kimeneti ezt a munkamenetet","Media info viewer tool":"Médiaadat-megjelenítő eszköz","View replaced file cache":"A kicserélt fájlok gyorsítótárának megtekintése","Clear replaced file cache":"Törölje a helyettesített fájl gyorsítótárát","Save config":"Save config","Scan only":"Csak szkennelés","Scan and convert":"Szkennelés és konvertálás","View scan/conversion summary log":"Szkennelési / konverziós összefoglaló napló megtekintése","View individual file check/conversion log":"Az egyedi fájlellenőrzési / konverziós napló megtekintése","View worker console output":"A munkavállalói konzol kimenetének megtekintése","Health check":"Állapotfelmérés","Clear healthy file cache":"Tiszta egészséges fájlgyorsítótár","View error log":"A hibanapló megtekintése","Email test":"E-mail teszt","View master log":"A mesternapló megtekintése","Wiki help":"Wiki segítség","An application by HaveAGitGat":"A HaveAGitGat által benyújtott kérelem","New":"Új","Launch":"Dob","Benchmark":"Viszonyítási alap","See results":"Lásd az eredményeket","Pause queue":"A várakozási sor szüneteltetése","Continue queue":"Folytassa a várólistát","Stop queue":"Állítsa le a várólistát","Convert selected files":"Konvertálja a kiválasztott fájlokat","Toggle queue view":"Váltási sor megtekintése","Deselect all":"Törölje az összes kijelölését","Invert all":"Fordítsa meg az összeset","Select all":"Mindet kiválaszt","Toggle output view":"Kapcsolja ki a kimeneti nézetet"}