{"The number of custom presets does not match the number of source folders!":"Jumlah preset khusus tidak sesuai dengan jumlah folder sumber!","source folders have been detected.":"folder sumber telah terdeteksi.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"garis terprogram khusus telah terdeteksi. Harap periksa ulang untuk jeda baris yang tidak terlihat. Seharusnya ada satu folder path atau preset per baris. Pastikan Anda tidak sengaja membuat garis kosong.","The number of filename suffixes does not match the number of source folders! ":"Jumlah akhiran nama file tidak sesuai dengan jumlah folder sumber!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"baris akhiran nama file telah terdeteksi. Harap periksa ulang untuk jeda baris yang tidak terlihat. Seharusnya ada satu folder path atau akhiran nama file per baris. Pastikan Anda tidak sengaja membuat garis kosong.","The number of source folders does not match the number of destination folders!":"Jumlah folder sumber tidak sesuai dengan jumlah folder tujuan!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"folder tujuan telah terdeteksi. Harap periksa ulang untuk jeda baris yang tidak terlihat. Seharusnya ada satu jalur folder per baris. Pastikan Anda tidak sengaja membuat garis kosong.","The number of source folders does not match the number of temporary conversion folders!":"Jumlah folder sumber tidak sesuai dengan jumlah folder konversi sementara!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"folder konversi sementara telah terdeteksi. Harap periksa ulang untuk jeda baris yang tidak terlihat. Seharusnya ada satu jalur folder per baris. Pastikan Anda tidak sengaja membuat garis kosong.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Silakan masukkan wadah yang valid seperti '.mp4'. Pastikan untuk memasukkan '.'","Corrupt file folder":"Folder file rusak","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"tidak ada! Pastikan tidak ada spasi atau karakter tersembunyi sebelum / setelah jalur","Source folder":"Folder sumber","Temporary conversion folder":"Folder konversi sementara","appears to be the same as or is within source folder":"tampaknya sama dengan atau di dalam folder sumber","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"yang akan mencegah HBBatchBeast dari berfungsi dengan benar. Harap ubah folder konversi sementara menjadi folder di luar folder sumber. Jika Anda ingin menggunakan fitur 'Ganti file asli', pilih folder tujuan yang tidak sama dengan, atau di dalam, folder sumber, dan kemudian centang kotak 'Ganti file asli selalu' di bagian pengaturan lanjutan . Hapus centang pada kotak 'Folder konversi sementara' sementara karena tidak akan berguna dalam kasus ini. File akan dikonversi ke folder tujuan dan kemudian dipindahkan kembali ke folder sumber.","Destination folder":"Folder tujuan","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"yang akan mencegah HBBatchBeast dari berfungsi dengan benar. Ubah folder tujuan menjadi folder di luar folder sumber. Jika Anda ingin menggunakan fitur 'Ganti file asli', pilih folder tujuan yang tidak sama dengan, atau di dalam, folder sumber, dan kemudian centang kotak 'Ganti file asli selalu' di bagian pengaturan lanjutan . Hapus centang pada kotak 'Folder konversi sementara' sementara karena tidak akan berguna dalam kasus ini. File akan dikonversi ke folder tujuan dan kemudian dipindahkan kembali ke folder sumber.","Error creating temporary conversion folder":"Kesalahan membuat folder konversi sementara","Error creating destination folder":"Kesalahan saat membuat folder tujuan","Please select to use HandBrake or FFmpeg!":"Silakan pilih untuk menggunakan HandBrake atau FFmpeg!","Please select a standard preset or input a custom one!":"Silakan pilih preset standar atau masukan yang kustom!","Please select a scan interval of 5 seconds or greater!":"Silakan pilih interval pemindaian 5 detik atau lebih besar!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Pastikan jumlah instance HandBrake / FFmpeg simultan yang digunakan adalah satu atau lebih besar!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Kunci API tidak valid! Silakan klik 'Baru' pada tab pemantauan jarak jauh untuk menghasilkan kunci baru.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Silakan masukkan waktu pemindaian harian dalam format 24 jam: jj: mm (misalnya 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"FILM SUMBER AKAN DIHAPUS SETELAH KONVERSI! Silakan uji sebelum penggunaan yang tepat!","Benchmark failed!":"Patokan gagal!","Log does not exist!":"Log tidak ada!","Folder does not exist!":"Folder tidak ada!","Error sending email! Please check your settings.":"Kesalahan mengirim email! Silakan periksa pengaturan Anda.","Test email sent!":"Email percobaan terkirim!","All worker processes have been stopped.":"Semua proses pekerja telah dihentikan.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Antrian akan dijeda setelah item saat ini selesai diproses. Anda yakin ingin menjeda antrian?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Jeda antrian dimulai. Tombol 'Lanjutkan' akan muncul setelah semua pekerja berhenti.","Healthy file cache cleared!":"Tembolok file yang sehat dihapus!","Cache cleared!":"Cache dibersihkan!","Cancel item":"Membatalkan Item","Please check the above checkbox to use this feature.":"Silakan centang kotak di atas untuk menggunakan fitur ini.","Configuration":"Konfigurasi","Source folders":"Folder sumber","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Ini adalah folder sumber yang akan dipindai untuk media. Folder harus dimasukkan tanpa garis miring. Sebagai contoh:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Kotak jalur folder sumber dapat diperluas (tekan enter untuk membuat baris baru). Jika Anda ingin menentukan beberapa folder sumber, pastikan setiap jalur folder sumber berada pada barisnya sendiri seperti:","Video health check":"Pemeriksaan kesehatan video","Batch conversion and Folder watching":"Konversi batch dan Menonton folder","Remote Monitoring (Beta)":"Remote Monitoring (Beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"Sistem","Help":"Membantu","Temporary conversion folders":"Folder konversi sementara","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Jika \"Folder konversi sementara?\" dicentang, maka HandBrake akan mengonversi file ke folder itu. Setelah konversi selesai, file akan dipindahkan ke \"folder Tujuan\" Anda. Anda harus menentukan folder konversi sementara sebanyak folder sumber. Folder sumber pertama Anda akan dikonversi menjadi folder konversi sementara pertama, folder sumber kedua Anda menjadi folder konversi sementara kedua Anda dan seterusnya. Pastikan setiap jalur folder konversi sementara berada di barisnya masing-masing.","Destination folders":"Folder tujuan","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Tentukan jalur folder tujuan. Sekali lagi, Anda harus menentukan folder tujuan sebanyak folder sumber. File dari folder sumber pertama Anda akan berakhir di folder tujuan pertama Anda, file folder sumber kedua Anda di folder tujuan kedua Anda dan seterusnya.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Folder sumber pertama ---------> Folder konversi sementara pertama ---------> Folder tujuan pertama","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Folder sumber kedua ---------> Folder konversi sementara kedua ---------> Folder tujuan kedua","etc":"dll","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast tidak akan berfungsi dengan baik jika Anda mengatur folder tujuan sama dengan, atau di dalam, folder sumber.","Standard preset:":"Prasetel standar:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Pilih preset HandBrake yang ingin Anda konversikan dengan file Anda. Jika \"Preset standar\" dipilih, maka semua file dalam folder yang dipilih akan dikonversi menggunakan preset HandBrake yang ditentukan. Anda dapat menemukan lebih banyak tentang preset HandBrake di sini:","Custom preset:":"Prasetel ubahsuaian:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Jika \"Custom preset\" maka Anda harus memasukkan preset kustom Anda sendiri. HBBatchBeast mencakup bagian \"HandBrakeCLI -i source -o destination\" dari input HandBrakeCLI sehingga Anda perlu memasukkan parameter konversi. Sebagai contoh:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Jika menggunakan FFmpeg, Anda perlu memisahkan parameter input dan output dengan koma. Seperti:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Anda juga dapat menautkan ke prasetel kustom yang diekspor dari aplikasi GUI HandBrake resmi misalnya:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Jika Anda mengalami masalah dengan preset khusus, itu mungkin disebabkan oleh bug yang diketahui dengan HandBrakeCLI (akan diperbaiki pada rilis HandBrakeCLI berikutnya). Silakan lihat ini untuk solusi sementara:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Setiap prasetel kustom harus berada di jalurnya sendiri dan, mirip dengan folder, harus ada preset kustom sebanyak folder sumber.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Folder sumber pertama ---------> Folder konversi sementara pertama ---------> Folder tujuan pertama @ Custom 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Folder sumber kedua ---------> Folder konversi sementara kedua ---------> Folder tujuan kedua @ Custom preset 2","See the following image for guidance:":"Lihat gambar berikut untuk panduan:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Jika menggunakan pengodean kartu grafis (seperti NVENC), maka Anda mungkin perlu mengurangi jumlah instance HandBrake (coba 2 atau kurang) karena keterbatasan VRAM.","Select standard preset:":"Pilih prasetel standar:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC terdeteksi, pastikan untuk menurunkan jumlah instance HandBrakeCLI menjadi 2 atau lebih rendah (untuk sebagian besar kartu grafis) atau Anda mungkin mengalami kesalahan karena tidak cukup VRAM. Pengaturan ini dapat ditemukan di tab \"Sistem\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Prasetel yang diimpor terdeteksi. Jika Anda mengalami masalah dengan preset khusus yang diimpor, itu mungkin disebabkan oleh bug yang diketahui dengan HandBrakeCLI (akan diperbaiki pada rilis HandBrakeCLI berikutnya). Solusi sementara adalah menghapus '\"PictureRotate\": \"0: 0\"' dari file .json. Info lebih lanjut di sini:","Container:":"Wadah:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Tentukan wadah yang Anda inginkan untuk memiliki file keluaran seperti '.mp4'. Anda dapat mengetahui lebih lanjut tentang wadah di:","Enable periodic scanning:":"Aktifkan pemindaian berkala:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast dapat memonitor folder sumber Anda dan menjalankan pemindaian untuk file baru pada interval yang ditentukan. Waktu interval dalam detik dengan standarnya adalah 300 detik (5 menit). Jika opsi ini dipilih, maka ketika Anda menekan \"Pindai dan konversi\", program akan mengonversi file baru dan penghitung waktu mundur akan dimulai. Ini akan berulang hingga berhenti. Interval pemindaian ada di bagian pengaturan lanjutan.","Enable daily scanning:":"Aktifkan pemindaian harian:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Alih-alih pemindaian berkala, Anda dapat memilih pemindaian untuk dijalankan sekali sehari. Waktu pemindaian dimasukkan di bagian pengaturan lanjutan dalam format jj: mm seperti '18: 30 '. Setelah \"Pindai dan konversi\" dipilih, program akan menunggu hingga waktu yang ditentukan hingga menjalankan proses pemindaian dan konversi. Sekali lagi, ini akan berulang hingga berhenti.","Show/hide advanced:":"Tampilkan / sembunyikan lanjut:","Scan interval (minimum 5 seconds):":"Interval pemindaian (minimal 5 detik):","Daily run time (hh:mm):":"Waktu lari harian (jj: mm):","Output filename suffix:":"Akhiran nama file keluaran:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Ini opsional. Anda dapat menentukan akhiran untuk ditambahkan ke akhir nama file Anda seperti '_1080p' atau '_testconversion' dll.","If 'standard preset' is selected then all output files will have the same suffix.":"Jika 'preset standar' dipilih maka semua file output akan memiliki akhiran yang sama.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Jika 'custom preset' dipilih maka Anda dapat menentukan satu suffix per folder sumber / custom preset. Pastikan setiap sufiks ada di barisnya masing-masing. Misalnya, jika Anda memiliki 2 folder sumber dan menggunakan 'preset khusus', Anda bisa meletakkan ini di kotak akhiran nama file:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"File dalam folder sumber pertama akan ditambahkan '_720p' ke nama file keluaran. File dalam folder sumber kedua akan ditambahkan '_1080p' ke nama file keluaran dll.","Include these file containers:":"Sertakan wadah file ini:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Masukkan wadah file yang akan dipindai. Setiap jenis harus dipisahkan oleh koma. Entri default adalah:","Exclude files smaller than (MB):":"Kecualikan file yang lebih kecil dari (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Tentukan apakah akan mengecualikan file yang lebih kecil dari ukuran tertentu dari konversi (dalam megabita)","Exclude files larger than (MB):":"Kecualikan file yang lebih besar dari (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Tentukan apakah akan mengecualikan file yang lebih besar dari ukuran tertentu dari konversi (dalam megabita)","Exclude filenames which include any of these words:":"Kecualikan nama file yang menyertakan kata-kata ini:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Masukkan kata kunci yang akan disaring saat memindai file. Misalnya, jika \"720p\" dimasukkan, maka file apa pun dengan \"720p\" dalam judul tidak akan dikonversi. Sekali lagi, kata kunci perlu dipisahkan dengan koma. Misalnya, masukkan yang berikut ini di kotak filter:","Include files with any ":"Sertakan file dengan"," or all ":"atau semua"," of these":"ini","properties:":"properti:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Di sini Anda dapat memasukkan properti video dan audio yang harus dimiliki file agar dapat dikonversi (info diekstraksi menggunakan FFprobe). Properti harus dipisahkan oleh koma. Gunakan alat penampil info media untuk membantu menentukan properti apa yang ingin Anda sertakan. Pastikan untuk meletakkan koma setelah properti terakhir. Misalnya, untuk hanya mengonversi file yang disandikan menggunakan h264 dan audio stereo aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Perlu dicatat bahwa pemeriksaan properti ini dilakukan setelah proses konversi dimulai (untuk menghemat waktu saat membangun antrian), jadi walaupun file mungkin muncul dalam antrian konversi, mereka akan dilewati / disertakan jika kondisi yang benar dipenuhi.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Jika FFprobe dapat mengekstrak properti, maka 'OK' akan muncul di kolom \"FFprobe\" di tampilan antrian.","Exclude files with any ":"Kecualikan file dengan"," of these ":"ini","The opposite of 'Include files with any or all of these properties'":"Kebalikan dari 'Sertakan file dengan salah satu atau semua properti ini'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Ini adalah alat kecil untuk menganalisis properti file untuk membantu Anda menentukan properti mana yang ingin Anda sertakan / kecualikan dalam opsi di atas. Ia menggunakan FFprobe untuk mengembalikan informasi. Seret dan taruh file ke dalam kotak abu-abu untuk menganalisisnya. Misalnya, memasukkan file tes dapat mengembalikan yang berikut:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Jika Anda ingin mengecualikan file seperti ini agar tidak dikonversi, maka Anda dapat memasukkan beberapa properti file ke kotak \"Kecualikan file dengan salah satu atau semua properti ini\" dan centang kotak di sebelah 'semua' alih-alih 'apa pun', seperti itu:","Copy excluded files to destination:":"Salin file yang dikecualikan ke tujuan:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Jika Anda memilih opsi ini, maka file yang telah dikecualikan dari konversi akan disalin langsung ke folder tujuan. Ini berlaku untuk filter berikut:","Exclude filenames which include any of these words":"Kecualikan nama file yang menyertakan kata-kata ini","Include files with any or all of these properties":"Sertakan file dengan salah satu atau semua properti ini","Exclude files with any or all of these properties":"Kecualikan file dengan salah satu atau semua properti ini","Exclude files smaller than (MB)":"Kecualikan file yang lebih kecil dari (MB)","Exclude files larger than (MB)":"Kecualikan file yang lebih besar dari (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Catatan ini juga berlaku untuk file yang dikecualikan karena mereka tidak memenuhi kondisi properti \"Sertakan\" di atas, jadi jangan secara tidak sengaja menyalin seluruh perpustakaan Anda ketika Anda hanya mencoba mengonversi beberapa file.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Fitur salin tidak berlaku untuk filter berikut (yaitu file dikecualikan karena filter)","Include these file types":"Sertakan jenis file ini","Delete source files after conversion:":"Hapus file sumber setelah konversi:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Jika ini dipilih, maka jika upaya konversi berhasil, file sumber akan dihapus. Proses ini dilakukan di akhir, setelah konversi semua file. Ini berarti Anda dapat mengonversi file sumber yang sama menggunakan beberapa preset, semuanya dalam sekali jalan. File sumber kemudian akan dihapus setelahnya.","Replace original file if converted file is smaller?(Compress attempt)":"Ganti file asli jika file yang dikonversi lebih kecil? (Upaya kompres)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Pilih kotak centang ini jika Anda ingin HBBatchBeast secara otomatis mengganti file sumber asli jika file baru lebih kecil. Jika file baru tidak lebih kecil, maka itu akan ditinggalkan di folder tujuan.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Pastikan folder tujuan Anda tidak sama dengan / atau di dalam, folder sumber Anda atau tidak akan berfungsi dengan baik.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Setelah HBBatchBeast mencoba mengompres file tertentu, itu akan menambahkan path file itu ke cache sehingga tidak akan dicoba lagi di masa depan. Anda dapat melihat / mengedit / menghapus cache menggunakan tombol kuning.","Replace original file always?":"Ganti file asli selalu?","The original file will be replaced regardless of whether the new file is larger or smaller.":"File asli akan diganti terlepas dari apakah file baru lebih besar atau lebih kecil.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Sekali lagi, pastikan folder tujuan Anda tidak sama dengan / atau di dalam, folder sumber Anda atau tidak akan berfungsi dengan baik.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Setelah HBBatchBeast mentranskodekan file tertentu, itu akan menambahkan path file itu ke cache sehingga tidak akan dicoba lagi di masa depan. Anda dapat melihat / mengedit / menghapus cache menggunakan tombol kuning.","Copy subtitle (srt) files to destination?":"Salin file subtitle (srt) ke tujuan?","Subtitle '.srt' files will be copied to the destination folder automatically.":"File subtitle '.srt' akan disalin ke folder tujuan secara otomatis.","Automatically create temporary/destination folders if they don't exist?":"Secara otomatis membuat folder sementara / tujuan jika tidak ada?","Custom bat path to run after each conversion (leave blank if not using):":"Jalur bat kustom untuk dijalankan setelah setiap konversi (kosongkan jika tidak menggunakan):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Masukkan jalur ke file kumpulan khusus yang ingin Anda jalankan setelah setiap konversi. Sebagai contoh:","Batch files with timeout statements won't work. More info here:":"File batch dengan pernyataan batas waktu tidak akan berfungsi. Info lebih lanjut di sini:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Biarkan kotak benar-benar kosong jika Anda tidak ingin menggunakan opsi ini (pastikan tidak ada karakter tersembunyi di dalam kotak)","Run processes at low priority?":"Jalankan proses dengan prioritas rendah?","All conversion processes will be run at low priority, reducing processor usage.":"Semua proses konversi akan dijalankan pada prioritas rendah, mengurangi penggunaan prosesor.","Remove apostrophes from filenames:":"Hapus apostrof dari nama file:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Pemindaian konversi / pemeriksaan kesehatan mungkin gagal jika nama file memiliki tanda kutip. Periksa ini untuk secara otomatis menghapus tanda kutip dari nama file."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Fitur ini dapat memindai file video yang rusak menggunakan fitur '--scan' HandBrake, meskipun ini tidak selalu akurat. Itu juga menggunakan FFprobe untuk memberikan titik referensi kedua. Jika FFprobe dan HandBrake gagal, maka ada kemungkinan besar file tersebut rusak.","Move corrupt files into the following folder:":"Pindahkan file yang rusak ke folder berikut:"," If checked, then any files which give errors will be moved into the specified folder.":"Jika dicentang, maka setiap file yang memberikan kesalahan akan dipindahkan ke folder yang ditentukan.","Corrupt file folder:":"Folder file rusak:","Run thorough file health check:":"Jalankan pemeriksaan kesehatan file menyeluruh:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Jika dicentang, maka pemeriksaan kesehatan video yang jauh lebih lambat dan lebih teliti akan dijalankan menggunakan FFmpeg alih-alih HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Berdasarkan 'ScanMedia.ps1' Desani ditemukan di:","Attempt to repair files after thorough check:":"Mencoba memperbaiki file setelah pemeriksaan menyeluruh:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Jika dicentang, HBBatchBeast akan berusaha memperbaiki file menggunakan FFmpeg. File baru dengan akhiran '_repaired' akan dibuat di folder yang sama dengan file sumber.","'CRF' value to use when attempting to repair files:":"Nilai 'CRF' untuk digunakan ketika mencoba memperbaiki file:","The default 'CRF' value is 23. Please see the following for more information:":"Nilai 'CRF' default adalah 23. Silakan lihat yang berikut untuk informasi lebih lanjut:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Kisaran skala CRF adalah 0-51, di mana 0 adalah lossless, 23 adalah default, dan 51 adalah kualitas terburuk yang mungkin. Nilai yang lebih rendah umumnya mengarah pada kualitas yang lebih tinggi, dan kisaran yang secara subyektif waras adalah 17-28. Pertimbangkan 17 atau 18 sebagai visual lossless atau hampir seperti itu; itu harus terlihat sama atau hampir sama dengan input tetapi secara teknis tidak lossless.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast menyimpan daftar jalur file yang dipindai yang dilaporkan sebagai tidak rusak. Bersihkan cache untuk melakukan pemindaian baru pada semua file.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Jumlah instance HandBrake / FFmpeg simultan untuk digunakan? (Disarankan 4 atau kurang):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Pengaturan ini berlaku untuk proses \"Pemeriksaan kesehatan video\" dan \"Pindai dan konversi\". Tentukan berapa banyak thread HandBrake yang akan digunakan. Tidak ada yang maksimal meskipun disarankan untuk tidak menggunakan lebih dari 4. Jumlah yang lebih tinggi dapat membekukan komputer Anda jika tidak terlalu kuat.","Queue size view limit?(Recommended 1000 or fewer):":"Batas tampilan ukuran antrian? (Disarankan 1000 atau kurang):","Automatically start \"Scan and convert\" when program opened?:":"Secara otomatis memulai \"Pindai dan konversi\" ketika program dibuka ?:","Save verbose logs?:":"Simpan log verbose ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Centang kotak ini untuk menyimpan log sub-proses terperinci. Ini termasuk ouput konsol pekerja. Ini akan menyebabkan log sangat besar.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Isi rincian email untuk menerima pemberitahuan email jika terjadi kesalahan selama pemeriksaan kesehatan atau menonton konversi / folder. Tidak akan bekerja dengan akun yang membutuhkan 2FA. Anda perlu mengaktifkan akses ke aplikasi yang kurang aman di akun Gmail.","Email address:":"Alamat email:","For example:":"Sebagai contoh:","Email password(not saved):":"Kata sandi email (tidak disimpan):","SMTP server:":"Server SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Fitur ini memungkinkan pemantauan status pemeriksaan konversi / kesehatan menggunakan browser web apa pun. Berguna saat menjalankan server dll. Tidak ada nama file yang dikirim.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Jika diaktifkan, data anonim berikut akan dikirim ke HBBatchBeast.io:","API key":"Kunci API","Current status ('Searching', 'Running', 'Finished' etc)":"Status saat ini ('Pencarian', 'Lari', 'Selesai' dll)","Number of:":"Jumlah:","Remaining items":"Item yang tersisa","Successful items":"Item yang sukses","Errored items":"Item yang salah","Cancelled items":"Item yang dibatalkan","Worker percentages":"Persentase pekerja","Last completed item time":"Waktu item selesai terakhir","Enable remote monitoring?:":"Aktifkan pemantauan jarak jauh ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Utilitas pembandingan dasar dibangun terutama untuk melihat kinerja 16+ prosesor inti menggunakan banyak instance HandBrake meskipun dapat dijalankan pada semua jenis prosesor.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Ini akan mengunduh file sampel h265 4k (2,5MB) dan menjalankan benchmark menggunakan 4 instance HandBrake dengan preset \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Hasil dapat diunggah ke hbbatchbeast.io jika Anda mau.","Queue":"Antre","Output this session":"Keluarkan sesi ini","Media info viewer tool":"Alat penampil info media","View replaced file cache":"Lihat cache file yang diganti","Clear replaced file cache":"Hapus cache file yang diganti","Save config":"Simpan konfigurasi","Scan only":"Pindai saja","Scan and convert":"Pindai dan konversi","View scan/conversion summary log":"Lihat pemindaian / ringkasan log konversi","View individual file check/conversion log":"Lihat pemeriksaan file individual / log konversi","View worker console output":"Lihat output konsol pekerja","Health check":"Cek kesehatan","Clear healthy file cache":"Bersihkan cache file yang sehat","View error log":"Lihat log kesalahan","Email test":"Tes email","View master log":"Lihat master log","Wiki help":"Bantuan wiki","An application by HaveAGitGat":"Aplikasi oleh HaveAGitGat","New":"Baru","Launch":"Meluncurkan","Benchmark":"Tolok ukur","See results":"Lihat hasilnya","Pause queue":"Jeda antrian","Continue queue":"Lanjutkan antrian","Stop queue":"Hentikan antrian","Convert selected files":"Konversi file yang dipilih","Toggle queue view":"Alihkan tampilan antrian","Deselect all":"Hapus pilihan semua","Invert all":"Balikkan semua","Select all":"Pilih Semua","Toggle output view":"Beralih tampilan output"}