{
    "The number of custom presets does not match the number of source folders!": "Fjölda sérsniðna forstillingar samsvarar ekki fjölda heimildarmöppna!",
    "source folders have been detected.": "Upprunalegir möppur hafa fundist.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "Sérsniðnar forstilltar línur hafa fundist. Vinsamlegast vertu tvöfalt að skoða ósýnilega línuskil. Það ætti að vera einn mappa slóð eða forstillt á línu. Gakktu úr skugga um að þú hafir ekki tilviljun búið til autt línu.",
    "The number of filename suffixes does not match the number of source folders! ": "Fjölda heiti skráarnafna samsvarar ekki fjölda heimildarmöppum!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "Skráarheiti viðskeyti línur hafa fundist. Vinsamlegast vertu tvöfalt að skoða ósýnilega línuskil. Það ætti að vera einn mappa slóð eða heiti eftirnafn á línu. Gakktu úr skugga um að þú hafir ekki tilviljun búið til autt línu.",
    "The number of source folders does not match the number of destination folders!": "Fjöldi heimildarmappa samsvarar ekki fjölda áfangastaða möppur!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "áfangastaðarmöppur hafa fundist. Vinsamlegast vertu tvöfalt að skoða ósýnilega línuskil. Það ætti að vera einn mappa slóð á línu. Gakktu úr skugga um að þú hafir ekki tilviljun búið til autt línu.",
    "The number of source folders does not match the number of temporary conversion folders!": "Fjöldi heimildarmappa samsvarar ekki fjölda tímabundinna viðskiptamöppur!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "Tímabundnar viðskiptamöppur hafa verið greindar. Vinsamlegast vertu tvöfalt að skoða ósýnilega línuskil. Það ætti að vera einn mappa slóð á línu. Gakktu úr skugga um að þú hafir ekki tilviljun búið til autt línu.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Vinsamlegast sláðu inn gilt gám eins og '.mp4'. Vertu viss um að innihalda '.'",
    "Corrupt file folder": "Spillt skrám möppu",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "er ekki til! Vinsamlegast vertu viss um að ekkert rými eða falinn stafur sé fyrir / eftir slóðina",
    "Source folder": "Heimildarmappa",
    "Temporary conversion folder": "Tímabundin viðskiptamöppur",
    "appears to be the same as or is within source folder": "virðist vera það sama og það er í uppspretta möppu",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "sem kemur í veg fyrir að HBBatchBeast virki rétt. Vinsamlegast breyttu tímabundinni umreikningsmöppunni í möppu utan upprunamöppunnar. Ef þú vilt nota \"Skipta upprunalegu skráareiginleikanum\" skaltu velja áfangastaðarmöppu sem er ekki það sama eða innan, upprunamappa og síðan skaltu haka í \"Skipta um upphaflega skrár alltaf\" í reitnum Advanced Settings . Taktu hakið úr hnappnum fyrir tímabundið \"Tímabundið viðskipti möppu\" þar sem það mun ekki nota í þessu tilfelli. Skrár verða breytt í áfangastaðarmiðann og síðan flutt aftur inn í heimildarmiðann.",
    "Destination folder": "Áfangastaður möppu",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "sem kemur í veg fyrir að HBBatchBeast virki rétt. Vinsamlegast breyttu áfangastaðsmöppunni í möppu fyrir utan möppu. Ef þú vilt nota \"Skipta upprunalegu skráareiginleikanum\" skaltu velja áfangastaðarmöppu sem er ekki það sama eða innan, upprunamappa og síðan skaltu haka í \"Skipta um upphaflega skrár alltaf\" í reitnum Advanced Settings . Taktu hakið úr hnappnum fyrir tímabundið \"Tímabundið viðskipti möppu\" þar sem það mun ekki nota í þessu tilfelli. Skrár verða breytt í áfangastaðarmiðann og síðan flutt aftur inn í heimildarmiðann.",
    "Error creating temporary conversion folder": "Villa við að búa til tímabundna viðskiptamöppu",
    "Error creating destination folder": "Villa við að búa til áfangastaðarmappa",
    "Please select to use HandBrake or FFmpeg!": "Vinsamlegast veldu að nota HandBrake eða FFmpeg!",
    "Please select a standard preset or input a custom one!": "Vinsamlegast veldu venjulegt forstillt eða sláðu inn sérsniðið!",
    "Please select a scan interval of 5 seconds or greater!": "Vinsamlegast veldu leitarglugga 5 sekúndur eða meira!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Vinsamlegast vertu viss um að fjöldi samtímis HandBrake / FFmpeg dæmi til að nota sé ein eða fleiri!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Ógildur API lykill! Vinsamlegast smelltu á 'Nýr' á ytra flipann til að búa til nýja lykil.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Vinsamlegast sláðu inn daglega grannskoða tíma í 24 klst snið: hh: mm (til dæmis 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "KILDUR FILIR VERÐUR FYRIR BREYTINGUM! Vinsamlegast prófaðu fyrir réttan notkun!",
    "Benchmark failed!": "Kvóti mistókst!",
    "Log does not exist!": "Loginn er ekki til!",
    "Folder does not exist!": "Mappa er ekki til!",
    "Error sending email! Please check your settings.": "Villa við að senda tölvupóst! Vinsamlegast athugaðu stillingarnar þínar.",
    "Test email sent!": "Próf tölvupóst send!",
    "All worker processes have been stopped.": "Öll verkferlaferli hefur verið stöðvuð.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Biðröð verður stöðvuð þegar núverandi hlutir hafa lokið vinnslu. Ertu viss um að þú viljir gera hlé á biðröðinni?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Kveikjahlé hefst. \"Halda áfram\" hnappinn birtist þegar allir starfsmenn hafa hléað.",
    "Healthy file cache cleared!": "Heilbrigður skrá skyndiminni hreinsaður!",
    "Cache cleared!": "Skyndiminni hreinsað!",
    "Cancel item": "Hætta við hlut",
    "Please check the above checkbox to use this feature.": "Vinsamlegast athugaðu hér að ofan til að nota þennan eiginleika.",
    "Configuration": "Stillingar",
    "Source folders": "Heimildarmöppur",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Þetta er uppspretta möppunnar sem verður skönnuð fyrir fjölmiðla. Mappan þarf að slá inn án þess að slash sé á eftir. Til dæmis:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Stýrihólfið fyrir uppspretta möppunnar er stækkanlegt (ýttu á Enter til að búa til nýja línu). Ef þú vilt tilgreina margar heimildarmöppur skaltu ganga úr skugga um að hver uppspretta möppuleið sé á eigin línu, svo sem:",
    "Video health check": "Video heilsa stöðva",
    "Batch conversion and Folder watching": "Hópur viðskipta og Mappa að horfa",
    "Remote Monitoring (Beta)": "Fjarstýring (beta)",
    "Benchmark (Beta)": "Kvóti (Beta)",
    "System": "Kerfi",
    "Help": "Hjálp",
    "Temporary conversion folders": "Tímabundin viðskipti möppur",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Ef \"Tímabundin viðskiptamöppur?\" er merkt, þá mun HandBrake umbreyta skrám í möppuna. Þegar viðskiptin eru lokið verður skráin flutt í \"Móttökuskrá\". Þú þarft að tilgreina eins mörg tímabundin viðskipti möppur sem uppspretta möppur. Fyrsta uppspretta möppan þín verður breytt í fyrsta tímabundna viðskipta möppuna þína, önnur uppspretta möppu í annað tímabundna viðskipta möppuna þína og svo framvegis. Gakktu úr skugga um að hverja tímabundna viðskiptamöppuleið sé á eigin línu.",
    "Destination folders": "Áfangastaðarmöppur",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Tilgreindu áfangastaðsstíga. Aftur þarftu að tilgreina eins mörg áfangastaðarmöppur og heimildarmöppur. Skrár úr fyrstu uppsprettu möppunni þinni munu endar í fyrsta áfangastað möppunni, önnur uppspretta möppu skrár í öðrum áfangastað möppu og svo framvegis.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Fyrsta uppspretta möppu ---------> Fyrsta tímabundinn viðskipti möppur ---------> Fyrsta áfangastað möppu",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Second uppspretta möppu ---------> Second tímabundin viðskipti möppu ---------> Second áfangastað möppu",
    "etc": "osfrv",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast virkar ekki rétt ef þú setur áfangastaðarmöppuna eins og eða innan, heimildarmiðillinn.",
    "Standard preset:": "Standard forstillt:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Veldu handbrake forstilltu sem þú vilt breyta skrám með. Ef \"Standardforstillt\" er valið, þá verða allar skrár í möppunum sem eru valdar breyttar með því að nota tilgreindan HandBrake forstillingu. Þú getur fundið meira um handbremsforstillingar hér:",
    "Custom preset:": "Sérsniðið forstillt:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Ef \"Sérsniðið forstillt\" þá þarftu að slá inn eigin sérsniðna forstillingu. HBBatchBeast nær yfir \"HandBrakeCLI-uppspretta -o áfangastað\" hluta HandBrakeCLI inntaksins þannig að þú þarft að slá inn viðskiptabreyturnar. Til dæmis:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Ef þú notar FFmpeg þarftu að aðskilja inntak og framleiðsla breytur með kommu. Eins og:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Þú getur einnig tengt við sérsniðna forstillingu sem hefur verið flutt út úr opinberu HandBrake GUI forritinu til dæmis:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Ef þú átt í vandræðum með sérsniðnar forstillingar gæti það verið vegna þekktrar galla með HandBrakeCLI (verður fastur í næsta HandBrakeCLI útgáfu). Vinsamlegast skoðaðu þetta fyrir tímabundna lausn:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Sérhver sérsniðin forstilltur þarf að vera á eigin línu og, eins og möppurnar, þarf að vera eins og margir sérsniðnar forstillingar sem heimildarmyndir.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Fyrsta uppspretta möppu ---------> Fyrsta tímabundinn viðskipti möppur ---------> Fyrsta áfangastað möppur @ Custom forstillta 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Second uppspretta möppu ---------> Second tímabundin viðskipti möppu ---------> Second áfangastað möppu @ Custom forstillta 2",
    "See the following image for guidance:": "Sjá eftirfarandi mynd til leiðbeiningar:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Ef þú notar kóðun á skjákorti (eins og NVENC), þá gætir þú þurft að draga úr fjölda HandBrake tilvikum (reyndu 2 eða færri) vegna VRAM takmörkana.",
    "Select standard preset:": "Veldu staðalstillingu:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC uppgötva, vinsamlegast vertu viss um að lækka fjölda HandBrakeCLI tilvika í 2 eða neðan (fyrir flestar skjákort) eða þú gætir lent í villum vegna ekki nógu VRAM. Þessi stilling er að finna á flipanum \"Kerfi\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Innflutt forstilltur uppgötvun. Ef þú átt í vandræðum með innfluttar sérsniðnar forstillingar gæti það verið vegna þekktrar galla með HandBrakeCLI (verður fastur í næsta HandBrakeCLI útgáfu). Tímabundin lausn er að fjarlægja '' PictureRotate ':' 0: 0 '' úr .json-skránni. Nánari upplýsingar hér:",
    "Container:": "Ílát:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Tilgreindu ílátið sem þú vilt að framleiðsla skráin hafi eins og '.mp4'. Þú getur fundið meira um gáma á:",
    "Enable periodic scanning:": "Virkja reglubundna skönnun:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast getur fylgst með upprunalegum möppum og keyrt skannar fyrir nýjar skrár á tilteknu bili. Tímabilið er í sekúndum og sjálfgefið er 300 sekúndur (5 mínútur). Ef þessi valkostur er valinn, þá þegar þú ýtir á \"Skanna og breyta\", mun forritið umbreyta öllum nýjum skrám og þá mun niðurtalningartíminn hefjast. Þetta mun lykkja óendanlega þar til það er hætt. Skanna bilið er í háþróaða stillingarhlutanum.",
    "Enable daily scanning:": "Virkja daglega skönnun:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Í stað þess að reglulega skanna, getur þú valið að skanna sé keyrt einu sinni á dag. Skanna tíminn er sleginn inn í háþróaða stillingarhlutanum í hh: mm sniði eins og '18: 30 '. Þegar \"Skanna og breyta\" er valið, mun forritið bíða þangað til tilgreint er til að keyra skanna og umbreytingarferli. Aftur, þetta mun lykkja óendanlega þar til hætt.",
    "Show/hide advanced:": "Sýna / fela ítarlegar:",
    "Scan interval (minimum 5 seconds):": "Skanna bil (lágmark 5 sekúndur):",
    "Daily run time (hh:mm):": "Dagleg hlaupartími (hh: mm):",
    "Output filename suffix:": "Output filename suffix:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Þetta er valfrjálst. Þú getur tilgreint viðskeyti til að bæta við enda filename eins og '_1080p' eða '_testconversion' o.fl.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Ef 'venjulegt forstillt' er valið þá munu öll framleiðsla skrár hafa sama viðskeyti.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Ef 'sérsniðið forstillt' er valið þá getur þú tilgreint eitt viðskeyti fyrir hverja möppu / sérsniðið forstillt. Gakktu úr skugga um að hver viðskeyti sé á eigin línu. Til dæmis, ef þú ert með 2 uppsprettu möppur og notar 'sérsniðin forstilltu', þá getur þú sett þetta í skráarnúmeri viðskeyti:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Skrár í fyrsta uppspretta möppunni verða '_720p' bætt við til að framleiða skráarnafnið. Skrár í annarri uppsprettu möppunni verða '_1080p' bætt við til að gefa út skráarnafn o.fl.",
    "Include these file types:": "Hafa þessar skráategundir:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Sláðu inn skráartegundirnar til að leita að. Hver tegund þarf að vera aðskilin með kommu. Sjálfgefin færsla er:",
    "Exclude files smaller than (MB):": "Útiloka skrá minni en (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Tilgreindu hvort eigi að útiloka skrár sem eru minni en ákveðin stærð frá viðskiptum (í megabæti)",
    "Exclude files larger than (MB):": "Útiloka skrár stærri en (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Tilgreindu hvort þú viljir útiloka skrár sem eru stærri en ákveðin stærð frá viðskiptum (í megabæti)",
    "Exclude filenames which include any of these words:": "Útiloka skráarnöfn sem innihalda eitthvað af þessum orðum:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Sláðu inn leitarorð sem þarf að sía út þegar leitað er að skrám. Til dæmis, ef \"720p\" er slegið inn þá verða engar skrár með \"720p\" í titlinum breytt. Aftur þurfa leitarorð að vera aðskilin með kommu. Til dæmis, sláðu inn eftirfarandi í síunarreitnum:",
    "Include files with any ": "Hafa skrá með einhverjum",
    " or all ": "eða allt",
    " of these": "af þessum",
    "properties:": "eignir:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Hér getur þú slegið inn myndskeið og hljóð eiginleika sem skrár verða að hafa til að hægt sé að breyta (upplýsingar tekin út með FFprobe). Eiginleikarnir verða að vera aðskilin með kommu. Notaðu miðlaraupplýsandaskoðara til að ákvarða hvaða eiginleikar þú vilt hafa með. Gakktu úr skugga um að setja kommu eftir síðustu eign. Til dæmis, að aðeins breyta skrám sem eru kóðaðar með því að nota h264 og aac hljómtæki hljóð:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Það er athyglisvert að þetta eignaathugun er gerður þegar viðskiptin hefjast (til að spara tíma á meðan biðröðin er byggð), svo þótt skrár birtist í viðskiptakóða, þá verður þeim sleppt / innifalið ef réttar aðstæður eru uppfylltar.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Ef FFprobe getur dregið út eiginleika þá birtist 'OK' í \"FFprobe\" dálknum í biðröðinni.",
    "Exclude files with any ": "Útiloka skrár með einhverjum",
    " of these ": "af þessum",
    "The opposite of 'Include files with any or all of these properties'": "The andstæða af 'Hafa skrá með einhverjum eða öllum þessum eiginleikum'",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Þetta er lítið tól til að greina skráareiginleika með til að hjálpa þér að ákvarða hvaða eiginleika þú vilt fela / útiloka í ofangreindum valkostum. Það notar FFprobe til að skila upplýsingum. Dragðu og slepptu skrám í gráa reitinn til að greina þær. Til dæmis getur sleppt í prófunarskrá skilað eftirfarandi:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Ef þú ert að leita að útiloka skrár eins og þetta frá því að vera breytt, þá getur þú sett nokkrar skráareiginleikar í \"Útiloka skrár með einhverjum eða öllum þessum eiginleikum\" kassanum og merktu við gátreitinn við hliðina á 'öllum' í staðinn fyrir 'allir' eins og svo:",
    "Copy excluded files to destination:": "Afritaðu útilokaðar skrár í áfangastað:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Ef þú velur þennan möguleika verða skrár sem hafa verið útilokaðir frá ummyndun afrituð beint á áfangastaðarmiðinn. Þetta á við um eftirfarandi síur:",
    "Exclude filenames which include any of these words": "Útiloka skráarnöfn sem innihalda eitthvað af þessum orðum",
    "Include files with any or all of these properties": "Hafa skrá með einhverjum eða öllum þessum eiginleikum",
    "Exclude files with any or all of these properties": "Útiloka skrár með einhverjum eða öllum þessum eiginleikum",
    "Exclude files smaller than (MB)": "Útiloka skrá minni en (MB)",
    "Exclude files larger than (MB)": "Útiloka skrár stærri en (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Athugaðu þetta gildir einnig um skrár sem eru útilokaðir vegna þess að þeir uppfylla ekki eignarskilyrðin \"Innihalda\" hér að ofan svo ekki afrita fyrir tilviljun að þú sért allt bókasafn þegar þú ert aðeins að reyna að umbreyta nokkrum skrám.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Eiginleikar afrita eiga ekki við um eftirfarandi síur (þ.e. skrár sem eru útilokaðir vegna síuna)",
    "Include these file types": "Hafa þessar skráategundir",
    "Delete source files after conversion:": "Eyða skrám eftir viðskipti:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Ef þetta er valið, þá er upphafsskráin eytt ef umbreytingarforsókn er tekin. Þetta ferli er gert í lok enda eftir breytingu á öllum skrám. Þetta þýðir að þú getur breytt sömu skrár með því að nota margar forstillingar, allt í einu. Upprunalegir skrár verða síðan eytt eftir það.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Skipta upprunalegu skránni ef breytt skrá er minni? (Þjappa tilraun)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Veldu þennan reit ef þú vilt að HBBatchBeast sjálfkrafa skipti upprunalegu upprunaskránni ef nýi skráin er minni. Ef nýr skrá er ekki minni þá verður það eftir í áfangastaðnum.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Gakktu úr skugga um að áfangasafnið þitt sé ekki það sama og / eða innan, heimildarmappan þín eða það mun ekki virka rétt.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Þegar HBBatchBeast hefur reynt að þjappa tiltekinni skrá mun það bæta við skráarslóðinni í skyndiminni svo að það verði ekki reynt aftur í framtíðinni. Þú getur skoðað / breytt / hreinsað skyndiminnið með gulu hnappunum.",
    "Replace original file always?": "Skiptu upprunalegu skránni alltaf?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Upprunalega skráin verður skipt út fyrir hvort nýjan skrá er stærri eða minni.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Gakktu úr skugga um að áfangasafnið þitt sé ekki það sama og / eða innan, heimildarmappan þín eða það mun ekki virka rétt.",
    "Copy subtitle (srt) files to destination?": "Afritaðu texta (srt) skrár á áfangastað?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Textar '.srt' skrár verða afritaðar á áfangastaðarmiðið sjálfkrafa.",
    "Automatically create temporary/destination folders if they don't exist?": "Búa til tímabundnar / áfangastaðarmöppur sjálfkrafa ef þær eru ekki til?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Sérsniðnar kylfu slóð að keyra eftir hverja breytingu (slepptu ef ekki nota):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Sláðu inn slóðina á sérsniðna lotuskrá sem þú vilt framkvæma eftir hverja viðskipti. Til dæmis:",
    "Batch files with timeout statements won't work. More info here:": "Hópur skrár með tímasetningu mun ekki virka. Nánari upplýsingar hér:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Leyfi kassanum alveg tómt ef þú vilt ekki nota þennan möguleika (vertu viss um að það eru engar falinn stafi í reitnum)",
    "Run processes at low priority?": "Hlaupa ferli við litla forgang?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Öll viðskipti ferli verður keyrt á lágum forgangi, draga úr örgjörva notkun.",
    "Remove apostrophes from filenames:": "Fjarlægðu apostrophes úr filenames:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Skönnun um viðskipti / heilsufarsskoðun kann að mistakast ef skráarnafn hafa apostrophes inn. Athugaðu þetta til að fjarlægja apostrophes sjálfkrafa úr skráarnafnunum.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Þessi eiginleiki getur skannað fyrir skemmdir vídeóskrár með því að nota'scan 'HandBrake, þótt þetta sé ekki alltaf rétt. Það notar einnig FFprobe til að gefa annað viðmiðunarpunkt. Ef bæði FFprobe og HandBrake mistakast þá er mikill möguleiki að skráin sé skemmd.",
    "Move corrupt files into the following folder:": "Færa spillt skrá í eftirfarandi möppu:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Ef það er valið þá verða allir skrár sem gefa villur færðar í tilgreindan möppu.",
    "Corrupt file folder:": "Spillt skrám möppu:",
    "Run thorough file health check:": "Hlaupa ítarlega skrá heilsu stöðva:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Ef köflóttur er þá mun mun hægari, nánari heilbrigðiseftirlit með myndskeiðum hlaupa með FFmpeg í stað HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Byggt á 'ScanMedia.ps1' Desani er að finna á:",
    "Attempt to repair files after thorough check:": "Tilraun til að gera við skrár eftir ítarlegar athuganir:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Ef það er valið, mun HBBatchBeast reyna að gera við skrár með FFmpeg. Ný skrá með viðskeyti '_repaired' verður búin til í sömu möppu og upprunalegri skrá.",
    "'CRF' value to use when attempting to repair files:": "'CRF' gildi sem á að nota þegar reynt er að gera við skrár:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Sjálfgefið 'CRF' gildi er 23. Vinsamlegast sjáðu eftirfarandi fyrir frekari upplýsingar:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Umfang CRF mælikvarða er 0-51, þar sem 0 er lossless, 23 er sjálfgefið og 51 er versta gæði mögulegt. Lægra gildi leiðir almennt til meiri gæða og viðfangsefnið er 17-28. Íhuga 17 eða 18 til að vera sjónrænt lausalaust eða næstum því; það ætti að líta eins eða næstum það sama og inntakið en það er ekki tæknilega týnt.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast vistar lista yfir skönnuð skráarslóðir sem greint er frá sem órjúfanlegur. Hreinsaðu skyndiminnið til að framkvæma nýja skönnun á öllum skrám.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Fjöldi samtímis HandBrake / FFmpeg dæmi til að nota? (Mælt 4 eða færri):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Þessi stilling gildir bæði fyrir \"Video Health Check\" og \"Scan and Convert\" aðferð. Tilgreindu hversu margar handbrake þráður er að nota. Það er engin hámark þó ráðlagt sé að nota ekki meira en 4. Hærri upphæð getur fryst tölvuna þína ef það er ekki mjög öflugt.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Bæjarstærðarmörk? (Mælt 1000 eða færri):",
    "Automatically start \"Scan and convert\" when program opened?": "Byrjaðu sjálfkrafa \"Skanna og umbreyta\" þegar forrit opnað?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Fylltu inn upplýsingar um tölvupóst til að fá tilkynningar í tölvupósti ef villa er upp á meðan á heilbrigðiseftirliti stendur eða að skoða umreikning / möppu. Mun ekki vinna með reikninga sem þurfa 2FA. Þú þarft að virkja aðgang að öruggari forritum á Gmail reikningum.",
    "Email address:": "Netfang:",
    "For example:": "Til dæmis:",
    "Email password(not saved):": "Email lykilorð (ekki vistað):",
    "SMTP server:": "SMTP þjónn:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Þessi eiginleiki gerir þér kleift að fylgjast með stöðu viðskipta / heilsuskoðunar með því að nota hvaða vafra sem er. Gagnlegar þegar keyrandi netþjónar",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Ef slökkt er á, verða eftirfarandi nafnlaus gögn send til HBBatchBeast.io:",
    "API key": "API lykill",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Núverandi staða ('Leita', 'Running', 'Finished' etc)",
    "Number of:": "Fjöldi:",
    "Remaining items": "Eftirstöðvar hlutir",
    "Successful items": "Árangursrík atriði",
    "Errored items": "Villutilboð",
    "Cancelled items": "Ógildir hlutir",
    "Worker percentages": "Vinnuhlutfall",
    "Last completed item time": "Síðasti lokið hlutartími",
    "Enable remote monitoring?:": "Virkja ytri eftirlit ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Grundvallarviðmiðunar gagnsemi byggð aðallega til að sjá hvernig 16 + kjarna örgjörvum framkvæma með því að nota margar HandBrake tilvikum þótt það sé hægt að keyra á hvaða tegund af örgjörva.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Þetta mun hlaða niður h265 4k sýnishornaskrá (2.5MB) og keyra viðmiðun með 4 HandBrake tilvikum með forstilltu \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Niðurstöður geta verið hlaðið upp á hbbatchbeast.io ef þú velur.",
    "Queue": "Biðröð",
    "Output this session": "Búðu til þennan fund",
    "Media info viewer tool": "Media upplýsingar áhorfandi tól",
    "View compress attempt cache": "Skoða þjappa tilraunaskyndiminni",
    "Clear compress attempt cache": "Hreinsaðu þjöppunarprófunarferilinn",
    "Save config": "Vista stillingu",
    "Scan only": "Aðeins skanna",
    "Scan and convert": "Skanna og umbreyta",
    "View scan/conversion summary log": "Skoðaðu samantektarskrá yfir skönnun / viðskipti",
    "View individual file check/conversion log": "Skoða einstaka skráarskoðun / viðskiptaskrá",
    "View worker console output": "Skoðaðu útsending framleiðanda",
    "Health check": "Heilbrigðisskoðun",
    "Clear healthy file cache": "Hreinsaðu heilbrigt skráarskyndiminni",
    "View error log": "Skoða villuskrá",
    "Email test": "Email próf",
    "View master log": "Skoða aðalskrá",
    "Wiki help": "Wiki hjálp",
    "An application by HaveAGitGat": "Umsókn frá HaveAGitGat",
    "New": "Nýtt",
    "Launch": "Sjósetja",
    "Benchmark": "Kvóti",
    "See results": "Sjá niðurstöður",
    "Pause queue": "Hlé biðröð",
    "Continue queue": "Haltu áfram biðröð",
    "Stop queue": "Hættu biðröð",
    "Convert selected files": "Umbreyta völdum skrám",
    "Toggle queue view": "Víxla í biðstöðu",
    "Deselect all": "Afvelja allt",
    "Invert all": "Snúa öllum",
    "Select all": "Velja allt",
    "Toggle output view": "Víxla framleiðsla útsýni"
}