{"The number of custom presets does not match the number of source folders!":"Il numero di preset personalizzati non corrisponde al numero di cartelle di origine!","source folders have been detected.":"le cartelle di origine sono state rilevate.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"sono state rilevate linee preimpostate personalizzate. Si prega di ricontrollare le interruzioni di linea invisibili. Dovrebbe esserci un percorso di cartella o un preset per riga. Assicurati di non aver accidentalmente creato una riga vuota.","The number of filename suffixes does not match the number of source folders! ":"Il numero di suffissi del nome file non corrisponde al numero di cartelle di origine!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"sono state rilevate linee di suffisso nome file. Si prega di ricontrollare le interruzioni di linea invisibili. Dovrebbe esserci un percorso di cartella o suffisso di nome file per riga. Assicurati di non aver accidentalmente creato una riga vuota.","The number of source folders does not match the number of destination folders!":"Il numero di cartelle di origine non corrisponde al numero di cartelle di destinazione!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"le cartelle di destinazione sono state rilevate. Si prega di ricontrollare le interruzioni di linea invisibili. Dovrebbe esserci un percorso di cartella per riga. Assicurati di non aver accidentalmente creato una riga vuota.","The number of source folders does not match the number of temporary conversion folders!":"Il numero di cartelle di origine non corrisponde al numero di cartelle di conversione temporanee!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"sono state rilevate cartelle di conversione temporanee. Si prega di ricontrollare le interruzioni di linea invisibili. Dovrebbe esserci un percorso di cartella per riga. Assicurati di non aver accidentalmente creato una riga vuota.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Inserisci un contenitore valido come \".mp4\". Assicurati di includere \".\"","Corrupt file folder":"Cartella di file danneggiata","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"non esiste! Assicurati che non ci siano spazi o caratteri nascosti prima / dopo il percorso","Source folder":"Cartella di origine","Temporary conversion folder":"Cartella di conversione temporanea","appears to be the same as or is within source folder":"sembra essere uguale o all'interno della cartella sorgente","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"che impedirà a HBBatchBeast di funzionare correttamente. Si prega di cambiare la cartella di conversione temporanea in una cartella al di fuori della cartella di origine. Se desideri utilizzare la funzione \"Sostituisci file originali\", seleziona una cartella di destinazione che non sia uguale o all'interno della cartella di origine, quindi seleziona la casella di controllo \"Sostituisci sempre file originali\" nella sezione delle impostazioni avanzate . Deseleziona la casella temporanea \"Cartella di conversione temporanea\" in quanto non servirà in questo caso. I file verranno convertiti nella cartella di destinazione e quindi spostati nella cartella di origine.","Destination folder":"La cartella di destinazione","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"che impedirà a HBBatchBeast di funzionare correttamente. Si prega di cambiare la cartella di destinazione in una cartella al di fuori della cartella di origine. Se desideri utilizzare la funzione \"Sostituisci file originali\", seleziona una cartella di destinazione che non sia uguale o all'interno della cartella di origine, quindi seleziona la casella di controllo \"Sostituisci sempre file originali\" nella sezione delle impostazioni avanzate . Deseleziona la casella temporanea \"Cartella di conversione temporanea\" in quanto non servirà in questo caso. I file verranno convertiti nella cartella di destinazione e quindi spostati nella cartella di origine.","Error creating temporary conversion folder":"Errore durante la creazione della cartella di conversione temporanea","Error creating destination folder":"Errore durante la creazione della cartella di destinazione","Please select to use HandBrake or FFmpeg!":"Si prega di selezionare per utilizzare HandBrake o FFmpeg!","Please select a standard preset or input a custom one!":"Seleziona un predefinito standard o inserisci uno personalizzato!","Please select a scan interval of 5 seconds or greater!":"Si prega di selezionare un intervallo di scansione di 5 secondi o superiore!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Assicurati che il numero di istanze di HandBrake / FFmpeg simultanee da utilizzare sia uno o più!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Chiave API non valida! Fare clic su \"Nuovo\" nella scheda di monitoraggio remoto per generare una nuova chiave.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Immettere un'ora di scansione giornaliera nel formato 24 ore: hh: mm (ad esempio 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"I FILE DI ORIGINE SARANNO CANCELLATI DOPO LA CONVERSIONE! Si prega di testare prima dell'uso corretto!","Benchmark failed!":"Benchmark fallito!","Log does not exist!":"Il registro non esiste!","Folder does not exist!":"La cartella non esiste!","Error sending email! Please check your settings.":"Errore nell'invio di email! Si prega di verificare le impostazioni.","Test email sent!":"Email di prova inviata!","All worker processes have been stopped.":"Tutti i processi di lavoro sono stati fermati.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"La coda verrà messa in pausa una volta terminata l'elaborazione degli articoli correnti. Sei sicuro di voler mettere in pausa la coda?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Pausa della coda avviata. Il pulsante \"Continua\" verrà visualizzato una volta che tutti i lavoratori si saranno messi in pausa.","Healthy file cache cleared!":"Cache di file sana cancellata!","Cache cleared!":"Cache cancellato!","Cancel item":"Cancella elemento","Please check the above checkbox to use this feature.":"Si prega di controllare la casella sopra per usare questa funzione.","Configuration":"Configurazione","Source folders":"Cartelle di origine","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Questa è la cartella sorgente che verrà scansionata per i media. La cartella deve essere inserita senza barra finale. Per esempio:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"La casella del percorso della cartella di origine è espandibile (premi invio per creare una nuova riga). Se si desidera specificare più cartelle di origine, assicurarsi che ogni percorso della cartella di origine si trovi sulla propria riga, ad esempio:","Video health check":"Controllo dello stato del video","Batch conversion and Folder watching":"Conversione batch e visione delle cartelle","Remote Monitoring (Beta)":"Monitoraggio remoto (Beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"Sistema","Help":"Aiuto","Temporary conversion folders":"Cartelle di conversione temporanee","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Se \"Cartella di conversione temporanea?\" è selezionato, quindi HandBrake convertirà i file in quella cartella. Al termine della conversione, il file verrà spostato nella \"cartella di destinazione\". Dovrai specificare tutte le cartelle di conversione temporanee come cartelle di origine. La prima cartella di origine verrà convertita nella prima cartella di conversione temporanea, nella seconda cartella di origine nella seconda cartella di conversione temporanea e così via. Assicurarsi che ogni percorso della cartella di conversione temporanea si trovi sulla propria riga.","Destination folders":"Cartelle di destinazione","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Specificare i percorsi della cartella di destinazione. Anche in questo caso, è necessario specificare il numero di cartelle di destinazione come cartelle di origine. I file della prima cartella di origine finiranno nella prima cartella di destinazione, i secondi file di cartella di origine nella seconda cartella di destinazione e così via.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Prima cartella di origine ---------> Prima cartella di conversione temporanea ---------> Prima cartella di destinazione","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Seconda cartella di origine ---------> Seconda cartella di conversione temporanea ---------> Seconda cartella di destinazione","etc":"eccetera","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast non funzionerà correttamente se si imposta la cartella di destinazione come o all'interno della cartella di origine.","Standard preset:":"Preimpostazione standard:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Seleziona il preset HandBrake con cui desideri convertire i tuoi file. Se è selezionato \"Preimpostazione standard\", tutti i file nelle cartelle selezionate verranno convertiti utilizzando la preimpostazione di HandBrake specificata. Qui puoi trovare ulteriori informazioni sui preset di HandBrake:","Custom preset:":"Preimpostazione personalizzata:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Se \"Preselezione personalizzata\", devi inserire la tua preimpostazione personalizzata. HBBatchBeast copre la parte \"HandBrakeCLI -i source -o destination\" dell'ingresso HandBrakeCLI, quindi è necessario inserire i parametri di conversione. Per esempio:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Se si utilizza FFmpeg, è necessario separare i parametri di input e output con una virgola. Ad esempio:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Puoi anche collegare un preset personalizzato che è stato esportato dall'applicazione GUI HandBrake ufficiale, ad esempio:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Se hai problemi con i preset personalizzati, potrebbe essere dovuto a un bug noto con HandBrakeCLI (verrà risolto nella prossima versione di HandBrakeCLI). Si prega di vedere questo per una soluzione temporanea:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Ogni preimpostazione personalizzata deve essere sulla propria linea e, in modo simile alle cartelle, è necessario che ci siano tante preimpostazioni personalizzate come cartelle di origine.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Prima cartella di origine ---------> Prima cartella di conversione temporanea ---------> Prima cartella di destinazione @ Preimpostazione personalizzata 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Seconda cartella di origine ---------> Seconda cartella di conversione temporanea ---------> Seconda cartella di destinazione @ Preimpostazione personalizzata 2","See the following image for guidance:":"Vedere la seguente immagine come guida:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Se si utilizza la codifica della scheda grafica (come NVENC), potrebbe essere necessario ridurre il numero di istanze di HandBrake (prova 2 o meno) a causa delle limitazioni della VRAM.","Select standard preset:":"Seleziona preset standard:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Rilevato NVENC, si prega di assicurarsi di abbassare il numero di istanze di HandBrakeCLI a 2 o meno (per la maggior parte delle schede grafiche) o si potrebbero riscontrare errori a causa della non sufficiente VRAM. Questa impostazione è disponibile nella scheda \"Sistema\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Presenza rilevata rilevata. Se hai problemi con i preset personalizzati importati, potrebbe essere dovuto a un bug noto con HandBrakeCLI (verrà risolto nella prossima versione di HandBrakeCLI). Una soluzione temporanea è rimuovere \"\" PictureRotate \":\" 0: 0 \"'dal file .json. Maggiori informazioni qui:","Container:":"Contenitore:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Specifica il contenitore che desideri avere come \".mp4\" nel file di output. Puoi saperne di più sui contenitori a:","Enable periodic scanning:":"Abilita scansione periodica:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast può monitorare le cartelle di origine ed eseguire scansioni per nuovi file a intervalli specificati. L'intervallo è espresso in secondi e il valore predefinito è 300 secondi (5 minuti). Se questa opzione è selezionata, quando si preme \"Scan and convert\", il programma convertirà tutti i nuovi file e quindi inizierà il conto alla rovescia. Questo si fermerà all'infinito fino all'arresto. L'intervallo di scansione si trova nella sezione delle impostazioni avanzate.","Enable daily scanning:":"Abilita scansione giornaliera:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Invece di una scansione periodica, è possibile scegliere di eseguire una scansione una volta al giorno. Il tempo di scansione viene inserito nella sezione delle impostazioni avanzate nel formato hh: mm come '18: 30 '. Una volta selezionato \"Scansione e conversione\", il programma attenderà fino al tempo specificato fino all'esecuzione di un processo di scansione e conversione. Anche in questo caso, questo verrà ripetuto all'infinito fino all'arresto.","Show/hide advanced:":"Mostra / nascondi avanzato:","Scan interval (minimum 5 seconds):":"Intervallo di scansione (minimo 5 secondi):","Daily run time (hh:mm):":"Tempo di esecuzione giornaliero (hh: mm):","Output filename suffix:":"Output suffisso nome file:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Questo è opzionale. Puoi specificare un suffisso da aggiungere alla fine del tuo nome file come \"_1080p\" o \"_testconversion\" ecc.","If 'standard preset' is selected then all output files will have the same suffix.":"Se è selezionato \"preset standard\", tutti i file di output avranno lo stesso suffisso.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Se è selezionato \"preimpostazione personalizzata\", è possibile specificare un suffisso per cartella di origine / preimpostazione personalizzata. Assicurati che ciascun suffisso sia sulla sua stessa linea. Ad esempio, se si dispone di 2 cartelle di origine e si utilizza 'preimpostazione personalizzata', è possibile inserire questo nella casella suffisso nome file:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"I file nella prima cartella di origine avranno \"_720p\" aggiunto al nome file di output. I file nella seconda cartella di origine avranno \"_1080p\" aggiunto al nome file di output, ecc.","Include these file containers:":"Includi questi contenitori di file:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Immettere i contenitori dei file per la ricerca. Ogni tipo deve essere separato da una virgola. La voce predefinita è:","Exclude files smaller than (MB):":"Esclude file più piccoli di (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Specificare se escludere file di dimensioni inferiori a una determinata dimensione dalla conversione (in megabyte)","Exclude files larger than (MB):":"Esclude file più grandi di (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Specificare se escludere file di dimensioni superiori a una determinata dimensione dalla conversione (in megabyte)","Exclude filenames which include any of these words:":"Escludere i nomi di file che includono una di queste parole:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Inserisci le parole chiave da filtrare durante la scansione dei file. Ad esempio, se si inserisce \"720p\", qualsiasi file con \"720p\" nel titolo non verrà convertito. Ancora una volta, le parole chiave devono essere separate da una virgola. Ad esempio, inserisci quanto segue nella casella del filtro:","Include files with any ":"Includi file con qualsiasi"," or all ":"o tutto"," of these":"di questi","properties:":"proprietà:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Qui puoi inserire proprietà video e audio che i file devono avere per essere convertiti (informazioni estratte usando FFprobe). Le proprietà devono essere separate da una virgola. Utilizza lo strumento di visualizzazione dei dati multimediali per determinare quali proprietà desideri includere. Assicurati di inserire una virgola dopo l'ultima proprietà. Ad esempio, per convertire solo i file codificati utilizzando l'audio stereo h264 e aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Vale la pena notare che questo controllo delle proprietà viene eseguito una volta avviato il processo di conversione (per risparmiare tempo durante la creazione della coda), quindi sebbene i file possano essere visualizzati nella coda di conversione, verranno saltati / inclusi se vengono soddisfatte le condizioni corrette.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Se FFprobe è in grado di estrarre le proprietà, nella vista \"coda\" apparirà un \"OK\" nella colonna \"FFprobe\".","Exclude files with any ":"Escludi file con qualsiasi"," of these ":"di questi","The opposite of 'Include files with any or all of these properties'":"L'opposto di \"Includi file con una o tutte queste proprietà\"","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Questo è un piccolo strumento per analizzare le proprietà dei file al fine di aiutarti a determinare quali proprietà desideri includere / escludere nelle opzioni sopra. Usa FFprobe per restituire informazioni. Trascina e rilascia i file nella casella grigia per analizzarli. Ad esempio, il rilascio di un file di test potrebbe restituire quanto segue:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Se stai cercando di escludere file come questo dalla conversione, puoi inserire diverse proprietà di file nella casella \"Escludi file con qualsiasi o tutte queste proprietà\" e seleziona la casella di controllo accanto a \"tutti\" invece di \"qualsiasi\", così:","Copy excluded files to destination:":"Copia i file esclusi nella destinazione:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Se si seleziona questa opzione, i file che sono stati esclusi dalla conversione verranno copiati direttamente nella cartella di destinazione. Questo vale per i seguenti filtri:","Exclude filenames which include any of these words":"Escludere i nomi di file che includono una di queste parole","Include files with any or all of these properties":"Includi file con una o tutte queste proprietà","Exclude files with any or all of these properties":"Escludere i file con alcune o tutte queste proprietà","Exclude files smaller than (MB)":"Esclude file più piccoli di (MB)","Exclude files larger than (MB)":"Esclude file più grandi di (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Nota: questo si applica anche ai file esclusi perché non soddisfano le condizioni di proprietà \"Include\" di quanto sopra, quindi non copi casualmente la tua intera libreria quando stai solo provando a convertire alcuni file.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"La funzione di copia non si applica ai seguenti filtri (ad es. File esclusi a causa del filtro)","Include these file types":"Includi questi tipi di file","Delete source files after conversion:":"Elimina i file di origine dopo la conversione:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Se è selezionato, se un tentativo di conversione ha esito positivo, il file sorgente verrà eliminato. Questo processo è fatto alla fine, dopo la conversione di tutti i file. Ciò significa che puoi convertire gli stessi file sorgente usando più preset, tutto in una volta. I file sorgente verranno quindi cancellati in seguito.","Replace original file if converted file is smaller?(Compress attempt)":"Sostituisci il file originale se il file convertito è più piccolo? (Comprimi il tentativo)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Seleziona questa casella di controllo se desideri che HBBatchBeast sostituisca automaticamente il file sorgente originale se il nuovo file è più piccolo. Se il nuovo file non è più piccolo, verrà lasciato nella cartella di destinazione.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Assicurati che la tua cartella di destinazione non sia la stessa di / o all'interno, la tua cartella di origine o non funzionerà correttamente.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Una volta che HBBatchBeast ha tentato di comprimere un file specifico, aggiungerà quel percorso di file a una cache in modo che non possa essere tentato di nuovo in futuro. Puoi visualizzare / modificare / cancellare la cache usando i pulsanti gialli.","Replace original file always?":"Sostituisci sempre il file originale?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Il file originale verrà sostituito indipendentemente dal fatto che il nuovo file sia più grande o più piccolo.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Di nuovo, assicurati che la tua cartella di destinazione non sia la stessa di / o all'interno, la tua cartella di origine o non funzionerà correttamente.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Una volta che HBBatchBeast ha transcodificato un file specifico, aggiungerà quel percorso di file a una cache in modo che non possa essere tentato di nuovo in futuro. Puoi visualizzare / modificare / cancellare la cache usando i pulsanti gialli.","Copy subtitle (srt) files to destination?":"Copia i file dei sottotitoli (srt) nella destinazione?","Subtitle '.srt' files will be copied to the destination folder automatically.":"I file sottotitoli '.srt' verranno copiati automaticamente nella cartella di destinazione.","Automatically create temporary/destination folders if they don't exist?":"Crea automaticamente cartelle temporanee / di destinazione se non esistono?","Custom bat path to run after each conversion (leave blank if not using):":"Percorso bat personalizzato da eseguire dopo ogni conversione (lasciare vuoto se non si utilizza):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Inserisci il percorso di un file batch personalizzato che desideri eseguire dopo ogni conversione. Per esempio:","Batch files with timeout statements won't work. More info here:":"I file batch con istruzioni di timeout non funzioneranno. Maggiori informazioni qui:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Lascia la casella completamente vuota se non desideri utilizzare questa opzione (assicurati che non ci siano caratteri nascosti nella casella)","Run processes at low priority?":"Esegui processi a bassa priorità?","All conversion processes will be run at low priority, reducing processor usage.":"Tutti i processi di conversione verranno eseguiti a bassa priorità, riducendo l'utilizzo del processore.","Remove apostrophes from filenames:":"Rimuovi gli apostrofi dai nomi dei file:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Le scansioni di conversioni / controllo integrità potrebbero non riuscire se i nomi file hanno apostrofi. Controllare questo per rimuovere automaticamente gli apostrofi dai nomi file."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Questa funzione può cercare file video corrotti usando la funzione '--scan' di HandBrake, sebbene questo non sia sempre accurato. Utilizza anche FFprobe per fornire un secondo punto di riferimento. Se entrambi FFprobe e HandBrake falliscono, c'è un'alta probabilità che il file sia corrotto.","Move corrupt files into the following folder:":"Sposta i file corrotti nella seguente cartella:"," If checked, then any files which give errors will be moved into the specified folder.":"Se selezionato, tutti i file che danno errori verranno spostati nella cartella specificata.","Corrupt file folder:":"Cartella di file danneggiata:","Run thorough file health check:":"Esegui un controllo approfondito dello stato dei file:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Se selezionato, verrà eseguito un controllo dello stato del video molto più lento e più accurato usando FFmpeg invece di HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Basato su 'ScanMedia.ps1' di Desani trovato in:","Attempt to repair files after thorough check:":"Tentare di riparare i file dopo un controllo approfondito:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Se selezionato, HBBatchBeast tenterà di riparare i file usando FFmpeg. Un nuovo file con il suffisso '_repaired' verrà creato nella stessa cartella del file sorgente.","'CRF' value to use when attempting to repair files:":"Valore \"CRF\" da utilizzare quando si tenta di riparare i file:","The default 'CRF' value is 23. Please see the following for more information:":"Il valore predefinito 'CRF' è 23. Per ulteriori informazioni, vedere quanto segue:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"L'intervallo della scala CRF è 0-51, dove 0 è senza perdita, 23 è l'impostazione predefinita e 51 è la peggiore qualità possibile. Un valore più basso generalmente porta a una qualità superiore e un intervallo soggettivamente sensato è 17-28. Considerare 17 o 18 per essere visivamente senza perdita o quasi; dovrebbe sembrare uguale o quasi uguale all'input, ma non è tecnicamente privo di perdite.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast salva un elenco di percorsi di file scansionati segnalati come non corretti. Svuota la cache per eseguire una nuova scansione su tutti i file.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Numero di istanze di HandBrake / FFmpeg simultanee da utilizzare? (Consigliato 4 o meno):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Questa impostazione si applica sia ai processi \"Controllo integrità video\" che \"Scansione e conversione\". Specificare il numero di thread HandBrake da utilizzare. Non c'è un limite, anche se si raccomanda di non usare più di 4. Una quantità maggiore può bloccare il computer se non è molto potente.","Queue size view limit?(Recommended 1000 or fewer):":"Limite di visualizzazione delle dimensioni della coda? (Consigliato 1000 o meno):","Automatically start \"Scan and convert\" when program opened?:":"Avvia automaticamente \"Scan and convert\" quando il programma è aperto ?:","Save verbose logs?:":"Salva log dettagliati ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Seleziona questa casella per salvare i registri dettagliati dei processi secondari. Ciò include l'uscita della console del lavoratore. Ciò causerà log molto grandi.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Inserisci i dettagli della posta elettronica per ricevere notifiche via email se si verifica un errore durante un controllo dello stato di salute o durante la conversione / visualizzazione della cartella. Non funzionerà con account che richiedono 2FA. Devi abilitare l'accesso ad app meno sicure sugli account Gmail.","Email address:":"Indirizzo email:","For example:":"Per esempio:","Email password(not saved):":"Email password (non salvata):","SMTP server:":"Server SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Questa funzione consente il monitoraggio dello stato di conversione / stato di integrità tramite qualsiasi browser Web. Utile durante l'esecuzione di server, ecc. Non vengono inviati nomi di file.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Se abilitato, i seguenti dati anonimi verranno inviati a HBBatchBeast.io:","API key":"Chiave API","Current status ('Searching', 'Running', 'Finished' etc)":"Stato attuale ('Ricerca', 'In esecuzione', 'Finito' ecc.)","Number of:":"Numero di:","Remaining items":"Oggetti rimanenti","Successful items":"Oggetti di successo","Errored items":"Oggetti errati","Cancelled items":"Oggetti cancellati","Worker percentages":"Percentuali del lavoratore","Last completed item time":"Ultima ora dell'elemento completato","Enable remote monitoring?:":"Abilita il monitoraggio remoto ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Un'utilità di benchmark di base costruita principalmente per vedere come i processori core 16+ eseguono utilizzando più istanze di HandBrake sebbene possa essere eseguito su qualsiasi tipo di processore.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Questo scaricherà un file campione di 4k h265 (2,5 MB) ed eseguirà un benchmark usando 4 istanze di HandBrake con preset \"Molto veloce 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"I risultati possono essere caricati su hbbatchbeast.io se si sceglie.","Queue":"Coda","Output this session":"Emetti questa sessione","Media info viewer tool":"Strumento di visualizzazione dei dati multimediali","View replaced file cache":"Visualizza cache dei file sostituiti","Clear replaced file cache":"Cancella la cache dei file sostituiti","Save config":"Salva config","Scan only":"Solo scansione","Scan and convert":"Scansione e conversione","View scan/conversion summary log":"Visualizza il registro di riepilogo scansione / conversione","View individual file check/conversion log":"Visualizza i singoli file di controllo / registro di conversione","View worker console output":"Visualizza l'output della console worker","Health check":"Controllo sanitario","Clear healthy file cache":"Cancella la cache dei file sani","View error log":"Visualizza il log degli errori","Email test":"Test dell'e-mail","View master log":"Visualizza il registro principale","Wiki help":"Aiuto Wiki","An application by HaveAGitGat":"Un'applicazione di HaveAGitGat","New":"Nuovo","Launch":"Lanciare","Benchmark":"segno di riferimento","See results":"Vedere i risultati","Pause queue":"Metti in pausa la coda","Continue queue":"Continua la coda","Stop queue":"Interrompere la coda","Convert selected files":"Converti file selezionati","Toggle queue view":"Attiva la visualizzazione della coda","Deselect all":"Deselezionare tutto","Invert all":"Invertire tutto","Select all":"Seleziona tutto","Toggle output view":"Attiva la visualizzazione di output"}