{"The number of custom presets does not match the number of source folders!":"מספר ההגדרות הקבועות המותאמות אישית אינו תואם למספר התיקיות המקוריות!","source folders have been detected.":"תיקיות המקור אותרו.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"קווי מראש קבוע מראש זוהו. בדוק פעמיים עבור מעברי שורה בלתי נראים. לא צריך להיות נתיב תיקיה אחת או מראש לכל שורה. ודא שלא יצרת בטעות שורה ריקה.","The number of filename suffixes does not match the number of source folders! ":"מספר הסיומות של שם הקובץ אינו תואם למספר התיקיות המקוריות!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"סיומות שם סיומת זוהו. בדוק פעמיים עבור מעברי שורה בלתי נראים. לא צריך להיות נתיב תיקייה אחת או סיומת קובץ בכל שורה. ודא שלא יצרת בטעות שורה ריקה.","The number of source folders does not match the number of destination folders!":"מספר תיקיות המקור אינו תואם למספר תיקיות היעד!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"תיקיות היעד אותרו. בדוק פעמיים עבור מעברי שורה בלתי נראים. צריך להיות נתיב תיקייה אחד בכל שורה. ודא שלא יצרת בטעות שורה ריקה.","The number of source folders does not match the number of temporary conversion folders!":"מספר תיקיות המקור אינו תואם למספר תיקיות ההמרות הזמניות!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"התגלו תיקיות המרה זמניות. בדוק פעמיים עבור מעברי שורה בלתי נראים. צריך להיות נתיב תיקייה אחד בכל שורה. ודא שלא יצרת בטעות שורה ריקה.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"הזן מיכל חוקי כגון '.mp4'. הקפד לכלול את '.'","Corrupt file folder":"תיקיית קבצים פגומה","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"לא קיים! ודא שאין רווחים או תווים מוסתרים לפני / אחרי הנתיב","Source folder":"תיקיית מקור","Temporary conversion folder":"תיקיית המרה זמנית","appears to be the same as or is within source folder":"נראה זהה או בתיקיית המקור","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"אשר ימנע HBBatchBeast מתפקד כראוי. שנה את תיקיית ההמרה הזמנית לתיקייה מחוץ לתיקיית המקור. אם ברצונך להשתמש בתכונה 'החלף קבצים מקוריים', בחר תיקיית יעד שאינה זהה לתיקיית המקור, או בתוך, ולאחר מכן סמן את תיבת הסימון 'החלף קבצים מקוריים תמיד' בקטע ההגדרות המתקדמות . בטל את הסימון בתיבה הזמנית 'תיקיית קבצים זמניים', מכיוון שהיא לא תשתמש במקרה זה. קבצים יומרו לתיקיית היעד ולאחר מכן חזרו לתיקיית המקור.","Destination folder":"תיקיית יעד","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"אשר ימנע HBBatchBeast מתפקד כראוי. שנה את תיקיית היעד לתיקייה מחוץ לתיקיית המקור. אם ברצונך להשתמש בתכונה 'החלף קבצים מקוריים', בחר תיקיית יעד שאינה זהה לתיקיית המקור, או בתוך, ולאחר מכן סמן את תיבת הסימון 'החלף קבצים מקוריים תמיד' בקטע ההגדרות המתקדמות . בטל את הסימון בתיבה הזמנית 'תיקיית קבצים זמניים', מכיוון שהיא לא תשתמש במקרה זה. קבצים יומרו לתיקיית היעד ולאחר מכן חזרו לתיקיית המקור.","Error creating temporary conversion folder":"שגיאה ביצירת תיקיית המרה זמנית","Error creating destination folder":"שגיאה ביצירת תיקיית היעד","Please select to use HandBrake or FFmpeg!":"אנא בחר להשתמש בלם יד או FFmpeg!","Please select a standard preset or input a custom one!":"אנא בחר מראש רגיל או קלט אחד מותאם אישית!","Please select a scan interval of 5 seconds or greater!":"נא לבחור מרווח סריקה של 5 שניות או יותר!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"אנא ודא את מספר מקרים של בלם יד / FFmpeg בו זמנית להשתמש בו הוא אחד או יותר!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"מפתח API לא חוקי! לחץ על 'חדש' בכרטיסייה ניטור מרחוק כדי ליצור מפתח חדש.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"הזן זמן סריקה יומי בתבנית 24 שעות: hh: mm (לדוגמה 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"קבצי המקור ימחקו לאחר השיחה! אנא בדוק לפני השימוש הנכון!","Benchmark failed!":"הסמן נכשל!","Log does not exist!":"יומן אינו קיים!","Folder does not exist!":"התיקייה לא קיימת!","Error sending email! Please check your settings.":"שגיאה בשליחת דוא\"ל! בדוק את ההגדרות שלך.","Test email sent!":"שלח דוא\"ל שנשלח!","All worker processes have been stopped.":"כל תהליכי העובדים הופסקו.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"התור יושהה לאחר השלמת הפריטים הנוכחיים. האם אתה בטוח שברצונך להשהות את התור?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"הלחצן 'השהה' יופעל.המשך יופיע לאחר שכל העובדים יושהו.","Healthy file cache cleared!":"מטמון קובץ בריא פינה!","Cache cleared!":"המטמון נוקה!","Cancel item":"בטל פריט","Please check the above checkbox to use this feature.":"סמן את תיבת הסימון שלמעלה כדי להשתמש בתכונה זו.","Configuration":"תצורה","Source folders":"תיקיות מקור","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"זוהי תיקיית המקור אשר יסרקו עבור מדיה. יש להכניס את התיקייה ללא קו נטוי. לדוגמה:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"תיבת נתיב תיקיית המקור ניתנת להרחבה (הקש enter כדי ליצור שורה חדשה). אם ברצונך לציין מספר תיקיות מקור, ודא שכל נתיב תיקיית מקור נמצא בשורה נפרדת, כגון:","Video health check":"בדיקת בריאות וידאו","Batch conversion and Folder watching":"אצווה המרה ותיקייה צופה","Remote Monitoring (Beta)":"ניטור מרחוק (ביטא)","Benchmark (Beta)":"Benchmark (ביטא)","System":"מערכת","Help":"עזרה","Temporary conversion folders":"תיקיות המרה זמניות","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"אם \"תיקיית המרה זמנית?\" מסומנת, ואז Handbrake יהיה להמיר קבצים לתוך התיקייה. לאחר ההמרה הסתיימה, הקובץ יועבר אל \"תיקיית היעד\" שלך. עליך לציין כמה תיקיות המרה זמניות כתיקיות מקור. תיקיית המקור הראשונה שלך תומר לתיקיית ההמרות הזמנית הראשונה שלך, לתיקיית המקור השני בתיקיית ההמרות הזמנית השנייה וכן הלאה. ודא שכל נתיב תיקיית המרה זמנית נמצא בשורה נפרדת.","Destination folders":"תיקיות יעד","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"ציין נתיבי תיקיית יעד. שוב, עליך לציין כמה תיקיות יעד כמו תיקיות מקור. קבצים מתוך תיקיית המקור הראשון שלך בסופו של דבר בתיקייה היעד הראשון שלך, קבצי המקור השני שלך תיקייה בתיקייה היעד השני שלך וכן הלאה.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"מקור ראשון תיקייה ---------> ראשית תיקיית המרה זמנית ---------> תיקיית היעד הראשון","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"תיקיית מקור שנייה ---------> תיקיית המרה זמנית שנייה ---------> תיקיית היעד השני","etc":"וכו","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatBeast לא יפעל כראוי אם תגדיר את תיקיית היעד זהה, או בתוך, את תיקיית המקור.","Standard preset:":"רגיל מראש:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"בחר מראש את הבלם יד שברצונך להמיר את הקבצים שלך. אם נבחר \"רגיל מוגדר מראש\", אז כל הקבצים בתיקיות שנבחרו יומרו באמצעות מוגדר מראש בלם יד. אתה יכול למצוא עוד על מראש Handbrake כאן:","Custom preset:":"קביעה מותאמת אישית:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"אם \"מותאם אישית מראש\" אז אתה צריך להזין מראש מותאם אישית משלך. HBBatBeast מכסה את \"HandBrakeCLI -i המקור-יעד\" חלק קלט HandBrakeCLI אז אתה צריך להזין את הפרמטרים המרה. לדוגמה:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"אם אתה משתמש ב- FFmpeg, עליך להפריד בין הפרמטרים לקלט ולפלט באמצעות פסיק. כמו:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"אתה יכול גם לקשר מראש מראש כי כבר מיוצא הרשמי יישום HandBrake GUI למשל:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"אם אתה נתקל בבעיות עם presets מותאמים אישית, זה יכול להיות בגלל באג ידוע עם HandBrakeCLI (יהיה קבוע הבא שחרור HandBrakeCLI). עיין בפתרון זמני זה:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"כל preset מותאם אישית צריך להיות על הקו שלו, בדומה לתיקיות, שם צריך להיות כמו presets מותאמות אישית רבות כמו תיקיות המקור.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"מקור ראשון תיקייה ---------> ראשית תיקיית המרה זמנית ---------> תיקיית היעד הראשון @ מותאם אישית מראש 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"תיקיית מקור שנייה ---------> תיקיית המרה זמנית שנייה ---------> תיקיית היעד השני @ Custom preset 2","See the following image for guidance:":"עיין בתמונה הבאה לקבלת הנחיות:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"אם אתה משתמש בקידוד כרטיס גרפי (כגון NVENC), ייתכן שיהיה עליך לצמצם את מספר המופעים של בלם היד (נסה 2 או פחות) עקב מגבלות VRAM.","Select standard preset:":"בחר הגדרה קבועה מראש:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC זוהתה, הקפד להוריד את מספר המופעים של HandBrakeCLI ל -2 או מתחת (עבור רוב כרטיסי המסך) או שתיתקל בשגיאות בשל חוסר VRAM מספיק. הגדרה זו נמצאת בכרטיסייה \"System\" (מערכת).","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"מיובאים מראש. אם אתה נתקל בבעיות עם presets המיובאים המיובאים, זה יכול להיות בגלל באג ידוע עם HandBrakeCLI (יהיה קבוע הבא שחרור HandBrakeCLI). פתרון זמני הוא להסיר את '' PictureRotate ':' 0: 0 '' מקובץ .json. פרטים נוספים:","Container:":"מכולה:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"ציין את המיכל שברצונך שקובץ הפלט יכלול '.mp4'. תוכל למצוא מידע נוסף על מכולות בכתובת:","Enable periodic scanning:":"אפשר סריקה תקופתית:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatBeast יכול לפקח על תיקיות המקור שלך ולהפעיל סריקות עבור קבצים חדשים במרווח שצוין. מרווח הזמן הוא שניות עם ברירת המחדל להיות 300 שניות (5 דקות). אם אפשרות זו נבחרה, ואז כאשר אתה לוחץ על \"סרוק להמיר\", התוכנית יהיה להמיר כל הקבצים החדשים ולאחר מכן טיימר ספירה לאחור יתחיל. זה יהיה לולאה עד אינסוף עד שנעצר. מרווח הסריקה נמצא בקטע ההגדרות המתקדמות.","Enable daily scanning:":"הפעל סריקה יומית:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"במקום סריקה תקופתית, באפשרותך לבחור לסריקה להפעלה פעם ביום. זמן הסריקה מוזן בקטע ההגדרות המתקדמות בפורמט hh: mm כגון '18: 30 '. לאחר בחירת \"סריקה והמרה\", התוכנית תמתין עד הזמן שצוין עד להפעלת סריקה תהליך ההמרה. שוב, זה יהיה לולאה אינסופית עד עצר.","Show/hide advanced:":"הצג / הסתר מתקדם:","Scan interval (minimum 5 seconds):":"מרווח סריקה (מינימום 5 שניות):","Daily run time (hh:mm):":"זמן ריצה יומי (hh: mm):","Output filename suffix:":"סיומת קובץ פלט:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"זה אופציונלי. תוכל לציין סיומת שתוסיף לסוף שם הקובץ שלך כגון '_1080p' או '_testconversion' וכו '.","If 'standard preset' is selected then all output files will have the same suffix.":"אם נבחר \"רגיל מראש\" אז כל קבצי הפלט תהיה אותה סיומת.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"אם 'מותאם אישית קבועה מראש' נבחר אז אתה יכול לציין סיומת אחת לכל תיקיית המקור / מראש מותאם אישית. ודא שכל סיומת היא על הקו שלה. לדוגמה, אם יש לך 2 תיקיות מקור ומשתמשות 'מותאם אישית מראש', אתה יכול לשים את זה בתיבה סיומת שם הקובץ:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"קבצים בתיקייה המקור הראשון יהיה '_720p' נוסף שם קובץ הפלט. קבצים בתיקיית המקור השני יהיה '_1080p' נוסף שם קובץ הפלט וכו '","Include these file types:":"כלול סוגי קבצים אלה:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"הזן את סוגי הקבצים לסריקה. כל סוג צריך להיות מופרדים על ידי פסיק. ערך ברירת המחדל הוא:","Exclude files smaller than (MB):":"אל תכלול קבצים קטנים מ- (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"ציין אם לא לכלול קבצים קטנים יותר בגודל מסוים מההמרה (במגה-בתים)","Exclude files larger than (MB):":"אל תכלול קבצים גדולים מ- (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"ציין אם לא לכלול קבצים גדולים מגודל מסוים מההמרה (במגה-בתים)","Exclude filenames which include any of these words:":"אל תכלול שמות קבצים הכוללים אף אחת מהמילים הבאות:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"הזן מילות מפתח כדי לסנן אותן בעת סריקת קבצים. לדוגמה, אם \"720p\" מוזן, אז כל הקבצים עם \"720p\" בכותרת לא יומרו. שוב, מילות מפתח צריך להיות מופרדים על ידי פסיק. לדוגמה, הזן את תיבת הסימון הבאה:","Include files with any ":"כלול קבצים עם כל"," or all ":"או כל"," of these":"של אלה","properties:":"נכסים:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"כאן אתה יכול קלט וידאו ושמע המאפיינים קבצים חייב להיות מנת להמיר (מידע חילוץ באמצעות FFprobe). יש להפריד בין המאפיינים באמצעות פסיק. השתמש בכלי מציג פרטי המדיה כדי לקבוע אילו מאפיינים ברצונך לכלול. הקפד לשים פסיק לאחר המאפיין האחרון. לדוגמה, רק להמיר קבצים אשר מקודד באמצעות h264 ו שמע סטריאו AAC:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"ראוי לציין כי בדיקת הנכס נעשית לאחר תחילת תהליך ההמרה (כדי לחסוך זמן בעת בניית התור), ולכן למרות הקבצים עשויים להופיע בתור ההמרה, הם יהיו דילוג / כללה אם התנאים הנכונים נפגשו.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"אם FFprobe מסוגל לחלץ מאפיינים, אז 'אישור' יופיע בעמודה \"FFprobe\" בתצוגת תור.","Exclude files with any ":"אל תכלול קבצים עם אף אחד"," of these ":"של אלה","The opposite of 'Include files with any or all of these properties'":"ההפך מ 'כלול קבצים עם כל המאפיינים האלה או כולם'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"זהו כלי קטן כדי לנתח מאפייני קובץ עם כדי לסייע לך לקבוע אילו מאפיינים אתה רוצה לכלול / לא לכלול את האפשרויות לעיל. הוא משתמש FFprobe כדי להחזיר מידע. גרור ושחרר קבצים לתוך התיבה האפורה כדי לנתח אותם. לדוגמה, הצבת קובץ בדיקה עשויה להחזיר את הפרטים הבאים:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"אם אתה מעוניין לבצע אי הכללה של קבצים מהסוג הזה, תוכל להוסיף מספר תכונות קבצים לקובץ \"אל תכלול קבצים עם כל המאפיינים האלה או את כל אלה\", וסמן את תיבת הסימון שליד 'הכל' במקום 'כל' ככה:","Copy excluded files to destination:":"העתק קבצים שלא נכללו ליעד:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"אם תבחר באפשרות זו, הקבצים שיוצאו מהמרה יועתקו ישירות לתיקיית היעד. זה חל על המסננים הבאים:","Exclude filenames which include any of these words":"אל תכלול שמות קבצים הכוללים אף אחת מהמילים האלה","Include files with any or all of these properties":"כלול קבצים עם כל המאפיינים האלה או כולם","Exclude files with any or all of these properties":"אל תכלול קבצים עם כל המאפיינים האלה או כולם","Exclude files smaller than (MB)":"אל תכלול קבצים קטנים מ- (MB)","Exclude files larger than (MB)":"אל תכלול קבצים גדולים מ- (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"הערה זה חל גם על קבצים שלא נכללו כי הם אינם עומדים בתנאי הנכס \"כלול\" של האמור לעיל ולכן לא בטעות להעתיק אתה הספרייה כולה כאשר אתה רק מנסה להמיר כמה קבצים.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"תכונת ההעתקה אינה חלה על המסננים הבאים (כלומר, קבצים שלא נכללו בשל המסנן)","Include these file types":"כלול סוגי קבצים אלה","Delete source files after conversion:":"מחק קובצי מקור לאחר המרה:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"אם זה נבחר, אם ניסיון ההמרה יצליח, קובץ המקור יימחק. תהליך זה נעשה ממש בסוף, לאחר המרה של כל הקבצים. זה אומר שאתה יכול להמיר את קבצי המקור אותו באמצעות presets מרובים, כל אחד ללכת. קבצי המקור יימחקו לאחר מכן.","Replace original file if converted file is smaller?(Compress attempt)":"החלף את הקובץ המקורי אם הקובץ המומר קטן יותר (ניסיון דחיסה)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"בחר בתיבת סימון זו אם ברצונך ש- HBBatchBeast יחליף אוטומטית את קובץ המקור המקורי אם הקובץ החדש קטן יותר. אם הקובץ החדש אינו קטן יותר, הוא יישאר בתיקיית היעד.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"ודא תיקיית היעד שלך אינו זהה / או בתוך, תיקיית המקור שלך או שזה לא יעבוד כראוי.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"לאחר ש- HBBatBeast ניסתה לדחוס קובץ מסוים, היא תוסיף את נתיב הקובץ למטמון כדי שלא תנסה שוב בעתיד. באפשרותך להציג / לערוך / לנקות את המטמון באמצעות הלחצנים הצהובים.","Replace original file always?":"להחליף את הקובץ המקורי תמיד?","The original file will be replaced regardless of whether the new file is larger or smaller.":"הקובץ המקורי יוחלף ללא קשר לשאלה אם הקובץ החדש גדול או קטן יותר.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"שוב, ודא תיקיית היעד שלך אינו זהה / או בתוך, תיקיית המקור שלך או שזה לא יעבוד כראוי.","Copy subtitle (srt) files to destination?":"האם להעתיק קבצי כתוביות (srt) ליעד?","Subtitle '.srt' files will be copied to the destination folder automatically.":"קבצי כתוביות \".srt\" יועתקו אוטומטית לתיקיית היעד.","Automatically create temporary/destination folders if they don't exist?":"ליצור באופן אוטומטי תיקיות זמניות / יעד אם הן אינן קיימות?","Custom bat path to run after each conversion (leave blank if not using):":"נתיב עטלף מותאם אישית לרוץ לאחר כל המרה (השאר ריק אם לא משתמש):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"הזן את הנתיב לקובץ אצווה מותאם אישית שברצונך לבצע לאחר כל המרה. לדוגמה:","Batch files with timeout statements won't work. More info here:":"קבצי אצווה עם הצהרות פסק זמן לא יעבוד. פרטים נוספים:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"השאר את התיבה ריקה לחלוטין אם אינך רוצה להשתמש באפשרות זו (ודא שאין תווים מוסתרים בתיבה)","Run processes at low priority?":"להפעיל תהליכים בעדיפות נמוכה?","All conversion processes will be run at low priority, reducing processor usage.":"כל תהליכי ההמרה יופעלו בעדיפות נמוכה, תוך הפחתת השימוש במעבד.","Remove apostrophes from filenames:":"הסר את האפוסטרופים משמות קבצים:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"בדיקות / בדיקות לבדיקות בריאותיות עלולות להיכשל אם שמות קבצים כוללים גרסאות. בדוק זאת כדי להסיר באופן אוטומטי את האפוסטרופים משמות קבצים."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"תכונה זו יכולה לסרוק קבצי וידאו פגומים באמצעות '--scan' של HandBrake 's תכונה, אם כי זה לא תמיד מדויק. הוא גם משתמש FFprobe לספק נקודת התייחסות שנייה. אם גם FFprobe וגם בלם יד נכשלים אז יש סיכוי גבוה כי הקובץ פגום.","Move corrupt files into the following folder:":"העבר קבצים פגומים לתיקייה הבאה:"," If checked, then any files which give errors will be moved into the specified folder.":"אם מסומנת, כל הקבצים שנותנים שגיאות יועברו לתיקייה שצוינה.","Corrupt file folder:":"תיקיית קבצים פגומה:","Run thorough file health check:":"הפעל בדיקה יסודית של הקובץ:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"אם מסומנת, אז הרבה יותר איטית, בדיקה יסודית יותר בריאות וידאו יפעלו באמצעות FFmpeg במקום בלם יד."," Based on Desani's 'ScanMedia.ps1' found at:":"מבוסס על Desani 'ScanMedia.ps1' נמצא ב:","Attempt to repair files after thorough check:":"ניסיון לתקן קבצים לאחר בדיקה יסודית:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"אם מסומנת, HBBatBeast ינסה לתקן קבצים באמצעות FFmpeg. קובץ חדש עם הסיומת '_repaired' ייווצר באותה תיקייה כמו קובץ המקור.","'CRF' value to use when attempting to repair files:":"'CRF' שיש להשתמש בו בעת ניסיון לתקן קבצים:","The default 'CRF' value is 23. Please see the following for more information:":"ערך ברירת המחדל 'CRF' הוא 23. עיין בפרטים הבאים לקבלת מידע נוסף:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"הטווח של סולם CRF הוא 0-51, כאשר 0 הוא lossless, 23 הוא ברירת המחדל, ו 51 הוא באיכות הגרוע ביותר האפשרי. ערך נמוך בדרך כלל מוביל לאיכות גבוהה יותר, טווח סובייקטיבי סובייקטיבי הוא 17-28. שקול 17 או 18 כדי להיות חסר אונים חזותית או כמעט כך; זה צריך להיראות זהה או כמעט זהה קלט אבל זה לא טכנית lossless.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatBeast שומר רשימה של נתיבי קבצים סרוקים דיווחו כמו לא מושחתים. נקה את המטמון כדי לבצע סריקה חדשה על כל הקבצים.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"מספר מקרים של HandBrake / FFmpeg בו זמנית (מומלץ 4 או פחות):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"הגדרה זו חלה הן על התהליכים \"בדיקת בריאות וידאו\" והן על \"סריקה והמרה\". ציין את מספר פתילי הבלם לשימוש. אין מקסימום למרות שזה מומלץ לא להשתמש יותר מ 4. כמות גבוהה יותר עשוי להקפיא את המחשב אם זה לא חזק מאוד.","Queue size view limit?(Recommended 1000 or fewer):":"מגבלת תצוגת גודל התור (מומלץ 1000 או פחות):","Automatically start \"Scan and convert\" when program opened?":"להתחיל באופן אוטומטי \"סריקה להמיר\" כאשר התוכנית נפתחה?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"מלא פרטי דוא\"ל כדי לקבל הודעות דוא\"ל אם אירעה שגיאה במהלך בדיקת בריאות או המרה / צפייה בתיקייה. לא יפעל עם חשבונות הדורשים 2FA. עליך לאפשר גישה לאפליקציות פחות מאובטחות בחשבונות Gmail.","Email address:":"כתובת דוא\"ל:","For example:":"לדוגמה:","Email password(not saved):":"סיסמת דוא\"ל (לא נשמרה):","SMTP server:":"שרת SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"תכונה זו מאפשרת ניטור של מצב ההמרה / בריאות לבדוק באמצעות כל דפדפן אינטרנט. שימושי בעת הפעלת שרתים וכו '","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"אם מאופשר, הנתונים האנונימיים הבאים יישלחו אל HBBatBeast.io:","API key":"מפתח API","Current status ('Searching', 'Running', 'Finished' etc)":"סטטוס נוכחי ('חיפוש', 'ריצה', 'סיום' וכו ')","Number of:":"מספר של:","Remaining items":"פריטים שנותרו","Successful items":"פריטים מצליחים","Errored items":"פריטים שנמחקו","Cancelled items":"פריטים שהוסרו","Worker percentages":"אחוזי עובדים","Last completed item time":"זמן השלים האחרון של הפריט","Enable remote monitoring?:":"אפשר ניטור מרחוק ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"כלי בסיסי בהשוואות בנוי בעיקר כדי לראות איך 16 + מעבדי הליבה לבצע באמצעות מקרים מרובים בלם יד אם כי ניתן להפעיל על כל סוג של מעבד.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"זה יוריד h265 4k קובץ מדגם (2.5MB) ולהפעיל benchmark באמצעות 4 מקרים עם בלם מראש \"מהר מאוד 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"תוצאות ניתן לטעון hbbatchbeast.io אם תבחר.","Queue":"תור","Output this session":"פלט הפגישה הזו","Media info viewer tool":"כלי מציג מידע מדיה","View compress attempt cache":"הצג מטמון ניסיונות לדחוס","Clear compress attempt cache":"נקה מטמון ניסיון לדחוס","Save config":"שמור את התצורה","Scan only":"סריקה בלבד","Scan and convert":"סרוק להמיר","View scan/conversion summary log":"הצג יומן סיכום סריקה / המרה","View individual file check/conversion log":"הצג קובץ בודדים של המחאה / יומן המרה","View worker console output":"הצג פלט קונסולת עובד","Health check":"בדיקת בריאות","Clear healthy file cache":"נקה מטמון קובץ בריא","View error log":"הצג יומן שגיאות","Email test":"בדיקת אימייל","View master log":"הצג יומן ראשי","Wiki help":"ויקי עזרה","An application by HaveAGitGat":"יישום על ידי HaveAGitGat","New":"חדש","Launch":"הפעלה","Benchmark":"בנצ'מרק","See results":"ראה תוצאות","Pause queue":"השהה תור","Continue queue":"המשך בתור","Stop queue":"עצור בתור","Convert selected files":"המרת קבצים נבחרים","Toggle queue view":"לתצוגת תור בתור","Deselect all":"הסר סימון מהכל","Invert all":"הפוך את כל","Select all":"בחר הכל","Toggle output view":"הפעל את תצוגת הפלט"}