{"The number of custom presets does not match the number of source folders!":"カスタムプリセットの数はソースフォルダの数と一致しません。","source folders have been detected.":"ソースフォルダが検出されました。","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"カスタムプリセットラインが検出されました。見えない改行を再確認してください。 1行に1つのフォルダパスまたはプリセットがあるはずです。誤って空白行を作成していないことを確認してください。","The number of filename suffixes does not match the number of source folders! ":"ファイル名の接尾辞の数がソースフォルダの数と一致しません。","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"ファイル名のサフィックス行が検出されました。見えない改行を再確認してください。 1行に1つのフォルダパスまたはファイル名の接尾辞が必要です。誤って空白行を作成していないことを確認してください。","The number of source folders does not match the number of destination folders!":"コピー元フォルダの数がコピー先フォルダの数と一致しません。","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"宛先フォルダが検出されました。見えない改行を再確認してください。 1行に1つのフォルダパスがあるはずです。誤って空白行を作成していないことを確認してください。","The number of source folders does not match the number of temporary conversion folders!":"ソースフォルダの数が一時変換フォルダの数と一致しません。","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"一時変換フォルダが検出されました。見えない改行を再確認してください。 1行に1つのフォルダパスがあるはずです。誤って空白行を作成していないことを確認してください。","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"「.mp4」などの有効なコンテナを入力してください。必ず「。」を含めてください。","Corrupt file folder":"破損したファイルフォルダー","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"存在しない！パスの前後にスペースや隠し文字がないことを確認してください。","Source folder":"ソースフォルダ","Temporary conversion folder":"一時変換フォルダ","appears to be the same as or is within source folder":"ソースフォルダと同じか、ソースフォルダ内にある","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"HBBatchBeastが正しく機能しなくなります。一時変換フォルダをソースフォルダ以外のフォルダに変更してください。 [元のファイルを置き換える]機能を使用する場合は、元のフォルダーと同じ、またはその中にない保存先フォルダーを選択し、詳細設定セクションの[常に元のファイルを置き換える]チェックボックスをオンにします。 。この場合は無効になるため、一時的な[一時変換フォルダ]チェックボックスをオフにします。ファイルは移動先のフォルダに変換されてから移動元のフォルダに戻されます。","Destination folder":"移動先フォルダ","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"HBBatchBeastが正しく機能しなくなります。コピー先フォルダをコピー元フォルダ以外のフォルダに変更してください。 [元のファイルを置き換える]機能を使用する場合は、元のフォルダーと同じ、またはその中にない保存先フォルダーを選択し、詳細設定セクションの[常に元のファイルを置き換える]チェックボックスをオンにします。 。この場合は無効になるため、一時的な[一時変換フォルダ]チェックボックスをオフにします。ファイルは移動先のフォルダに変換されてから移動元のフォルダに戻されます。","Error creating temporary conversion folder":"一時変換フォルダの作成エラー","Error creating destination folder":"保存先フォルダの作成エラー","Please select to use HandBrake or FFmpeg!":"HandBrakeまたはFFmpegを選択してください。","Please select a standard preset or input a custom one!":"標準のプリセットを選択するか、カスタムのプリセットを入力してください。","Please select a scan interval of 5 seconds or greater!":"5秒以上のスキャン間隔を選択してください。","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"同時に使用するHandBrake / FFmpegインスタンスの数が1以上であることを確認してください。","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"無効なAPIキーです。新しいキーを生成するには、リモートモニタリングタブの[新規]をクリックしてください。","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"毎日のスキャン時間を24時間形式で入力してください：hh：mm（たとえば13:02）","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"ソースファイルは変換後に削除されます。適切に使用する前にテストしてください。","Benchmark failed!":"ベンチマークは失敗しました！","Log does not exist!":"ログが存在しません！","Folder does not exist!":"フォルダが存在しません。","Error sending email! Please check your settings.":"メール送信エラーです。設定を確認してください。","Test email sent!":"テストメールを送信しました。","All worker processes have been stopped.":"すべてのワーカープロセスが停止しました。","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"現在のアイテムの処理が完了すると、キューは一時停止します。キューを一時停止してよろしいですか？","Queue pause initiated.'Continue' button will appear once all workers have paused.":"キューの一時停止が開始されました。すべての作業者が一時停止すると、[続行]ボタンが表示されます。","Healthy file cache cleared!":"正常なファイルキャッシュがクリアされました。","Cache cleared!":"キャッシュがクリアされました。","Cancel item":"アイテムをキャンセル","Please check the above checkbox to use this feature.":"この機能を使用するには、上記のチェックボックスをオンにしてください。","Configuration":"設定","Source folders":"ソースフォルダ","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"これはメディアのスキャン対象となるソースフォルダです。フォルダーは末尾にスラッシュを付けずに入力する必要があります。例えば：","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"ソースフォルダのパスボックスは拡張可能です（Enterを押して新しい行を作成します）。複数のソースフォルダを指定する場合は、各ソースフォルダのパスが次のようにそれぞれ独自の行にあるようにします。","Video health check":"ビデオヘルスチェック","Batch conversion and Folder watching":"バッチ変換とフォルダ監視","Remote Monitoring (Beta)":"リモートモニタリング（ベータ版）","Benchmark (Beta)":"ベンチマーク（ベータ版）","System":"システム","Help":"助けて","Temporary conversion folders":"一時変換フォルダ","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"「仮変換フォルダ」の場合がチェックされると、HandBrakeはファイルをそのフォルダに変換します。変換が完了すると、ファイルはあなたの \"Destination folder\"に移動されます。ソースフォルダと同じ数の一時変換フォルダを指定する必要があります。最初のソースフォルダは最初の一時変換フォルダに、2番目のソースフォルダは2番目の一時変換フォルダにというように変換されます。各一時変換フォルダのパスが必ず独自の行にあるようにしてください。","Destination folders":"インストール先フォルダ","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"保存先フォルダのパスを指定します。繰り返しますが、ソースフォルダと同じ数の宛先フォルダを指定する必要があります。あなたの最初のソースフォルダからのファイルはあなたの最初のコピー先フォルダ、あなたの2番目のコピー先フォルダの中のあなたの2番目のコピー元フォルダのファイルになるでしょう。","First source folder ---------> First temporary conversion folder ---------> First destination folder":"最初の移動元フォルダ--------->最初の一時変換フォルダ--------->最初の移動先フォルダ","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"第2移動元フォルダ--------->第2一時変換フォルダ--------->第2移動先フォルダ","etc":"等","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"コピー先フォルダをコピー元フォルダと同じ、またはコピー元フォルダ内に設定した場合、HBBatchBeastは正しく機能しません。","Standard preset:":"標準プリセット","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"ファイルの変換に使用したいHandBrakeプリセットを選択してください。 「標準プリセット」を選択した場合は、選択したフォルダ内のすべてのファイルが指定のHandBrakeプリセットを使用して変換されます。 HandBrakeプリセットの詳細については、こちらを参照してください。","Custom preset:":"カスタムプリセット：","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"「カスタムプリセット」の場合は、独自のカスタムプリセットを入力する必要があります。 HBBatchBeastはHandBrakeCLI入力の「HandBrakeCLI -i source -o destination」の部分をカバーしているので、変換パラメーターを入力する必要があります。例えば：","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"FFmpegを使用している場合は、入力パラメータと出力パラメータをカンマで区切る必要があります。といった：","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"また、公式HandBrake GUIアプリケーションからエクスポートされたカスタムプリセットにリンクすることもできます。","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"カスタムプリセットで問題がある場合は、HandBrakeCLIの既知のバグが原因である可能性があります（次のHandBrakeCLIリリースで修正される予定です）。一時的な解決方法についてはこちらをご覧ください。","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"各カスタムプリセットはそれぞれ独自の行に配置する必要があり、フォルダと同様に、ソースフォルダと同じ数のカスタムプリセットが必要です。","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"最初のソースフォルダ--------->最初の一時変換フォルダ--------->最初のコピー先フォルダ@カスタムプリセット1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"2番目のソースフォルダ---------> 2番目の一時変換フォルダ---------> 2番目の宛先フォルダ@カスタムプリセット2","See the following image for guidance:":"次の図を参考にしてください。","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"グラフィックカードのエンコーディング（NVENCなど）を使用している場合は、VRAMの制限のためにHandBrakeインスタンスの数を減らす必要があるかもしれません（2以下を試してください）。","Select standard preset:":"標準プリセットを選択してください：","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENCが検出しました。HandBrakeCLIインスタンスの数を必ず2以下に減らすようにしてください（ほとんどのグラフィックスカードの場合）。VRAMが足りないためにエラーが発生する可能性があります。この設定は[システム]タブにあります。","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"インポートされたプリセットが検出されました。インポートされたカスタムプリセットで問題がある場合は、HandBrakeCLIの既知のバグが原因である可能性があります（次のHandBrakeCLIリリースで修正される予定です）。一時的な解決策は、.jsonファイルから '\"PictureRotate\"： \"0：0\"'を削除することです。詳細はこちら：","Container:":"容器：","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"出力ファイルに含めるコンテナを「.mp4」のように指定します。コンテナーの詳細については、次のサイトを参照してください。","Enable periodic scanning:":"定期スキャンを有効にします。","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeastはあなたのソースフォルダを監視し、指定された間隔で新しいファイルのスキャンを実行することができます。インターバル時間は秒単位で、デフォルトは300秒（5分）です。このオプションが選択されている場合、「スキャンして変換」を押すと、プログラムは新しいファイルを変換してからカウントダウンタイマーが始まります。これは停止するまで無限にループします。スキャン間隔は詳細設定セクションにあります。","Enable daily scanning:":"毎日のスキャンを有効にします。","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"定期的なスキャンの代わりに、スキャンを1日に1回実行するように選択できます。スキャン時間は、「詳細設定」セクションに「18：30」などのhh：mm形式で入力されます。 「スキャンと変換」を選択すると、プログラムはスキャンと変換プロセスを実行するまで指定された時間まで待ちます。繰り返しますが、これは停止するまで無限にループします。","Show/hide advanced:":"詳細表示/非表示","Scan interval (minimum 5 seconds):":"スキャン間隔（最小5秒）：","Daily run time (hh:mm):":"毎日の実行時間（hh：mm）：","Output filename suffix:":"出力ファイル名の接尾辞：","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"これはオプションです。 '_1080p'や '_testconversion'などのように、ファイル名の末尾に追加するサフィックスを指定できます。","If 'standard preset' is selected then all output files will have the same suffix.":"「標準プリセット」が選択されている場合、すべての出力ファイルは同じサフィックスを持ちます。","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"「カスタムプリセット」を選択した場合は、ソースフォルダ/カスタムプリセットごとに1つのサフィックスを指定できます。各接尾辞がそれぞれ独自の行にあるようにしてください。たとえば、2つのソースフォルダがあり、「カスタムプリセット」を使用している場合は、これをファイル名のサフィックスボックスに入れます。","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"最初のソースフォルダ内のファイルには、出力ファイル名に '_720p'が追加されます。 2番目のソースフォルダ内のファイルは、出力ファイル名などに '_1080p'が追加されます。","Include these file containers:":"これらのファイルコンテナを含めます：","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"スキャンするファイルコンテナを入力してください。各タイプはカンマで区切る必要があります。デフォルトのエントリは次のとおりです。","Exclude files smaller than (MB):":"（MB）より小さいファイルを除外します。","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"特定のサイズより小さいファイルを変換から除外するかどうかを指定します（メガバイト単位）。","Exclude files larger than (MB):":"（MB）より大きいファイルを除外します。","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"特定のサイズより大きいファイルを変換から除外するかどうかを指定します（メガバイト単位）。","Exclude filenames which include any of these words:":"これらの単語のいずれかを含むファイル名を除外してください。","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"ファイルをスキャンするときに除外するキーワードを入力します。たとえば、「720p」と入力した場合、タイトルに「720p」が含まれているファイルは変換されません。キーワードもカンマで区切る必要があります。たとえば、フィルタボックスに次のように入力します。","Include files with any ":"anyを含むファイルを含める"," or all ":"または全部"," of these":"これらの","properties:":"プロパティ：","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"ここでは変換するためにファイルが持っていなければならないビデオとオーディオのプロパティを入力することができます（FFprobeを使って抽出された情報）。プロパティはカンマで区切る必要があります。メディア情報ビューアツールを使用して、どのプロパティを含めたいかを判断します。最後のプロパティーの後に必ずコンマを入れてください。たとえば、h264とaacステレオオーディオを使用してエンコードされたファイルのみを変換するには、次のようにします。","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"変換処理が開始されると（キューの構築時に時間を節約するために）このプロパティチェックが行われるため、変換キューにファイルが表示されることがありますが、正しい条件が満たされるとスキップされます。","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"FFprobeがプロパティを抽出できる場合は、キュービューの[FFprobe]列に「OK」と表示されます。","Exclude files with any ":"anyでファイルを除外する"," of these ":"これらの","The opposite of 'Include files with any or all of these properties'":"「これらのプロパティの一部または全部を含むファイルを含める」の反対","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"これはファイルのプロパティを分析するための小さなツールで、上記のオプションにどのプロパティを含めるか除外するかを決めるのに役立ちます。それは情報を返すためにFFprobeを使います。ファイルをグレーのボックスにドラッグアンドドロップして分析します。たとえば、テストファイルをドロップインすると、次のようになります。","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"このようなファイルを変換対象から除外するには、いくつかのファイルプロパティを[これらのプロパティの一部またはすべてを含むファイルを除外する]ボックスに追加し、[any]ではなく[all]の横のチェックボックスをオンにします。そのようです：","Copy excluded files to destination:":"除外ファイルをコピー先にコピーします。","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"このオプションを選択した場合、変換から除外されたファイルは直接保存先フォルダにコピーされます。これは以下のフィルタに適用されます。","Exclude filenames which include any of these words":"これらの単語のいずれかを含むファイル名を除外する","Include files with any or all of these properties":"これらのプロパティの一部または全部を含むファイルを含める","Exclude files with any or all of these properties":"これらのプロパティの一部または全部を持つファイルを除外する","Exclude files smaller than (MB)":"（MB）より小さいファイルを除外する","Exclude files larger than (MB)":"（MB）より大きいファイルを除外する","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"これは除外されたファイルにも当てはまることに注意してください。これらは上記の \"Include\"プロパティ条件を満たしていないので、少数のファイルを変換しようとしているときに誤ってライブラリ全体をコピーしないでください。","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"コピー機能は、以下のフィルタには適用されません（つまり、フィルタにより除外されたファイル）。","Include these file types":"これらのファイルの種類を含める","Delete source files after conversion:":"変換後にソースファイルを削除します。","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"これが選択されている場合、変換の試みが成功すると、ソースファイルは削除されます。このプロセスは、すべてのファイルの変換後、最後に行われます。つまり、同じソースファイルを複数のプリセットを使って一度に変換できます。その後、ソースファイルは削除されます。","Replace original file if converted file is smaller?(Compress attempt)":"変換後のファイルが小さい場合は元のファイルを置き換えますか？（圧縮の試み）","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"新しいファイルが小さい場合にHBBatchBeastで元のソースファイルを自動的に置き換える場合は、このチェックボックスをオンにします。新しいファイルがそれより小さくない場合は、保存先フォルダに残ります。","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"コピー先のフォルダがコピー元のフォルダと同じでない、または正しくコピーされないことを確認してください。","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeastが特定のファイルを圧縮しようとすると、そのファイルパスがキャッシュに追加されるため、今後は再試行されません。黄色のボタンを使ってキャッシュを表示/編集/消去することができます。","Replace original file always?":"元のファイルを常に置き換えますか？","The original file will be replaced regardless of whether the new file is larger or smaller.":"新しいファイルが大きいか小さいかに関係なく、元のファイルは置き換えられます。","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"繰り返しますが、コピー先のフォルダがコピー元のフォルダと同じでない、または正しくコピーされないことを確認してください。","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeastが特定のファイルをトランスコードすると、そのファイルパスをキャッシュに追加して、今後再試行されないようにします。黄色のボタンを使ってキャッシュを表示/編集/消去することができます。","Copy subtitle (srt) files to destination?":"字幕（srt）ファイルをコピー先にコピーしますか？","Subtitle '.srt' files will be copied to the destination folder automatically.":"字幕の '.srt'ファイルは自動的にコピー先のフォルダにコピーされます。","Automatically create temporary/destination folders if they don't exist?":"存在しない場合は、一時フォルダ/保存先フォルダを自動的に作成しますか？","Custom bat path to run after each conversion (leave blank if not using):":"各変換後に実行するカスタムbatパス（使用しない場合は空白のままにします）。","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"各変換後に実行するカスタムバッチファイルへのパスを入力します。例えば：","Batch files with timeout statements won't work. More info here:":"タイムアウト文を含むバッチファイルは機能しません。詳細はこちら：","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"このオプションを使用したくない場合は、ボックスを完全に空のままにしてください（ボックスに隠れた文字がないことを確認してください）。","Run processes at low priority?":"低い優先順位でプロセスを実行しますか？","All conversion processes will be run at low priority, reducing processor usage.":"すべての変換プロセスは低い優先順位で実行され、プロセッサーの使用量を削減します。","Remove apostrophes from filenames:":"ファイル名からアポストロフィを削除します。","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"ファイル名にアポストロフィが含まれていると、変換/ヘルスチェックスキャンが失敗する可能性があります。ファイル名からアポストロフィを自動的に削除するには、これをチェックします。"," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"この機能はHandBrakeの '--scan'機能を使用して破損したビデオファイルをスキャンできますが、これは必ずしも正確ではありません。また、FFprobeを使用して2番目の参照点を提供します。 FFprobeとHandBrakeの両方が失敗した場合は、ファイルが破損している可能性が高いです。","Move corrupt files into the following folder:":"破損したファイルを次のフォルダに移動します。"," If checked, then any files which give errors will be moved into the specified folder.":"チェックした場合、エラーが発生したファイルは指定されたフォルダに移動されます。","Corrupt file folder:":"破損したファイルフォルダ：","Run thorough file health check:":"徹底的なファイルヘルスチェックを実行します。"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"チェックすると、HandBrakeの代わりにFFmpegを使って、もっと遅くてより徹底的なビデオヘルスチェックが実行されます。"," Based on Desani's 'ScanMedia.ps1' found at:":"Desaniの「ScanMedia.ps1」に基づきます。","Attempt to repair files after thorough check:":"徹底的なチェックの後にファイルを修復しようとします。"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"チェックすると、HBBatchBeastはFFmpegを使ってファイルの修復を試みます。接尾辞 '_repaired'を持つ新しいファイルが、ソースファイルと同じフォルダに作成されます。","'CRF' value to use when attempting to repair files:":"ファイルを修復しようとするときに使用する 'CRF'値：","The default 'CRF' value is 23. Please see the following for more information:":"デフォルトの 'CRF'値は23です。詳細については、以下を参照してください。","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"CRFスケールの範囲は0〜51です。0は無損失、23はデフォルト、51は最悪の品質です。一般的に値が低いほど高品質になり、主観的に見て良い範囲は17〜28です。 17または18を視覚的に無損失またはほぼ無損失であると考えてください。入力と同じかほぼ同じに見えるはずですが、技術的に無損失ではありません。","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeastは、破損していないと報告されたスキャン済みファイルパスのリストを保存します。キャッシュをクリアして、すべてのファイルに対してフレッシュスキャンを実行します。","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"同時に使用するHandBrake / FFmpegインスタンスの数？（推奨4以下）","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"この設定は、「ビデオヘルスチェック」と「スキャンと変換」の両方のプロセスに適用されます。使用するHandBrakeスレッドの数を指定してください。それは4以上を使用しないことをお勧めしますが最大値はありません。それが非常に強力でない場合、より高い量はあなたのコンピュータを凍らせるかもしれません。","Queue size view limit?(Recommended 1000 or fewer):":"キューサイズの表示制限？（1000以下を推奨）","Automatically start \"Scan and convert\" when program opened?:":"プログラムが開いたときに「スキャンして変換」を自動的に開始しますか？","Save verbose logs?:":"詳細ログを保存しますか？：","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"詳細なサブプロセスログを保存するには、このチェックボックスをオンにします。これにはワーカーコンソールの出力が含まれます。これは非常に大きいログを引き起こします。","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"ヘルスチェックまたはコンバージョン/フォルダの監視中にエラーが発生した場合は、電子メールの詳細を入力して電子メール通知を受信します。 2FAを必要とするアカウントでは動作しません。 Gmailアカウントでセキュリティの低いアプリへのアクセスを有効にする必要があります。","Email address:":"電子メールアドレス：","For example:":"例えば：","Email password(not saved):":"メールパスワード（保存されていません）：","SMTP server:":"SMTPサーバー","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"この機能により、任意のWebブラウザを使用してコンバージョン/ヘルスチェックのステータスを監視できます。サーバーなどを実行しているときに便利です。ファイル名は送信されません。","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"有効にすると、次の匿名データがHBBatchBeast.ioに送信されます。","API key":"APIキー","Current status ('Searching', 'Running', 'Finished' etc)":"現在のステータス（「検索中」、「実行中」、「完了」など）","Number of:":"の数：","Remaining items":"残りの商品","Successful items":"成功したアイテム","Errored items":"エラー項目","Cancelled items":"キャンセルされた商品","Worker percentages":"労働者の割合","Last completed item time":"最後に完了した商品の時間","Enable remote monitoring?:":"リモート監視を有効にしますか？","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"基本的なベンチマークユーティリティは、16種類以上のコアプロセッサが複数のHandBrakeインスタンスを使用してどのように動作するかを確認するために主に構築されていますが、あらゆる種類のプロセッサで実行できます。","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"これにより、h265 4kサンプルファイル（2.5MB）がダウンロードされ、プリセット \"Very Fast 1080p30\"の4つのHandBrakeインスタンスを使用してベンチマークが実行されます。","Results can be uploaded to hbbatchbeast.io if you choose.":"選択した場合は、結果をhbbatchbeast.ioにアップロードできます。","Queue":"キュー","Output this session":"このセッションを出力する","Media info viewer tool":"メディア情報ビューアツール","View replaced file cache":"置き換えられたファイルキャッシュを表示する","Clear replaced file cache":"置き換えられたファイルキャッシュを消去する","Save config":"設定を保存","Scan only":"スキャンのみ","Scan and convert":"スキャンして変換する","View scan/conversion summary log":"スキャン/コンバージョンサマリログを表示する","View individual file check/conversion log":"個々のファイルチェック/変換ログを見る","View worker console output":"ワーカーコンソールの出力を表示する","Health check":"健康診断","Clear healthy file cache":"正常なファイルキャッシュを消去する","View error log":"エラーログを表示する","Email test":"メールテスト","View master log":"マスターログを表示する","Wiki help":"Wikiヘルプ","An application by HaveAGitGat":"HaveAGitGatによるアプリケーション","New":"新しい","Launch":"起動する","Benchmark":"基準","See results":"結果を見る","Pause queue":"キューを一時停止","Continue queue":"続行キュー","Stop queue":"停止キュー","Convert selected files":"選択したファイルを変換する","Toggle queue view":"キュービューを切り替える","Deselect all":"すべての選択を解除","Invert all":"すべて反転","Select all":"すべて選択","Toggle output view":"出力ビューを切り替える"}