{"The number of custom presets does not match the number of source folders!":"საბაჟო presets არ წყვეტს წყაროს ფოლდერების რაოდენობა!","source folders have been detected.":"წყაროების ფოლდერები აღმოაჩინეს.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"საბაჟო წინასწარ ხაზები იქნა აღმოჩენილი. გთხოვთ შეამოწმოთ უხილავი ხაზის წყვეტები. უნდა იყოს ერთი ფოლდერი გზა ან წინასწარ თითო ხაზი. დარწმუნდით, რომ თქვენ არ გაქვთ შემთხვევით შექმნილი ცარიელი ხაზი.","The number of filename suffixes does not match the number of source folders! ":"ფაილის წარწერების რაოდენობა არ ემთხვევა წყაროს საქაღალდეების რაოდენობას!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"აღმოჩენილია filename suffix ხაზები. გთხოვთ შეამოწმოთ უხილავი ხაზის წყვეტები. უნდა არსებობდეს ერთი ფოლდერი გზა ან ფაილის სახელი თითო ხაზზე. დარწმუნდით, რომ თქვენ არ გაქვთ შემთხვევით შექმნილი ცარიელი ხაზი.","The number of source folders does not match the number of destination folders!":"წყაროს საქაღალდეების რაოდენობა არ დაემთხვევა დანიშნულების საქაღალდეების რაოდენობას!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"დანიშნულების ფოლდერები აღმოაჩინეს. გთხოვთ შეამოწმოთ უხილავი ხაზის წყვეტები. ერთი ხაზი უნდა იყოს ხაზის თითო ხაზზე. დარწმუნდით, რომ თქვენ არ გაქვთ შემთხვევით შექმნილი ცარიელი ხაზი.","The number of source folders does not match the number of temporary conversion folders!":"წყაროს საქაღალდეების რაოდენობა არ ემთხვევა დროებითი კონვერსიის საქაღალდეების რაოდენობას!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"დროებითი კონვერტაციის ფოლდერები აღმოაჩინეს. გთხოვთ შეამოწმოთ უხილავი ხაზის წყვეტები. ერთი ხაზი უნდა იყოს ხაზის თითო ხაზზე. დარწმუნდით, რომ თქვენ არ გაქვთ შემთხვევით შექმნილი ცარიელი ხაზი.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"გთხოვთ შეიყვანოთ სწორი კონტეინერი, როგორიცაა '.mp4'. დარწმუნდით, რომ შეიცავდეს '.'","Corrupt file folder":"კორუმპირებული ფაილის საქაღალდე","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"არ არსებობს! გთხოვთ, დარწმუნდეთ, რომ არ არსებობს სივრცეები ან დამალული სიმბოლოები გზაზე / ადრე","Source folder":"წყარო საქაღალდე","Temporary conversion folder":"დროებითი კონვერტაციის საქაღალდე","appears to be the same as or is within source folder":"როგორც ჩანს, იგივეა, ან წყაროებიდან","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"რომელიც ხელს შეუშლის HBBatchBeast ფუნქციონირების სწორად. გთხოვთ, შეცვალოთ დროებითი კონვერტაციის საქაღალდე საქაღალდის გარე საქაღალდეში. თუ გსურთ გამოიყენოთ \"ორიგინალი ფაილების ფუნქციის ჩანაცვლება\", გთხოვთ, დანიშნოთ დანიშნულების საქაღალდე, რომელიც არ არის იგივე, ან შიგნით, წყაროს საქაღალდეში და შემდეგ შეამოწმეთ \"თავდაპირველი ფაილების ჩანაცვლება ყოველთვის\" . შეამოწმეთ დროებითი \"დროებითი კონვერტაციის საქაღალდე\" ჩამრთველი, როგორც ეს არ გამოიყენებს ამ შემთხვევაში. ფაილები კონვერტირდება დანიშნულების საქაღალდეში და შემდეგ დააბრუნებს წყარო საქაღალდეში.","Destination folder":"Დანიშნულების საქაღალდე","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"რომელიც ხელს შეუშლის HBBatchBeast ფუნქციონირების სწორად. გთხოვთ შეცვალოთ დანიშნულების საქაღალდე საქაღალდის გარე საქაღალდეში. თუ გსურთ გამოიყენოთ \"ორიგინალი ფაილების ფუნქციის ჩანაცვლება\", გთხოვთ, აირჩიოთ დანიშნულების საქაღალდე, რომელიც არ არის იგივე, ან შიგნით, წყაროს საქაღალდეში და შემდეგ შეამოწმეთ \"თავდაპირველი ფაილების ჩანაცვლება ყოველთვის\" . შეამოწმეთ დროებითი \"დროებითი კონვერტაციის საქაღალდე\" ჩამრთველი, როგორც ეს არ გამოიყენებს ამ შემთხვევაში. ფაილები კონვერტირდება დანიშნულების საქაღალდეში და შემდეგ დააბრუნებს წყარო საქაღალდეში.","Error creating temporary conversion folder":"დროებითი კონვერტაციის საქაღალდის შექმნის შეცდომა","Error creating destination folder":"დანიშნულების საქაღალდის შექმნის შეცდომა","Please select to use HandBrake or FFmpeg!":"გთხოვთ, აირჩიოთ ხელით ან FFmpeg!","Please select a standard preset or input a custom one!":"გთხოვთ, აირჩიოთ სტანდარტული წინასწარ ან შეყვანის საბაჟო!","Please select a scan interval of 5 seconds or greater!":"გთხოვთ, აირჩიოთ სკანირების ინტერვალი 5 წამის ან მეტი!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"გთხოვთ დარწმუნდეთ იმაში, რომ ერთდროულად HandBrake / FFmpeg შემთხვევების რაოდენობა არის ერთი ან მეტი!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"არასწორი API გასაღები! გთხოვთ, დააჭირეთ ახალ ღილაკს \"ახალი\" დისტანციური მონიტორინგისთვის, რათა შეიქმნას ახალი გასაღები.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"გთხოვთ, შეიყვანოთ ყოველდღიური სკანირების დრო 24 საათიანი ფორმატით: hh: mm (მაგალითად 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"SOURCE FILES დაიშლება შემდეგ კონვერტაციის! გთხოვთ, გამოვიყენოთ შესაბამისი გამოყენება!","Benchmark failed!":"ბენჩმარკი ვერ მოხერხდა!","Log does not exist!":"შესვლა არ არსებობს!","Folder does not exist!":"საქაღალდე არ არსებობს!","Error sending email! Please check your settings.":"ელ.ფოსტის გაგზავნის შეცდომა! გთხოვთ, შეამოწმოთ თქვენი პარამეტრები.","Test email sent!":"ელფოსტის ტესტი გამოგზავნილია!","All worker processes have been stopped.":"ყველა სამუშაო პროცესი შეჩერდა.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Queue იქნება შეჩერებული ერთხელ მიმდინარე ელემენტი დასრულდა გადამუშავება. დარწმუნებული ხართ, რომ გსურთ პაუზა?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Queue პაუზის ინიციატივით. 'კონტაინი' ღილაკი გამოჩნდება ერთხელ ყველა მუშები შეჩერებულია.","Healthy file cache cleared!":"ჯანსაღი ფაილის კეში გაწმენდილი!","Cache cleared!":"Cache გაწმენდილი!","Cancel item":"პუნქტის გაუქმება","Please check the above checkbox to use this feature.":"გთხოვთ, შეამოწმოთ ზემოთ მოცემული ჩანართი ამ ფუნქციის გამოყენებისათვის.","Configuration":"კონფიგურაცია","Source folders":"წყარო ფოლდერები","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"ეს არის წყარო საქაღალდე, რომელიც იქნება სკანირებული მედიისთვის. საქაღალდეში უნდა შევიდნენ არა ტრასირებაზე. Მაგალითად:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"წყარო საქაღალდეში გზამკვლევი expandable (დააჭირეთ შეიყვანეთ ახალი ხაზის შექმნა). თუ გსურთ დააკონკრეტა მრავალი წყარო ფოლდერები, დარწმუნდით, რომ თითოეული წყარო საქაღალდე გზაა საკუთარი ხაზიდან:","Video health check":"ვიდეო ჯანმრთელობის შემოწმება","Batch conversion and Folder watching":"Batch კონვერტაციის და Folder თვალს","Remote Monitoring (Beta)":"დისტანციური მონიტორინგი (Beta)","Benchmark (Beta)":"ბენჩმარკი (ბეტა)","System":"სისტემა","Help":"დახმარება","Temporary conversion folders":"დროებითი კონვერტაციის საქაღალდეები","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"თუ \"დროებითი კონვერტაციის საქაღალდე?\" გადამოწმება, მაშინ HandBrake გადააქვს ფაილები ამ საქაღალდეში. კონვერტაციის დასრულების შემდეგ, ფაილი გადავა თქვენს \"დანიშნულების საქაღალდეში\". თქვენ უნდა მიუთითოთ, როგორც ბევრი დროებითი კონვერტაციის ფოლდერები, როგორც წყარო ფოლდერები. თქვენი პირველი წყარო საქაღალდე ჩაირთვება თქვენს პირველი დროებითი კონვერტაციის საქაღალდეში, თქვენი მეორე წყარო საქაღალდეში თქვენს მეორე დროებითი კონვერტაციის საქაღალდეში და ასე შემდეგ. დარწმუნდით, რომ ყოველი დროებითი კონვერტაციის საქაღალდე გზაა საკუთარი ხაზიდან.","Destination folders":"დანიშნულების საქაღალდეები","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"მიუთითეთ დანიშნულების საქაღალდის ბილიკების მითითება. კიდევ ერთხელ, თქვენ უნდა მიუთითოთ, როგორც ბევრი დანიშნულების ფოლდერები წყარო წყაროები. თქვენი პირველი წყარო საქაღალდის ფაილები დასრულდება თქვენი პირველი დანიშნულების საქაღალდეში, თქვენი მეორე წყარო საქაღალდე ფაილი თქვენს მეორე დანიშნულების საქაღალდეში და ასე შემდეგ.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"პირველი წყარო საქაღალდე ---------> პირველი დროებითი კონვერტაციის საქაღალდე ---------> პირველი დანიშნულების საქაღალდე","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"მეორე წყარო საქაღალდე ---------> მეორე დროებითი კონვერტაციის საქაღალდე ---------> მეორე დანიშნულების საქაღალდე","etc":"და ა.შ.","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast არ იმუშავებს სათანადოდ, თუ დანიშნულების საქაღალდის შექმნის იგივე ფორმაა, ან შიგნით, საქაღალდეში.","Standard preset:":"სტანდარტული წინასწარ","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"აირჩიეთ ხელსაბჭო წინასწარ გსურთ თქვენი ფაილების კონვერტაცია. თუ \"სტანდარტული წინასწარ\" შეირჩევა, მაშინ შერჩეული ფოლდერების ყველა ფაილი გარდაიქმნება მითითებულ ხელბორკილის წინასწარ გამოყენებით. თქვენ შეგიძლიათ იპოვოთ მეტი HandBrake presets აქ:","Custom preset:":"საბაჟო წინასწარ","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"თუ \"საბაჟო წინასწარ\" მაშინ უნდა ჩაწეროთ საკუთარი საბაჟო წინასწარ. HBBatchBeast მოიცავს \"HandBrakeCLI -i წყარო-დანიშნულების\" ნაწილს HandBrakeCLI შეყვანის ნაწილს, ასე რომ თქვენ უნდა შეიყვანოთ კონვერტაციის პარამეტრები. Მაგალითად:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"თუ FFmpeg- ის გამოყენებით, თქვენ უნდა გამოვყოთ შემავალი და გამომავალი პარამეტრების მძიმით. როგორიცაა:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"თქვენ ასევე შეგიძლიათ დაარეგისტრიროთ საბაჟო წინასწარ, რომელიც ექსპორტირებულია ოფიციალური ხელსაბანიდან GUI- ის განაცხადის მაგალითზე:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"თუ თქვენ გაქვთ პრობლემები საბაჟო presets, ეს შეიძლება იყოს გამო ცნობილი bug with HandBrakeCLI (დაფიქსირდება შემდეგ HandBrakeCLI გათავისუფლებას). გთხოვთ იხილოთ ეს დროებითი გადაწყვეტისთვის:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"თითოეული საბაჟო წინასწარ უნდა იყოს საკუთარი ხაზი და, ისევე როგორც ფოლდერები, იქ უნდა იყოს, როგორც ბევრი საბაჟო presets როგორც წყარო ფოლდერები.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"პირველი წყარო საქაღალდე ---------> პირველი დროებითი კონვერტაციის საქაღალდე ---------> პირველი დანიშნულების საქაღალდე @ საბაჟო წინასწარ 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"მეორე წყარო საქაღალდე ---------> მეორე დროებითი კონვერტაციის საქაღალდე ---------> მეორე დანიშნულების საქაღალდე @ საბაჟო წინასწარ 2","See the following image for guidance:":"იხილეთ შემდეგი სურათი ხელმძღვანელობით:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"თუ გრაფის ბარათის კოდირება (როგორიცაა NVENC), მაშინ შეიძლება დაგჭირდეთ შემცირებისას ხელიხელჭეშის შემთხვევების რაოდენობა (სცადეთ 2 ან ნაკლები) VRAM შეზღუდვების გამო.","Select standard preset:":"სტანდარტული წინასწარ შერჩევა:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC- ს გამოვლინდა, დარწმუნდით, რომ შეამციროთ HandBrakeCLI- ის შემთხვევების რაოდენობა 2-ზე ან ქვემოთ (უმეტესი გრაფიკული ბარათებისთვის) ან შეგიძლიათ შეცდომები გაგიწიოთ არასწორი VRAM- ის გამო. ეს პარამეტრი შეგიძლიათ იხილოთ \"სისტემის\" ჩანართში.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"იმპორტირებული წინასწარ გამოვლენილია. თუ თქვენ გაქვთ საეჭვო იმპორტირებული საბაჟო presets, ეს შეიძლება იყოს გამო ცნობილი შეცდომით HandBrakeCLI (დაფიქსირდება შემდეგი HandBrakeCLI გათავისუფლებას). დროებითი გამოსავალი არის \"PictorRotate\": \"0: 0\" \".json ფაილიდან. დამატებითი ინფორმაცია აქ:","Container:":"კონტეინერი:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"მიუთითეთ კონტეინერი, რომელიც გსურთ გამომავალი ფაილური იყოს, როგორც '.mp4'. შეგიძლიათ შეიტყოთ მეტი კონტეინერების შესახებ:","Enable periodic scanning:":"პერიოდული სკანირების ჩართვა:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast შეგიძლიათ მონიტორინგი თქვენი წყარო ფოლდერები და აწარმოებს Scans ახალი ფაილი მითითებულ ინტერვალში. ინტერვალის დრო არის წამში, რომელსაც 300 წამი (5 წუთი) აქვს. თუ ეს პარამეტრი შეირჩევა, მაშინ როდესაც დააჭერთ \"სკანირება და კონვერტირება\", პროგრამა გარდაქმნის ნებისმიერ ახალ ფაილს და შემდეგ დაიწყება მრიცხველის დრო. ეს იქნება loop უსასრულოდ სანამ შეჩერდა. სკანირების ინტერვალი არის გაფართოებული პარამეტრების სექციაში.","Enable daily scanning:":"ყოველდღიური სკანირების ჩართვა:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"პერიოდული სკანირების ნაცვლად, შეგიძლიათ სკანირებისთვის აირჩიოთ დღეში ერთხელ. სკანირების დრო შეყვანილია გაფართოებული პარამეტრების სექციაში hh: mm ფორმატში, როგორიცაა '18: 30 '. მას შემდეგ, რაც \"სკანირება და კონვერტაცია\" შეირჩევა, პროგრამა დაელოდა სანამ განსაზღვრულ დროს სკანირებისა და კონვერტაციის პროცესში. კიდევ ერთხელ, ეს loop უსასრულოდ სანამ შეჩერდა.","Show/hide advanced:":"მოწინავე ჩვენება / დამალვა:","Scan interval (minimum 5 seconds):":"სკანირების ინტერვალი (მინიმუმ 5 წამი):","Daily run time (hh:mm):":"ყოველდღიური დრო (hh: mm):","Output filename suffix:":"გამოყვანის ფაილის წარმდგენი","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"ეს არის სურვილისამებრ. თქვენ შეგიძლიათ მიუთითოთ სუფიქსი, რომელიც დაამატეთ თქვენი ფაილის დასასრულს '_1080p' ან '_testconversion' და ა.შ.","If 'standard preset' is selected then all output files will have the same suffix.":"თუ \"სტანდარტული წინასწარ\" შერჩეულია მაშინ ყველა გამომავალი ფაილი ექნება იგივე სუფიქსი.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"თუ \"საბაჟო წინასწარ\" შეირჩევა მაშინ შეგიძლიათ მიუთითოთ ერთი სულელი თითო წყარო საქაღალდეში / საბაჟო წინასწარ. დარწმუნდით, რომ თითოეული სუფიქსი თავისივე ხაზშია. მაგალითად, თუ თქვენ გაქვთ 2 წყარო ფოლდერები და იყენებენ \"საბაჟო წინასწარ\", შეგიძლიათ დააყენოთ ეს ფაილის სახელის სუქსემბურგში:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"ფაილების პირველ წყაროს საქაღალდეში \"_720p\" დაემატება გამომავალი ფაილის სახელი. მეორე წყარო საქაღალდეში ფაილები '_1080p' დაემატება გამომავალი ფაილის სახელით და ა.შ.","Include these file types:":"ამ ფაილების ტიპების ჩართვა:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"შეიტანეთ ფაილის ტიპები სკანირებისთვის. თითოეული ტიპი უნდა გამოყოფილიყო მძიმით. ნაგულისხმევი ჩანაწერი არის:","Exclude files smaller than (MB):":"გამორიცხავს ფაილებზე ნაკლები (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"მიუთითეთ თუ არა ფაილების გამორიცხვა გარკვეული ზომის გარდა კონვერტაციისგან (მეგაბაიტებში)","Exclude files larger than (MB):":"გამორიცხავს ფაილებს (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"მიუთითეთ თუ არა ზომის კონვერტაციისგან (მაგ.","Exclude filenames which include any of these words:":"გამორიცხავს ფაილებს, რომლებიც მოიცავს ამ სიტყვებს:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"შეიყვანეთ საკვანძო სიტყვები, როდესაც ფაილების სკანირება მოხდება. მაგალითად, თუ \"720p\" შედის, მაშინ ნებისმიერი ფაილი \"720p\" - ში არ შეცვლილა. კიდევ ერთხელ, საკვანძო სიტყვები უნდა გამოყოფილიყო მძიმით. მაგალითად, შეიტანეთ შემდეგი ფილტრის ყუთში:","Include files with any ":"ჩართე ფაილები ნებისმიერი"," or all ":"ან ყველა"," of these":"ამ","properties:":"თვისებები:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"აქ შეგიძლიათ შეყვანის ვიდეო და აუდიო თვისებები, რომ ფაილი უნდა ჰქონდეს, რათა მოაქცია (ინფორმაციის მოპოვებული გამოყენებით FFprobe). თვისებები უნდა გამოყოფილი იყოს მძიმით. გამოიყენეთ მედიის ინფორმაციის მაყურებლის ინსტრუმენტი, რათა დადგინდეს, რა თვისებები გსურთ. დარწმუნდით, რომ უკანასკნელი ქონების შემდეგ მძიმით დასვა. მაგალითად, მხოლოდ კონვერტაციის ფაილები, რომლებიც encoded გამოყენებით h264 და aac სტერეო აუდიო:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"აღსანიშნავია, რომ ამ ქონების შემოწმება ხდება კონვერტაციის პროცესის დაწყებისთანავე (ამ დროისთვის მზერის შესაქმნელად), თუმცა ფაილები კონვერტაციის რიგში გამოჩნდება, ისინი გამოტოვებენ / შედის, თუ სწორი პირობები შესრულდება.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"თუ FFprobe- ს შეუძლია თვისებების ამონაწერი, მაშინ \"OK\" გამოჩნდება \"FFprobe\" სვეტში რიგში.","Exclude files with any ":"გამორიცხავს ფაილებს"," of these ":"ამ","The opposite of 'Include files with any or all of these properties'":"საპირისპირო \"შეიტანეთ ფაილები ნებისმიერი ან ყველა ამ თვისებით\"","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"ეს არის პატარა ინსტრუმენტი, რათა გაანალიზოთ ფაილების თვისებები იმისათვის, რომ დაგეხმაროთ განსაზღვროთ რომელი თვისებები გსურთ მოიცავდეთ / ჩართოთ ზემოთ პარამეტრებში. იგი იყენებს FFprobe ინფორმაციის დაბრუნებას. გადაათრიეთ ფაილები რუხი ყუთში გაანალიზებისთვის. მაგალითად, ჩატვირთვისას ტესტი ფაილი შეიძლება დაბრუნდეს შემდეგნაირად:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"თუ თქვენ ეძებთ ფაილების გამორიცხვა, როგორიცაა კონვერტირება, მაშინ შეგიძლიათ შეიტანოთ რამდენიმე ფაილების თვისებები \"ნებისმიერი ფაილების ნებისმიერ ან ყველაფერთან ერთად ფაილების გამორიცხვა\" და შეამოწმეთ \"ყველა\" ნაცვლად \"ყველა\" ნაცვლად ამის მსგავსად:","Copy excluded files to destination:":"დაუშვებელი ფაილების ასლი დანიშნულების ადგილას:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"თუ ამ ვარიანტს აირჩიეთ, მაშინ ფაილები, რომლებიც გარდაიქმნება კონვერტაციისგან, გადაწერა პირდაპირ დანიშნულების საქაღალდეში. ეს ეხება შემდეგ ფილტრებს:","Exclude filenames which include any of these words":"გამორიცხეთ filenames რომელიც მოიცავს ნებისმიერი ამ სიტყვებით","Include files with any or all of these properties":"შეიტანეთ ფაილები ნებისმიერი ან ყველა ამ თვისებით","Exclude files with any or all of these properties":"გამორიცხავს ფაილებს ნებისმიერი ან ყველა ამ თვისებით","Exclude files smaller than (MB)":"გამორიცხავს ფაილებზე ნაკლები (MB)","Exclude files larger than (MB)":"გამორიცხავს ფაილებს (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"შენიშვნა ასევე ვრცელდება ფაილებზე, რადგან ისინი არ აკმაყოფილებენ ზემოთ მოყვანილი ქონების პირობებს \"შეავსეთ\" ასე რომ შემთხვევით არ დააკოპირებთ თქვენ მთელ ბიბლიოთეკას, როდესაც თქვენ მხოლოდ ცდილობს შეცვალო რამდენიმე ფაილი.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"ასლი ფუნქცია არ ვრცელდება შემდეგ ფილტრებზე (ანუ ფილტრის გამოკლებით მიღებული ფაილები)","Include these file types":"ამ ფაილის ტიპების ჩართვა","Delete source files after conversion:":"წყაროს ფაილების წაშლა კონვერტაციის შემდეგ:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"თუ ეს შერჩეულია, მაშინ კონვერტაციის მცდელობა წარმატებულია, წყაროს ფაილი წაიშლება. ეს პროცესი კეთდება ბოლოს და ბოლოს, ყველა ფაილი გარდაიქმნება. ეს ნიშნავს, რომ თქვენ შეგიძლიათ დააკონვერტიროთ იმავე წყაროს ფაილები მრავალჯერადი presets- ით, ყველა ერთში. წყაროს ფაილი შემდეგ წაიშლება.","Replace original file if converted file is smaller?(Compress attempt)":"შეცვალეთ ორიგინალი ფაილი, თუ გადატვირთული ფაილი უფრო მცირეა? (შეკუმშვის მცდელობა)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"აირჩიეთ ეს საკონკურსო ფანჯარა, თუ გსურთ HBBatchBeast ავტომატურად შეცვალოთ ორიგინალური წყარო ფაილი, თუ ახალი ფაილი არის პატარა. თუ ახალი ფაილი არ არის პატარა, მაშინ ის დარჩება დანიშნულების საქაღალდეში.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"დარწმუნდით, რომ თქვენი დანიშნულების საქაღალდე არ არის იგივე, როგორც / ან შიგნით, თქვენი წყაროს საქაღალდე ან არ მუშაობს.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"მას შემდეგ, რაც HBBatchBeast სცადა შეკუმშოს კონკრეტული ფაილი, დაამატებთ, რომ ფაილის გზა ქეში ისე, რომ ის არ იქნება მცდელობა კვლავ მომავალში. თქვენ შეგიძლიათ იხილოთ / რედაქტირება / გასუფთავება ქეში გამოყენებით ყვითელი ღილაკები.","Replace original file always?":"შეცვალეთ თავდაპირველი ფაილი?","The original file will be replaced regardless of whether the new file is larger or smaller.":"თავდაპირველი ფაილი შეიცვლება მიუხედავად იმისა, ახალი ფაილი უფრო დიდია ან უფრო მცირეა.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"კიდევ ერთხელ, დარწმუნდით, რომ თქვენი დანიშნულების საქაღალდე არ არის იგივე როგორც / ან ფარგლებში, თქვენი წყაროს საქაღალდე ან არ იმუშავებს.","Copy subtitle (srt) files to destination?":"დანიშნულების ადგილის ასლი სუბტიტრების (srt) ფაილების ასლი?","Subtitle '.srt' files will be copied to the destination folder automatically.":"საქაღალდე \". SRT ფაილები გადანაწილდება დანიშნულების საქაღალდეში ავტომატურად.","Automatically create temporary/destination folders if they don't exist?":"ავტომატურად შექმნის დროებითი / დანიშნულების საქაღალდეები, თუ ისინი არ არსებობენ?","Custom bat path to run after each conversion (leave blank if not using):":"საბაჟო ბატარეა თითოეული კონვერტაციის შემდეგ","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"შეყვანის გზა საბაჟო სურათების ფაილი, რომელიც გსურთ შეასრულოს ყოველი კონვერტაციის შემდეგ. Მაგალითად:","Batch files with timeout statements won't work. More info here:":"Batch ფაილების შედგენის ვადები არ იმუშავებს. დამატებითი ინფორმაცია აქ:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"დატოვეთ ყუთი სრულიად ცარიელი თუ არ გსურთ გამოიყენოთ ეს პარამეტრი (დარწმუნდით, რომ არ არსებობს ფარული ასოები ყუთში)","Run processes at low priority?":"პროცესების გაშვება დაბალი პრიორიტეტით?","All conversion processes will be run at low priority, reducing processor usage.":"ყველა კონვერტაციის პროცესი იქნება დაბალი პრიორიტეტი, შემცირების პროცესორის გამოყენება.","Remove apostrophes from filenames:":"წაიშალოს apostrophes საწყისი filenames:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"კონვერსიები / ჯანმრთელობის შემოწმების სკანირება შეიძლება ჩაიშალოს, თუ ფაილებს აქვთ აპოსტროფიები. შეამოწმეთ ეს ავტომატურად ამოიღონ apostrophes filenames."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"ეს ფუნქცია შეიძლება სკანირდეს კორუმპირებული ვიდეო ფაილებისთვის HandBrake- ის \"Sscan\" ფუნქციის გამოყენებით, თუმცა ეს ყოველთვის არ არის ზუსტი. იგი ასევე იყენებს FFprobe უზრუნველყოს მეორე მინიშნება წერტილი. თუ ორივე FFprobe და HandBrake ვერ მაშინ მაღალია შანსი, რომ ფაილი კორუმპირებული.","Move corrupt files into the following folder:":"გადაადგილეთ კორუმპირებული ფაილები შემდეგ საქაღალდეში:"," If checked, then any files which give errors will be moved into the specified folder.":"თუ შემოწმდება, მაშინ ნებისმიერი ფაილი, რომელიც შეცდომებს მისცემს, გადატანილი იქნება საქაღალდეში.","Corrupt file folder:":"კორუმპირებული ფაილის საქაღალდე:","Run thorough file health check:":"ამოიწურეთ სრულყოფილი სამედიცინო შემოწმება:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"თუ შემოწმდება, მაშინ გაცილებით უფრო ნელი, უფრო სრულყოფილი ვიდეო სამედიცინო შემოწმება მოხდება FFmpeg- ის ნაცვლად HandBrake- ის გამოყენებით."," Based on Desani's 'ScanMedia.ps1' found at:":"საფუძველზე Desani ს 'ScanMedia.ps1' ნაპოვნია:","Attempt to repair files after thorough check:":"მცდელობა შეკეთება ფაილი შემდეგ დეტალურად შემოწმება:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"თუ შემოწმდა, HBBatchBeast შეეცდება შეაკეთოს ფაილები FFmpeg- ის გამოყენებით. ახალ ფაილს, რომელზეც '' რეპლიკა '' შეიქმნება, იგივე ფოლდერში შეიქმნება წყაროს ფაილი.","'CRF' value to use when attempting to repair files:":"'CRF' ღირებულების გამოყენება ფაილების შეკეთებისას:","The default 'CRF' value is 23. Please see the following for more information:":"ნაგულისხმევი \"CRF\" ღირებულება 23. გთხოვთ იხილოთ შემდეგი ინფორმაცია:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"CRF- ის მასშტაბი არის 0-51, სადაც 0 უიმედოა, 23 არის ნაგულისხმევი, ხოლო 51 არის ყველაზე უარესი ხარისხი. ქვედა ღირებულება ზოგადად მივყავართ უფრო მაღალ ხარისხს და სუბიექტური გონებრივი სიმაღლეა 17-28. განვიხილოთ 17 ან 18 ვიზუალური დაკარგვა ან თითქმის ასე; იგი უნდა გამოიყურებოდეს იმავე ან თითქმის იგივე, რაც შეყვანის მაგრამ ეს არ არის ტექნიკურად უდანაშაულო.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast ინახავს სკანდალური ფაილის ბილიკების ჩამონათვალს, როგორც არაკორუმპირებული. გასუფთავებული ქეში შეასრულოს ახალი სკანირების ყველა ფაილი.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"ერთდროულად HandBrake / FFmpeg შემთხვევების რაოდენობა გამოსაყენებლად? (რეკომენდებულია 4 ან ნაკლები):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"ეს პარამეტრი ვრცელდება როგორც \"ვიდეო ჯანმრთელობის შემოწმება\" და \"სკანირება და კონვერტაცია\" პროცესები. მიუთითეთ რამდენი HandBrake თემა გამოიყენოს. არ არსებობს მაქსიმალური, თუმცა რეკომენდირებულია არ გამოიყენოს მეტი 4. უფრო მაღალი თანხის შეიძლება გაყინვას თქვენს კომპიუტერში თუ ეს არ არის ძალიან ძლიერი.","Queue size view limit?(Recommended 1000 or fewer):":"Queue ზომის ხედი ლიმიტი? (რეკომენდებულია 1000 ან ნაკლები):","Automatically start \"Scan and convert\" when program opened?":"ავტომატურად დაიწყება \"სკანირება და კონვერტაცია\" როდესაც პროგრამა გაიხსნა?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"შეავსეთ ელექტრონული ფოსტის დეტალები ელფოსტის შეტყობინებების მისაღებად, თუ შეცდომა შეექმნა ჯანმრთელობის შემოწმების ან კონვერტაციის / საქაღალდის ნახვის დროს. არ იმუშავებს ანგარიშები, რომლებიც მოითხოვს 2FA. საჭიროა Gmail- ის ანგარიშებზე ნაკლებად უსაფრთხო აპების ხელმისაწვდომობა.","Email address:":"Ელექტრონული მისამართი:","For example:":"Მაგალითად:","Email password(not saved):":"ელ.ფოსტის პაროლი (არ შეინახება):","SMTP server:":"SMTP სერვერი:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"ეს ფუნქცია იძლევა კონვერტაციის / ჯანმრთელობის შემოწმების სტატუსის მონიტორინგს ვებ-ბრაუზერის გამოყენებით. სასარგებლო, როდესაც გაშვებული სერვერები და ა.შ.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"თუ ჩართულია, შემდეგი ანონიმური მონაცემები გადაეგზავნება HBBatchBeast.io- ს:","API key":"API გასაღები","Current status ('Searching', 'Running', 'Finished' etc)":"მიმდინარე სტატუსი ('ძიება', 'მიმდინარე', 'დასრულებული' და ა.შ.)","Number of:":"Რაოდენობა:","Remaining items":"დარჩენილი ნივთები","Successful items":"წარმატებული ნივთები","Errored items":"შეცდომა ნივთები","Cancelled items":"გაუქმებული ნივთები","Worker percentages":"სამუშაო პროცენტული მაჩვენებლები","Last completed item time":"ბოლო დასრულებული პუნქტის დრო","Enable remote monitoring?:":"დისტანციური მონიტორინგის ჩართვა ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"ძირითადი ბენჩმარკინგი სასარგებლო აშენდა ძირითადად, თუ როგორ 16 + core პროცესორები ასრულებენ გამოყენებით მრავალჯერადი HandBrake შემთხვევები, თუმცა შეიძლება აწარმოებს ნებისმიერი ტიპის პროცესორი.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"ეს გადმოწერს h265 4k ნიმუში ფაილის (2.5MB) და აწარმოებს საორიენტაციო გამოყენებით 4 HandBrake ინსტანციების ერთად წინასწარ \"ძალიან სწრაფი 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"შედეგები შეიძლება აიტვირთა hbbatchbeast.io თუ თქვენ აირჩიეთ.","Queue":"რიგი","Output this session":"ამ სესიის გამოყვანა","Media info viewer tool":"მედია ინფორმაციის მაყურებლის ინსტრუმენტი","View compress attempt cache":"შეკუმშვის მცდელობის ქეში","Clear compress attempt cache":"გასუფთავება შეკუმშვის მცდელობა","Save config":"კონფიგურაციის შენახვა","Scan only":"მხოლოდ სკანირება","Scan and convert":"სკანირება და კონვერტაცია","View scan/conversion summary log":"სკანირების / კონვერტაციის შემაჯამებელი ჩანაწერის ნახვა","View individual file check/conversion log":"ინდივიდუალური ფაილის შემოწმება / კონვერტაციის ჟურნალი","View worker console output":"შრომის კონსოლი გამომავალი","Health check":"Ჯანმრთელობის შემოწმება","Clear healthy file cache":"წაიშალოს ჯანსაღი ფაილის ქეში","View error log":"შეცდომების ნახვა","Email test":"ელ","View master log":"საძიებო ლოგირების ნახვა","Wiki help":"Wiki დახმარება","An application by HaveAGitGat":"განცხადება HaveAGITGat- ის მიერ","New":"ახალი","Launch":"დაიწყე","Benchmark":"ბენჩმარკი","See results":"შედეგების ნახვა","Pause queue":"პაუზის რიგით","Continue queue":"გაგრძელება მდგომ","Stop queue":"შეაჩერე მდგომ","Convert selected files":"შერჩეული ფაილების კონვერტაცია","Toggle queue view":"გადართვა მდგომ ხედზე","Deselect all":"Გააუქმეთ ყველა მონიშვნა","Invert all":"ინვერტული ყველა","Select all":"Მონიშნე ყველა","Toggle output view":"გამომავალი ხედების გადართვა"}