{"The number of custom presets does not match the number of source folders!":"ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳ ಸಂಖ್ಯೆ ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳ ಸಂಖ್ಯೆಗೆ ಹೊಂದಿಕೆಯಾಗುವುದಿಲ್ಲ!","source folders have been detected.":"ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳನ್ನು ಕಂಡುಹಿಡಿಯಲಾಗಿದೆ.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"ಕಸ್ಟಮ್ ಮೊದಲೇ ಸಾಲುಗಳನ್ನು ಕಂಡುಹಿಡಿಯಲಾಗಿದೆ. ಅದೃಶ್ಯ ರೇಖೆಯ ವಿರಾಮಗಳಿಗಾಗಿ ದಯವಿಟ್ಟು ಎರಡು ಬಾರಿ ಪರಿಶೀಲಿಸಿ. ಪ್ರತಿ ಸಾಲಿಗೆ ಒಂದು ಫೋಲ್ಡರ್ ಮಾರ್ಗ ಅಥವಾ ಮೊದಲೇ ಹೊಂದಿರಬೇಕು. ನೀವು ಆಕಸ್ಮಿಕವಾಗಿ ಖಾಲಿ ರೇಖೆಯನ್ನು ರಚಿಸಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.","The number of filename suffixes does not match the number of source folders! ":"ಫೈಲ್ ಹೆಸರಿನ ಪ್ರತ್ಯಯಗಳ ಸಂಖ್ಯೆ ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳ ಸಂಖ್ಯೆಗೆ ಹೊಂದಿಕೆಯಾಗುವುದಿಲ್ಲ!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"ಫೈಲ್ ಹೆಸರಿನ ಪ್ರತ್ಯಯ ಸಾಲುಗಳನ್ನು ಕಂಡುಹಿಡಿಯಲಾಗಿದೆ. ಅದೃಶ್ಯ ರೇಖೆಯ ವಿರಾಮಗಳಿಗಾಗಿ ದಯವಿಟ್ಟು ಎರಡು ಬಾರಿ ಪರಿಶೀಲಿಸಿ. ಪ್ರತಿ ಸಾಲಿಗೆ ಒಂದು ಫೋಲ್ಡರ್ ಮಾರ್ಗ ಅಥವಾ ಫೈಲ್ ಹೆಸರಿನ ಪ್ರತ್ಯಯ ಇರಬೇಕು. ನೀವು ಆಕಸ್ಮಿಕವಾಗಿ ಖಾಲಿ ರೇಖೆಯನ್ನು ರಚಿಸಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.","The number of source folders does not match the number of destination folders!":"ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳ ಸಂಖ್ಯೆ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗಳ ಸಂಖ್ಯೆಗೆ ಹೊಂದಿಕೆಯಾಗುವುದಿಲ್ಲ!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗಳನ್ನು ಕಂಡುಹಿಡಿಯಲಾಗಿದೆ. ಅದೃಶ್ಯ ರೇಖೆಯ ವಿರಾಮಗಳಿಗಾಗಿ ದಯವಿಟ್ಟು ಎರಡು ಬಾರಿ ಪರಿಶೀಲಿಸಿ. ಪ್ರತಿ ಸಾಲಿಗೆ ಒಂದು ಫೋಲ್ಡರ್ ಮಾರ್ಗ ಇರಬೇಕು. ನೀವು ಆಕಸ್ಮಿಕವಾಗಿ ಖಾಲಿ ರೇಖೆಯನ್ನು ರಚಿಸಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.","The number of source folders does not match the number of temporary conversion folders!":"ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳ ಸಂಖ್ಯೆ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್‌ಗಳ ಸಂಖ್ಯೆಗೆ ಹೊಂದಿಕೆಯಾಗುವುದಿಲ್ಲ!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್‌ಗಳನ್ನು ಕಂಡುಹಿಡಿಯಲಾಗಿದೆ. ಅದೃಶ್ಯ ರೇಖೆಯ ವಿರಾಮಗಳಿಗಾಗಿ ದಯವಿಟ್ಟು ಎರಡು ಬಾರಿ ಪರಿಶೀಲಿಸಿ. ಪ್ರತಿ ಸಾಲಿಗೆ ಒಂದು ಫೋಲ್ಡರ್ ಮಾರ್ಗ ಇರಬೇಕು. ನೀವು ಆಕಸ್ಮಿಕವಾಗಿ ಖಾಲಿ ರೇಖೆಯನ್ನು ರಚಿಸಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"ದಯವಿಟ್ಟು '.mp4' ನಂತಹ ಮಾನ್ಯ ಧಾರಕವನ್ನು ನಮೂದಿಸಿ. '' ಅನ್ನು ಸೇರಿಸಲು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.","Corrupt file folder":"ಭ್ರಷ್ಟ ಫೈಲ್ ಫೋಲ್ಡರ್","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ಅಸ್ತಿತ್ವದಲ್ಲಿ ಇಲ್ಲ! ಮಾರ್ಗದ ಮೊದಲು / ನಂತರ ಯಾವುದೇ ಸ್ಥಳಗಳು ಅಥವಾ ಗುಪ್ತ ಅಕ್ಷರಗಳಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ","Source folder":"ಮೂಲ ಫೋಲ್ಡರ್","Temporary conversion folder":"ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್","appears to be the same as or is within source folder":"ಮೂಲ ಫೋಲ್ಡರ್‌ನಂತೆಯೇ ಅಥವಾ ಇರುವಂತೆ ತೋರುತ್ತಿದೆ","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ಇದು HBBatchBeast ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದನ್ನು ತಡೆಯುತ್ತದೆ. ದಯವಿಟ್ಟು ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ಅನ್ನು ಮೂಲ ಫೋಲ್ಡರ್‌ನ ಹೊರಗಿನ ಫೋಲ್ಡರ್‌ಗೆ ಬದಲಾಯಿಸಿ. ನೀವು 'ಮೂಲ ಫೈಲ್‌ಗಳ ವೈಶಿಷ್ಟ್ಯವನ್ನು ಬದಲಾಯಿಸು' ಅನ್ನು ಬಳಸಲು ಬಯಸಿದರೆ, ದಯವಿಟ್ಟು ಮೂಲ ಫೋಲ್ಡರ್‌ನಂತೆಯೇ ಅಥವಾ ಒಳಗೆ ಇಲ್ಲದ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿ, ತದನಂತರ ಸುಧಾರಿತ ಸೆಟ್ಟಿಂಗ್‌ಗಳ ವಿಭಾಗದಲ್ಲಿ 'ಮೂಲ ಫೈಲ್‌ಗಳನ್ನು ಯಾವಾಗಲೂ ಬದಲಾಯಿಸಿ' ಚೆಕ್‌ಬಾಕ್ಸ್ ಪರಿಶೀಲಿಸಿ. . ತಾತ್ಕಾಲಿಕ 'ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್' ಚೆಕ್‌ಬಾಕ್ಸ್ ಅನ್ನು ಗುರುತಿಸಬೇಡಿ ಏಕೆಂದರೆ ಅದು ಈ ಸಂದರ್ಭದಲ್ಲಿ ಯಾವುದೇ ಪ್ರಯೋಜನವನ್ನು ಪಡೆಯುವುದಿಲ್ಲ. ಫೈಲ್‌ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗೆ ಪರಿವರ್ತಿಸಲಾಗುತ್ತದೆ ಮತ್ತು ನಂತರ ಅದನ್ನು ಮೂಲ ಫೋಲ್ಡರ್‌ಗೆ ಸರಿಸಲಾಗುತ್ತದೆ.","Destination folder":"ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ಇದು HBBatchBeast ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದನ್ನು ತಡೆಯುತ್ತದೆ. ದಯವಿಟ್ಟು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ಅನ್ನು ಮೂಲ ಫೋಲ್ಡರ್‌ನ ಹೊರಗಿನ ಫೋಲ್ಡರ್‌ಗೆ ಬದಲಾಯಿಸಿ. ನೀವು 'ಮೂಲ ಫೈಲ್‌ಗಳ ವೈಶಿಷ್ಟ್ಯವನ್ನು ಬದಲಾಯಿಸು' ಅನ್ನು ಬಳಸಲು ಬಯಸಿದರೆ, ದಯವಿಟ್ಟು ಮೂಲ ಫೋಲ್ಡರ್‌ನಂತೆಯೇ ಅಥವಾ ಒಳಗೆ ಇಲ್ಲದ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿ, ತದನಂತರ ಸುಧಾರಿತ ಸೆಟ್ಟಿಂಗ್‌ಗಳ ವಿಭಾಗದಲ್ಲಿ 'ಮೂಲ ಫೈಲ್‌ಗಳನ್ನು ಯಾವಾಗಲೂ ಬದಲಾಯಿಸಿ' ಚೆಕ್‌ಬಾಕ್ಸ್ ಪರಿಶೀಲಿಸಿ. . ತಾತ್ಕಾಲಿಕ 'ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್' ಚೆಕ್‌ಬಾಕ್ಸ್ ಅನ್ನು ಗುರುತಿಸಬೇಡಿ ಏಕೆಂದರೆ ಅದು ಈ ಸಂದರ್ಭದಲ್ಲಿ ಯಾವುದೇ ಪ್ರಯೋಜನವನ್ನು ಪಡೆಯುವುದಿಲ್ಲ. ಫೈಲ್‌ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗೆ ಪರಿವರ್ತಿಸಲಾಗುತ್ತದೆ ಮತ್ತು ನಂತರ ಅದನ್ನು ಮೂಲ ಫೋಲ್ಡರ್‌ಗೆ ಸರಿಸಲಾಗುತ್ತದೆ.","Error creating temporary conversion folder":"ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ರಚಿಸುವಲ್ಲಿ ದೋಷ","Error creating destination folder":"ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ರಚಿಸುವಲ್ಲಿ ದೋಷ","Please select to use HandBrake or FFmpeg!":"ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ಅಥವಾ ಎಫ್‌ಎಫ್‌ಎಂಪಿಗ್ ಬಳಸಲು ದಯವಿಟ್ಟು ಆಯ್ಕೆಮಾಡಿ!","Please select a standard preset or input a custom one!":"ದಯವಿಟ್ಟು ಪ್ರಮಾಣಿತ ಮೊದಲೇ ಆಯ್ಕೆಮಾಡಿ ಅಥವಾ ಕಸ್ಟಮ್ ಒಂದನ್ನು ಇನ್ಪುಟ್ ಮಾಡಿ!","Please select a scan interval of 5 seconds or greater!":"ದಯವಿಟ್ಟು 5 ಸೆಕೆಂಡುಗಳು ಅಥವಾ ಹೆಚ್ಚಿನ ಸ್ಕ್ಯಾನ್ ಮಧ್ಯಂತರವನ್ನು ಆಯ್ಕೆ ಮಾಡಿ!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"ಬಳಸಲು ಏಕಕಾಲಿಕ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ / ಎಫ್‌ಎಫ್‌ಎಂಪಿಗ್ ನಿದರ್ಶನಗಳ ಸಂಖ್ಯೆ ಒಂದು ಅಥವಾ ಹೆಚ್ಚಿನದಾಗಿದೆ ಎಂಬುದನ್ನು ದಯವಿಟ್ಟು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"ಅಮಾನ್ಯ API ಕೀ! ಹೊಸ ಕೀಲಿಯನ್ನು ರಚಿಸಲು ದಯವಿಟ್ಟು ದೂರಸ್ಥ ಮಾನಿಟರಿಂಗ್ ಟ್ಯಾಬ್‌ನಲ್ಲಿ 'ಹೊಸ' ಕ್ಲಿಕ್ ಮಾಡಿ.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"ದಯವಿಟ್ಟು ದೈನಂದಿನ ಸ್ಕ್ಯಾನ್ ಸಮಯವನ್ನು 24 ಗಂಟೆಗಳ ಸ್ವರೂಪದಲ್ಲಿ ನಮೂದಿಸಿ: hh: mm (ಉದಾಹರಣೆಗೆ 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"ಪರಿವರ್ತನೆಯ ನಂತರ ಮೂಲ ಫೈಲ್‌ಗಳನ್ನು ಅಳಿಸಲಾಗುತ್ತದೆ! ಸರಿಯಾದ ಬಳಕೆಯ ಮೊದಲು ದಯವಿಟ್ಟು ಪರೀಕ್ಷಿಸಿ!","Benchmark failed!":"ಮಾನದಂಡ ವಿಫಲವಾಗಿದೆ!","Log does not exist!":"ಲಾಗ್ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ!","Folder does not exist!":"ಫೋಲ್ಡರ್ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ!","Error sending email! Please check your settings.":"ಇಮೇಲ್ ಕಳುಹಿಸುವಲ್ಲಿ ದೋಷ! ದಯವಿಟ್ಟು ನಿಮ್ಮ ಸೆಟ್ಟಿಂಗ್‌ಗಳನ್ನು ಪರಿಶೀಲಿಸಿ.","Test email sent!":"ಪರೀಕ್ಷಾ ಇಮೇಲ್ ಕಳುಹಿಸಲಾಗಿದೆ!","All worker processes have been stopped.":"ಎಲ್ಲಾ ಕಾರ್ಮಿಕ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ನಿಲ್ಲಿಸಲಾಗಿದೆ.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"ಪ್ರಸ್ತುತ ವಸ್ತುಗಳು ಪ್ರಕ್ರಿಯೆ ಮುಗಿದ ನಂತರ ಕ್ಯೂ ಅನ್ನು ವಿರಾಮಗೊಳಿಸಲಾಗುತ್ತದೆ. ನೀವು ಕ್ಯೂ ಅನ್ನು ವಿರಾಮಗೊಳಿಸಲು ಬಯಸುತ್ತೀರಾ?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"ಕ್ಯೂ ವಿರಾಮವನ್ನು ಪ್ರಾರಂಭಿಸಲಾಗಿದೆ. ಎಲ್ಲಾ ಕಾರ್ಮಿಕರು ವಿರಾಮಗೊಳಿಸಿದ ನಂತರ 'ಮುಂದುವರಿಸು' ಬಟನ್ ಕಾಣಿಸುತ್ತದೆ.","Healthy file cache cleared!":"ಆರೋಗ್ಯಕರ ಫೈಲ್ ಸಂಗ್ರಹವನ್ನು ತೆರವುಗೊಳಿಸಲಾಗಿದೆ!","Cache cleared!":"ಸಂಗ್ರಹವನ್ನು ತೆರವುಗೊಳಿಸಲಾಗಿದೆ!","Cancel item":"ಐಟಂ ರದ್ದುಮಾಡಿ","Please check the above checkbox to use this feature.":"ಈ ವೈಶಿಷ್ಟ್ಯವನ್ನು ಬಳಸಲು ದಯವಿಟ್ಟು ಮೇಲಿನ ಚೆಕ್‌ಬಾಕ್ಸ್ ಪರಿಶೀಲಿಸಿ.","Configuration":"ಸಂರಚನೆ","Source folders":"ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳು","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"ಇದು ಮೂಲ ಫೋಲ್ಡರ್ ಆಗಿದ್ದು ಅದನ್ನು ಮಾಧ್ಯಮಕ್ಕಾಗಿ ಸ್ಕ್ಯಾನ್ ಮಾಡಲಾಗುತ್ತದೆ. ಹಿಂದುಳಿದ ಸ್ಲ್ಯಾಷ್ ಇಲ್ಲದೆ ಫೋಲ್ಡರ್ ಅನ್ನು ನಮೂದಿಸಬೇಕಾಗಿದೆ. ಉದಾಹರಣೆಗೆ:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"ಮೂಲ ಫೋಲ್ಡರ್ ಪಾತ್ ಬಾಕ್ಸ್ ವಿಸ್ತರಿಸಬಲ್ಲದು (ಹೊಸ ಸಾಲನ್ನು ರಚಿಸಲು ಎಂಟರ್ ಒತ್ತಿರಿ). ನೀವು ಅನೇಕ ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಲು ಬಯಸಿದರೆ, ಪ್ರತಿ ಮೂಲ ಫೋಲ್ಡರ್ ಮಾರ್ಗವು ತನ್ನದೇ ಆದ ಸಾಲಿನಲ್ಲಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ:","Video health check":"ವೀಡಿಯೊ ಆರೋಗ್ಯ ತಪಾಸಣೆ","Batch conversion and Folder watching":"ಬ್ಯಾಚ್ ಪರಿವರ್ತನೆ ಮತ್ತು ಫೋಲ್ಡರ್ ವೀಕ್ಷಣೆ","Remote Monitoring (Beta)":"ರಿಮೋಟ್ ಮಾನಿಟರಿಂಗ್ (ಬೀಟಾ)","Benchmark (Beta)":"ಮಾನದಂಡ (ಬೀಟಾ)","System":"ಸಿಸ್ಟಮ್","Help":"ಸಹಾಯ","Temporary conversion folders":"ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್‌ಗಳು","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"\"ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್?\" ಪರಿಶೀಲಿಸಲಾಗುತ್ತದೆ, ನಂತರ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ಫೈಲ್‌ಗಳನ್ನು ಆ ಫೋಲ್ಡರ್‌ಗೆ ಪರಿವರ್ತಿಸುತ್ತದೆ. ಪರಿವರ್ತನೆ ಮುಗಿದ ನಂತರ, ಫೈಲ್ ಅನ್ನು ನಿಮ್ಮ \"ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್\" ಗೆ ಸರಿಸಲಾಗುವುದು. ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳಂತೆ ನೀವು ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್‌ಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಬೇಕಾಗಿದೆ. ನಿಮ್ಮ ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್ ಅನ್ನು ನಿಮ್ಮ ಮೊದಲ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ಆಗಿ, ನಿಮ್ಮ ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್ ಅನ್ನು ನಿಮ್ಮ ಎರಡನೇ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ಆಗಿ ಪರಿವರ್ತಿಸಲಾಗುತ್ತದೆ. ಪ್ರತಿ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ಮಾರ್ಗವು ತನ್ನದೇ ಆದ ಸಾಲಿನಲ್ಲಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.","Destination folders":"ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗಳು","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ಮಾರ್ಗಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಿ. ಮತ್ತೆ, ನೀವು ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳಂತೆ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಬೇಕಾಗುತ್ತದೆ. ನಿಮ್ಮ ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್‌ನ ಫೈಲ್‌ಗಳು ನಿಮ್ಮ ಮೊದಲ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ನಲ್ಲಿ, ನಿಮ್ಮ ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್ ಫೈಲ್‌ಗಳು ನಿಮ್ಮ ಎರಡನೇ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ನಲ್ಲಿ ಕೊನೆಗೊಳ್ಳುತ್ತವೆ.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್ ---------> ಮೊದಲ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ---------> ಮೊದಲ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್ ---------> ಎರಡನೇ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ---------> ಎರಡನೇ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್","etc":"ಇತ್ಯಾದಿ","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"ನೀವು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ಅನ್ನು ಮೂಲ ಫೋಲ್ಡರ್ನಂತೆಯೇ ಅಥವಾ ಒಳಗೆ ಹೊಂದಿಸಿದರೆ HBBatchBeast ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದಿಲ್ಲ.","Standard preset:":"ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಮೊದಲೇ:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"ನಿಮ್ಮ ಫೈಲ್‌ಗಳನ್ನು ಪರಿವರ್ತಿಸಲು ನೀವು ಬಯಸುವ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ಮೊದಲೇ ಆಯ್ಕೆಮಾಡಿ. \"ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಮೊದಲೇ\" ಆಯ್ಕೆಮಾಡಿದರೆ, ಆಯ್ಕೆ ಮಾಡಿದ ಫೋಲ್ಡರ್‌ಗಳಲ್ಲಿನ ಎಲ್ಲಾ ಫೈಲ್‌ಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಿದ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ಮೊದಲೇ ಬಳಸಿ ಪರಿವರ್ತಿಸಲಾಗುತ್ತದೆ. ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ಪೂರ್ವನಿಗದಿಗಳ ಕುರಿತು ನೀವು ಇಲ್ಲಿ ಇನ್ನಷ್ಟು ಕಾಣಬಹುದು:","Custom preset:":"ಕಸ್ಟಮ್ ಮೊದಲೇ:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"\"ಕಸ್ಟಮ್ ಮೊದಲೇ\" ಆಗಿದ್ದರೆ ನೀವು ನಿಮ್ಮ ಸ್ವಂತ ಕಸ್ಟಮ್ ಮೊದಲೇ ನಮೂದಿಸಬೇಕಾಗುತ್ತದೆ. HBBatchBeast ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ಕ್ಲಿ ಇನ್‌ಪುಟ್‌ನ \"ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ಕ್ಲಿ -ಐ ಮೂಲ -ಒ ಗಮ್ಯಸ್ಥಾನ\" ಭಾಗವನ್ನು ಒಳಗೊಳ್ಳುತ್ತದೆ ಆದ್ದರಿಂದ ನೀವು ಪರಿವರ್ತನೆ ನಿಯತಾಂಕಗಳನ್ನು ನಮೂದಿಸಬೇಕಾಗುತ್ತದೆ. ಉದಾಹರಣೆಗೆ:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"FFmpeg ಅನ್ನು ಬಳಸುತ್ತಿದ್ದರೆ, ನೀವು ಇನ್ಪುಟ್ ಮತ್ತು output ಟ್ಪುಟ್ ನಿಯತಾಂಕಗಳನ್ನು ಅಲ್ಪವಿರಾಮದಿಂದ ಬೇರ್ಪಡಿಸಬೇಕು. ಉದಾಹರಣೆಗೆ:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"ಅಧಿಕೃತ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ಜಿಯುಐ ಅಪ್ಲಿಕೇಶನ್‌ನಿಂದ ರಫ್ತು ಮಾಡಲಾದ ಕಸ್ಟಮ್ ಮೊದಲೇ ನೀವು ಲಿಂಕ್ ಮಾಡಬಹುದು:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳೊಂದಿಗೆ ನಿಮಗೆ ತೊಂದರೆಯಾಗಿದ್ದರೆ, ಅದು ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ಕ್ಲಿಯೊಂದಿಗೆ ತಿಳಿದಿರುವ ದೋಷದಿಂದಾಗಿರಬಹುದು (ಮುಂದಿನ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ಸಿಎಲ್ಐ ಬಿಡುಗಡೆಯಲ್ಲಿ ಸರಿಪಡಿಸಲಾಗುವುದು). ತಾತ್ಕಾಲಿಕ ಪರಿಹಾರಕ್ಕಾಗಿ ದಯವಿಟ್ಟು ಇದನ್ನು ನೋಡಿ:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"ಪ್ರತಿಯೊಂದು ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿ ತನ್ನದೇ ಆದ ಸಾಲಿನಲ್ಲಿರಬೇಕು ಮತ್ತು ಫೋಲ್ಡರ್‌ಗಳಂತೆಯೇ, ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳಂತೆ ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳ ಅಗತ್ಯವಿರುತ್ತದೆ.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್ ---------> ಮೊದಲ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ---------> ಮೊದಲ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ @ ಕಸ್ಟಮ್ ಮೊದಲೇ 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್ ---------> ಎರಡನೇ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ---------> ಎರಡನೇ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ @ ಕಸ್ಟಮ್ ಮೊದಲೇ 2","See the following image for guidance:":"ಮಾರ್ಗದರ್ಶನಕ್ಕಾಗಿ ಈ ಕೆಳಗಿನ ಚಿತ್ರವನ್ನು ನೋಡಿ:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"ಗ್ರಾಫಿಕ್ಸ್ ಕಾರ್ಡ್ ಎನ್‌ಕೋಡಿಂಗ್ ಅನ್ನು ಬಳಸುತ್ತಿದ್ದರೆ (ಉದಾಹರಣೆಗೆ NVENC), ನಂತರ ನೀವು VRAM ಮಿತಿಗಳಿಂದಾಗಿ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ನಿದರ್ಶನಗಳ ಸಂಖ್ಯೆಯನ್ನು ಕಡಿಮೆ ಮಾಡಬೇಕಾಗಬಹುದು (2 ಅಥವಾ ಅದಕ್ಕಿಂತ ಕಡಿಮೆ ಪ್ರಯತ್ನಿಸಿ).","Select standard preset:":"ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಮೊದಲೇ ಆಯ್ಕೆಮಾಡಿ:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC ಪತ್ತೆಯಾಗಿದೆ, ದಯವಿಟ್ಟು ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ಕ್ಲಿ ನಿದರ್ಶನಗಳ ಸಂಖ್ಯೆಯನ್ನು 2 ಅಥವಾ ಅದಕ್ಕಿಂತ ಕಡಿಮೆ (ಹೆಚ್ಚಿನ ಗ್ರಾಫಿಕ್ಸ್ ಕಾರ್ಡ್‌ಗಳಿಗೆ) ಇಳಿಸಲು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ ಅಥವಾ ಸಾಕಷ್ಟು VRAM ಇಲ್ಲದ ಕಾರಣ ನೀವು ದೋಷಗಳನ್ನು ಎದುರಿಸಬಹುದು. ಈ ಸೆಟ್ಟಿಂಗ್ ಅನ್ನು \"ಸಿಸ್ಟಮ್\" ಟ್ಯಾಬ್‌ನಲ್ಲಿ ಕಾಣಬಹುದು.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"ಆಮದು ಮಾಡಿದ ಪೂರ್ವನಿಗದಿ ಪತ್ತೆಯಾಗಿದೆ. ನೀವು ಆಮದು ಮಾಡಿದ ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳೊಂದಿಗೆ ತೊಂದರೆ ಅನುಭವಿಸುತ್ತಿದ್ದರೆ, ಅದು ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ಕ್ಲಿಯೊಂದಿಗೆ ತಿಳಿದಿರುವ ದೋಷದಿಂದಾಗಿರಬಹುದು (ಮುಂದಿನ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ಸಿಎಲ್ಐ ಬಿಡುಗಡೆಯಲ್ಲಿ ಸರಿಪಡಿಸಲಾಗುವುದು). .Json ಫೈಲ್‌ನಿಂದ '\"ಪಿಕ್ಚರ್‌ರೋಟೇಟ್\": \"0: 0\" ಅನ್ನು ತೆಗೆದುಹಾಕುವುದು ತಾತ್ಕಾಲಿಕ ಪರಿಹಾರವಾಗಿದೆ. ಹೆಚ್ಚಿನ ಮಾಹಿತಿ ಇಲ್ಲಿ:","Container:":"ಕಂಟೇನರ್:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":".ಟ್ಪುಟ್ ಫೈಲ್ '.mp4' ನಂತಹ ಹೊಂದಲು ನೀವು ಬಯಸುವ ಕಂಟೇನರ್ ಅನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಿ. ಕಂಟೇನರ್‌ಗಳ ಕುರಿತು ನೀವು ಇಲ್ಲಿ ಇನ್ನಷ್ಟು ತಿಳಿದುಕೊಳ್ಳಬಹುದು:","Enable periodic scanning:":"ಆವರ್ತಕ ಸ್ಕ್ಯಾನಿಂಗ್ ಅನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಿ:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast ನಿಮ್ಮ ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳನ್ನು ಮೇಲ್ವಿಚಾರಣೆ ಮಾಡಬಹುದು ಮತ್ತು ನಿರ್ದಿಷ್ಟ ಫೈಲ್‌ಗಳಲ್ಲಿ ಹೊಸ ಫೈಲ್‌ಗಳಿಗಾಗಿ ಸ್ಕ್ಯಾನ್‌ಗಳನ್ನು ಚಲಾಯಿಸಬಹುದು. ಮಧ್ಯಂತರ ಸಮಯ ಸೆಕೆಂಡುಗಳಲ್ಲಿ ಡೀಫಾಲ್ಟ್ 300 ಸೆಕೆಂಡುಗಳು (5 ನಿಮಿಷಗಳು). ಈ ಆಯ್ಕೆಯನ್ನು ಆರಿಸಿದರೆ, ನೀವು \"ಸ್ಕ್ಯಾನ್ ಮಾಡಿ ಮತ್ತು ಪರಿವರ್ತಿಸಿ\" ಒತ್ತಿದಾಗ, ಪ್ರೋಗ್ರಾಂ ಯಾವುದೇ ಹೊಸ ಫೈಲ್‌ಗಳನ್ನು ಪರಿವರ್ತಿಸುತ್ತದೆ ಮತ್ತು ನಂತರ ಕೌಂಟ್ಡೌನ್ ಟೈಮರ್ ಪ್ರಾರಂಭವಾಗುತ್ತದೆ. ನಿಲ್ಲಿಸುವವರೆಗೆ ಇದು ಅನಂತವಾಗಿ ಲೂಪ್ ಆಗುತ್ತದೆ. ಸ್ಕ್ಯಾನ್ ಮಧ್ಯಂತರವು ಸುಧಾರಿತ ಸೆಟ್ಟಿಂಗ್‌ಗಳ ವಿಭಾಗದಲ್ಲಿದೆ.","Enable daily scanning:":"ದೈನಂದಿನ ಸ್ಕ್ಯಾನಿಂಗ್ ಅನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಿ:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"ಆವರ್ತಕ ಸ್ಕ್ಯಾನಿಂಗ್ ಬದಲಿಗೆ, ನೀವು ದಿನಕ್ಕೆ ಒಮ್ಮೆ ಸ್ಕ್ಯಾನ್ ಚಲಾಯಿಸಲು ಆಯ್ಕೆ ಮಾಡಬಹುದು. '18: 30 'ನಂತಹ hh: mm ಸ್ವರೂಪದಲ್ಲಿ ಸುಧಾರಿತ ಸೆಟ್ಟಿಂಗ್‌ಗಳ ವಿಭಾಗದಲ್ಲಿ ಸ್ಕ್ಯಾನ್ ಸಮಯವನ್ನು ನಮೂದಿಸಲಾಗಿದೆ. \"ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತನೆ\" ಆಯ್ಕೆ ಮಾಡಿದ ನಂತರ, ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತನೆ ಪ್ರಕ್ರಿಯೆಯನ್ನು ನಡೆಸುವವರೆಗೆ ಪ್ರೋಗ್ರಾಂ ನಿಗದಿತ ಸಮಯದವರೆಗೆ ಕಾಯುತ್ತದೆ. ಮತ್ತೆ, ನಿಲ್ಲಿಸುವವರೆಗೂ ಇದು ಅನಂತವಾಗಿ ಲೂಪ್ ಆಗುತ್ತದೆ.","Show/hide advanced:":"ಸುಧಾರಿತ ತೋರಿಸು / ಮರೆಮಾಡಿ:","Scan interval (minimum 5 seconds):":"ಸ್ಕ್ಯಾನ್ ಮಧ್ಯಂತರ (ಕನಿಷ್ಠ 5 ಸೆಕೆಂಡುಗಳು):","Daily run time (hh:mm):":"ದೈನಂದಿನ ಚಾಲನೆಯ ಸಮಯ (hh: mm):","Output filename suffix:":"File ಟ್‌ಪುಟ್ ಫೈಲ್ ಹೆಸರಿನ ಪ್ರತ್ಯಯ:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"ಇದು ಐಚ್ .ಿಕ. ನಿಮ್ಮ ಫೈಲ್ ಹೆಸರಿನ ಕೊನೆಯಲ್ಲಿ '_1080p' ಅಥವಾ '_testconversion' ಇತ್ಯಾದಿಗಳನ್ನು ಸೇರಿಸಲು ನೀವು ಪ್ರತ್ಯಯವನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಬಹುದು.","If 'standard preset' is selected then all output files will have the same suffix.":"'ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಮೊದಲೇ' ಆಯ್ಕೆಮಾಡಿದರೆ ಎಲ್ಲಾ output ಟ್‌ಪುಟ್ ಫೈಲ್‌ಗಳು ಒಂದೇ ಪ್ರತ್ಯಯವನ್ನು ಹೊಂದಿರುತ್ತವೆ.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"'ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿ' ಆಯ್ಕೆಮಾಡಿದರೆ ನೀವು ಪ್ರತಿ ಮೂಲ ಫೋಲ್ಡರ್ / ಕಸ್ಟಮ್ ಮೊದಲೇ ಒಂದು ಪ್ರತ್ಯಯವನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಬಹುದು. ಪ್ರತಿಯೊಂದು ಪ್ರತ್ಯಯವು ತನ್ನದೇ ಆದ ಸಾಲಿನಲ್ಲಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ. ಉದಾಹರಣೆಗೆ, ನೀವು 2 ಮೂಲ ಫೋಲ್ಡರ್‌ಗಳನ್ನು ಹೊಂದಿದ್ದರೆ ಮತ್ತು 'ಕಸ್ಟಮ್ ಮೊದಲೇ' ಬಳಸುತ್ತಿದ್ದರೆ, ನೀವು ಇದನ್ನು ಫೈಲ್ ನೇಮ್ ಪ್ರತ್ಯಯ ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಇಡಬಹುದು:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್‌ನಲ್ಲಿನ ಫೈಲ್‌ಗಳು _ಟ್‌ಪುಟ್ ಫೈಲ್ ಹೆಸರಿಗೆ '_720p' ಅನ್ನು ಸೇರಿಸಲಾಗುತ್ತದೆ. ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್‌ನಲ್ಲಿನ ಫೈಲ್‌ಗಳು _ಟ್‌ಪುಟ್ ಫೈಲ್ ಹೆಸರು ಇತ್ಯಾದಿಗಳಿಗೆ '_1080p' ಅನ್ನು ಸೇರಿಸಲಾಗುತ್ತದೆ.","Include these file containers:":"ಈ ಫೈಲ್ ಕಂಟೇನರ್‌ಗಳನ್ನು ಸೇರಿಸಿ:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"ಸ್ಕ್ಯಾನ್ ಮಾಡಲು ಫೈಲ್ ಕಂಟೇನರ್‌ಗಳನ್ನು ನಮೂದಿಸಿ. ಪ್ರತಿಯೊಂದು ಪ್ರಕಾರವನ್ನು ಅಲ್ಪವಿರಾಮದಿಂದ ಬೇರ್ಪಡಿಸಬೇಕಾಗಿದೆ. ಡೀಫಾಲ್ಟ್ ನಮೂದು:","Exclude files smaller than (MB):":"(MB) ಗಿಂತ ಚಿಕ್ಕದಾದ ಫೈಲ್‌ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"ಪರಿವರ್ತನೆಯಿಂದ ನಿರ್ದಿಷ್ಟ ಗಾತ್ರಕ್ಕಿಂತ ಚಿಕ್ಕದಾದ ಫೈಲ್‌ಗಳನ್ನು ಹೊರಗಿಡಬೇಕೆ ಎಂದು ನಿರ್ದಿಷ್ಟಪಡಿಸಿ (ಮೆಗಾಬೈಟ್‌ಗಳಲ್ಲಿ)","Exclude files larger than (MB):":"(MB) ಗಿಂತ ದೊಡ್ಡದಾದ ಫೈಲ್‌ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"ಪರಿವರ್ತನೆಯಿಂದ ನಿರ್ದಿಷ್ಟ ಗಾತ್ರಕ್ಕಿಂತ ದೊಡ್ಡದಾದ ಫೈಲ್‌ಗಳನ್ನು ಹೊರಗಿಡಬೇಕೆ ಎಂದು ನಿರ್ದಿಷ್ಟಪಡಿಸಿ (ಮೆಗಾಬೈಟ್‌ಗಳಲ್ಲಿ)","Exclude filenames which include any of these words:":"ಈ ಯಾವುದೇ ಪದಗಳನ್ನು ಒಳಗೊಂಡಿರುವ ಫೈಲ್ ಹೆಸರುಗಳನ್ನು ಹೊರತುಪಡಿಸಿ:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"ಫೈಲ್‌ಗಳಿಗಾಗಿ ಸ್ಕ್ಯಾನ್ ಮಾಡುವಾಗ ಫಿಲ್ಟರ್ ಮಾಡಲು ಕೀವರ್ಡ್‌ಗಳನ್ನು ನಮೂದಿಸಿ. ಉದಾಹರಣೆಗೆ, \"720p\" ಅನ್ನು ನಮೂದಿಸಿದರೆ, ಶೀರ್ಷಿಕೆಯಲ್ಲಿ \"720p\" ಹೊಂದಿರುವ ಯಾವುದೇ ಫೈಲ್‌ಗಳನ್ನು ಪರಿವರ್ತಿಸಲಾಗುವುದಿಲ್ಲ. ಮತ್ತೆ, ಕೀವರ್ಡ್ಗಳನ್ನು ಅಲ್ಪವಿರಾಮದಿಂದ ಬೇರ್ಪಡಿಸಬೇಕಾಗಿದೆ. ಉದಾಹರಣೆಗೆ, ಫಿಲ್ಟರ್ ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಈ ಕೆಳಗಿನವುಗಳನ್ನು ನಮೂದಿಸಿ:","Include files with any ":"ಯಾವುದೇ ಫೈಲ್‌ಗಳನ್ನು ಸೇರಿಸಿ"," or all ":"ಅಥವಾ ಎಲ್ಲಾ"," of these":"ಇವುಗಳಲ್ಲಿ","properties:":"ಗುಣಲಕ್ಷಣಗಳು:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"ಫೈಲ್‌ಗಳನ್ನು ಪರಿವರ್ತಿಸಲು ನೀವು ಹೊಂದಿರಬೇಕಾದ ವೀಡಿಯೊ ಮತ್ತು ಆಡಿಯೊ ಗುಣಲಕ್ಷಣಗಳನ್ನು ಇಲ್ಲಿ ನೀವು ಇನ್ಪುಟ್ ಮಾಡಬಹುದು (ಎಫ್‌ಎಫ್‌ಪ್ರೊಬ್ ಬಳಸಿ ಮಾಹಿತಿಯನ್ನು ಹೊರತೆಗೆಯಲಾಗುತ್ತದೆ). ಗುಣಲಕ್ಷಣಗಳನ್ನು ಅಲ್ಪವಿರಾಮದಿಂದ ಬೇರ್ಪಡಿಸಬೇಕು. ನೀವು ಯಾವ ಗುಣಲಕ್ಷಣಗಳನ್ನು ಸೇರಿಸಲು ಬಯಸುತ್ತೀರಿ ಎಂಬುದನ್ನು ನಿರ್ಧರಿಸಲು ಸಹಾಯ ಮಾಡಲು ಮಾಧ್ಯಮ ಮಾಹಿತಿ ವೀಕ್ಷಕ ಸಾಧನವನ್ನು ಬಳಸಿ. ಕೊನೆಯ ಆಸ್ತಿಯ ನಂತರ ಅಲ್ಪವಿರಾಮವನ್ನು ಇರಿಸಲು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ. ಉದಾಹರಣೆಗೆ, h264 ಮತ್ತು aac ಸ್ಟಿರಿಯೊ ಆಡಿಯೊ ಬಳಸಿ ಎನ್‌ಕೋಡ್ ಮಾಡಲಾದ ಫೈಲ್‌ಗಳನ್ನು ಮಾತ್ರ ಪರಿವರ್ತಿಸಲು:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"ಪರಿವರ್ತನೆ ಪ್ರಕ್ರಿಯೆಯು ಪ್ರಾರಂಭವಾದ ನಂತರ (ಕ್ಯೂ ನಿರ್ಮಿಸುವಾಗ ಸಮಯವನ್ನು ಉಳಿಸಲು) ಈ ಆಸ್ತಿ ಪರಿಶೀಲನೆ ನಡೆಸಲಾಗುತ್ತದೆ ಎಂಬುದು ಗಮನಿಸಬೇಕಾದ ಸಂಗತಿ, ಆದ್ದರಿಂದ ಪರಿವರ್ತನೆ ಕ್ಯೂನಲ್ಲಿ ಫೈಲ್‌ಗಳು ಗೋಚರಿಸಬಹುದಾದರೂ, ಸರಿಯಾದ ಷರತ್ತುಗಳನ್ನು ಪೂರೈಸಿದರೆ ಅವುಗಳನ್ನು ಬಿಟ್ಟುಬಿಡಲಾಗುತ್ತದೆ / ಸೇರಿಸಲಾಗುತ್ತದೆ.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"ಎಫ್‌ಎಫ್‌ಪ್ರೊಬ್ ಗುಣಲಕ್ಷಣಗಳನ್ನು ಹೊರತೆಗೆಯಲು ಸಾಧ್ಯವಾದರೆ, ಕ್ಯೂ ವೀಕ್ಷಣೆಯಲ್ಲಿನ \"ಎಫ್‌ಎಫ್‌ಪ್ರೊಬ್\" ಕಾಲಂನಲ್ಲಿ 'ಸರಿ' ಕಾಣಿಸುತ್ತದೆ.","Exclude files with any ":"ಯಾವುದನ್ನಾದರೂ ಹೊಂದಿರುವ ಫೈಲ್‌ಗಳನ್ನು ಹೊರಗಿಡಿ"," of these ":"ಇವುಗಳಲ್ಲಿ","The opposite of 'Include files with any or all of these properties'":"'ಈ ಯಾವುದೇ ಅಥವಾ ಎಲ್ಲಾ ಗುಣಲಕ್ಷಣಗಳೊಂದಿಗೆ ಫೈಲ್‌ಗಳನ್ನು ಸೇರಿಸಿ'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"ಮೇಲಿನ ಆಯ್ಕೆಗಳಲ್ಲಿ ನೀವು ಯಾವ ಗುಣಲಕ್ಷಣಗಳನ್ನು ಸೇರಿಸಲು / ಹೊರಗಿಡಲು ಬಯಸುತ್ತೀರಿ ಎಂಬುದನ್ನು ನಿರ್ಧರಿಸಲು ಸಹಾಯ ಮಾಡಲು ಫೈಲ್ ಗುಣಲಕ್ಷಣಗಳನ್ನು ವಿಶ್ಲೇಷಿಸಲು ಇದು ಒಂದು ಸಣ್ಣ ಸಾಧನವಾಗಿದೆ. ಮಾಹಿತಿಯನ್ನು ಹಿಂತಿರುಗಿಸಲು ಇದು ಎಫ್‌ಎಫ್‌ಪ್ರೊಬ್ ಅನ್ನು ಬಳಸುತ್ತದೆ. ಫೈಲ್‌ಗಳನ್ನು ವಿಶ್ಲೇಷಿಸಲು ಬೂದು ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಎಳೆಯಿರಿ ಮತ್ತು ಬಿಡಿ. ಉದಾಹರಣೆಗೆ, ಪರೀಕ್ಷಾ ಫೈಲ್‌ನಲ್ಲಿ ಬಿಡುವುದರಿಂದ ಈ ಕೆಳಗಿನವುಗಳನ್ನು ಹಿಂತಿರುಗಿಸಬಹುದು:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"ಈ ರೀತಿಯ ಫೈಲ್‌ಗಳನ್ನು ಪರಿವರ್ತಿಸುವುದರಿಂದ ನೀವು ಹೊರಗಿಡಲು ಬಯಸಿದರೆ, ನೀವು ಹಲವಾರು ಫೈಲ್ ಗುಣಲಕ್ಷಣಗಳನ್ನು \"ಈ ಯಾವುದೇ ಅಥವಾ ಎಲ್ಲಾ ಗುಣಲಕ್ಷಣಗಳೊಂದಿಗೆ ಫೈಲ್‌ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ\" ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಹಾಕಬಹುದು ಮತ್ತು 'ಯಾವುದಾದರೂ' ಬದಲಿಗೆ 'ಎಲ್ಲ' ಪಕ್ಕದಲ್ಲಿರುವ ಚೆಕ್‌ಬಾಕ್ಸ್ ಅನ್ನು ಪರಿಶೀಲಿಸಿ, ಹಾಗೆ:","Copy excluded files to destination:":"ಹೊರತುಪಡಿಸಿದ ಫೈಲ್‌ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನಕ್ಕೆ ನಕಲಿಸಿ:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"ನೀವು ಈ ಆಯ್ಕೆಯನ್ನು ಆರಿಸಿದರೆ, ಪರಿವರ್ತನೆಯಿಂದ ಹೊರಗಿಡಲಾದ ಫೈಲ್‌ಗಳನ್ನು ನೇರವಾಗಿ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗೆ ನಕಲಿಸಲಾಗುತ್ತದೆ. ಇದು ಕೆಳಗಿನ ಫಿಲ್ಟರ್‌ಗಳಿಗೆ ಅನ್ವಯಿಸುತ್ತದೆ:","Exclude filenames which include any of these words":"ಈ ಯಾವುದೇ ಪದಗಳನ್ನು ಒಳಗೊಂಡಿರುವ ಫೈಲ್ ಹೆಸರುಗಳನ್ನು ಹೊರಗಿಡಿ","Include files with any or all of these properties":"ಈ ಯಾವುದೇ ಅಥವಾ ಎಲ್ಲಾ ಗುಣಲಕ್ಷಣಗಳೊಂದಿಗೆ ಫೈಲ್‌ಗಳನ್ನು ಸೇರಿಸಿ","Exclude files with any or all of these properties":"ಈ ಯಾವುದೇ ಅಥವಾ ಎಲ್ಲಾ ಗುಣಲಕ್ಷಣಗಳೊಂದಿಗೆ ಫೈಲ್‌ಗಳನ್ನು ಹೊರಗಿಡಿ","Exclude files smaller than (MB)":"(MB) ಗಿಂತ ಚಿಕ್ಕದಾದ ಫೈಲ್‌ಗಳನ್ನು ಹೊರಗಿಡಿ","Exclude files larger than (MB)":"(MB) ಗಿಂತ ದೊಡ್ಡದಾದ ಫೈಲ್‌ಗಳನ್ನು ಹೊರಗಿಡಿ","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"ಮೇಲಿನ \"ಆಸ್ತಿ\" ಷರತ್ತುಗಳನ್ನು ಅವರು ಪೂರೈಸದ ಕಾರಣ ಹೊರಗಿಡಲಾದ ಫೈಲ್‌ಗಳಿಗೆ ಇದು ಅನ್ವಯಿಸುತ್ತದೆ ಎಂಬುದನ್ನು ಗಮನಿಸಿ ಆದ್ದರಿಂದ ನೀವು ಕೆಲವು ಫೈಲ್‌ಗಳನ್ನು ಮಾತ್ರ ಪರಿವರ್ತಿಸಲು ಪ್ರಯತ್ನಿಸುತ್ತಿರುವಾಗ ಆಕಸ್ಮಿಕವಾಗಿ ನಿಮ್ಮ ಸಂಪೂರ್ಣ ಗ್ರಂಥಾಲಯವನ್ನು ನಕಲಿಸಬೇಡಿ.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"ನಕಲು ವೈಶಿಷ್ಟ್ಯವು ಈ ಕೆಳಗಿನ ಫಿಲ್ಟರ್‌ಗಳಿಗೆ ಅನ್ವಯಿಸುವುದಿಲ್ಲ (ಅಂದರೆ ಫೈಲ್‌ಗಳನ್ನು ಫಿಲ್ಟರ್‌ನಿಂದ ಹೊರಗಿಡಲಾಗಿದೆ)","Include these file types":"ಈ ಫೈಲ್ ಪ್ರಕಾರಗಳನ್ನು ಸೇರಿಸಿ","Delete source files after conversion:":"ಪರಿವರ್ತನೆಯ ನಂತರ ಮೂಲ ಫೈಲ್‌ಗಳನ್ನು ಅಳಿಸಿ:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"ಇದನ್ನು ಆಯ್ಕೆ ಮಾಡಿದರೆ, ಪರಿವರ್ತನೆ ಪ್ರಯತ್ನ ಯಶಸ್ವಿಯಾದರೆ, ಮೂಲ ಫೈಲ್ ಅನ್ನು ಅಳಿಸಲಾಗುತ್ತದೆ. ಎಲ್ಲಾ ಫೈಲ್‌ಗಳನ್ನು ಪರಿವರ್ತಿಸಿದ ನಂತರ ಈ ಪ್ರಕ್ರಿಯೆಯನ್ನು ಬಹಳ ಕೊನೆಯಲ್ಲಿ ಮಾಡಲಾಗುತ್ತದೆ. ಇದರರ್ಥ ನೀವು ಒಂದೇ ಮೂಲ ಫೈಲ್‌ಗಳನ್ನು ಅನೇಕ ಪೂರ್ವನಿಗದಿಗಳನ್ನು ಬಳಸಿ ಪರಿವರ್ತಿಸಬಹುದು, ಎಲ್ಲವೂ ಒಂದೇ ಸಮಯದಲ್ಲಿ. ಮೂಲ ಫೈಲ್‌ಗಳನ್ನು ನಂತರ ಅಳಿಸಲಾಗುತ್ತದೆ.","Replace original file if converted file is smaller?(Compress attempt)":"ಪರಿವರ್ತಿಸಲಾದ ಫೈಲ್ ಚಿಕ್ಕದಾಗಿದ್ದರೆ ಮೂಲ ಫೈಲ್ ಅನ್ನು ಬದಲಾಯಿಸಿ? (ಸಂಕುಚಿತ ಪ್ರಯತ್ನ)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"ಹೊಸ ಫೈಲ್ ಚಿಕ್ಕದಾಗಿದ್ದರೆ ಮೂಲ ಮೂಲ ಫೈಲ್ ಅನ್ನು ಸ್ವಯಂಚಾಲಿತವಾಗಿ ಬದಲಾಯಿಸಲು ನೀವು HBBatchBeast ಬಯಸಿದರೆ ಈ ಚೆಕ್ ಬಾಕ್ಸ್ ಆಯ್ಕೆಮಾಡಿ. ಹೊಸ ಫೈಲ್ ಚಿಕ್ಕದಾಗದಿದ್ದರೆ, ಅದನ್ನು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ನಲ್ಲಿ ಬಿಡಲಾಗುತ್ತದೆ.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"ನಿಮ್ಮ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ನಿಮ್ಮ ಮೂಲ ಫೋಲ್ಡರ್ / ಅಥವಾ ಒಳಗೆ ಇಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ ಅಥವಾ ಅದು ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದಿಲ್ಲ.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast ಒಂದು ನಿರ್ದಿಷ್ಟ ಫೈಲ್ ಅನ್ನು ಕುಗ್ಗಿಸಲು ಪ್ರಯತ್ನಿಸಿದ ನಂತರ, ಅದು ಆ ಫೈಲ್ ಪಥವನ್ನು ಸಂಗ್ರಹಕ್ಕೆ ಸೇರಿಸುತ್ತದೆ ಇದರಿಂದ ಭವಿಷ್ಯದಲ್ಲಿ ಅದನ್ನು ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಲಾಗುವುದಿಲ್ಲ. ಹಳದಿ ಗುಂಡಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ನೀವು ಸಂಗ್ರಹವನ್ನು ವೀಕ್ಷಿಸಬಹುದು / ಸಂಪಾದಿಸಬಹುದು / ತೆರವುಗೊಳಿಸಬಹುದು.","Replace original file always?":"ಮೂಲ ಫೈಲ್ ಅನ್ನು ಯಾವಾಗಲೂ ಬದಲಾಯಿಸಬೇಕೆ?","The original file will be replaced regardless of whether the new file is larger or smaller.":"ಹೊಸ ಫೈಲ್ ದೊಡ್ಡದಾಗಿದೆ ಅಥವಾ ಚಿಕ್ಕದಾಗಿದೆ ಎಂಬುದನ್ನು ಲೆಕ್ಕಿಸದೆ ಮೂಲ ಫೈಲ್ ಅನ್ನು ಬದಲಾಯಿಸಲಾಗುತ್ತದೆ.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"ಮತ್ತೆ, ನಿಮ್ಮ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ನಿಮ್ಮ ಮೂಲ ಫೋಲ್ಡರ್ / ಅಥವಾ ಒಳಗೆ ಇಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ ಅಥವಾ ಅದು ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದಿಲ್ಲ.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast ಒಂದು ನಿರ್ದಿಷ್ಟ ಫೈಲ್ ಅನ್ನು ಟ್ರಾನ್ಸ್ಕೋಡ್ ಮಾಡಿದ ನಂತರ, ಅದು ಆ ಫೈಲ್ ಪಥವನ್ನು ಸಂಗ್ರಹಕ್ಕೆ ಸೇರಿಸುತ್ತದೆ ಇದರಿಂದ ಭವಿಷ್ಯದಲ್ಲಿ ಅದನ್ನು ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಲಾಗುವುದಿಲ್ಲ. ಹಳದಿ ಗುಂಡಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ನೀವು ಸಂಗ್ರಹವನ್ನು ವೀಕ್ಷಿಸಬಹುದು / ಸಂಪಾದಿಸಬಹುದು / ತೆರವುಗೊಳಿಸಬಹುದು.","Copy subtitle (srt) files to destination?":"ಉಪಶೀರ್ಷಿಕೆ (srt) ಫೈಲ್‌ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನಕ್ಕೆ ನಕಲಿಸುವುದೇ?","Subtitle '.srt' files will be copied to the destination folder automatically.":"ಉಪಶೀರ್ಷಿಕೆ '.srt' ಫೈಲ್‌ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗೆ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ನಕಲಿಸಲಾಗುತ್ತದೆ.","Automatically create temporary/destination folders if they don't exist?":"ತಾತ್ಕಾಲಿಕ / ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್‌ಗಳು ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲದಿದ್ದರೆ ಅವುಗಳನ್ನು ಸ್ವಯಂಚಾಲಿತವಾಗಿ ರಚಿಸುವುದೇ?","Custom bat path to run after each conversion (leave blank if not using):":"ಪ್ರತಿ ಪರಿವರ್ತನೆಯ ನಂತರ ಚಲಾಯಿಸಲು ಕಸ್ಟಮ್ ಬ್ಯಾಟ್ ಮಾರ್ಗ (ಬಳಸದಿದ್ದರೆ ಖಾಲಿ ಬಿಡಿ):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"ಪ್ರತಿ ಪರಿವರ್ತನೆಯ ನಂತರ ನೀವು ಕಾರ್ಯಗತಗೊಳಿಸಲು ಬಯಸುವ ಕಸ್ಟಮ್ ಬ್ಯಾಚ್ ಫೈಲ್‌ಗೆ ಮಾರ್ಗವನ್ನು ನಮೂದಿಸಿ. ಉದಾಹರಣೆಗೆ:","Batch files with timeout statements won't work. More info here:":"ಕಾಲಾವಧಿ ಹೇಳಿಕೆಗಳೊಂದಿಗೆ ಬ್ಯಾಚ್ ಫೈಲ್‌ಗಳು ಕಾರ್ಯನಿರ್ವಹಿಸುವುದಿಲ್ಲ. ಹೆಚ್ಚಿನ ಮಾಹಿತಿ ಇಲ್ಲಿ:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"ಈ ಆಯ್ಕೆಯನ್ನು ಬಳಸಲು ನೀವು ಬಯಸದಿದ್ದರೆ ಬಾಕ್ಸ್ ಅನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ಖಾಲಿ ಬಿಡಿ (ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಯಾವುದೇ ಗುಪ್ತ ಅಕ್ಷರಗಳಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ)","Run processes at low priority?":"ಕಡಿಮೆ ಆದ್ಯತೆಯಲ್ಲಿ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ನಡೆಸುವುದೇ?","All conversion processes will be run at low priority, reducing processor usage.":"ಎಲ್ಲಾ ಪರಿವರ್ತನೆ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ಕಡಿಮೆ ಆದ್ಯತೆಯಲ್ಲಿ ನಡೆಸಲಾಗುವುದು, ಪ್ರೊಸೆಸರ್ ಬಳಕೆಯನ್ನು ಕಡಿಮೆ ಮಾಡುತ್ತದೆ.","Remove apostrophes from filenames:":"ಫೈಲ್ ಹೆಸರುಗಳಿಂದ ಅಪಾಸ್ಟ್ರಫಿಗಳನ್ನು ತೆಗೆದುಹಾಕಿ:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"ಫೈಲ್ ಹೆಸರುಗಳು ಅಪಾಸ್ಟ್ರಫಿಗಳನ್ನು ಹೊಂದಿದ್ದರೆ ಪರಿವರ್ತನೆಗಳು / ಆರೋಗ್ಯ ಪರಿಶೀಲನೆ ಸ್ಕ್ಯಾನ್ಗಳು ವಿಫಲವಾಗಬಹುದು. ಫೈಲ್ ಹೆಸರುಗಳಿಂದ ಅಪಾಸ್ಟ್ರಫಿಗಳನ್ನು ಸ್ವಯಂಚಾಲಿತವಾಗಿ ತೆಗೆದುಹಾಕಲು ಇದನ್ನು ಪರಿಶೀಲಿಸಿ."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"ಈ ವೈಶಿಷ್ಟ್ಯವು ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ನ '- ಸ್ಕ್ಯಾನ್' ವೈಶಿಷ್ಟ್ಯವನ್ನು ಬಳಸಿಕೊಂಡು ಭ್ರಷ್ಟ ವೀಡಿಯೊ ಫೈಲ್‌ಗಳನ್ನು ಸ್ಕ್ಯಾನ್ ಮಾಡಬಹುದು, ಆದರೂ ಇದು ಯಾವಾಗಲೂ ನಿಖರವಾಗಿರುವುದಿಲ್ಲ. ಇದು ಎರಡನೇ ಉಲ್ಲೇಖ ಬಿಂದುವನ್ನು ಒದಗಿಸಲು ಎಫ್‌ಎಫ್‌ಪ್ರೊಬ್ ಅನ್ನು ಸಹ ಬಳಸುತ್ತದೆ. ಎಫ್‌ಎಫ್‌ಪ್ರೊಬ್ ಮತ್ತು ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ಎರಡೂ ವಿಫಲವಾದರೆ ಫೈಲ್ ಭ್ರಷ್ಟವಾಗುವ ಹೆಚ್ಚಿನ ಅವಕಾಶವಿದೆ.","Move corrupt files into the following folder:":"ಭ್ರಷ್ಟ ಫೈಲ್‌ಗಳನ್ನು ಈ ಕೆಳಗಿನ ಫೋಲ್ಡರ್‌ಗೆ ಸರಿಸಿ:"," If checked, then any files which give errors will be moved into the specified folder.":"ಪರಿಶೀಲಿಸಿದರೆ, ದೋಷಗಳನ್ನು ನೀಡುವ ಯಾವುದೇ ಫೈಲ್‌ಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಿದ ಫೋಲ್ಡರ್‌ಗೆ ಸರಿಸಲಾಗುತ್ತದೆ.","Corrupt file folder:":"ಭ್ರಷ್ಟ ಫೈಲ್ ಫೋಲ್ಡರ್:","Run thorough file health check:":"ಸಂಪೂರ್ಣ ಫೈಲ್ ಆರೋಗ್ಯ ಪರಿಶೀಲನೆಯನ್ನು ಚಲಾಯಿಸಿ:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"ಪರಿಶೀಲಿಸಿದರೆ, ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್‌ನ ಬದಲಾಗಿ ಎಫ್‌ಎಫ್‌ಎಂಪಿಗ್ ಬಳಸಿ ಹೆಚ್ಚು ನಿಧಾನವಾದ, ಹೆಚ್ಚು ಸಂಪೂರ್ಣವಾದ ವೀಡಿಯೊ ಆರೋಗ್ಯ ತಪಾಸಣೆ ನಡೆಸಲಾಗುತ್ತದೆ."," Based on Desani's 'ScanMedia.ps1' found at:":"ದೇಸಾನಿಯ 'ಸ್ಕ್ಯಾನ್ ಮೀಡಿಯಾ.ಪಿಎಸ್ 1' ಅನ್ನು ಆಧರಿಸಿ:","Attempt to repair files after thorough check:":"ಸಂಪೂರ್ಣ ಪರಿಶೀಲನೆಯ ನಂತರ ಫೈಲ್‌ಗಳನ್ನು ಸರಿಪಡಿಸುವ ಪ್ರಯತ್ನ:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"ಪರಿಶೀಲಿಸಿದರೆ, ಎಚ್‌ಬಿ ಬ್ಯಾಚ್‌ಬೀಸ್ಟ್ ಎಫ್‌ಎಫ್‌ಎಂಪಿಗ್ ಬಳಸಿ ಫೈಲ್‌ಗಳನ್ನು ರಿಪೇರಿ ಮಾಡಲು ಪ್ರಯತ್ನಿಸುತ್ತದೆ. ಮೂಲ ಫೈಲ್‌ನಂತೆಯೇ ಅದೇ ಫೋಲ್ಡರ್‌ನಲ್ಲಿ '_ ರಿಪೇರಿಡ್' ಪ್ರತ್ಯಯದೊಂದಿಗೆ ಹೊಸ ಫೈಲ್ ಅನ್ನು ರಚಿಸಲಾಗುತ್ತದೆ.","'CRF' value to use when attempting to repair files:":"ಫೈಲ್‌ಗಳನ್ನು ರಿಪೇರಿ ಮಾಡಲು ಪ್ರಯತ್ನಿಸುವಾಗ ಬಳಸಬೇಕಾದ 'ಸಿಆರ್‌ಎಫ್' ಮೌಲ್ಯ:","The default 'CRF' value is 23. Please see the following for more information:":"ಡೀಫಾಲ್ಟ್ 'ಸಿಆರ್ಎಫ್' ಮೌಲ್ಯ 23. ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗಾಗಿ ದಯವಿಟ್ಟು ಈ ಕೆಳಗಿನವುಗಳನ್ನು ನೋಡಿ:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"ಸಿಆರ್ಎಫ್ ಸ್ಕೇಲ್ನ ವ್ಯಾಪ್ತಿಯು 0–51 ಆಗಿದೆ, ಅಲ್ಲಿ 0 ನಷ್ಟವಿಲ್ಲ, 23 ಡೀಫಾಲ್ಟ್ ಆಗಿದೆ, ಮತ್ತು 51 ಕೆಟ್ಟ ಗುಣಮಟ್ಟವಾಗಿದೆ. ಕಡಿಮೆ ಮೌಲ್ಯವು ಸಾಮಾನ್ಯವಾಗಿ ಉತ್ತಮ ಗುಣಮಟ್ಟಕ್ಕೆ ಕಾರಣವಾಗುತ್ತದೆ, ಮತ್ತು ವ್ಯಕ್ತಿನಿಷ್ಠವಾಗಿ ವಿವೇಕದ ಶ್ರೇಣಿ 17–28. 17 ಅಥವಾ 18 ಅನ್ನು ದೃಷ್ಟಿ ನಷ್ಟವಿಲ್ಲದ ಅಥವಾ ಹೆಚ್ಚು ಎಂದು ಪರಿಗಣಿಸಿ; ಇದು ಇನ್ಪುಟ್ನಂತೆಯೇ ಅಥವಾ ಬಹುತೇಕ ಒಂದೇ ರೀತಿ ಕಾಣಬೇಕು ಆದರೆ ಅದು ತಾಂತ್ರಿಕವಾಗಿ ನಷ್ಟವಿಲ್ಲ.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast ಅವ್ಯಕ್ತ ಎಂದು ವರದಿ ಮಾಡಲಾದ ಸ್ಕ್ಯಾನ್ ಮಾಡಿದ ಫೈಲ್ ಪಥಗಳ ಪಟ್ಟಿಯನ್ನು ಉಳಿಸುತ್ತದೆ. ಎಲ್ಲಾ ಫೈಲ್‌ಗಳಲ್ಲಿ ಹೊಸ ಸ್ಕ್ಯಾನ್ ಮಾಡಲು ಸಂಗ್ರಹವನ್ನು ತೆರವುಗೊಳಿಸಿ.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"ಬಳಸಲು ಏಕಕಾಲಿಕ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ / ಎಫ್‌ಎಫ್‌ಎಂಪಿಗ್ ನಿದರ್ಶನಗಳ ಸಂಖ್ಯೆ? (ಶಿಫಾರಸು 4 ಅಥವಾ ಅದಕ್ಕಿಂತ ಕಡಿಮೆ):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"ಈ ಸೆಟ್ಟಿಂಗ್ \"ವೀಡಿಯೊ ಆರೋಗ್ಯ ಪರಿಶೀಲನೆ\" ಮತ್ತು \"ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತನೆ\" ಪ್ರಕ್ರಿಯೆಗಳಿಗೆ ಅನ್ವಯಿಸುತ್ತದೆ. ಎಷ್ಟು ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ಎಳೆಗಳನ್ನು ಬಳಸಬೇಕೆಂದು ನಿರ್ದಿಷ್ಟಪಡಿಸಿ. 4 ಕ್ಕಿಂತ ಹೆಚ್ಚು ಬಳಸದಂತೆ ಶಿಫಾರಸು ಮಾಡಲಾಗಿದ್ದರೂ ಗರಿಷ್ಠ ಇಲ್ಲ. ಹೆಚ್ಚಿನ ಪ್ರಮಾಣವು ನಿಮ್ಮ ಕಂಪ್ಯೂಟರ್ ಅನ್ನು ಹೆಚ್ಚು ಶಕ್ತಿಯುತವಾಗಿರದಿದ್ದರೆ ಫ್ರೀಜ್ ಮಾಡಬಹುದು.","Queue size view limit?(Recommended 1000 or fewer):":"ಕ್ಯೂ ಗಾತ್ರದ ವೀಕ್ಷಣೆ ಮಿತಿ? (ಶಿಫಾರಸು 1000 ಅಥವಾ ಕಡಿಮೆ):","Automatically start \"Scan and convert\" when program opened?:":"ಪ್ರೋಗ್ರಾಂ ತೆರೆದಾಗ ಸ್ವಯಂಚಾಲಿತವಾಗಿ \"ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತನೆ\" ಪ್ರಾರಂಭಿಸಿ?:","Save verbose logs?:":"ಮೌಖಿಕ ದಾಖಲೆಗಳನ್ನು ಉಳಿಸುವುದೇ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"ವಿವರವಾದ ಉಪ-ಪ್ರಕ್ರಿಯೆಯ ಲಾಗ್‌ಗಳನ್ನು ಉಳಿಸಲು ಈ ಚೆಕ್‌ಬಾಕ್ಸ್ ಪರಿಶೀಲಿಸಿ. ಇದು ವರ್ಕರ್ ಕನ್ಸೋಲ್ put ಟ್ಪುಟ್ ಅನ್ನು ಒಳಗೊಂಡಿದೆ. ಇದು ಬಹಳ ದೊಡ್ಡ ದಾಖಲೆಗಳಿಗೆ ಕಾರಣವಾಗುತ್ತದೆ.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"ಆರೋಗ್ಯ ತಪಾಸಣೆ ಅಥವಾ ಪರಿವರ್ತನೆ / ಫೋಲ್ಡರ್ ವೀಕ್ಷಣೆಯ ಸಮಯದಲ್ಲಿ ದೋಷ ಎದುರಾದರೆ ಇಮೇಲ್ ಅಧಿಸೂಚನೆಗಳನ್ನು ಸ್ವೀಕರಿಸಲು ಇಮೇಲ್ ವಿವರಗಳನ್ನು ಭರ್ತಿ ಮಾಡಿ. 2FA ಅಗತ್ಯವಿರುವ ಖಾತೆಗಳೊಂದಿಗೆ ಕೆಲಸ ಮಾಡುವುದಿಲ್ಲ. Gmail ಖಾತೆಗಳಲ್ಲಿ ಕಡಿಮೆ ಸುರಕ್ಷಿತ ಅಪ್ಲಿಕೇಶನ್‌ಗಳಿಗೆ ನೀವು ಪ್ರವೇಶವನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಬೇಕಾಗಿದೆ.","Email address:":"ಇಮೇಲ್ ವಿಳಾಸ:","For example:":"ಉದಾಹರಣೆಗೆ:","Email password(not saved):":"ಇಮೇಲ್ ಪಾಸ್ವರ್ಡ್ (ಉಳಿಸಲಾಗಿಲ್ಲ):","SMTP server:":"SMTP ಸರ್ವರ್:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"ಈ ವೈಶಿಷ್ಟ್ಯವು ಯಾವುದೇ ವೆಬ್ ಬ್ರೌಸರ್ ಬಳಸಿ ಪರಿವರ್ತನೆ / ಆರೋಗ್ಯ ಪರಿಶೀಲನೆ ಸ್ಥಿತಿಯನ್ನು ಮೇಲ್ವಿಚಾರಣೆ ಮಾಡಲು ಅನುಮತಿಸುತ್ತದೆ. ಸರ್ವರ್‌ಗಳನ್ನು ಚಲಾಯಿಸುವಾಗ ಉಪಯುಕ್ತವಾಗಿದೆ. ಯಾವುದೇ ಫೈಲ್ ಹೆಸರುಗಳನ್ನು ಕಳುಹಿಸಲಾಗುವುದಿಲ್ಲ.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"ಸಕ್ರಿಯಗೊಳಿಸಿದ್ದರೆ, ಈ ಕೆಳಗಿನ ಅನಾಮಧೇಯ ಡೇಟಾವನ್ನು HBBatchBeast.io ಗೆ ಕಳುಹಿಸಲಾಗುತ್ತದೆ:","API key":"API ಕೀ","Current status ('Searching', 'Running', 'Finished' etc)":"ಪ್ರಸ್ತುತ ಸ್ಥಿತಿ ('ಹುಡುಕಲಾಗುತ್ತಿದೆ', 'ರನ್ನಿಂಗ್', 'ಮುಗಿದಿದೆ' ಇತ್ಯಾದಿ)","Number of:":"ಸಂಖ್ಯೆ:","Remaining items":"ಉಳಿದ ವಸ್ತುಗಳು","Successful items":"ಯಶಸ್ವಿ ವಸ್ತುಗಳು","Errored items":"ತಪ್ಪಾದ ವಸ್ತುಗಳು","Cancelled items":"ರದ್ದುಗೊಳಿಸಿದ ವಸ್ತುಗಳು","Worker percentages":"ಕಾರ್ಮಿಕರ ಶೇಕಡಾವಾರು","Last completed item time":"ಕೊನೆಯದಾಗಿ ಪೂರ್ಣಗೊಂಡ ಐಟಂ ಸಮಯ","Enable remote monitoring?:":"ದೂರಸ್ಥ ಮೇಲ್ವಿಚಾರಣೆಯನ್ನು ಸಕ್ರಿಯಗೊಳಿಸುವುದೇ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"16+ ಕೋರ್ ಪ್ರೊಸೆಸರ್‌ಗಳು ಅನೇಕ ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ನಿದರ್ಶನಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಹೇಗೆ ಕಾರ್ಯನಿರ್ವಹಿಸುತ್ತವೆ ಎಂಬುದನ್ನು ನೋಡಲು ಮುಖ್ಯವಾಗಿ ನಿರ್ಮಿಸಲಾದ ಒಂದು ಮೂಲ ಮಾನದಂಡದ ಉಪಯುಕ್ತತೆಯನ್ನು ಯಾವುದೇ ರೀತಿಯ ಪ್ರೊಸೆಸರ್‌ನಲ್ಲಿ ಚಲಾಯಿಸಬಹುದು.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"ಇದು h265 4k ಸ್ಯಾಂಪಲ್ ಫೈಲ್ (2.5MB) ಅನ್ನು ಡೌನ್‌ಲೋಡ್ ಮಾಡುತ್ತದೆ ಮತ್ತು ಮೊದಲೇ \"ವೆರಿ ಫಾಸ್ಟ್ 1080p30\" ನೊಂದಿಗೆ 4 ಹ್ಯಾಂಡ್‌ಬ್ರೇಕ್ ನಿದರ್ಶನಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಮಾನದಂಡವನ್ನು ಚಲಾಯಿಸುತ್ತದೆ.","Results can be uploaded to hbbatchbeast.io if you choose.":"ನೀವು ಆರಿಸಿದರೆ ಫಲಿತಾಂಶಗಳನ್ನು hbbatchbeast.io ಗೆ ಅಪ್‌ಲೋಡ್ ಮಾಡಬಹುದು.","Queue":"ಕ್ಯೂ","Output this session":"ಈ ಅಧಿವೇಶನವನ್ನು put ಟ್ಪುಟ್ ಮಾಡಿ","Media info viewer tool":"ಮಾಧ್ಯಮ ಮಾಹಿತಿ ವೀಕ್ಷಕ ಸಾಧನ","View replaced file cache":"ಬದಲಾದ ಫೈಲ್ ಸಂಗ್ರಹವನ್ನು ವೀಕ್ಷಿಸಿ","Clear replaced file cache":"ಬದಲಾದ ಫೈಲ್ ಸಂಗ್ರಹವನ್ನು ತೆರವುಗೊಳಿಸಿ","Save config":"ಸಂರಚನೆಯನ್ನು ಉಳಿಸಿ","Scan only":"ಸ್ಕ್ಯಾನ್ ಮಾತ್ರ","Scan and convert":"ಸ್ಕ್ಯಾನ್ ಮಾಡಿ ಮತ್ತು ಪರಿವರ್ತಿಸಿ","View scan/conversion summary log":"ಸ್ಕ್ಯಾನ್ / ಪರಿವರ್ತನೆ ಸಾರಾಂಶ ಲಾಗ್ ವೀಕ್ಷಿಸಿ","View individual file check/conversion log":"ಪ್ರತ್ಯೇಕ ಫೈಲ್ ಚೆಕ್ / ಪರಿವರ್ತನೆ ಲಾಗ್ ವೀಕ್ಷಿಸಿ","View worker console output":"ವರ್ಕರ್ ಕನ್ಸೋಲ್ .ಟ್‌ಪುಟ್ ವೀಕ್ಷಿಸಿ","Health check":"ಆರೋಗ್ಯ ತಪಾಸಣೆ","Clear healthy file cache":"ಆರೋಗ್ಯಕರ ಫೈಲ್ ಸಂಗ್ರಹವನ್ನು ತೆರವುಗೊಳಿಸಿ","View error log":"ದೋಷ ಲಾಗ್ ವೀಕ್ಷಿಸಿ","Email test":"ಇಮೇಲ್ ಪರೀಕ್ಷೆ","View master log":"ಮಾಸ್ಟರ್ ಲಾಗ್ ವೀಕ್ಷಿಸಿ","Wiki help":"ವಿಕಿ ಸಹಾಯ","An application by HaveAGitGat":"HaveAGitGat ನಿಂದ ಅಪ್ಲಿಕೇಶನ್","New":"ಹೊಸದು","Launch":"ಪ್ರಾರಂಭಿಸಿ","Benchmark":"ಮಾನದಂಡ","See results":"ಫಲಿತಾಂಶಗಳನ್ನು ನೋಡಿ","Pause queue":"ಕ್ಯೂ ಅನ್ನು ವಿರಾಮಗೊಳಿಸಿ","Continue queue":"ಕ್ಯೂ ಮುಂದುವರಿಸಿ","Stop queue":"ಕ್ಯೂ ನಿಲ್ಲಿಸಿ","Convert selected files":"ಆಯ್ದ ಫೈಲ್‌ಗಳನ್ನು ಪರಿವರ್ತಿಸಿ","Toggle queue view":"ಕ್ಯೂ ವೀಕ್ಷಣೆಯನ್ನು ಟಾಗಲ್ ಮಾಡಿ","Deselect all":"ಎಲ್ಲವನ್ನೂ ಆಯ್ಕೆ ರದ್ದುಮಾಡಿ","Invert all":"ಎಲ್ಲವನ್ನೂ ತಿರುಗಿಸಿ","Select all":"ಎಲ್ಲವನ್ನು ಆರಿಸು","Toggle output view":"Output ಟ್‌ಪುಟ್ ವೀಕ್ಷಣೆಯನ್ನು ಟಾಗಲ್ ಮಾಡಿ"}