{
    "The number of custom presets does not match the number of source folders!": "ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳು ಸಂಖ್ಯೆ ಮೂಲ ಫೋಲ್ಡರ್ಗಳ ಸಂಖ್ಯೆಗೆ ಹೊಂದಿಕೆಯಾಗುವುದಿಲ್ಲ!",
    "source folders have been detected.": "ಮೂಲ ಫೋಲ್ಡರ್ಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಲಾಗಿದೆ.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "ಕಸ್ಟಮ್ ಪೂರ್ವನಿಯೋಜಿತ ಸಾಲುಗಳನ್ನು ಪತ್ತೆ ಮಾಡಲಾಗಿದೆ. ಅಗೋಚರ ಲೈನ್ ಬ್ರೇಕ್ಗಳಿಗಾಗಿ ದಯವಿಟ್ಟು ಎರಡು ಬಾರಿ ಪರಿಶೀಲಿಸಿ. ಒಂದು ಫೋಲ್ಡರ್ ಪಥ ಅಥವಾ ಸಾಲಿಗೆ ಮೊದಲೇ ಇರಬೇಕು. ನೀವು ಆಕಸ್ಮಿಕವಾಗಿ ಖಾಲಿ ರೇಖೆಯನ್ನು ಸೃಷ್ಟಿಸಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.",
    "The number of filename suffixes does not match the number of source folders! ": "ಕಡತದ ಹೆಸರಿನ ಪ್ರತ್ಯಯಗಳ ಸಂಖ್ಯೆ ಮೂಲ ಫೋಲ್ಡರ್ಗಳ ಸಂಖ್ಯೆಗೆ ಹೊಂದಿಕೆಯಾಗುವುದಿಲ್ಲ!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "ಕಡತ ಹೆಸರಿನ ಪ್ರತ್ಯಯ ಸಾಲುಗಳನ್ನು ಪತ್ತೆ ಮಾಡಲಾಗಿದೆ. ಅಗೋಚರ ಲೈನ್ ಬ್ರೇಕ್ಗಳಿಗಾಗಿ ದಯವಿಟ್ಟು ಎರಡು ಬಾರಿ ಪರಿಶೀಲಿಸಿ. ಪ್ರತಿ ಫೋಲ್ಡರ್ಗೆ ಒಂದು ಮಾರ್ಗ ಅಥವಾ ಫೈಲ್ ಹೆಸರಿನ ಪ್ರತ್ಯಯ ಇರಬೇಕು. ನೀವು ಆಕಸ್ಮಿಕವಾಗಿ ಖಾಲಿ ರೇಖೆಯನ್ನು ಸೃಷ್ಟಿಸಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.",
    "The number of source folders does not match the number of destination folders!": "ಮೂಲ ಫೋಲ್ಡರ್ಗಳು ಸಂಖ್ಯೆಯ ಫೋಲ್ಡರ್ಗಳ ಸಂಖ್ಯೆಗೆ ಹೊಂದಿಕೆಯಾಗುವುದಿಲ್ಲ!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಲಾಗಿದೆ. ಅಗೋಚರ ಲೈನ್ ಬ್ರೇಕ್ಗಳಿಗಾಗಿ ದಯವಿಟ್ಟು ಎರಡು ಬಾರಿ ಪರಿಶೀಲಿಸಿ. ಪ್ರತಿ ಸಾಲಿಗೆ ಒಂದು ಫೋಲ್ಡರ್ ಮಾರ್ಗ ಇರಬೇಕು. ನೀವು ಆಕಸ್ಮಿಕವಾಗಿ ಖಾಲಿ ರೇಖೆಯನ್ನು ಸೃಷ್ಟಿಸಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.",
    "The number of source folders does not match the number of temporary conversion folders!": "ಮೂಲ ಫೋಲ್ಡರ್ಗಳು ಸಂಖ್ಯೆಯನ್ನು ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ಗಳಿಗೆ ಹೊಂದಿಕೆಯಾಗುವುದಿಲ್ಲ!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಲಾಗಿದೆ. ಅಗೋಚರ ಲೈನ್ ಬ್ರೇಕ್ಗಳಿಗಾಗಿ ದಯವಿಟ್ಟು ಎರಡು ಬಾರಿ ಪರಿಶೀಲಿಸಿ. ಪ್ರತಿ ಸಾಲಿಗೆ ಒಂದು ಫೋಲ್ಡರ್ ಮಾರ್ಗ ಇರಬೇಕು. ನೀವು ಆಕಸ್ಮಿಕವಾಗಿ ಖಾಲಿ ರೇಖೆಯನ್ನು ಸೃಷ್ಟಿಸಿಲ್ಲ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "ದಯವಿಟ್ಟು '.mp4' ನಂತಹ ಮಾನ್ಯವಾದ ಧಾರಕವನ್ನು ನಮೂದಿಸಿ. '.'",
    "Corrupt file folder": "ಭ್ರಷ್ಟ ಕಡತ ಫೋಲ್ಡರ್",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "ಅಸ್ತಿತ್ವದಲ್ಲಿ ಇಲ್ಲ! ಪಥದ ನಂತರ / ಮೊದಲು ಸ್ಥಳಾವಕಾಶಗಳು ಇಲ್ಲವೇ ಗುಪ್ತ ಅಕ್ಷರಗಳು ಇಲ್ಲವೆಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ",
    "Source folder": "ಮೂಲ ಫೋಲ್ಡರ್",
    "Temporary conversion folder": "ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್",
    "appears to be the same as or is within source folder": "ಮೂಲ ಫೋಲ್ಡರ್ನಂತೆ ಅಥವಾ ಅದೇ ರೀತಿ ಕಂಡುಬರುತ್ತದೆ",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "ಇದು HBBatchBeast ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದನ್ನು ತಡೆಯುತ್ತದೆ. ದಯವಿಟ್ಟು ಮೂಲ ಫೋಲ್ಡರ್ ಹೊರಗೆ ಫೋಲ್ಡರ್ಗೆ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ಅನ್ನು ಬದಲಾಯಿಸಿ. 'ಮೂಲ ಫೈಲ್ಗಳ ವೈಶಿಷ್ಟ್ಯವನ್ನು ಬದಲಾಯಿಸಿ' ಅನ್ನು ಬಳಸಲು ನೀವು ಬಯಸಿದರೆ, ದಯವಿಟ್ಟು ಮೂಲ ಫೋಲ್ಡರ್ನಂತೆ, ಅಥವಾ ಒಳಗೆ ಇರುವಂತಹ ಒಂದು ಡೆಸ್ಟಿನೇಶನ್ ಫೋಲ್ಡರ್ ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿ ಮತ್ತು ನಂತರ ಸುಧಾರಿತ ಸೆಟ್ಟಿಂಗ್ಗಳ ವಿಭಾಗದಲ್ಲಿ 'ಮೂಲ ಫೈಲ್ಗಳನ್ನು ಯಾವಾಗಲೂ ಬದಲಾಯಿಸಿ' ಚೆಕ್ಬಾಕ್ಸ್ ಅನ್ನು ಪರಿಶೀಲಿಸಿ . ತಾತ್ಕಾಲಿಕ 'ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್' ಚೆಕ್ಬಾಕ್ಸ್ ಅನ್ನು ಅನ್ಚೆಕ್ ಮಾಡಿ ಅದು ಈ ಸಂದರ್ಭದಲ್ಲಿ ಯಾವುದೇ ಉಪಯೋಗವನ್ನು ನೀಡುವುದಿಲ್ಲ. ಫೈಲ್ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ಗೆ ಪರಿವರ್ತಿಸಲಾಗುತ್ತದೆ ಮತ್ತು ನಂತರ ಮೂಲ ಫೋಲ್ಡರ್ಗೆ ಹಿಂತಿರುಗಿಸಲಾಗುತ್ತದೆ.",
    "Destination folder": "ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "ಇದು HBBatchBeast ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದನ್ನು ತಡೆಯುತ್ತದೆ. ದಯವಿಟ್ಟು ಮೂಲ ಫೋಲ್ಡರ್ ಹೊರಗಿನ ಫೋಲ್ಡರ್ಗೆ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ಅನ್ನು ಬದಲಾಯಿಸಿ. 'ಮೂಲ ಫೈಲ್ಗಳ ವೈಶಿಷ್ಟ್ಯವನ್ನು ಬದಲಾಯಿಸಿ' ಅನ್ನು ಬಳಸಲು ನೀವು ಬಯಸಿದರೆ, ದಯವಿಟ್ಟು ಮೂಲ ಫೋಲ್ಡರ್ನಂತೆ, ಅಥವಾ ಒಳಗೆ ಇರುವಂತಹ ಒಂದು ಡೆಸ್ಟಿನೇಶನ್ ಫೋಲ್ಡರ್ ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿ ಮತ್ತು ನಂತರ ಸುಧಾರಿತ ಸೆಟ್ಟಿಂಗ್ಗಳ ವಿಭಾಗದಲ್ಲಿ 'ಮೂಲ ಫೈಲ್ಗಳನ್ನು ಯಾವಾಗಲೂ ಬದಲಾಯಿಸಿ' ಚೆಕ್ಬಾಕ್ಸ್ ಅನ್ನು ಪರಿಶೀಲಿಸಿ . ತಾತ್ಕಾಲಿಕ 'ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್' ಚೆಕ್ಬಾಕ್ಸ್ ಅನ್ನು ಅನ್ಚೆಕ್ ಮಾಡಿ ಅದು ಈ ಸಂದರ್ಭದಲ್ಲಿ ಯಾವುದೇ ಉಪಯೋಗವನ್ನು ನೀಡುವುದಿಲ್ಲ. ಫೈಲ್ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ಗೆ ಪರಿವರ್ತಿಸಲಾಗುತ್ತದೆ ಮತ್ತು ನಂತರ ಮೂಲ ಫೋಲ್ಡರ್ಗೆ ಹಿಂತಿರುಗಿಸಲಾಗುತ್ತದೆ.",
    "Error creating temporary conversion folder": "ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ರಚಿಸುವಲ್ಲಿ ದೋಷ",
    "Error creating destination folder": "ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ರಚಿಸುವಲ್ಲಿ ದೋಷ",
    "Please select to use HandBrake or FFmpeg!": "ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ ಅಥವಾ FFmpeg ಬಳಸಲು ದಯವಿಟ್ಟು ಆಯ್ಕೆಮಾಡಿ!",
    "Please select a standard preset or input a custom one!": "ದಯವಿಟ್ಟು ಪ್ರಮಾಣಿತ ಪೂರ್ವನಿಯೋಜಿತವನ್ನು ಆಯ್ಕೆಮಾಡಿ ಅಥವಾ ಕಸ್ಟಮ್ ಒಂದನ್ನು ಇನ್ಪುಟ್ ಮಾಡಿ!",
    "Please select a scan interval of 5 seconds or greater!": "ದಯವಿಟ್ಟು 5 ಸೆಕೆಂಡುಗಳ ಸ್ಕ್ಯಾನ್ ವಿರಾಮವನ್ನು ಅಥವಾ ಹೆಚ್ಚಿನದನ್ನು ಆಯ್ಕೆ ಮಾಡಿ!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "ಏಕಕಾಲದಲ್ಲಿ ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ / ಎಫ್ಎಫ್ಎಂಪಿಗ್ ನಿದರ್ಶನಗಳನ್ನು ಬಳಸಲು ಒಂದು ಅಥವಾ ಹೆಚ್ಚಿನದು ಎಂಬುದನ್ನು ದಯವಿಟ್ಟು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "ಅಮಾನ್ಯವಾದ API ಕೀ! ಹೊಸ ಕೀಲಿಯನ್ನು ಸೃಷ್ಟಿಸಲು ರಿಮೋಟ್ ಮಾನಿಟರಿಂಗ್ ಟ್ಯಾಬ್ನಲ್ಲಿ 'ಹೊಸ' ಕ್ಲಿಕ್ ಮಾಡಿ.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "ದಯವಿಟ್ಟು 24 ಗಂಟೆಯ ಸ್ವರೂಪದಲ್ಲಿ ದೈನಂದಿನ ಸ್ಕ್ಯಾನ್ ಸಮಯವನ್ನು ನಮೂದಿಸಿ: hh: mm (ಉದಾಹರಣೆಗೆ 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "ಸಂಭಾಷಣೆ ನಂತರ ಮೂಲ ಫೈಲ್ಗಳನ್ನು ಅಳಿಸಲಾಗುವುದು! ಸರಿಯಾದ ಬಳಕೆಯನ್ನು ಪರೀಕ್ಷಿಸಲು ದಯವಿಟ್ಟು!",
    "Benchmark failed!": "ಬೆಂಚ್ಮಾರ್ಕ್ ವಿಫಲವಾಗಿದೆ!",
    "Log does not exist!": "ಲಾಗ್ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ!",
    "Folder does not exist!": "ಫೋಲ್ಡರ್ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ!",
    "Error sending email! Please check your settings.": "ಇಮೇಲ್ ಕಳುಹಿಸುವಲ್ಲಿ ದೋಷ! ದಯವಿಟ್ಟು ನಿಮ್ಮ ಸೆಟ್ಟಿಂಗ್ಗಳನ್ನು ಪರಿಶೀಲಿಸಿ.",
    "Test email sent!": "ಪರೀಕ್ಷೆಯ ಇಮೇಲ್ ಕಳುಹಿಸಲಾಗಿದೆ!",
    "All worker processes have been stopped.": "ಎಲ್ಲಾ ಕೆಲಸಗಾರರ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ನಿಲ್ಲಿಸಲಾಗಿದೆ.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "ಪ್ರಸ್ತುತ ಐಟಂಗಳು ಪ್ರಕ್ರಿಯೆ ಮುಗಿದ ನಂತರ ಸರತಿಯನ್ನು ವಿರಾಮಗೊಳಿಸಲಾಗುತ್ತದೆ. ಕ್ಯೂ ಅನ್ನು ವಿರಾಮಗೊಳಿಸಲು ನೀವು ಖಚಿತವಾಗಿ ಬಯಸುವಿರಾ?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "ಕ್ಯೂ ವಿರಾಮ ಪ್ರಾರಂಭಿಸಿದೆ. ಎಲ್ಲಾ ಕೆಲಸಗಾರರು ವಿರಾಮಗೊಳಿಸಿದ ನಂತರ 'ಮುಂದುವರಿಕೆ' ಬಟನ್ ಗೋಚರಿಸುತ್ತದೆ.",
    "Healthy file cache cleared!": "ಆರೋಗ್ಯಕರ ಫೈಲ್ ಸಂಗ್ರಹ ತೆರವುಗೊಳಿಸಲಾಗಿದೆ!",
    "Cache cleared!": "ಸಂಗ್ರಹ ತೆರವುಗೊಳಿಸಲಾಗಿದೆ!",
    "Cancel item": "ಐಟಂ ರದ್ದುಮಾಡಿ",
    "Please check the above checkbox to use this feature.": "ಈ ವೈಶಿಷ್ಟ್ಯವನ್ನು ಬಳಸಲು ದಯವಿಟ್ಟು ಮೇಲಿನ ಚೆಕ್ಬಾಕ್ಸ್ ಅನ್ನು ಪರಿಶೀಲಿಸಿ.",
    "Configuration": "ಸಂರಚನೆ",
    "Source folders": "ಮೂಲ ಫೋಲ್ಡರ್ಗಳು",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "ಮಾಧ್ಯಮಕ್ಕಾಗಿ ಸ್ಕ್ಯಾನ್ ಮಾಡಲಾಗುವ ಮೂಲ ಫೋಲ್ಡರ್ ಇದು. ಹಿಂಬಾಲಕ ಸ್ಲಾಶ್ನೊಂದಿಗೆ ಫೋಲ್ಡರ್ ನಮೂದಿಸಬೇಕಾಗಿದೆ. ಉದಾಹರಣೆಗೆ:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "ಮೂಲ ಫೋಲ್ಡರ್ ಮಾರ್ಗ ಪೆಟ್ಟಿಗೆಯನ್ನು ವಿಸ್ತರಿಸಬಹುದಾಗಿದೆ (ಹೊಸ ಸಾಲನ್ನು ರಚಿಸಲು ಎಂಟರ್ ಒತ್ತಿ). ನೀವು ಬಹು ಮೂಲ ಫೋಲ್ಡರ್ಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಲು ಬಯಸಿದರೆ, ಪ್ರತಿ ಮೂಲ ಫೋಲ್ಡರ್ ಹಾದಿ ತನ್ನದೇ ಸಾಲಿನಲ್ಲಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ:",
    "Video health check": "ವೀಡಿಯೊ ಆರೋಗ್ಯ ಪರಿಶೀಲನೆ",
    "Batch conversion and Folder watching": "ಬ್ಯಾಚ್ ಪರಿವರ್ತನೆ ಮತ್ತು ಫೋಲ್ಡರ್ ವೀಕ್ಷಣೆ",
    "Remote Monitoring (Beta)": "ರಿಮೋಟ್ ಮಾನಿಟರಿಂಗ್ (ಬೀಟಾ)",
    "Benchmark (Beta)": "ಬೆಂಚ್ಮಾರ್ಕ್ (ಬೀಟಾ)",
    "System": "ಸಿಸ್ಟಮ್",
    "Help": "ಸಹಾಯ",
    "Temporary conversion folders": "ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ಗಳು",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "\"ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್?\" ಪರೀಕ್ಷಿಸಲ್ಪಟ್ಟಿದೆ, ನಂತರ ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ ಫೈಲ್ಗಳನ್ನು ಆ ಫೋಲ್ಡರ್ಗೆ ಪರಿವರ್ತಿಸುತ್ತದೆ. ಪರಿವರ್ತನೆ ಪೂರ್ಣಗೊಂಡ ನಂತರ, ಫೈಲ್ ಅನ್ನು ನಿಮ್ಮ \"ಡೆಸ್ಟಿನೇಶನ್ ಫೋಲ್ಡರ್\" ಗೆ ವರ್ಗಾಯಿಸಲಾಗುತ್ತದೆ. ಮೂಲ ಫೋಲ್ಡರ್ಗಳಾಗಿ ಅನೇಕ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ಗಳನ್ನು ನೀವು ನಿರ್ದಿಷ್ಟಪಡಿಸಬೇಕಾಗಿದೆ. ನಿಮ್ಮ ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್ ಅನ್ನು ನಿಮ್ಮ ಮೊದಲ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ಆಗಿ ಪರಿವರ್ತಿಸಲಾಗುವುದು, ನಿಮ್ಮ ಎರಡನೆಯ ಮೂಲ ಫೋಲ್ಡರ್ ನಿಮ್ಮ ಎರಡನೆಯ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ಗೆ ಮತ್ತು ಹೀಗೆ. ಪ್ರತಿ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ಮಾರ್ಗವು ತನ್ನದೇ ಸಾಲಿನಲ್ಲಿದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ.",
    "Destination folders": "ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ಗಳು",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ ಹಾದಿಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಿ. ಮತ್ತೊಮ್ಮೆ, ನೀವು ಮೂಲ ಫೋಲ್ಡರ್ಗಳಾಗಿ ಹಲವು ತಾಣ ಫೋಲ್ಡರ್ಗಳನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಬೇಕಾಗಿದೆ. ನಿಮ್ಮ ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್ನಿಂದ ಫೈಲ್ಗಳು ನಿಮ್ಮ ಎರಡನೆಯ ಮೂಲ ಫೋಲ್ಡರ್ನಲ್ಲಿನ ನಿಮ್ಮ ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್ ಫೈಲ್ಗಳು ಮತ್ತು ನಿಮ್ಮ ಮೊದಲ destination ಫೋಲ್ಡರ್ನಲ್ಲಿ ಕೊನೆಗೊಳ್ಳುತ್ತದೆ.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್ ---------> ಮೊದಲ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ---------> ಮೊದಲ ಗಮ್ಯಸ್ಥಾನದ ಫೋಲ್ಡರ್",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್ ---------> ಎರಡನೇ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ---------> ಸೆಕೆಂಡ್ ಗಮ್ಯಸ್ಥಾನದ ಫೋಲ್ಡರ್",
    "etc": "ಇತ್ಯಾದಿ",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast ಗಮ್ಯಸ್ಥಾನದ ಫೋಲ್ಡರ್ ಅನ್ನು ನೀವು ಅದೇ ರೀತಿಯಲ್ಲಿ, ಅಥವಾ ಫೋಲ್ಡರ್ನ ಮೂಲ ಫೋಲ್ಡರ್ ಅನ್ನು ಹೊಂದಿಸಿದರೆ ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದಿಲ್ಲ.",
    "Standard preset:": "ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಪೂರ್ವನಿಯೋಜಿತ:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "ನಿಮ್ಮ ಫೈಲ್ಗಳನ್ನು ನೀವು ಪರಿವರ್ತಿಸಲು ಬಯಸುವ ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ ಮೊದಲೇ ಆಯ್ಕೆಮಾಡಿ. \"ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಪೂರ್ವನಿಯೋಜಿತ\" ಅನ್ನು ಆರಿಸಿದರೆ, ಆಯ್ಕೆ ಮಾಡಲಾದ ಫೋಲ್ಡರ್ಗಳಲ್ಲಿನ ಎಲ್ಲಾ ಫೈಲ್ಗಳನ್ನು ನಿರ್ದಿಷ್ಟ ಹ್ಯಾಂಡ್ಬ್ರ್ರೇ ಮೊದಲೇ ಬಳಸಿ ಪರಿವರ್ತಿಸಲಾಗುತ್ತದೆ. ಇಲ್ಲಿ ನೀವು ಹ್ಯಾಂಡ್ಬ್ರ್ರೇ ಪೂರ್ವಸೂಚಿಗಳ ಬಗ್ಗೆ ಇನ್ನಷ್ಟು ಕಂಡುಹಿಡಿಯಬಹುದು:",
    "Custom preset:": "ಕಸ್ಟಮ್ ಮೊದಲೇ:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "\"ಕಸ್ಟಮ್ ಮೊದಲೇ\" ಆಗಿದ್ದರೆ ನೀವು ನಿಮ್ಮ ಸ್ವಂತ ಕಸ್ಟಮ್ ಮೊದಲೇ ನಮೂದಿಸಬೇಕು. HBBatchBeast HandBrakeCLI ಇನ್ಪುಟ್ನ \"HandBrakeCLI -i source-a destination\" ಭಾಗವನ್ನು ಒಳಗೊಳ್ಳುತ್ತದೆ, ಆದ್ದರಿಂದ ನೀವು ಪರಿವರ್ತನೆ ನಿಯತಾಂಕಗಳನ್ನು ನಮೂದಿಸಬೇಕಾಗುತ್ತದೆ. ಉದಾಹರಣೆಗೆ:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "FFmpeg ಅನ್ನು ಬಳಸುತ್ತಿದ್ದರೆ, ನೀವು ಇನ್ಪುಟ್ ಮತ್ತು ಔಟ್ಪುಟ್ ನಿಯತಾಂಕಗಳನ್ನು ಅಲ್ಪವಿರಾಮದಿಂದ ಬೇರ್ಪಡಿಸಬೇಕು. ಇಂಥವುಗಳು:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "ಉದಾಹರಣೆಗೆ ನೀವು ಅಧಿಕೃತ ಹ್ಯಾಂಡ್ಬ್ರ್ಯಾಕ್ GUI ಅಪ್ಲಿಕೇಶನ್ನಿಂದ ರಫ್ತು ಮಾಡಲಾದ ಕಸ್ಟಮ್ ಮೊದಲೇಗೆ ಲಿಂಕ್ ಮಾಡಬಹುದು:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳೊಂದಿಗೆ ನೀವು ತೊಂದರೆ ಹೊಂದಿದ್ದರೆ, ಅದು ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ಎಲ್ಯೊಂದಿಗೆ ತಿಳಿದ ದೋಷದಿಂದಾಗಿರಬಹುದು (ಮುಂದಿನ HandBrakeCLI ಬಿಡುಗಡೆಯಲ್ಲಿ ನಿವಾರಿಸಲಾಗಿದೆ). ತಾತ್ಕಾಲಿಕ ಪರಿಹಾರಕ್ಕಾಗಿ ದಯವಿಟ್ಟು ಇದನ್ನು ನೋಡಿ:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "ಪ್ರತಿ ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳು ತನ್ನ ಸ್ವಂತ ಸಾಲಿನಲ್ಲಿರಬೇಕು ಮತ್ತು ಫೋಲ್ಡರ್ಗಳಿಗೆ ಹೋಲುತ್ತವೆ, ಮೂಲ ಫೋಲ್ಡರ್ಗಳಾಗಿ ಅನೇಕ ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳು ಇರಬೇಕು.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್ ---------> ಮೊದಲ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ---------> ಮೊದಲ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ @ ಕಸ್ಟಮ್ ಮೊದಲೇ 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್ ---------> ಎರಡನೆಯ ತಾತ್ಕಾಲಿಕ ಪರಿವರ್ತನೆ ಫೋಲ್ಡರ್ ---------> ಸೆಕೆಂಡ್ ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ @ ಕಸ್ಟಮ್ ಮೊದಲೇ 2",
    "See the following image for guidance:": "ಮಾರ್ಗದರ್ಶನಕ್ಕಾಗಿ ಕೆಳಗಿನ ಚಿತ್ರವನ್ನು ನೋಡಿ:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "ಗ್ರಾಫಿಕ್ಸ್ ಕಾರ್ಡ್ ಎನ್ಕೋಡಿಂಗ್ ಅನ್ನು ಬಳಸಿದರೆ (NVENC ನಂತಹ), ನಂತರ ನೀವು VRAM ಮಿತಿಗಳ ಕಾರಣ ಹ್ಯಾಂಡ್ಬ್ರ್ರೇ ನಿದರ್ಶನಗಳ ಸಂಖ್ಯೆ (2 ಅಥವಾ ಅದಕ್ಕಿಂತ ಕಡಿಮೆ ಪ್ರಯತ್ನಿಸಿ) ಕಡಿಮೆ ಮಾಡಬೇಕಾಗುತ್ತದೆ.",
    "Select standard preset:": "ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಮೊದಲೇ ಆಯ್ಕೆಮಾಡಿ:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC ಪತ್ತೆಯಾಗಿದೆ, ದಯವಿಟ್ಟು ಹ್ಯಾಂಡ್ಬ್ರಕ್ಕ್ಲೈ ನಿದರ್ಶನಗಳ ಸಂಖ್ಯೆಯನ್ನು 2 ಅಥವಾ ಅದಕ್ಕಿಂತ ಕಡಿಮೆ (ಹೆಚ್ಚಿನ ಗ್ರಾಫಿಕ್ಸ್ ಕಾರ್ಡುಗಳಿಗಾಗಿ) ಕಡಿಮೆಗೊಳಿಸಲು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ ಅಥವಾ ಸಾಕಷ್ಟು ವಿಆರ್ಎಎಮ್ಎಮ್ ಇರುವ ಕಾರಣ ದೋಷಗಳನ್ನು ನೀವು ಎದುರಿಸಬಹುದು. ಈ ಸೆಟ್ಟಿಂಗ್ ಅನ್ನು \"ಸಿಸ್ಟಮ್\" ಟ್ಯಾಬ್ನಲ್ಲಿ ಕಾಣಬಹುದು.",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "ಆಮದು ಪೂರ್ವನಿಗದಿಗಳು ಪತ್ತೆಯಾಗಿವೆ. ಆಮದು ಮಾಡಲಾದ ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗಳು ನಿಮಗೆ ತೊಂದರೆ ಹೊಂದಿದ್ದರೆ, ಅದು ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ಎಲ್ಯೊಂದಿಗೆ ತಿಳಿದಿರುವ ದೋಷದಿಂದಾಗಿರಬಹುದು (ಮುಂದಿನ HandBrakeCLI ಬಿಡುಗಡೆಯಲ್ಲಿ ನಿವಾರಿಸಲಾಗಿದೆ). 'PictureRotate': \"0: 0\" '.json ಫೈಲ್ನಿಂದ ತೆಗೆದುಹಾಕಲು ತಾತ್ಕಾಲಿಕ ಪರಿಹಾರವಾಗಿದೆ. ಇಲ್ಲಿ ಹೆಚ್ಚಿನ ಮಾಹಿತಿ:",
    "Container:": "ಧಾರಕ:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "'.Mp4' ನಂತಹ ಔಟ್ಪುಟ್ ಫೈಲ್ ಅನ್ನು ನೀವು ಹೊಂದಲು ಬಯಸುವ ಧಾರಕವನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಿ. ಧಾರಕಗಳ ಬಗ್ಗೆ ನೀವು ಇನ್ನಷ್ಟು ತಿಳಿದುಕೊಳ್ಳಬಹುದು:",
    "Enable periodic scanning:": "ಆವರ್ತಕ ಸ್ಕ್ಯಾನಿಂಗ್ ಸಕ್ರಿಯಗೊಳಿಸಿ:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast ನಿಮ್ಮ ಮೂಲ ಫೋಲ್ಡರ್ಗಳನ್ನು ಮೇಲ್ವಿಚಾರಣೆ ಮಾಡಬಹುದು ಮತ್ತು ನಿರ್ದಿಷ್ಟಪಡಿಸಿದ ಮಧ್ಯಂತರದಲ್ಲಿ ಹೊಸ ಫೈಲ್ಗಳಿಗಾಗಿ ಸ್ಕ್ಯಾನ್ಗಳನ್ನು ರನ್ ಮಾಡಬಹುದು. ಮಧ್ಯಂತರ ಸಮಯ ಸೆಕೆಂಡುಗಳಲ್ಲಿ ಡೀಫಾಲ್ಟ್ ಆಗಿರುತ್ತದೆ 300 ಸೆಕೆಂಡುಗಳು (5 ನಿಮಿಷಗಳು). ಈ ಆಯ್ಕೆಯನ್ನು ಆರಿಸಿದರೆ, ನೀವು \"ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತಿಸು\" ಅನ್ನು ಒತ್ತಿದಾಗ, ಪ್ರೋಗ್ರಾಂ ಯಾವುದೇ ಹೊಸ ಫೈಲ್ಗಳನ್ನು ಪರಿವರ್ತಿಸುತ್ತದೆ ಮತ್ತು ಕೌಂಟ್ಡೌನ್ ಟೈಮರ್ ಪ್ರಾರಂಭವಾಗುತ್ತದೆ. ನಿಲ್ಲಿಸಿದ ತನಕ ಇದು ಲೂಪ್ ಕೊನೆಯಿರುತ್ತದೆ. ಸ್ಕ್ಯಾನ್ ಮಧ್ಯಂತರವು ಸುಧಾರಿತ ಸೆಟ್ಟಿಂಗ್ಗಳ ವಿಭಾಗದಲ್ಲಿದೆ.",
    "Enable daily scanning:": "ದಿನನಿತ್ಯದ ಸ್ಕ್ಯಾನಿಂಗ್ ಸಕ್ರಿಯಗೊಳಿಸಿ:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "ಆವರ್ತಕ ಸ್ಕ್ಯಾನಿಂಗ್ಗೆ ಬದಲಾಗಿ, ದಿನಕ್ಕೆ ಒಮ್ಮೆ ಸ್ಕ್ಯಾನ್ ಮಾಡಲು ನೀವು ಆಯ್ಕೆ ಮಾಡಬಹುದು. '18: 30 'ನಂತಹ hh: mm ರೂಪದಲ್ಲಿ ಸುಧಾರಿತ ಸೆಟ್ಟಿಂಗ್ಗಳ ವಿಭಾಗದಲ್ಲಿ ಸ್ಕ್ಯಾನ್ ಸಮಯ ನಮೂದಿಸಲಾಗಿದೆ. \"ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತನೆ\" ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿದ ನಂತರ, ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತನೆ ಪ್ರಕ್ರಿಯೆಯನ್ನು ಚಾಲನೆ ಮಾಡುವವರೆಗೂ ನಿರ್ದಿಷ್ಟ ಸಮಯದವರೆಗೆ ಪ್ರೋಗ್ರಾಂ ಕಾಯುತ್ತದೆ. ಮತ್ತೊಮ್ಮೆ, ಇದು ನಿಲ್ಲಿಸುವವರೆಗೂ ಅನಂತವಾಗಿ ಲೂಪ್ ಮಾಡುತ್ತದೆ.",
    "Show/hide advanced:": "ತೋರಿಸು / ಮರೆಮಾಡು ಹೈಡ್:",
    "Scan interval (minimum 5 seconds):": "ಸ್ಕ್ಯಾನ್ ಮಧ್ಯಂತರ (ಕನಿಷ್ಠ 5 ಸೆಕೆಂಡುಗಳು):",
    "Daily run time (hh:mm):": "ದಿನನಿತ್ಯದ ರನ್ ಸಮಯ (hh: mm):",
    "Output filename suffix:": "ಔಟ್ಪುಟ್ ಫೈಲ್ ಹೆಸರು ಪ್ರತ್ಯಯ:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "ಇದು ಐಚ್ಛಿಕವಾಗಿರುತ್ತದೆ. '_1080 ಪು' ಅಥವಾ '_ ಟೆಸ್ಟೋನ್ವರ್ಷನ್' ಮುಂತಾದ ನಿಮ್ಮ ಫೈಲ್ ಹೆಸರಿನ ಕೊನೆಯಲ್ಲಿ ಸೇರಿಸಲು ನೀವು ಪ್ರತ್ಯಯವನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಬಹುದು.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "'ಸ್ಟ್ಯಾಂಡರ್ಡ್ ಪೂರ್ವನಿಯೋಜಿತ' ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿದರೆ ಎಲ್ಲಾ ಔಟ್ಪುಟ್ ಫೈಲ್ಗಳು ಒಂದೇ ಪ್ರತ್ಯಯವನ್ನು ಹೊಂದಿರುತ್ತದೆ.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "'ಕಸ್ಟಮ್ ಮೊದಲೇ' ಆಯ್ಕೆಮಾಡಿದರೆ ನೀವು ಮೂಲ ಫೋಲ್ಡರ್ / ಕಸ್ಟಮ್ ಪೂರ್ವನಿಗದಿಗೆ ಪ್ರತಿ ಪ್ರತ್ಯಯವನ್ನು ನಿರ್ದಿಷ್ಟಪಡಿಸಬಹುದು. ಪ್ರತಿ ಪ್ರತ್ಯಯವು ತನ್ನದೇ ಸಾಲಿನಲ್ಲಿದೆ ಎಂಬುದನ್ನು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ. ಉದಾಹರಣೆಗೆ, ನೀವು 2 ಮೂಲ ಫೋಲ್ಡರ್ಗಳನ್ನು ಹೊಂದಿದ್ದರೆ ಮತ್ತು 'ಕಸ್ಟಮ್ ಮೊದಲೇ' ಬಳಸುತ್ತಿದ್ದರೆ, ನೀವು ಇದನ್ನು ಫೈಲ್ ಹೆಸರಿನ ಪ್ರತ್ಯಯ ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಇರಿಸಬಹುದು:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "ಮೊದಲ ಮೂಲ ಫೋಲ್ಡರ್ನಲ್ಲಿರುವ ಫೈಲ್ಗಳು 'ಫೈಲ್ಫೇಮ್ ಹೆಸರನ್ನು ಔಟ್ಪುಟ್ಗೆ ಸೇರಿಸುವ' _720p 'ಅನ್ನು ಹೊಂದಿರುತ್ತದೆ. ಎರಡನೇ ಮೂಲ ಫೋಲ್ಡರ್ನಲ್ಲಿರುವ ಫೈಲ್ಗಳು '_1080p' ಅನ್ನು ಔಟ್ಪುಟ್ ಫೈಲ್ಹೆಮೇನ್ಗೆ ಸೇರಿಸಲಾಗುತ್ತದೆ.",
    "Include these file types:": "ಈ ಫೈಲ್ ಪ್ರಕಾರಗಳನ್ನು ಸೇರಿಸಿ:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "ಸ್ಕ್ಯಾನ್ ಮಾಡಲು ಫೈಲ್ ಪ್ರಕಾರಗಳನ್ನು ನಮೂದಿಸಿ. ಪ್ರತಿಯೊಂದು ಬಗೆಯನ್ನು ಅಲ್ಪವಿರಾಮದಿಂದ ಬೇರ್ಪಡಿಸಬೇಕಾಗಿದೆ. ಡೀಫಾಲ್ಟ್ ನಮೂದು:",
    "Exclude files smaller than (MB):": "(MB) ಗಿಂತ ಚಿಕ್ಕದಾದ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ:",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "ಪರಿವರ್ತನೆಯಿಂದ ನಿರ್ದಿಷ್ಟ ಗಾತ್ರಕ್ಕಿಂತ ಚಿಕ್ಕದಾದ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ (ಮೆಗಾಬೈಟ್ಗಳಲ್ಲಿ)",
    "Exclude files larger than (MB):": "(MB) ಗಿಂತ ದೊಡ್ಡದಾದ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ:",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "ಪರಿವರ್ತನೆಯಿಂದ ನಿರ್ದಿಷ್ಟ ಗಾತ್ರಕ್ಕಿಂತ ಹೆಚ್ಚಿನ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ (ಮೆಗಾಬೈಟ್ಗಳಲ್ಲಿ)",
    "Exclude filenames which include any of these words:": "ಈ ಯಾವುದೇ ಪದಗಳನ್ನು ಒಳಗೊಂಡಿರುವ ಫೈಲ್ ಹೆಸರುಗಳನ್ನು ಹೊರತುಪಡಿಸಿ:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "ಫೈಲ್ಗಳಿಗಾಗಿ ಸ್ಕ್ಯಾನ್ ಮಾಡುವಾಗ ಫಿಲ್ಟರ್ ಮಾಡಲು ಕೀವರ್ಡ್ಗಳನ್ನು ನಮೂದಿಸಿ. ಉದಾಹರಣೆಗೆ, \"720p\" ಅನ್ನು ಪ್ರವೇಶಿಸಿದರೆ, ಶೀರ್ಷಿಕೆಯಲ್ಲಿ \"720p\" ಹೊಂದಿರುವ ಯಾವುದೇ ಫೈಲ್ಗಳನ್ನು ಪರಿವರ್ತಿಸಲಾಗುವುದಿಲ್ಲ. ಮತ್ತೆ, ಕೀವರ್ಡ್ಗಳನ್ನು ಅಲ್ಪವಿರಾಮದಿಂದ ಬೇರ್ಪಡಿಸಬೇಕಾಗಿದೆ. ಉದಾಹರಣೆಗೆ, ಫಿಲ್ಟರ್ ಬಾಕ್ಸ್ನಲ್ಲಿ ಈ ಕೆಳಗಿನವುಗಳನ್ನು ನಮೂದಿಸಿ:",
    "Include files with any ": "ಯಾವುದೇ ಫೈಲ್ಗಳನ್ನು ಸೇರಿಸಿ",
    " or all ": "ಅಥವಾ ಎಲ್ಲಾ",
    " of these": "ಇವುಗಳಲ್ಲಿ",
    "properties:": "ಗುಣಲಕ್ಷಣಗಳು:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "ಇಲ್ಲಿ ನೀವು ಇನ್ಪುಟ್ ವೀಡಿಯೋ ಮತ್ತು ಆಡಿಯೋ ಗುಣಲಕ್ಷಣಗಳನ್ನು ಪರಿವರ್ತಿಸಲು ಸಲುವಾಗಿ ಫೈಲ್ಗಳನ್ನು ಹೊಂದಿರಬೇಕು (ಮಾಹಿತಿಯನ್ನು FFprobe ಬಳಸಿಕೊಂಡು ಹೊರತೆಗೆಯಲಾಗುತ್ತದೆ). ಗುಣಗಳನ್ನು ಅಲ್ಪವಿರಾಮದಿಂದ ಬೇರ್ಪಡಿಸಬೇಕು. ನೀವು ಸೇರಿಸಲು ಬಯಸುವ ಗುಣಲಕ್ಷಣಗಳನ್ನು ನಿರ್ಧರಿಸಲು ಮಾಧ್ಯಮ ಮಾಹಿತಿಯನ್ನು ವೀಕ್ಷಕ ಸಾಧನವನ್ನು ಬಳಸಿ. ಕೊನೆಯ ಆಸ್ತಿಯ ನಂತರ ಕಾಮಾವನ್ನು ಹಾಕಬೇಕೆಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ. ಉದಾಹರಣೆಗೆ, H264 ಮತ್ತು AAC ಸ್ಟಿರಿಯೊ ಆಡಿಯೊ ಬಳಸಿ ಎನ್ಕೋಡ್ ಮಾಡಲಾದ ಫೈಲ್ಗಳನ್ನು ಮಾತ್ರ ಪರಿವರ್ತಿಸಲು:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "ಪರಿವರ್ತನೆ ಪ್ರಕ್ರಿಯೆಯು ಪ್ರಾರಂಭವಾದಾಗ (ಸಮಯವನ್ನು ಉಳಿಸಲು) ಈ ಆಸ್ತಿ ಪರಿಶೀಲನೆಯು ಮಾಡಲಾಗುತ್ತದೆ ಎಂದು ಗಮನಿಸಬೇಕಾದ ಸಂಗತಿಯಾಗಿದೆ, ಹಾಗಿದ್ದರೂ ಫೈಲ್ಗಳು ಪರಿವರ್ತನೆ ಸರತಿಯಲ್ಲಿ ಗೋಚರಿಸಬಹುದು, ಸರಿಯಾದ ಪರಿಸ್ಥಿತಿಗಳು ಪೂರೈಸಿದರೆ ಅವುಗಳನ್ನು ಬಿಟ್ಟುಬಿಡಲಾಗುತ್ತದೆ / ಸೇರಿಸಲಾಗುತ್ತದೆ.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "FFprobe ಗುಣಗಳನ್ನು ಹೊರತೆಗೆಯಲು ಸಾಧ್ಯವಾದರೆ, ನಂತರ \"ಸರಿ\" ಕ್ಯೂ ವೀಕ್ಷಣೆಯಲ್ಲಿ \"FFprobe\" ಕಾಲಮ್ನಲ್ಲಿ ಕಾಣಿಸಿಕೊಳ್ಳುತ್ತದೆ.",
    "Exclude files with any ": "ಯಾವುದೇ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ",
    " of these ": "ಇವುಗಳಲ್ಲಿ",
    "The opposite of 'Include files with any or all of these properties'": "'ಈ ಯಾವುದೇ ಗುಣಲಕ್ಷಣಗಳೊಂದಿಗೆ ಯಾವುದೇ ಫೈಲ್ಗಳನ್ನು ಸೇರಿಸಿ'",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "ಮೇಲಿನ ಆದ್ಯತೆಗಳಲ್ಲಿ ನೀವು ಸೇರಿಸಲು / ಸೇರಿಸಬೇಕೆಂದಿರುವ ಗುಣಲಕ್ಷಣಗಳನ್ನು ನಿರ್ಧರಿಸಲು ಸಹಾಯ ಮಾಡುವ ಸಲುವಾಗಿ ಫೈಲ್ ಗುಣಲಕ್ಷಣಗಳನ್ನು ವಿಶ್ಲೇಷಿಸಲು ಇದು ಚಿಕ್ಕ ಸಾಧನವಾಗಿದೆ. ಮಾಹಿತಿಯನ್ನು ಹಿಂದಿರುಗಿಸಲು ಇದು FFprobe ಅನ್ನು ಬಳಸುತ್ತದೆ. ಅವುಗಳನ್ನು ವಿಶ್ಲೇಷಿಸಲು ಫೈಲ್ಗಳನ್ನು ಬೂದು ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಎಳೆದು ಬಿಡಿ. ಉದಾಹರಣೆಗೆ, ಒಂದು ಪರೀಕ್ಷಾ ಕಡತದಲ್ಲಿ ಬಿಡುವುದು ಕೆಳಗಿನವುಗಳಿಗೆ ಮರಳಬಹುದು:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "ನೀವು ಪರಿವರ್ತನೆಗೊಳ್ಳದಂತೆ ಫೈಲ್ಗಳನ್ನು ಹೊರಗಿಡಲು ಬಯಸಿದರೆ, ನೀವು ಹಲವಾರು ಫೈಲ್ ಗುಣಲಕ್ಷಣಗಳನ್ನು \"ಯಾವುದೇ ಅಥವಾ ಎಲ್ಲ ಗುಣಲಕ್ಷಣಗಳೊಂದಿಗೆ ಹೊರತುಪಡಿಸಿ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ\" ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಇರಿಸಬಹುದು ಮತ್ತು 'ಯಾವುದಾದರೂ' ಬದಲಿಗೆ 'ಎಲ್ಲ' ಪಕ್ಕದಲ್ಲಿರುವ ಚೆಕ್ಬಾಕ್ಸ್ ಅನ್ನು ಪರಿಶೀಲಿಸಬಹುದು, ಹಾಗೆ:",
    "Copy excluded files to destination:": "ಹೊರಗಿರುವ ಫೈಲ್ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನಕ್ಕೆ ನಕಲಿಸಿ:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "ನೀವು ಈ ಆಯ್ಕೆಯನ್ನು ಆರಿಸಿದರೆ, ಪರಿವರ್ತನೆಯಿಂದ ಹೊರಗಿಡಲಾದ ಫೈಲ್ಗಳನ್ನು ನೇರವಾಗಿ ಗಮ್ಯಸ್ಥಾನದ ಫೋಲ್ಡರ್ಗೆ ನಕಲಿಸಲಾಗುತ್ತದೆ. ಇದು ಕೆಳಗಿನ ಫಿಲ್ಟರ್ಗಳಿಗೆ ಅನ್ವಯಿಸುತ್ತದೆ:",
    "Exclude filenames which include any of these words": "ಈ ಯಾವುದೇ ಪದಗಳನ್ನು ಒಳಗೊಂಡಿರುವ ಫೈಲ್ ಹೆಸರುಗಳನ್ನು ಹೊರತುಪಡಿಸಿ",
    "Include files with any or all of these properties": "ಈ ಗುಣಲಕ್ಷಣಗಳ ಯಾವುದೇ ಅಥವಾ ಎಲ್ಲಾದರೊಂದಿಗೆ ಫೈಲ್ಗಳನ್ನು ಸೇರಿಸಿ",
    "Exclude files with any or all of these properties": "ಈ ಗುಣಲಕ್ಷಣಗಳ ಯಾವುದೇ ಅಥವಾ ಎಲ್ಲಾದರೊಂದಿಗೆ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ",
    "Exclude files smaller than (MB)": "(MB) ಗಿಂತ ಚಿಕ್ಕದಾದ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ",
    "Exclude files larger than (MB)": "(MB) ಗಿಂತ ದೊಡ್ಡದಾದ ಫೈಲ್ಗಳನ್ನು ಹೊರತುಪಡಿಸಿ",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "ಮೇಲ್ಭಾಗದ ಆಸ್ತಿ ಪರಿಸ್ಥಿತಿಗಳನ್ನು \"ಸೇರ್ಪಡೆಗೊಳಿಸಿ\" ಅವರು ಪೂರೈಸದ ಕಾರಣ ಇದು ಹೊರತುಪಡಿಸಿದ ಫೈಲ್ಗಳಿಗೆ ಸಹ ಅನ್ವಯಿಸುತ್ತದೆ ಎಂಬುದನ್ನು ಗಮನಿಸಿ, ಆದ್ದರಿಂದ ನೀವು ಕೆಲವು ಫೈಲ್ಗಳನ್ನು ಮಾತ್ರ ಪರಿವರ್ತಿಸಲು ಪ್ರಯತ್ನಿಸುತ್ತಿರುವಾಗ ನೀವು ಸಂಪೂರ್ಣ ಲೈಬ್ರರಿಯೆಂದು ಆಕಸ್ಮಿಕವಾಗಿ ನಕಲಿಸಬೇಡಿ.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "ನಕಲಿನ ವೈಶಿಷ್ಟ್ಯವು ಕೆಳಗಿನ ಫಿಲ್ಟರ್ಗಳಿಗೆ ಅನ್ವಯಿಸುವುದಿಲ್ಲ (ಅಂದರೆ ಫಿಲ್ಟರ್ನ ಕಾರಣದಿಂದ ಹೊರಗಿರುವ ಫೈಲ್ಗಳು)",
    "Include these file types": "ಈ ಫೈಲ್ ಪ್ರಕಾರಗಳನ್ನು ಸೇರಿಸಿ",
    "Delete source files after conversion:": "ಪರಿವರ್ತನೆಯ ನಂತರ ಮೂಲ ಫೈಲ್ಗಳನ್ನು ಅಳಿಸಿ:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "ಇದನ್ನು ಆಯ್ಕೆಮಾಡಿದರೆ, ಪರಿವರ್ತನೆ ಪ್ರಯತ್ನ ಯಶಸ್ವಿಯಾದರೆ, ಮೂಲ ಫೈಲ್ ಅನ್ನು ಅಳಿಸಲಾಗುತ್ತದೆ. ಈ ಪ್ರಕ್ರಿಯೆಯು ಎಲ್ಲಾ ಕಡತಗಳ ಪರಿವರ್ತನೆಯ ನಂತರ, ಅತ್ಯಂತ ಕೊನೆಯಲ್ಲಿ ಮಾಡಲಾಗುತ್ತದೆ. ಇದರರ್ಥ ನೀವು ಅನೇಕ ಪೂರ್ವನಿಗದಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಅದೇ ಮೂಲ ಫೈಲ್ಗಳನ್ನು ಪರಿವರ್ತಿಸಬಹುದು, ಎಲ್ಲವೂ ಒಂದೇ ಸಮಯದಲ್ಲಿ. ಮೂಲ ಫೈಲ್ಗಳನ್ನು ನಂತರ ಅಳಿಸಲಾಗುತ್ತದೆ.",
    "Replace original file if converted file is smaller?(Compress attempt)": "ಪರಿವರ್ತನೆಗೊಂಡ ಫೈಲ್ ಚಿಕ್ಕದಾಗಿದ್ದರೆ ಮೂಲ ಫೈಲ್ ಅನ್ನು ಬದಲಾಯಿಸಿ? (ಸಂಕುಚಿತ ಪ್ರಯತ್ನ)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "ಹೊಸ ಫೈಲ್ ಚಿಕ್ಕದಾಗಿದ್ದರೆ ಮೂಲ ಫೈಲ್ ಅನ್ನು ಸ್ವಯಂಚಾಲಿತವಾಗಿ ಬದಲಾಯಿಸಲು HBBatchBeast ಬಯಸಿದರೆ ಈ ಚೆಕ್ ಬಾಕ್ಸ್ ಅನ್ನು ಆಯ್ಕೆ ಮಾಡಿ. ಹೊಸ ಫೈಲ್ ಚಿಕ್ಕದಾಗಿದ್ದರೆ, ಅದು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ನಲ್ಲಿ ಉಳಿಯುತ್ತದೆ.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "ನಿಮ್ಮ ಗಮ್ಯಸ್ಥಾನದ ಫೋಲ್ಡರ್ ನಿಮ್ಮ ಮೂಲ ಫೋಲ್ಡರ್ನಂತೆ / ಅಥವಾ ಅದರಂತೆಯೇ ಇಲ್ಲವೆಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ ಅಥವಾ ಅದು ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದಿಲ್ಲ.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "HBBatchBeast ಒಂದು ನಿರ್ದಿಷ್ಟ ಕಡತವನ್ನು ಸಂಕುಚಿಸಲು ಪ್ರಯತ್ನಿಸಿದ ನಂತರ, ಇದು ಆ ಫೈಲ್ ಪಥವನ್ನು ಒಂದು ಸಂಗ್ರಹಕ್ಕೆ ಸೇರಿಸುತ್ತದೆ, ಇದರಿಂದ ಅದು ಭವಿಷ್ಯದಲ್ಲಿ ಮತ್ತೆ ಪ್ರಯತ್ನಿಸುವುದಿಲ್ಲ. ನೀವು ಹಳದಿ ಗುಂಡಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಕ್ಯಾಷ್ ಅನ್ನು ವೀಕ್ಷಿಸಬಹುದು / ಸಂಪಾದಿಸಬಹುದು / ತೆರವುಗೊಳಿಸಬಹುದು.",
    "Replace original file always?": "ಮೂಲ ಫೈಲ್ ಅನ್ನು ಯಾವಾಗಲೂ ಬದಲಾಯಿಸಿ?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "ಹೊಸ ಫೈಲ್ ದೊಡ್ಡದಾಗಿದೆಯೇ ಅಥವಾ ಚಿಕ್ಕದಾಗಿದೆಯೇ ಹೊರತು ಮೂಲ ಫೈಲ್ ಅನ್ನು ಬದಲಾಯಿಸಲಾಗುತ್ತದೆ.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "ಮತ್ತೊಮ್ಮೆ, ನಿಮ್ಮ ಗಮ್ಯಸ್ಥಾನದ ಫೋಲ್ಡರ್ ನಿಮ್ಮ ಮೂಲ ಫೋಲ್ಡರ್ನಂತೆ / ಅಥವಾ ಅದೇ ರೀತಿಯಲ್ಲಿಲ್ಲ ಎಂಬುದನ್ನು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ ಅಥವಾ ಅದು ಸರಿಯಾಗಿ ಕಾರ್ಯನಿರ್ವಹಿಸುವುದಿಲ್ಲ.",
    "Copy subtitle (srt) files to destination?": "ಉಪಶೀರ್ಷಿಕೆ (srt) ಫೈಲ್ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನಕ್ಕೆ ನಕಲಿಸುವುದೇ?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "ಉಪಶೀರ್ಷಿಕೆ '.rt' ಫೈಲ್ಗಳನ್ನು ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ಗೆ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ನಕಲಿಸಲಾಗುತ್ತದೆ.",
    "Automatically create temporary/destination folders if they don't exist?": "ತಾತ್ಕಾಲಿಕ / ಗಮ್ಯಸ್ಥಾನ ಫೋಲ್ಡರ್ಗಳನ್ನು ಅವರು ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲದಿದ್ದರೆ ಸ್ವಯಂಚಾಲಿತವಾಗಿ ರಚಿಸುವುದೇ?",
    "Custom bat path to run after each conversion (leave blank if not using):": "ಪ್ರತಿ ಪರಿವರ್ತನೆಯ ನಂತರ ಚಲಾಯಿಸಲು ಕಸ್ಟಮ್ ಬ್ಯಾಟ್ ಮಾರ್ಗ (ಬಳಸದೆ ಹೋದರೆ ಖಾಲಿ ಬಿಡಿ):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "ಪ್ರತಿ ಪರಿವರ್ತನೆಯ ನಂತರ ನೀವು ಕಾರ್ಯಗತಗೊಳಿಸಲು ಬಯಸುವ ಕಸ್ಟಮ್ ಬ್ಯಾಚ್ ಫೈಲ್ಗೆ ಮಾರ್ಗವನ್ನು ಇನ್ಪುಟ್ ಮಾಡಿ. ಉದಾಹರಣೆಗೆ:",
    "Batch files with timeout statements won't work. More info here:": "ಕಾಲಾವಧಿ ಹೇಳಿಕೆಗಳೊಂದಿಗೆ ಬ್ಯಾಚ್ ಫೈಲ್ಗಳು ಕಾರ್ಯನಿರ್ವಹಿಸುವುದಿಲ್ಲ. ಇಲ್ಲಿ ಹೆಚ್ಚಿನ ಮಾಹಿತಿ:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "ಈ ಆಯ್ಕೆಯನ್ನು ನೀವು ಬಳಸಲು ಬಯಸದಿದ್ದರೆ ಬಾಕ್ಸ್ ಅನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ಖಾಲಿ ಬಿಡಿ (ಪೆಟ್ಟಿಗೆಯಲ್ಲಿ ಗುಪ್ತ ಅಕ್ಷರಗಳು ಇಲ್ಲವೆಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳಿ)",
    "Run processes at low priority?": "ಕಡಿಮೆ ಆದ್ಯತೆಗಳಲ್ಲಿ ಪ್ರಕ್ರಿಯೆಗಳನ್ನು ರನ್ ಮಾಡುವುದೇ?",
    "All conversion processes will be run at low priority, reducing processor usage.": "ಎಲ್ಲಾ ಪರಿವರ್ತನೆ ಪ್ರಕ್ರಿಯೆಗಳು ಕಡಿಮೆ ಆದ್ಯತೆಗಳಲ್ಲಿ ಕಾರ್ಯನಿರ್ವಹಿಸುತ್ತವೆ, ಪ್ರೊಸೆಸರ್ ಬಳಕೆಯನ್ನು ಕಡಿಮೆ ಮಾಡುತ್ತದೆ.",
    "Remove apostrophes from filenames:": "ಕಡತನಾಮಗಳಿಂದ ಅಪಾಸ್ಟ್ರಫಿಗಳನ್ನು ತೆಗೆದುಹಾಕಿ:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "ಕಡತದ ಹೆಸರುಗಳು ಅಪಾಸ್ಟ್ರಫಿಗಳನ್ನು ಹೊಂದಿದ್ದರೆ ಪರಿವರ್ತನೆಗಳು / ಆರೋಗ್ಯ ಪರಿಶೀಲನೆ ಸ್ಕ್ಯಾನ್ಗಳು ವಿಫಲವಾಗಬಹುದು. ಫೈಲ್ಗಳಿಂದ ಅಪಾಸ್ಟ್ರಫಿಗಳನ್ನು ಸ್ವಯಂಚಾಲಿತವಾಗಿ ತೆಗೆದುಹಾಕಲು ಇದನ್ನು ಪರೀಕ್ಷಿಸಿ.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕೆಯ '--ಸ್ಕ್ಯಾನ್' ವೈಶಿಷ್ಟ್ಯವನ್ನು ಬಳಸಿಕೊಂಡು ಭ್ರಷ್ಟ ವೀಡಿಯೊ ಫೈಲ್ಗಳಿಗಾಗಿ ಈ ವೈಶಿಷ್ಟ್ಯವು ಸ್ಕ್ಯಾನ್ ಮಾಡಬಹುದು, ಆದಾಗ್ಯೂ ಇದು ಯಾವಾಗಲೂ ನಿಖರವಾಗಿಲ್ಲ. ಇದು ಎರಡನೇ ಉಲ್ಲೇಖ ಬಿಂದುವನ್ನು ಒದಗಿಸಲು FFprobe ಅನ್ನು ಸಹ ಬಳಸುತ್ತದೆ. FFprobe ಮತ್ತು ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ ಎರಡೂ ವಿಫಲವಾದಲ್ಲಿ ಫೈಲ್ ದೋಷಪೂರಿತವಾಗಿದೆ ಎಂದು ಹೆಚ್ಚಿನ ಅವಕಾಶವಿದೆ.",
    "Move corrupt files into the following folder:": "ಭ್ರಷ್ಟ ಫೈಲ್ಗಳನ್ನು ಕೆಳಗಿನ ಫೋಲ್ಡರ್ಗೆ ಸರಿಸಿ:",
    " If checked, then any files which give errors will be moved into the specified folder.": "ಪರಿಶೀಲಿಸಿದಲ್ಲಿ, ದೋಷಗಳನ್ನು ನೀಡುವ ಯಾವುದೇ ಫೈಲ್ಗಳನ್ನು ನಿರ್ದಿಷ್ಟ ಫೋಲ್ಡರ್ಗೆ ವರ್ಗಾಯಿಸಲಾಗುತ್ತದೆ.",
    "Corrupt file folder:": "ಭ್ರಷ್ಟ ಕಡತ ಫೋಲ್ಡರ್:",
    "Run thorough file health check:": "ಸಂಪೂರ್ಣ ಫೈಲ್ ಆರೋಗ್ಯ ಚೆಕ್ ಅನ್ನು ರನ್ ಮಾಡಿ:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "ಪರೀಕ್ಷಿಸಿದರೆ, ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ ಬದಲಿಗೆ FFmpeg ಅನ್ನು ಬಳಸಿಕೊಂಡು ಹೆಚ್ಚು ನಿಧಾನವಾಗಿ ಹೆಚ್ಚು ಸಂಪೂರ್ಣ ವೀಡಿಯೊ ಆರೋಗ್ಯ ಪರಿಶೀಲನೆ ನಡೆಯುತ್ತದೆ.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "ದೇಸಾನಿಯ 'ScanMedia.ps1' ಅನ್ನು ಆಧರಿಸಿ:",
    "Attempt to repair files after thorough check:": "ಸಂಪೂರ್ಣ ಪರಿಶೀಲನೆಯ ನಂತರ ಫೈಲ್ಗಳನ್ನು ದುರಸ್ತಿ ಮಾಡಲು ಪ್ರಯತ್ನಿಸು:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "ಪರಿಶೀಲಿಸಿದಲ್ಲಿ, FBmpeg ಬಳಸಿ ಫೈಲ್ಗಳನ್ನು ದುರಸ್ತಿ ಮಾಡಲು HBBatchBeast ಪ್ರಯತ್ನಿಸುತ್ತದೆ. '_Repaired' ಪ್ರತ್ಯಯದೊಂದಿಗೆ ಹೊಸ ಫೈಲ್ ಅನ್ನು ಮೂಲ ಫೈಲ್ನ ಅದೇ ಫೋಲ್ಡರ್ನಲ್ಲಿ ರಚಿಸಲಾಗುತ್ತದೆ.",
    "'CRF' value to use when attempting to repair files:": "ಫೈಲ್ಗಳನ್ನು ಸರಿಪಡಿಸಲು ಪ್ರಯತ್ನಿಸುವಾಗ ಬಳಸಲು 'ಸಿಆರ್ಎಫ್' ಮೌಲ್ಯ:",
    "The default 'CRF' value is 23. Please see the following for more information:": "ಪೂರ್ವನಿಯೋಜಿತ 'ಸಿಆರ್ಎಫ್' ಮೌಲ್ಯವು 23 ಆಗಿದೆ. ಹೆಚ್ಚಿನ ಮಾಹಿತಿಗಾಗಿ ದಯವಿಟ್ಟು ಕೆಳಗಿನದನ್ನು ನೋಡಿ:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "ಸಿಆರ್ಎಫ್ ಸ್ಕೇಲ್ನ ಶ್ರೇಣಿಯು 0-51, 0 ನಷ್ಟವಿಲ್ಲದಿದ್ದರೆ, 23 ಡೀಫಾಲ್ಟ್ ಆಗಿರುತ್ತದೆ, ಮತ್ತು 51 ಇದು ಸಾಧ್ಯವಾದಷ್ಟು ಕೆಟ್ಟ ಗುಣಮಟ್ಟ. ಕಡಿಮೆ ಮೌಲ್ಯವು ಸಾಮಾನ್ಯವಾಗಿ ಉತ್ತಮ ಗುಣಮಟ್ಟಕ್ಕೆ ಕಾರಣವಾಗುತ್ತದೆ, ಮತ್ತು ವಸ್ತುನಿಷ್ಠವಾದ ಸಾನ್ ಶ್ರೇಣಿ 17-28. ದೃಷ್ಟಿ ಕಳೆದುಕೊಳ್ಳಲು ಅಥವಾ ಸುಮಾರು 17 ಅಥವಾ 18 ಅನ್ನು ಪರಿಗಣಿಸಿ; ಇದು ಅದೇ ರೀತಿ ಅಥವಾ ಇನ್ಪುಟ್ನಂತೆಯೇ ಒಂದೇ ಆಗಿರಬೇಕು ಆದರೆ ತಾಂತ್ರಿಕವಾಗಿ ನಷ್ಟವಿಲ್ಲದದು.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast ಸ್ಕ್ಯಾನ್ ಮಾಡಲಾದ ಫೈಲ್ ಪಥಗಳ ಪಟ್ಟಿಯನ್ನು ಉಳಿಸದೆ ವರದಿ ಮಾಡಿದೆ. ಎಲ್ಲ ಫೈಲ್ಗಳಲ್ಲಿ ತಾಜಾ ಸ್ಕ್ಯಾನ್ ಮಾಡಲು ಸಂಗ್ರಹವನ್ನು ತೆರವುಗೊಳಿಸಿ.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "ಬಳಸಲು ಏಕಕಾಲದಲ್ಲಿ ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ / ಎಫ್ಎಫ್ಎಂಪಿಗ್ ನಿದರ್ಶನಗಳ ಸಂಖ್ಯೆ (ಶಿಫಾರಸು 4 ಅಥವಾ ಕಡಿಮೆ):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "ಈ ಸೆಟ್ಟಿಂಗ್ \"ವೀಡಿಯೊ ಆರೋಗ್ಯ ಪರಿಶೀಲನೆ\" ಮತ್ತು \"ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತನೆ\" ಪ್ರಕ್ರಿಯೆಗಳಿಗೆ ಅನ್ವಯಿಸುತ್ತದೆ. ಎಷ್ಟು ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ ಎಳೆಗಳನ್ನು ಬಳಸಲು ಸೂಚಿಸಿ. 4 ಕ್ಕಿಂತಲೂ ಹೆಚ್ಚಿನದನ್ನು ಬಳಸಬಾರದೆಂದು ಸೂಚಿಸಿದ್ದರೂ ಯಾವುದೇ ಗರಿಷ್ಠ ಇಲ್ಲ. ನಿಮ್ಮ ಕಂಪ್ಯೂಟರ್ ಅನ್ನು ಹೆಚ್ಚು ಶಕ್ತಿಯುತವಾಗಿಲ್ಲದಿದ್ದರೆ ಹೆಚ್ಚಿನ ಮೊತ್ತವನ್ನು ಫ್ರೀಜ್ ಮಾಡಬಹುದು.",
    "Queue size view limit?(Recommended 1000 or fewer):": "ಕ್ಯೂ ಗಾತ್ರದ ವೀಕ್ಷಣೆ ಮಿತಿ? (ಶಿಫಾರಸು ಮಾಡಲಾದ 1000 ಅಥವಾ ಕಡಿಮೆ):",
    "Automatically start \"Scan and convert\" when program opened?": "ಪ್ರೋಗ್ರಾಂ ತೆರೆದಾಗ ಸ್ವಯಂಚಾಲಿತವಾಗಿ \"ಸ್ಕ್ಯಾನ್ ಮತ್ತು ಪರಿವರ್ತನೆ\" ಅನ್ನು ಪ್ರಾರಂಭಿಸುವುದೇ?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "ಆರೋಗ್ಯ ಪರಿಶೀಲನೆ ಅಥವಾ ಪರಿವರ್ತನೆ / ಫೋಲ್ಡರ್ ವೀಕ್ಷಣೆ ಸಮಯದಲ್ಲಿ ದೋಷ ಎದುರಾದರೆ ಇಮೇಲ್ ಅಧಿಸೂಚನೆಗಳನ್ನು ಸ್ವೀಕರಿಸಲು ಇಮೇಲ್ ವಿವರಗಳನ್ನು ಭರ್ತಿ ಮಾಡಿ. 2FA ಅಗತ್ಯವಿರುವ ಖಾತೆಗಳೊಂದಿಗೆ ಕೆಲಸ ಮಾಡುವುದಿಲ್ಲ. Gmail ಖಾತೆಗಳಲ್ಲಿ ಕಡಿಮೆ ಸುರಕ್ಷಿತ ಅಪ್ಲಿಕೇಶನ್ಗಳಿಗೆ ನೀವು ಪ್ರವೇಶವನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಬೇಕಾಗುತ್ತದೆ.",
    "Email address:": "ಇಮೇಲ್ ವಿಳಾಸ:",
    "For example:": "ಉದಾಹರಣೆಗೆ:",
    "Email password(not saved):": "ಇಮೇಲ್ ಪಾಸ್ವರ್ಡ್ (ಉಳಿಸಲಾಗಿಲ್ಲ):",
    "SMTP server:": "SMTP ಸರ್ವರ್:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "ಈ ವೈಶಿಷ್ಟ್ಯವು ಯಾವುದೇ ವೆಬ್ ಬ್ರೌಸರ್ ಬಳಸಿ ಪರಿವರ್ತನೆ / ಆರೋಗ್ಯ ಪರಿಶೀಲನೆಯ ಸ್ಥಿತಿಯನ್ನು ಮೇಲ್ವಿಚಾರಣೆಗೆ ಅನುಮತಿಸುತ್ತದೆ. ಸರ್ವರ್ಗಳನ್ನು ಚಾಲನೆ ಮಾಡುವಾಗ ಉಪಯುಕ್ತ.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "ಸಕ್ರಿಯಗೊಳಿಸಿದಲ್ಲಿ, ಕೆಳಗಿನ ಅನಾಮಧೇಯ ಡೇಟಾವನ್ನು HBBatchBeast.io ಗೆ ಕಳುಹಿಸಲಾಗುತ್ತದೆ:",
    "API key": "API ಕೀಲಿ",
    "Current status ('Searching', 'Running', 'Finished' etc)": "ಪ್ರಸ್ತುತ ಸ್ಥಿತಿ ('ಹುಡುಕಲಾಗುತ್ತಿದೆ', 'ರನ್ನಿಂಗ್', 'ಮುಗಿದಿದೆ' ಇತ್ಯಾದಿ)",
    "Number of:": "ಸಂಖ್ಯೆ:",
    "Remaining items": "ಉಳಿದಿರುವ ಐಟಂಗಳು",
    "Successful items": "ಯಶಸ್ವಿ ಐಟಂಗಳನ್ನು",
    "Errored items": "ದೋಷಪೂರಿತ ಐಟಂಗಳು",
    "Cancelled items": "ರದ್ದುಪಡಿಸಿದ ಐಟಂಗಳು",
    "Worker percentages": "ಕೆಲಸಗಾರ ಶೇಕಡಾವಾರು",
    "Last completed item time": "ಕೊನೆಯ ಪೂರ್ಣಗೊಂಡ ಐಟಂ ಸಮಯ",
    "Enable remote monitoring?:": "ದೂರಸ್ಥ ಮೇಲ್ವಿಚಾರಣೆಯನ್ನು ಸಕ್ರಿಯಗೊಳಿಸುವುದೇ ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "ಮೂಲಭೂತ ಮಾನದಂಡದ ಉಪಯುಕ್ತತೆಯು ಮುಖ್ಯವಾಗಿ 16+ ಕೋರ್ ಪ್ರೊಸೆಸರ್ಗಳು ಅನೇಕ ಹ್ಯಾಂಡ್ಬ್ರ್ರೇಕ್ ನಿದರ್ಶನಗಳನ್ನು ಹೇಗೆ ಬಳಸುತ್ತದೆ ಎಂಬುದನ್ನು ನೋಡಲು ನಿರ್ಮಿಸುತ್ತದೆ ಆದರೆ ಇದು ಯಾವುದೇ ಪ್ರಕಾರದ ಪ್ರೊಸೆಸರ್ನಲ್ಲಿ ಕಾರ್ಯನಿರ್ವಹಿಸುತ್ತದೆ.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "ಇದು h265 4k ಸ್ಯಾಂಪಲ್ ಫೈಲ್ (2.5MB) ಅನ್ನು ಡೌನ್ಲೋಡ್ ಮಾಡುತ್ತದೆ ಮತ್ತು 4 ಹ್ಯಾಂಡ್ಬ್ರೇಕ್ ನಿದರ್ಶನಗಳನ್ನು \"ವೆಸ್ಟ್ ಫಾಸ್ಟ್ 1080p30\" ನೊಂದಿಗೆ ಬೆಂಚ್ಮಾರ್ಕ್ ಅನ್ನು ರನ್ ಮಾಡುತ್ತದೆ.",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "ನೀವು ಆಯ್ಕೆ ಮಾಡಿದರೆ ಫಲಿತಾಂಶಗಳನ್ನು hbbatchbeast.io ಗೆ ಅಪ್ಲೋಡ್ ಮಾಡಬಹುದು.",
    "Queue": "ಕ್ಯೂ",
    "Output this session": "ಈ ಸೆಷನ್ ಅನ್ನು ಔಟ್ಪುಟ್ ಮಾಡಿ",
    "Media info viewer tool": "ಮಾಧ್ಯಮ ಮಾಹಿತಿ ವೀಕ್ಷಕ ಸಾಧನ",
    "View compress attempt cache": "ಪ್ರಯತ್ನ ಕ್ಯಾಶೆಯನ್ನು ವೀಕ್ಷಿಸಿ",
    "Clear compress attempt cache": "ಪ್ರಯತ್ನ ಸಂಗ್ರಹವನ್ನು ಸಂಕುಚಿಸಿ ತೆರವುಗೊಳಿಸಿ",
    "Save config": "ಸಂರಚನೆಯನ್ನು ಉಳಿಸಿ",
    "Scan only": "ಸ್ಕ್ಯಾನ್ ಮಾತ್ರ",
    "Scan and convert": "ಸ್ಕ್ಯಾನ್ ಮಾಡಿ ಪರಿವರ್ತಿಸಿ",
    "View scan/conversion summary log": "ಸ್ಕ್ಯಾನ್ / ಪರಿವರ್ತನ ಸಾರಾಂಶ ಲಾಗ್ ಅನ್ನು ವೀಕ್ಷಿಸಿ",
    "View individual file check/conversion log": "ಪ್ರತ್ಯೇಕ ಫೈಲ್ ಚೆಕ್ / ಪರಿವರ್ತನೆ ಲಾಗ್ ಅನ್ನು ವೀಕ್ಷಿಸಿ",
    "View worker console output": "ಕೆಲಸಗಾರ ಕನ್ಸೋಲ್ ಔಟ್ಪುಟ್ ವೀಕ್ಷಿಸಿ",
    "Health check": "ಆರೋಗ್ಯ ತಪಾಸಣೆ",
    "Clear healthy file cache": "ಆರೋಗ್ಯಕರ ಫೈಲ್ ಸಂಗ್ರಹವನ್ನು ತೆರವುಗೊಳಿಸಿ",
    "View error log": "ದೋಷ ಲಾಗ್ ಅನ್ನು ವೀಕ್ಷಿಸಿ",
    "Email test": "ಇಮೇಲ್ ಪರೀಕ್ಷೆ",
    "View master log": "ಮಾಸ್ಟರ್ ಲಾಗ್ ಅನ್ನು ವೀಕ್ಷಿಸಿ",
    "Wiki help": "ವಿಕಿ ಸಹಾಯ",
    "An application by HaveAGitGat": "ಹ್ಯಾವ್ಎಜಿಜಿಟ್ ಗ್ಯಾಟ್ನ ಅಪ್ಲಿಕೇಶನ್",
    "New": "ಹೊಸ",
    "Launch": "ಪ್ರಾರಂಭಿಸಿ",
    "Benchmark": "ಮಾನದಂಡ",
    "See results": "ಫಲಿತಾಂಶಗಳನ್ನು ನೋಡಿ",
    "Pause queue": "ಕ್ಯೂ ವಿರಾಮಗೊಳಿಸು",
    "Continue queue": "ಕ್ಯೂ ಮುಂದುವರಿಸಿ",
    "Stop queue": "ಕ್ಯೂ ನಿಲ್ಲಿಸಿ",
    "Convert selected files": "ಆಯ್ದ ಫೈಲ್ಗಳನ್ನು ಪರಿವರ್ತಿಸಿ",
    "Toggle queue view": "ಟಾಗಲ್ ಕ್ಯೂ ವೀಕ್ಷಣೆ",
    "Deselect all": "ಎಲ್ಲವನ್ನೂ ಆಯ್ಕೆ ಮಾಡಿ",
    "Invert all": "ಎಲ್ಲವನ್ನೂ ತಿರುಗಿಸು",
    "Select all": "ಎಲ್ಲವನ್ನು ಆರಿಸು",
    "Toggle output view": "ಔಟ್ಪುಟ್ ವೀಕ್ಷಣೆಯನ್ನು ಟಾಗಲ್ ಮಾಡಿ"
}