{
    "The number of custom presets does not match the number of source folders!": "Etiam iaculis mollis mos numerus non respondeat numero fons folders!",
    "source folders have been detected.": "fons folders reperti sunt.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "Funes preset consuetudo deprehendatur. Gemina fracta recta placuerunt ceptum invisibilium. Pellentesque ut una uel folder per lineam. Fac tibi blank linea non est accidens creata.",
    "The number of filename suffixes does not match the number of source folders! ": "Archive suffixes numerus non respondeat numero fons folders!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "etiamne name versus deprehendi. Gemina fracta recta placuerunt ceptum invisibilium. Per unam lineam que folder name uel esse. Fac tibi blank linea non est accidens creata.",
    "The number of source folders does not match the number of destination folders!": "Numerus de fonte folder does not match fuerit numerus destination folders!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "folders destination reperti sunt. Gemina fracta recta placuerunt ceptum invisibilium. Per viam rectam ut una folder. Fac tibi blank linea non est accidens creata.",
    "The number of source folders does not match the number of temporary conversion folders!": "Numerus de fonte folder does not match numerum conversionem ad tempus folders!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "tempus conversionem folders reperti sunt. Gemina fracta recta placuerunt ceptum invisibilium. Per viam rectam ut una folder. Fac tibi blank linea non est accidens creata.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Please enter validum continetur ut '.mp4. Fac Vide ut quod '.",
    "Corrupt file folder": "Corrumpere file folder",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "non existat! Quaeso, scrutare non sunt spatia nec occultatum characteres ante / post viam,",
    "Source folder": "fons folder",
    "Temporary conversion folder": "Tempus conversionem folder",
    "appears to be the same as or is within source folder": "Videtur quod non sit eadem est in fonte folder",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "qui ne ex HBBatchBeast muneris bene. Placere tempus conversionem mutata in folder ad fontem folder extra folder. Si vos erant 'uti volentes quam etiam per' Restituo pluma files originale ', placere eligere folder, quod destination est in idem est, sive intra in folder fonte, et tunc reprehendo quod' vnde originale files semper, reprehendo in provectus occasus sectione . Notam e ad tempus, temporaria conversionem folder, checkbox serve quia in hoc casu non est usus. Lima folder Vobis equidem convertetur in locum desideratum et ferebatur in folder fons.",
    "Destination folder": "Destination folder",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "qui ne ex HBBatchBeast muneris bene. Placere mutare locum desideratum folder ut a folder foras ad fontem folder. Si vos erant 'uti volentes quam etiam per' Restituo pluma files originale ', placere eligere folder, quod destination est in idem est, sive intra in folder fonte, et tunc reprehendo quod' vnde originale files semper, reprehendo in provectus occasus sectione . Notam e ad tempus, temporaria conversionem folder, checkbox serve quia in hoc casu non est usus. Lima folder Vobis equidem convertetur in locum desideratum et ferebatur in folder fons.",
    "Error creating temporary conversion folder": "Conversionis tempus creavit errorem folder",
    "Error creating destination folder": "Error partum destination folder",
    "Please select to use HandBrake or FFmpeg!": "Placere eligere et uti handbrake FFmpeg!",
    "Please select a standard preset or input a custom one!": "Placere eligere vel addere cum preset vexillum mos est!",
    "Please select a scan interval of 5 seconds or greater!": "Placere eligere scan aut maius spatium V seconds!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Quaeso, scrutare si numerus simultaneous handbrake / FFmpeg vel maior instantiarum est ad uti!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Aliquam API key! Please click 'nova, magna tab in remotis novum key est generate.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "XXIV horas quotidie in scan PDF format n: mm (exempli 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "FONS lima mos fortiores potius deleta conuersi! Tenta nos obsecro ante legitimum usum revocabis?",
    "Benchmark failed!": "Probatio defecit!",
    "Log does not exist!": "Iniuriarum non est?",
    "Folder does not exist!": "Folder non est?",
    "Error sending email! Please check your settings.": "Errorem mittentes inscriptio? Placere reprehendo vestri occasus.",
    "Test email sent!": "Test misit inscriptio?",
    "All worker processes have been stopped.": "Omnis artifex sublatis processus.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Et cum paulum reticuisset current processus items in queue et complevit. Es vos certus vos volo est moram faciendi in queue?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Queue initiated.'Continue mora, cum omnes opifices non apparebit conjunctionem morabantur.",
    "Healthy file cache cleared!": "Sanus file cache remotae?",
    "Cache cleared!": "Cache remotae?",
    "Cancel item": "item Cancel",
    "Please check the above checkbox to use this feature.": "Please uti supra pluma reprehendo.",
    "Configuration": "configurationis",
    "Source folders": "fons folders",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Hic est fons folder quod voluntas media est lustrabat lumine. Quod folder postulo ut exsisto ingressi sunt VULNUS nihil trailing. For example:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Fons est arca folder semita expandable (torcular intra creare novum recta). Si volumus multiple fons proprius folders, faciunt certus quisque fons folder semita recta suum sicut in ejus:",
    "Video health check": "Video reprehendo sanitas",
    "Batch conversion and Folder watching": "Et batch conversionem vigilo Folder",
    "Remote Monitoring (Beta)": "Cras remotis (Beta)",
    "Benchmark (Beta)": "Benchmarkr (Beta)",
    "System": "ratio",
    "Help": "auxilium",
    "Temporary conversion folders": "Tempus conversionem folders",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Quod si \"temporaria conversionem folder?\" sedatus est ergo handbrake convertet in files ut folder. Cum enim conversionem consummatum est, quod voluntas movetur in lima vestri 'folder Destination \". Opus erit tibi deprementis specificare Quotquot tempus conversionem fons folders quod folders. Primo fonte amet folder in vestri convertentur ad tempus conversionem folder, secundum tempus tuam secundo fonte folder in vestri et conversionem in folder. Conversionis tempus utrumque suo est certam viam rectam folder.",
    "Destination folders": "Destination folders",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Proprius folder destinatum iter. Iterum, youll 'postulo ut proprius folders pro fonte Quotquot destination folders. Files a fonte amet folder mos terminus sursum folder in vestri destination primo, secundo fonte vestri files folder in folder alterum, et sic in destination.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Primo fons folder ---------> Primum tempus conversionem folder ---------> Primo destination folder",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Secundo fonte folder ---------> secundum conversionem ad tempus folder ---------> secundi destination folder",
    "etc": "etc.",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast nec bene operari set si destination est in idem folder vel intra, fons folder.",
    "Standard preset:": "Latin preset:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Select the Handbrake preset velis tua denuo cum converterit. Si «Latin fermentum 'sit electus, et omnis electus folders quod lima in mos est eorum multi permoveantur ut certa handbrake fermentum. Potes invenire magis de handbrake Etiam iaculis mollis hic:",
    "Custom preset:": "More preset:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Si «Mos consectetur 'tunc intra eget consectetur consuetudo. HBBatchBeast operit ventrem \"o fons destination HandBrakeCLI l 'postulo vos ut input partem HandBrakeCLI intrare conversionem parametri. For example:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Si FFmpeg usura, vos postulo ad input et output separate comma, cum motus parametri. Ut:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Vos can quoque mos preset ad quod suus 'a multis dissipatis a GUI applicationem publica handbrake exempli gratia:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Si vos es habens tribulationis cum Etiam iaculis mollis consuetudo est, ut sciatur, debitum ad cimex cum HandBrakeCLI (dabit ei imponi iuxta HandBrakeCLI release). Placere animadverto ad id tempus continget solutio,",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Quisque fermentum mos postulo ut exsisto in linea sui et similis folders, sis ut multi mos non postulo ut fons Etiam iaculis mollis folders.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Primo fons folder ---------> Primum tempus conversionem folder ---------> Primo destination folder Custom preset I @",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Secundo fonte folder ---------> secundum conversionem ad tempus folder ---------> secundi destination folder @ Custom preset II",
    "See the following image for guidance:": "Vide in sequentibus ad imaginem duce revelasti:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Si per modum translitterandi graphics card (ut NVENC), tunc vos postulo ut handbrake minuere numerum exemplorum (experiri aut paucioribus II) debitum ad VRAM limitations.",
    "Select standard preset:": "Select vexillum preset:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC nequiquam detecta fraude in aliquibus placet, fac, ut infra numerus HandBrakeCLI II infra, sive (ut maxime graphics pecto), vel forte occurrant vobis risu digna in tempore non satis VRAM. Hoc potest occasu in in \"System\" tab.",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Etiam iaculis mollis velit fermentum detected.If es habens tribulationis cum importari consuetudo est, ut sciatur, debitum ad cimex cum HandBrakeCLI (dabit ei imponi iuxta HandBrakeCLI release). A solutio ad tempus removere ' \"PictureRotate\" \"0, 0' 'a lima .json. Magis info hic",
    "Container:": "continens:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Specificare in quo velis ad output lima ut ut '.mp4. Vos can inveniet procul et de continentia:",
    "Enable periodic scanning:": "Admitte periodica intuens:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "Monitor vestri folders quod fons HBBatchBeast potest currere ad lustrat novam files certa ad futuram. Spatium temporis est seconds cum CCC seconds default esse (V minuta). Si optio sit electus, tunc vos premere, cum \"converterit quis Scan quod\" progressio limis et converterit quis novus timer tunc countdown a incipiam. Haec voluntatis loop in infinitum, donec finiatur. Ordines spatium aetatis partem in scan.",
    "Enable daily scanning:": "Admitte cotidie intuens:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Instead of periodica intuens, te potest eligere ut in scan currunt semel in die. Et ingressus est in scan tempus occasus provectus sectionem in h: ut forma '18 mm: XXX. Cum \"Scan convertere 'sit electus, libellum exspectabo usque ad praefinitum tempus a currentem ad scan et conversionem processus. Iterum, hoc concludi voluntatis loop ad infinitum.",
    "Show/hide advanced:": "Show / provectus celare:",
    "Scan interval (minimum 5 seconds):": "Scan spatium (minimum V seconds)",
    "Daily run time (hh:mm):": "Daily run tempus (H h: mm)",
    "Output filename suffix:": "Que output name:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Hoc est liberum voluntati. Si vis addere que sunt ad finem, sicut archive of vestri '_1080p' vel '_testconversion' etc.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Si 'vexillum fermentum' sit electus et tota output erit files eodem que.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Quod si, more lobortis, lectus non erit inter vos can proprius folder que per fons / more fermentum. Que sit linea quaelibet certa suo. Eg si habes II fons folders quod mos sunt per 'consectetur', vos potest posuit in filename que est arca:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Lima folder erit in fonte primo, _720p 'additum output filename. Files secundum folder erit fons '_1080p' additum output archive etc.",
    "Include these file types:": "Lima typus haec includere:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Intra ut scan per lima typus. Necesse est quod quisque genus separata per acutum a C Diatonico. Et ingressum default est:",
    "Exclude files smaller than (MB):": "Excludere files minor (MB)",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Specificare sive est quaedam minor mole de conversionem excludere files (in megalocteti)",
    "Exclude files larger than (MB):": "Excludere maior quam files (MB)",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Specificare sive est maior quam aliqua magnitudo ex conversionem excludere files (in megalocteti)",
    "Exclude filenames which include any of these words:": "Excludere filenames quae includit aliquo horum verborum:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Intra keywords ut percolantur quando scanning est files. Eg si '720p \"ingressus est ergo ad omnem files\" 720p \"in titulo non erat. Iterum: opus keywords separari per acutum a C Diatonico. Eg intrare in filter post arca:",
    "Include files with any ": "Includit omni files",
    " or all ": "aut omne",
    " of these": "horum",
    "properties:": "proprietatibus,",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Hic vos can video input et proprietatibus, ut audio files habere necesse est ut convertantur (exprimatur per FFprobe info). De proprietatibus debet separari per acutum a C Diatonico. Instrumentis uti tool iuvo info videntium proprietatibus, quae determinare velis includit. Curare ut proprietas comma post ultimam. Verbi gratia, tantum conversi sunt encoded lima quod uti Stereo h264 et aac audio:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Dignum est ut res est reprehendo processus conversionis initium quondam (dum aedificant servare queue) Licet lima apparet in conversione queue omittendum erit / si sub condicione recte occurrit.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Si FFprobe possit eliciunt proprietatibus, tunc per 'OK' apparebit in \"FFprobe\" columna in queue visum.",
    "Exclude files with any ": "Excludere omni files",
    " of these ": "horum",
    "The opposite of 'Include files with any or all of these properties'": "Contrarium, cum omnes comprehendat lima istarum rerum,",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Hoc est parva analyze file tool est cum proprietatibus, quae determinare auxilium vobis ut vestri 'amo ut includit proprietatibus / in excludere super options. Sic utitur FFprobe redire notitia. In extraho quod occumbo lima arca archa est infallibilis et lux griseo. Eg mittentem æra temptare file redirem sequentibus:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Si vos erant 'vultus ut files like this excludere e converso, tunc vos can lima pluribus proprietatibus posuit ad \"Excludere omne files aut quis est ex his proprietatibus\" reprehendo reprehendo arca archa tunc ut et' omnis 'pro' si ', ut sic;",
    "Copy excluded files to destination:": "Excluduntur effingo lima ut destination,",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Si eligere hanc optionem ergo files excluduntur, quae sunt directe transtulerunt ex conversionem et ad locum desideratum folder. Haec est lex Filtra sequentia:",
    "Exclude filenames which include any of these words": "Excludere filenames quae includit aliquo horum verborum",
    "Include files with any or all of these properties": "Haec omnia includere, vel si cum proprietatibus files",
    "Exclude files with any or all of these properties": "Excludere omne files aut quis est ex his proprietatibus",
    "Exclude files smaller than (MB)": "Excludere files minor (MB)",
    "Exclude files larger than (MB)": "Excludere maior quam files (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Nota hic, ita potest dici files excluduntur, quia non occurrit in \"Nulla\" conditionibus supra res non ita accidens tantum, erant 'effingo vestri' trying ut convertam tota bibliotheca cum paucis files.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Sed hoc non est exemplum pluma est Filtra sequentia (id excluduntur propter filter files)",
    "Include these file types": "Haec includit file types",
    "Delete source files after conversion:": "Delere fons files post conversionem:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Eaque delectus conversio si conatus prospere Gloria Patri principium deletum. Hoc fit extremum omnium conversione lima. Hoc est ut possit convertere eodem fonte usus multiple files Etiam iaculis mollis, omnis ire in unum. Et erit fons files potest deletum mortem exstiterunt.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Original file reponere si conversus lima est minor? (Conatus Compriment)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Quod reprehendo arca archa, si velis eligere HBBatchBeast statim reponere in the original file, si fons novus lima est minor. Si novus lima est minor, tum In locum desideratum debet folder.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Effice ut tuam destination est in idem folder quod / vel interius, vel folder ut vestri source non recte operandum.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Semel conatus est, ut brevi a propria HBBatchBeast file: et adde quod lima, quae ad viam, et non est cache in futura conatus. Inspicere potes / edit / purgare per quod flavo Bullae cache.",
    "Replace original file always?": "Original file semper reponere?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Original file Et erit reponi, sive novus lima est minor vel maior.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Iterum, fac tua destination est in idem folder quod / vel interius, vel folder ut vestri source non recte operandum.",
    "Copy subtitle (srt) files to destination?": "Exemplum subtilissima (avi) files ad locum properant omnia",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Title '.srt, copied files ut folder statim ad locum desideratum.",
    "Automatically create temporary/destination folders if they don't exist?": "Tempus statim create / folders destination si hoc non est?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Vespertilio in semita mos run sulum post conversionem (discedere nisi per blank)",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Quem morem iter seges input file conversionem singulos facere velis. For example:",
    "Batch files with timeout statements won't work. More info here:": "Batch lima per dicitur timeout non operatur. Magis info hic",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Nolo egredi pixidem vacat si bene uti (occultas notas fac nulla cellula)",
    "Run processes at low priority?": "Maximum currunt priores actiones?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Conversionem processus omnes currerent ero humilis prior usu processus dapibus.",
    "Remove apostrophes from filenames:": "Remove a apostrophes filenames:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Ad conversiones promovendas / salutem reprehendo visu perlustrat, ut, si filenames non deficient in apostrophes. Reprehendo hoc statim removere a apostrophes filenames.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Hoc scan Potest enim pluma video lima usura handbrake est corrumpere '--scan' pluma, tamen hoc non semper accurate. Etiam utitur FFprobe providere a secunda parte referat. Quod si tam FFprobe handbrake et deficient et altum ibi est tabella, quae forte non corrumpere.",
    "Move corrupt files into the following folder:": "Movere corrumpere files folder in sequentibus:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Si repressit, quodlibet movebitur in speciem imagini quibus errores folder.",
    "Corrupt file folder:": "Corrumpere file folder:",
    "Run thorough file health check:": "Curre penitus lima salutem reprehendo:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Si sedatus, deinde multo tardius, in current, in quo indigenae sacerdotes penitius video salutem reprehendo usura FFmpeg pro handbrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Ex Desani est, ScanMedia.ps1 'found in:",
    "Attempt to repair files after thorough check:": "Reficere conatus files ex accurata reprehendo:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Si sedatus, HBBatchBeast operam dabunt, ut quod cadere cœperat files per FFmpeg. Novum lima cum suffixo '_repaired, et creatus est in eodem fonte file folder ut.",
    "'CRF' value to use when attempting to repair files:": "'CRF' ad valorem cum conanti files ita ut impleretur instauratio:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Default est, CRF 'Placere animadverto valorem 23. haec est enim magis notitia:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "In range ex scale quod CRF 0-51, ubi sit 0 Insane, XXIII default est, et fieri potest qualis LI est pessimus. Qualia plerumque minoris aestimat ad superiora et subiective 17-28 parendum est sanus. Considerans vel XVII XVIII esse uisum est lossless vel prope, aspice ut paene eiusdem autem est technice lossless input.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "Lustrabat lumine HBBatchBeast salvet a album of lima quod per vias rectas nuntiavit incipiebat incorruptum. Purgare cache praestare nova scan super files.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Number of simultaneous handbrake / FFmpeg exemplis uti? (IV commendatur aut paucioribus)",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Hic locus utrique \"Video valetudo reprehendo\" et \"convertere Scan\" processus. Quot handbrake specificare ut relatorum. Suus commendatur non uti non licet maior quam 4. Si superior ornare non duratus plurimum quantitatis.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Visum mole queue finis? (M commendatur aut paucioribus)",
    "Automatically start \"Scan and convert\" when program opened?": "Statim satus \", et converterit quis Scan\" Cum aperuit progressio?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Replete in inscriptio inscriptio Details Acta Vicimediorum Communium accipere, si errorem offendit est per conversionem et salutem reprehendo / folder jejuniis multis. Non opus hoc requirere 2FA rationum. Opus est tibi accessum ad ad minus secure rationes ipses apps.",
    "Email address:": "Email address:",
    "For example:": "For example:",
    "Email password(not saved):": "Email password (non servata est)",
    "SMTP server:": "ESMTP servo:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Hoc pluma concedit magna conversionem / status salutem reprehendo usura ullus textus pasco,. Cum currit servers utiles etc.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Si ipsae non ad hoc data HBBatchBeast.io Anonymous:",
    "API key": "API key",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Current status ( 'Searching', 'currit', 'Complevit, etc.)",
    "Number of:": "Numerus ex:",
    "Remaining items": "reliquis items",
    "Successful items": "felix items",
    "Errored items": "Errored items",
    "Cancelled items": "Pax items",
    "Worker percentages": "opificem, percentages",
    "Last completed item time": "Item ultimo complebitur tempus",
    "Enable remote monitoring?:": "Admitte remotis magna ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Maxime quantum ad utilitatem built benchmarking A basic core 16+ processors usus praestare possit, tametsi plures handbrake persequor omnis generis processus.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Hoc erit download lima est h265 4k specimen (2.5MB) et currere ad velit fermentum consectetur est cum usura exempla IV handbrake \"Fast 1080p30 Ipsum\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Results potest esse uploaded hbbatchbeast.io Si vis.",
    "Queue": "Queue",
    "Output this session": "Hoc sessionem output",
    "Media info viewer tool": "Media videntium instrumentum info",
    "View compress attempt cache": "View compriment conatus cache",
    "Clear compress attempt cache": "Patet compriment conatus cache",
    "Save config": "nisi aboutconfig",
    "Scan only": "nisi scan",
    "Scan and convert": "Et convertam scan",
    "View scan/conversion summary log": "View scan / summary conversionem iniuriarum",
    "View individual file check/conversion log": "View file singula reprehendo / conversionem iniuriarum",
    "View worker console output": "Consolamini operatur View output",
    "Health check": "reprehendo sanitas",
    "Clear healthy file cache": "Patet sanus file cache",
    "View error log": "View errorem iniuriarum",
    "Email test": "Email test",
    "View master log": "View dominum iniuriarum",
    "Wiki help": "wiki auxilium",
    "An application by HaveAGitGat": "An application per HaveAGitGat",
    "New": "novus",
    "Launch": "Lorem",
    "Benchmark": "Benchmarkr",
    "See results": "lemmātis",
    "Pause queue": "Die Jovis queue",
    "Continue queue": "continue queue",
    "Stop queue": "nolite queue",
    "Convert selected files": "Converterit quis lectus files",
    "Toggle queue view": "Toggle visum queue",
    "Deselect all": "omnes Deselect",
    "Invert all": "invertunt omnia,",
    "Select all": "Desumo omnes",
    "Toggle output view": "Toggle visum output"
}