{
    "The number of custom presets does not match the number of source folders!": "Pasirinktinių nustatymų skaičius neatitinka šaltinių aplankų skaičiaus!",
    "source folders have been detected.": "šaltinių aplankai.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "nustatytos individualios iš anksto nustatytos eilutės. Patikrinkite, ar nėra nematomų linijų pertraukų. Kiekvienoje eilutėje turėtų būti vienas aplanko kelias arba išankstinis nustatymas. Įsitikinkite, kad netyčia nesukūrėte tuščios eilutės.",
    "The number of filename suffixes does not match the number of source folders! ": "Failų pavadinimų priesagų skaičius neatitinka šaltinių aplankų skaičiaus!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "aptikta failo vardo priesaga. Patikrinkite, ar nėra nematomų linijų pertraukų. Kiekvienoje eilutėje turėtų būti vienas aplanko kelias arba failo vardo priesaga. Įsitikinkite, kad netyčia nesukūrėte tuščios eilutės.",
    "The number of source folders does not match the number of destination folders!": "Šaltinių aplankų skaičius neatitinka paskirties aplankų skaičiaus!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "paskirties aplankai. Patikrinkite, ar nėra nematomų linijų pertraukų. Kiekvienoje eilutėje turėtų būti vienas aplanko kelias. Įsitikinkite, kad netyčia nesukūrėte tuščios eilutės.",
    "The number of source folders does not match the number of temporary conversion folders!": "Šaltinių aplankų skaičius neatitinka laikinų konversijos aplankų skaičiaus!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "buvo nustatyti laikini konversijos aplankai. Patikrinkite, ar nėra nematomų linijų pertraukų. Kiekvienoje eilutėje turėtų būti vienas aplanko kelias. Įsitikinkite, kad netyčia nesukūrėte tuščios eilutės.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Įveskite galiojantį konteinerį, pvz., „.Mp4“. Būtinai įtraukite „.“",
    "Corrupt file folder": "Sugadintas failų aplankas",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "neegzistuoja! Prieš / po kelio įsitikinkite, kad nėra tarpų ar paslėptų simbolių",
    "Source folder": "Šaltinio aplankas",
    "Temporary conversion folder": "Laikinas konversijos aplankas",
    "appears to be the same as or is within source folder": "Atrodo, kad jis yra toks pat kaip arba yra šaltinio aplanke",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "kuri neleis tinkamai veikti HBBatchBeast. Pakeiskite laikiną konversijos aplanką į aplanką, esantį ne šaltinio aplanke. Jei norite naudoti „Pakeisti originalaus failo funkciją“, pasirinkite paskirties aplanką, kuris nėra tas pats, ar šaltinio aplanke, ir tada pažymėkite žymės langelį „Pakeisti originalius failus“ išplėstinių nustatymų skiltyje . Pažymėkite žymimąjį laukelį „Laikinas konversijos aplankas“, nes šiuo atveju jis nebus naudojamas. Failai bus konvertuojami į paskirties aplanką ir po to perkeliami į šaltinio aplanką.",
    "Destination folder": "Paskirties aplanką",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "kuri neleis tinkamai veikti HBBatchBeast. Pakeiskite paskirties aplanką į aplanką, esantį ne šaltinio aplanke. Jei norite naudoti „Pakeisti originalaus failo funkciją“, pasirinkite paskirties aplanką, kuris nėra tas pats, ar šaltinio aplanke, ir tada pažymėkite žymės langelį „Pakeisti originalius failus“ išplėstinių nustatymų skiltyje . Pažymėkite žymimąjį laukelį „Laikinas konversijos aplankas“, nes šiuo atveju jis nebus naudojamas. Failai bus konvertuojami į paskirties aplanką ir po to perkeliami į šaltinio aplanką.",
    "Error creating temporary conversion folder": "Klaida kuriant laikiną konversijos aplanką",
    "Error creating destination folder": "Klaida kuriant paskirties aplanką",
    "Please select to use HandBrake or FFmpeg!": "Prašome pasirinkti naudoti „HandBrake“ arba „FFmpeg“!",
    "Please select a standard preset or input a custom one!": "Prašome pasirinkti standartinį nustatymą arba įvesti pasirinktinį!",
    "Please select a scan interval of 5 seconds or greater!": "Pasirinkite skenavimo intervalą 5 sekundes ar ilgiau!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Įsitikinkite, kad vienu metu naudojamų „HandBrake / FFmpeg“ atvejų skaičius yra vienas ar didesnis!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Neteisingas API raktas! Norėdami generuoti naują raktą, nuotolinio stebėjimo skirtuke spustelėkite „Naujas“.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Įveskite dienos skenavimo laiką 24 valandų formatu: hh: mm (pvz., 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "PAGAL KONVERSIJĄ PILDYTI ŠALTINIAI! Patikrinkite prieš naudojimą!",
    "Benchmark failed!": "Palyginimas nepavyko!",
    "Log does not exist!": "Žurnalas neegzistuoja!",
    "Folder does not exist!": "Aplankas neegzistuoja!",
    "Error sending email! Please check your settings.": "Klaida siunčiant el. Laišką! Patikrinkite nustatymus.",
    "Test email sent!": "Išsiųstas testo el. Laiškas!",
    "All worker processes have been stopped.": "Visi darbo procesai buvo sustabdyti.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Jei dabartiniai elementai bus apdoroti, eilė bus pristabdyta. Ar tikrai norite sustabdyti eilę?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Įjungta eilės pauzė. Kai visi darbuotojai pristabdys, pasirodys mygtukas „Tęsti“.",
    "Healthy file cache cleared!": "Išvalyta sveika failų talpykla!",
    "Cache cleared!": "Išsaugota talpykla!",
    "Cancel item": "Atšaukti elementą",
    "Please check the above checkbox to use this feature.": "Jei norite naudoti šią funkciją, patikrinkite aukščiau esantį žymės langelį.",
    "Configuration": "Konfigūracija",
    "Source folders": "Šaltinio aplankai",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Tai šaltinio aplankas, kuris bus nuskaitytas žiniasklaidai. Aplankas turi būti įvestas be jokių nuokrypių. Pavyzdžiui:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Šaltinio aplanko kelio langas yra išplėstas (paspauskite Enter, kad sukurtumėte naują eilutę). Jei norite nurodyti kelis šaltinio aplankus, įsitikinkite, kad kiekvieno šaltinio aplanko kelias yra savo eilutėje, pvz .:",
    "Video health check": "Video sveikatos patikrinimas",
    "Batch conversion and Folder watching": "Partijos konvertavimas ir aplankų žiūrėjimas",
    "Remote Monitoring (Beta)": "Nuotolinis stebėjimas (Beta)",
    "Benchmark (Beta)": "Benchmark (Beta)",
    "System": "Sistema",
    "Help": "Pagalba",
    "Temporary conversion folders": "Laikini konversijos aplankai",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Jei „Laikinas konversijos aplankas?“ pažymėtas, tada „HandBrake“ konvertuos failus į tą aplanką. Baigus konversiją, failas bus perkeltas į jūsų paskirties vietą. Turėsite nurodyti kuo daugiau laikinųjų konversijos aplankų kaip šaltinio aplankus. Jūsų pirmasis šaltinio aplankas bus konvertuojamas į pirmąjį laikiną konversijos aplanką, antrąjį šaltinio aplanką į antrąjį laikiną konversijos aplanką ir pan. Įsitikinkite, kad kiekvienas laikino konvertavimo aplanko kelias yra savo eilutėje.",
    "Destination folders": "Paskirties aplankai",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Nurodykite paskirties aplanko takus. Vėlgi, jums reikės nurodyti tiek aplankų, kiek paskirties šaltinių. Jūsų pirmojo šaltinio aplanko failai baigsis pirmajame paskirties aplanke, antrajame šaltinio aplanko failuose antrajame paskirties aplanke ir pan.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Pirmasis šaltinio aplankas ---------> Pirmasis laikinas konversijos aplankas ---------> Pirmasis paskirties aplankas",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Antrasis šaltinio aplankas ---------> Antrasis laikinas konversijos aplankas ---------> Antrasis paskirties aplankas",
    "etc": "ir kt",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast neveiks tinkamai, jei nustatysite paskirties aplanką kaip ir šaltinio aplanke arba jo viduje.",
    "Standard preset:": "Standartinis standartinis nustatymas:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Pasirinkite „HandBrake“ nustatymą, kurį norite konvertuoti failus. Jei pasirinktas „Standartinis nustatymas“, visi failai pasirinktuose aplankuose bus konvertuoti naudojant nustatytą rankinio stabdžio nustatymą. Daugiau apie „HandBrake“ nustatymus galite rasti čia:",
    "Custom preset:": "Pasirinktinis nustatymas:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Jei „Custom preset“ („Pasirinktinis nustatymas“), turite įvesti savo pasirinktinį nustatymą. „HBBatchBeast“ apima „HandBrakeCLI -i šaltinio-paskirties vietą“ „HandBrakeCLI“ įvesties dalį, todėl reikia įvesti konversijos parametrus. Pavyzdžiui:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Jei naudojate FFmpeg, turite atskirti įvesties ir išvesties parametrus kableliu. Toks kaip:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Taip pat galite susieti su pasirinktiniu nustatymu, kuris buvo eksportuotas iš oficialios „HandBrake“ GUI programos, pavyzdžiui:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Jei kyla problemų su pasirinktiniais nustatymais, jis gali būti susijęs su žinoma klaida „HandBrakeCLI“ (bus nustatyta kitame „HandBrakeCLI“ leidinyje). Jei norite gauti laikiną sprendimą, žr.",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Kiekvienas priskirtas išankstinis nustatymas turi būti savo eilutėje ir, kaip ir aplankuose, turi būti tiek daug pasirinktų iš anksto nustatytų kaip pirminių aplankų.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Pirmasis šaltinio aplankas ---------> Pirmasis laikinas konversijos aplankas ---------> Pirmasis paskirties aplankas @ Pasirinktinis nustatymas 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Antrasis šaltinio aplankas ---------> Antrasis laikinas konversijos aplankas ---------> Antrasis paskirties aplankas @ Pasirinktinis nustatymas 2",
    "See the following image for guidance:": "Žr. Toliau pateiktą vaizdą:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Jei naudojate grafikos plokštės kodavimą (pvz., NVENC), gali tekti sumažinti „HandBrake“ atvejų skaičių (pabandyti 2 ar mažiau) dėl VRAM apribojimų.",
    "Select standard preset:": "Pasirinkite standartinį nustatymą:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "Aptikta NVENC, įsitikinkite, kad sumažinsite „HandBrakeCLI“ egzempliorių skaičių iki 2 arba žemiau (daugumai grafikos kortelių) arba gali kilti klaidų dėl nepakankamo VRAM. Šį nustatymą galima rasti skirtuke „Sistema“.",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Importuotas išankstinis nustatymas.Jei kyla problemų su importuotais pasirinktiniais išankstiniais nustatymais, tai gali būti dėl žinomos klaidos „HandBrakeCLI“ (bus nustatyta kitame „HandBrakeCLI“ leidinyje). Laikinas sprendimas yra pašalinti „„ PictureRotate “:„ 0: 0 “iš .json failo. Daugiau informacijos čia:",
    "Container:": "Konteineris:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Nurodykite konteinerį, kurį norite turėti išvesties failą, pvz., „.Mp4“. Daugiau apie konteinerius galite sužinoti adresu:",
    "Enable periodic scanning:": "Įgalinti periodinį nuskaitymą:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "„HBBatchBeast“ gali stebėti jūsų šaltinių aplankus ir paleisti naujus failus nuskaitytais intervalais. Laiko intervalas yra sekundėmis, kai numatytasis parametras yra 300 sekundžių (5 minutės). Pasirinkus šią parinktį, kai paspausite „Nuskaityti ir konvertuoti“, programa konvertuos visus naujus failus, o tada bus pradėtas atgalinės atskaitos laikmatis. Tai bus begalinis, kol sustos. Skenavimo intervalas yra išplėstinių nustatymų skiltyje.",
    "Enable daily scanning:": "Įgalinti dienos skenavimą:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Vietoj periodinio nuskaitymo galite pasirinkti, kad skenavimas būtų paleistas kartą per dieną. Nuskaitymo laikas įvedamas išplėstinių nustatymų skiltyje hh: mm formatu, pvz., „18: 30“. Pasirinkus „Nuskaityti ir konvertuoti“, programa laukia iki nurodyto laiko, kol bus paleistas nuskaitymo ir konvertavimo procesas. Vėlgi, tai truks be galo, kol sustos.",
    "Show/hide advanced:": "Rodyti / slėpti išplėstą:",
    "Scan interval (minimum 5 seconds):": "Nuskaitymo intervalas (mažiausiai 5 sekundės):",
    "Daily run time (hh:mm):": "Kasdienis veikimo laikas (hh: mm):",
    "Output filename suffix:": "Išvesties failo pavadinimo priesaga:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Tai neprivaloma. Galite nurodyti priesagą, kad pridėtumėte prie failo vardo pabaigos, pvz., „_1080p“ arba „_testconversion“ ir tt",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Jei pasirinktas „standartinis išankstinis nustatymas“, visi išvesties failai turės tą patį priesagą.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Pasirinkus „pasirinktinį nustatymą“, galite nurodyti vieną priesagą kiekvienam šaltinio aplankui / pasirinktiniam nustatymui. Įsitikinkite, kad kiekvienas priesagas yra savo eilutėje. Pvz., Jei turite 2 šaltinio aplankus ir naudojate „pasirinktinį nustatymą“, galite jį įterpti į failo pavadinimo priedėlį:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Pirmajame šaltinio aplanke esantys failai bus pridėti prie „_720p“ išvesties failo vardo. Antrajame šaltinio aplanke esantys failai bus pridėti prie „_1080p“ išvesties failo pavadinimo ir pan.",
    "Include these file types:": "Įtraukti šiuos failų tipus:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Įveskite ieškomus failų tipus. Kiekvienas tipas turi būti atskirtas kableliu. Numatytasis įrašas yra:",
    "Exclude files smaller than (MB):": "Išskirti mažesnius nei (MB) failus:",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Nurodykite, ar iš konversijos neįtraukti mažesnio nei tam tikro dydžio failai (megabaitais)",
    "Exclude files larger than (MB):": "Išskirti didesnius nei (MB) failus:",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Nurodykite, ar iš konversijos neįtraukiami failai, didesni nei tam tikras dydis (megabaitais)",
    "Exclude filenames which include any of these words:": "Neįtraukti failų vardų, kuriuose yra bet kuris iš šių žodžių:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Skenuodami failus įveskite raktinius žodžius, kurie turi būti filtruojami. Pvz., Jei įvestas „720p“, tada bet kokie failai su pavadinimu „720p“ nebus konvertuojami. Vėlgi, raktinius žodžius reikia atskirti kableliu. Pvz., Filtro laukelyje įveskite:",
    "Include files with any ": "Įtraukite failus į bet kurį",
    " or all ": "arba visi",
    " of these": "iš jų",
    "properties:": "savybės:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Čia galite įvesti vaizdo ir garso ypatybes, kurias turi turėti failai, kad juos būtų galima konvertuoti (informacija išgaunama naudojant FFprobe). Savybės turi būti atskirtos kableliu. Naudokite žiniasklaidos informacijos peržiūros priemonės įrankį, kad nustatytumėte, kokias savybes norite įtraukti. Įsitikinkite, kad po paskutinio turto įdėjote kablelį. Pvz., Norėdami konvertuoti tik failus, kurie koduojami naudojant h264 ir aac stereo garsus:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Verta pažymėti, kad šis nuosavybės patikrinimas atliekamas, kai prasideda konversijos procesas (norint sutaupyti laiko pastatant eilę), todėl, nors konversijos eilėje gali būti rodomi failai, jie bus praleisti / įtraukti, jei bus įvykdytos teisingos sąlygos.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Jei FFprobe gali išskirti savybes, eilutės rodinyje „FFprobe“ stulpelyje pasirodys „OK“.",
    "Exclude files with any ": "Išskirti failus bet kuriuo",
    " of these ": "iš jų",
    "The opposite of 'Include files with any or all of these properties'": "Priešingai nei „Įtraukti failus su bet kuria iš šių savybių“",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Tai maža priemonė, skirta analizuoti failo ypatybes, kad būtų lengviau nustatyti, kurias ypatybes norite įtraukti / neįtraukti į pirmiau nurodytas parinktis. Ji naudoja FFprobe, kad grąžintų informaciją. Norėdami analizuoti juos, vilkite ir upuść failus į pilką langelį. Pavyzdžiui, atsisakant bandomojo failo gali būti:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Jei norite, kad tokie failai nebūtų konvertuojami, į „Išskirti failus su bet kuria iš šių savybių“ arba „Įtraukti failus į bet kurią iš šių savybių“ galite pažymėti keletą failo ypatybių ir pažymėti žymės langelį šalia „visi“ vietoj „bet“, kaip ir taip:",
    "Copy excluded files to destination:": "Kopijuoti neįtrauktus failus į paskirties vietą:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Jei pasirinksite šią parinktį, failai, kurie buvo neįtraukti į konversiją, bus nukopijuoti tiesiai į paskirties aplanką. Tai taikoma šiems filtrams:",
    "Exclude filenames which include any of these words": "Išskirti failų pavadinimus, kuriuose yra bet kuris iš šių žodžių",
    "Include files with any or all of these properties": "Įtraukti failus su bet kuria iš šių savybių",
    "Exclude files with any or all of these properties": "Išskirti failus su bet kuria iš šių savybių",
    "Exclude files smaller than (MB)": "Išskirti mažesnius nei (MB) failus",
    "Exclude files larger than (MB)": "Išskirti didesnius nei (MB) failus",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Atminkite, kad tai taip pat taikoma neįtrauktiems failams, nes jie neatitinka anksčiau pateiktų „Įtraukti“ nuosavybės sąlygų, todėl netyčia nenukopijuojate visos bibliotekos, kai tik bandote konvertuoti keletą failų.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Kopijavimo funkcija netaikoma šiems filtrams (ty failams, kurie neįtraukti dėl filtro)",
    "Include these file types": "Įtraukti šiuos failų tipus",
    "Delete source files after conversion:": "Ištrinti šaltinio failus po konversijos:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Jei tai pasirinkta, jei konversijos bandymas bus sėkmingas, šaltinio failas bus ištrintas. Šis procesas atliekamas pasibaigus visiems failams. Tai reiškia, kad tuos pačius šaltinio failus galite konvertuoti naudodami kelis iš anksto nustatytus nustatymus. Po to šaltiniai bus ištrinti.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Pakeiskite originalų failą, jei konvertuotas failas yra mažesnis?",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Pažymėkite šį žymės langelį, jei norite, kad HBBatchBeast automatiškai pakeistų pradinį šaltinio failą, jei naujas failas yra mažesnis. Jei naujas failas nėra mažesnis, jis bus paliktas paskirties aplanke.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Įsitikinkite, kad paskirties aplankas yra ne tas pats, kaip / arba, jūsų šaltinio aplanke, arba jis neveiks tinkamai.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Kai HBBatchBeast bandė suspausti konkretų failą, jis pridės tą failo kelią į talpyklą, kad ateityje jis nebūtų bandytas dar kartą. Galite peržiūrėti / redaguoti / išvalyti talpyklą geltonais mygtukais.",
    "Replace original file always?": "Visada pakeiskite originalų failą?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Pradinis failas bus pakeistas nepriklausomai nuo to, ar naujasis failas yra didesnis ar mažesnis.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Vėlgi, įsitikinkite, kad paskirties aplankas nėra tas pats, kas / arba jūsų šaltinio aplankas, arba jis neveiks tinkamai.",
    "Copy subtitle (srt) files to destination?": "Kopijuoti subtitrų (srt) failus į paskirties vietą?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Subtitrų „.srt“ failai bus nukopijuoti į paskirties aplanką automatiškai.",
    "Automatically create temporary/destination folders if they don't exist?": "Automatiškai sukurkite laikinus / paskirties aplankus, jei jų nėra?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Pasirinktinis šikšnosparnių kelias, skirtas paleisti po kiekvieno konversijos (palikite tuščią, jei nenaudojate):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Įveskite pasirinktinio paketo failo kelią, kurį norite atlikti po kiekvieno konversijos. Pavyzdžiui:",
    "Batch files with timeout statements won't work. More info here:": "Partijos failai su laiko išeikvojimo ataskaitomis neveiks. Daugiau informacijos čia:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Jei nenorite naudoti šios parinkties, palikite langelį visiškai tuščią (įsitikinkite, kad laukelyje nėra paslėptų simbolių)",
    "Run processes at low priority?": "Vykdykite žemo prioriteto procesus?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Visi konversijos procesai bus vykdomi mažu prioritetu, sumažinant procesoriaus naudojimą.",
    "Remove apostrophes from filenames:": "Pašalinti apostrofus iš failų vardų:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Konversijos / sveikatos patikrinimai gali nepavykti, jei failų vardai turi apostrofus. Patikrinkite, ar automatiškai pašalinami apostrofai iš failų vardų.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Ši funkcija gali nuskaityti sugadintus vaizdo failus naudojant „HandBrake“ funkciją „-scan“, nors tai ne visada yra tiksli. Jis taip pat naudoja FFprobe ir pateikia antrą atskaitos tašką. Jei FFprobe ir HandBrake nepavyksta, yra didelė tikimybė, kad failas bus sugadintas.",
    "Move corrupt files into the following folder:": "Perkelkite sugadintus failus į šį aplanką:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Jei pažymėta, tada bet kokie klaidos duodantys failai bus perkelti į nurodytą aplanką.",
    "Corrupt file folder:": "Sugadintas failų aplankas:",
    "Run thorough file health check:": "Atlikite išsamų failo sveikatos patikrinimą:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Jei bus patikrinta, tada FFmpeg, o ne HandBrake, bus atliktas daug lėčiau, kruopščiau tikrinant vaizdo įrašą.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Remiantis Desani „ScanMedia.ps1“, rastu:",
    "Attempt to repair files after thorough check:": "Bandymas taisyti failus po kruopštaus patikrinimo:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Jei pažymėtas, HBBatchBeast bandys taisyti failus naudodamas FFmpeg. Naujas failas su priesaga „_repaired“ bus sukurtas tame pačiame aplanke, kaip ir šaltinio failas.",
    "'CRF' value to use when attempting to repair files:": "„CRF“ vertė, naudojama bandant taisyti failus:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Numatytoji „CRF“ reikšmė yra 23. Jei norite gauti daugiau informacijos, žr.",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "CRF skalės diapazonas yra 0–51, kur 0 yra nuostolingas, 23 yra numatytasis, o 51 - blogiausia kokybė. Mažesnė vertė paprastai lemia aukštesnę kokybę, o subjektyviai sveikas diapazonas yra 17–28. Apsvarstykite 17 ar 18, kad jie būtų vizualiai beprasmiški ar beveik taip; jis turėtų atrodyti toks pats arba beveik toks pat, kaip ir įvesties, bet jis nėra techniškai prarastas.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast išsaugo nuskaitytų failų takų sąrašą, apie kurį pranešta kaip nekoreguota. Išvalykite talpyklą, kad atliktumėte naują visų failų nuskaitymą.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Vienu metu naudojamų „HandBrake / FFmpeg“ atvejų skaičius (rekomenduojama 4 ar mažiau):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Šis nustatymas taikomas tiek „Video sveikatos patikrinimui“, tiek „Scan and convert“ procesams. Nurodykite, kiek „HandBrake“ siūlų naudoti. Nėra maksimalaus, nors rekomenduojama nenaudoti daugiau nei 4. Didesnė suma gali užšaldyti kompiuterį, jei tai nėra labai galingas.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Eilės dydžio peržiūros riba? (Rekomenduojama 1000 ar mažiau):",
    "Automatically start \"Scan and convert\" when program opened?": "Automatiškai paleidus „Scan and convert“, kai programa atidaroma?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Užpildykite el. Pašto duomenis, kad gautumėte pranešimus apie el. Laišką, jei sveikatos patikrinimo ar konversijos / aplanko stebėjimo metu įvyko klaida. Neveiks su paskyromis, kurioms reikia 2FA. Turite įgalinti prieigą prie mažiau saugių programų „Gmail“ paskyrose.",
    "Email address:": "Elektroninio pašto adresas:",
    "For example:": "Pavyzdžiui:",
    "Email password(not saved):": "El. Pašto slaptažodis (neįrašytas):",
    "SMTP server:": "SMTP serveris:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Ši funkcija leidžia stebėti konversijos / sveikatos patikrinimo būseną naudojant bet kurią interneto naršyklę. Naudinga paleisti serverius ir kt.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Jei įjungta, HBBatchBeast.io bus išsiųsti šie anoniminiai duomenys:",
    "API key": "API raktas",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Dabartinė būsena („Paieška“, „Veikimas“, „Baigta“ ir tt)",
    "Number of:": "Skaičius:",
    "Remaining items": "Likę elementai",
    "Successful items": "Sėkmingi elementai",
    "Errored items": "Klaidingi elementai",
    "Cancelled items": "Atšaukti elementai",
    "Worker percentages": "Darbuotojų procentai",
    "Last completed item time": "Paskutinis užbaigtas elemento laikas",
    "Enable remote monitoring?:": "Įgalinti nuotolinį stebėjimą ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Pagrindinė etaloninė priemonė, sukurta daugiausia norint pamatyti, kaip 16+ pagrindiniai procesoriai atlieka naudojimąsi keliais rankinio stabdymo atvejais, nors jis gali būti naudojamas bet kokio tipo procesoriuje.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Tai atsisiunčia „h265 4k“ pavyzdinio failo failą (2,5 MB) ir atliks lyginamąjį indeksą naudodami 4 „HandBrake“ atvejus su iš anksto nustatytu „labai greitu 1080p30“",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Rezultatai gali būti įkelti į hbbatchbeast.io, jei pasirinksite.",
    "Queue": "Eilė",
    "Output this session": "Išvesti šią sesiją",
    "Media info viewer tool": "Medijos informacijos peržiūros priemonės įrankis",
    "View compress attempt cache": "Peržiūrėti kompresą bando talpyklą",
    "Clear compress attempt cache": "Išvalyti glaudinimo bandymą talpykloje",
    "Save config": "Išsaugoti konfig",
    "Scan only": "Tik nuskaitykite",
    "Scan and convert": "Nuskaityti ir konvertuoti",
    "View scan/conversion summary log": "Peržiūrėti nuskaitymo / konvertavimo suvestinės žurnalą",
    "View individual file check/conversion log": "Peržiūrėkite atskirą failo patikrinimo / konversijos žurnalą",
    "View worker console output": "Peržiūrėkite darbuotojų konsolės išėjimą",
    "Health check": "Sveikatos patikrinimas",
    "Clear healthy file cache": "Išvalyti sveiką failų talpyklą",
    "View error log": "Peržiūrėti klaidų žurnalą",
    "Email test": "El. Pašto testas",
    "View master log": "Peržiūrėti pagrindinį žurnalą",
    "Wiki help": "„Wiki“ pagalba",
    "An application by HaveAGitGat": "„HaveAGitGat“ paraiška",
    "New": "Naujas",
    "Launch": "Pradėti",
    "Benchmark": "Lyginamoji analizė",
    "See results": "Žr. Rezultatus",
    "Pause queue": "Sustabdyti eilę",
    "Continue queue": "Tęsti eilę",
    "Stop queue": "Sustabdyti eilę",
    "Convert selected files": "Konvertuoti pasirinktus failus",
    "Toggle queue view": "Perjungti eilės vaizdą",
    "Deselect all": "Atzymeti visus pasirinkimus",
    "Invert all": "Apversti viską",
    "Select all": "Pasirinkti viską",
    "Toggle output view": "Perjungti išėjimo vaizdą"
}