{"The number of custom presets does not match the number of source folders!":"Pielāgoto iestatījumu skaits nesakrīt ar avotu mapju skaitu!","source folders have been detected.":"avotu mapes.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"ir atklātas pielāgotas sākotnējās līnijas. Lūdzu, veiciet dubultu pārbaudi neredzamiem rindas pārtraukumiem. Katrai līnijai jābūt vienam mapes ceļam vai iepriekšējai iestatīšanai. Pārliecinieties, vai neesat nejauši izveidojis tukšu rindu.","The number of filename suffixes does not match the number of source folders! ":"Failu nosaukuma sufiksu skaits neatbilst avota mapju skaitam!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"ir konstatētas faila nosaukuma sufiksa rindas. Lūdzu, veiciet dubultu pārbaudi neredzamiem rindas pārtraukumiem. Katrai rindai jābūt vienam mapes ceļam vai faila nosaukuma sufiksam. Pārliecinieties, vai neesat nejauši izveidojis tukšu rindu.","The number of source folders does not match the number of destination folders!":"Avota mapju skaits neatbilst galamērķu mapju skaitam!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"mērķa mapes. Lūdzu, veiciet dubultu pārbaudi neredzamiem rindas pārtraukumiem. Katrai rindai jābūt vienam mapes ceļam. Pārliecinieties, vai neesat nejauši izveidojis tukšu rindu.","The number of source folders does not match the number of temporary conversion folders!":"Avota mapju skaits neatbilst pagaidu reklāmguvumu mapju skaitam!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"ir konstatētas pagaidu konvertēšanas mapes. Lūdzu, veiciet dubultu pārbaudi neredzamiem rindas pārtraukumiem. Katrai rindai jābūt vienam mapes ceļam. Pārliecinieties, vai neesat nejauši izveidojis tukšu rindu.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Lūdzu, ievadiet derīgu konteineru, piemēram, \".mp4\". Pārliecinieties, lai iekļautu '.'","Corrupt file folder":"Korumpēta failu mape","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"neeksistē! Lūdzu, pārliecinieties, ka pirms / pēc ceļa nav atstarpju vai slēptu rakstzīmju","Source folder":"Avota mape","Temporary conversion folder":"Pagaidu konvertēšanas mape","appears to be the same as or is within source folder":"Šķiet, ka tas ir tāds pats kā vai atrodas avota mapē","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"kas novērsīs HBBatchBeast pareizu darbību. Lūdzu, nomainiet pagaidu konvertēšanas mapi uz mapi ārpus avota mapes. Ja vēlaties izmantot funkciju \"Aizstāt sākotnējos failus\", lūdzu, atlasiet mērķa mapi, kas nav tā pati avota mape vai tās iekšpusē, un pēc tam atzīmējiet izvēles rūtiņu \"Aizstāt sākotnējos failus\" papildu iestatījumu sadaļā. . Noņemiet atzīmi no pagaidu izvēles rūtiņas “Pagaidu konvertēšanas mape”, jo tas šajā gadījumā neizmanto. Faili tiks pārvērsti mērķa mapē un pēc tam pārvietoti atpakaļ avota mapē.","Destination folder":"Galamērķa mape","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"kas novērsīs HBBatchBeast pareizu darbību. Lūdzu, nomainiet mērķa mapi uz mapi ārpus avota mapes. Ja vēlaties izmantot funkciju \"Aizstāt sākotnējos failus\", lūdzu, atlasiet mērķa mapi, kas nav tā pati avota mape vai tās iekšpusē, un pēc tam atzīmējiet izvēles rūtiņu \"Aizstāt sākotnējos failus\" papildu iestatījumu sadaļā. . Noņemiet atzīmi no pagaidu izvēles rūtiņas “Pagaidu konvertēšanas mape”, jo tas šajā gadījumā neizmanto. Faili tiks pārvērsti mērķa mapē un pēc tam pārvietoti atpakaļ avota mapē.","Error creating temporary conversion folder":"Radot pagaidu konvertēšanas mapi, radās kļūda","Error creating destination folder":"Radot mērķa mapi, radās kļūda","Please select to use HandBrake or FFmpeg!":"Lūdzu, izvēlieties lietot HandBrake vai FFmpeg!","Please select a standard preset or input a custom one!":"Lūdzu, atlasiet standarta iestatījumu vai ievadiet pielāgoto iestatījumu!","Please select a scan interval of 5 seconds or greater!":"Lūdzu, izvēlieties skenēšanas intervālu 5 sekundes vai ilgāk!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Lūdzu, pārliecinieties, vai vienlaicīgi izmantojamo HandBrake / FFmpeg gadījumu skaits ir viens vai lielāks!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Nederīga API atslēga! Lai izveidotu jaunu atslēgu, attālās uzraudzības cilnē noklikšķiniet uz \"Jauns\".","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Lūdzu, ievadiet ikdienas skenēšanas laiku 24 stundu formātā: hh: mm (piemēram, 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"PĒC PĀRSTRĀDES IZŅEMT AVOTU DOKUMENTI! Lūdzu, pārbaudiet pirms pareizas lietošanas!","Benchmark failed!":"Benchmark neizdevās!","Log does not exist!":"Žurnāls nepastāv!","Folder does not exist!":"Mapes neeksistē!","Error sending email! Please check your settings.":"E-pasta sūtīšanas kļūda! Lūdzu, pārbaudiet iestatījumus.","Test email sent!":"Testa e-pasts nosūtīts!","All worker processes have been stopped.":"Visi darba ņēmēju procesi ir apturēti.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Ja pašreizējie vienumi būs pabeiguši apstrādi, rinda tiks apturēta. Vai tiešām vēlaties pārtraukt rindu?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Uzsākta rindas pauze. '' Turpināt '' poga parādīsies, kad visi darbinieki ir apturējuši.","Healthy file cache cleared!":"Veselīga failu kešatmiņa notīrīta!","Cache cleared!":"Kešatmiņa notīrīta!","Cancel item":"Atcelt vienumu","Please check the above checkbox to use this feature.":"Lūdzu, atzīmējiet iepriekš minēto izvēles rūtiņu, lai izmantotu šo funkciju.","Configuration":"Konfigurācija","Source folders":"Avota mapes","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Šī ir avota mape, kas tiks skenēta plašsaziņas līdzekļiem. Mapei ir jāievada bez aizmugures slīpsvītras. Piemēram:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Avota mapes ceļa lodziņš ir paplašināms (nospiediet Enter, lai izveidotu jaunu līniju). Ja vēlaties norādīt vairākas avota mapes, pārliecinieties, ka katra avota mapes ceļš atrodas savā rindā, piemēram:","Video health check":"Video veselības pārbaude","Batch conversion and Folder watching":"Partijas konversija un mape skatīšanās","Remote Monitoring (Beta)":"Tālvadības uzraudzība (Beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"Sistēma","Help":"Palīdzība","Temporary conversion folders":"Pagaidu konvertēšanas mapes","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Ja \"Pagaidu konvertēšanas mape?\" tiek pārbaudīts, tad HandBrake konvertēs failus šajā mapē. Kad reklāmguvums ir pabeigts, fails tiks pārvietots uz jūsu galamērķa mapi. Jums būs jānorāda tik daudz pagaidu reklāmguvumu mapju kā avota mapes. Jūsu pirmā avota mape tiks pārveidota par pirmo pagaidu konvertēšanas mapi, otro avota mapi otrajā pagaidu konvertēšanas mapē un tā tālāk. Pārliecinieties, ka katrs pagaidu konvertēšanas mapes ceļš atrodas savā rindā.","Destination folders":"Galamērķa mapes","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Norādiet mērķa mapes ceļus. Atkal, jums būs jānorāda tik daudz mērķa mapju kā avota mapes. Faili no pirmās avota mapes nonāks jūsu pirmajā galamērķa mapē, otrā avota mapes failos otrajā galamērķa mapē utt.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Pirmā avota mape ---------> Pirmā pagaidu konvertēšanas mape ---------> Pirmā galamērķa mape","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Otra avota mape ---------> Otra pagaidu konvertēšanas mape ---------> Otrais galamērķa mape","etc":"utt","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast nedarbosies pareizi, ja mērķa mapi iestatīsiet tāpat kā avota mapē vai tajā.","Standard preset:":"Standarta iestatījums:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Atlasiet iepriekš iestatīto HandBrake iestatījumu, ar kuru vēlaties konvertēt failus. Ja ir izvēlēts \"Standarta iestatījums\", tad visi atlasītajās mapēs esošie faili tiks konvertēti, izmantojot norādīto HandBrake iestatījumu. Vairāk par HandBrake presets varat atrast šeit:","Custom preset:":"Pielāgots iestatījums:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Ja \"Pielāgots iestatījums\", tad jums jāievada savs pielāgotais iestatījums. HBBatchBeast aptver HandBrakeCLI ievadi \"HandBrakeCLI -i avots -o galamērķis\", lai ievadītu konversijas parametrus. Piemēram:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Ja izmantojat FFmpeg, ir nepieciešams atdalīt ievades un izejas parametrus ar komatu. Piemēram:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Varat arī saiti uz pielāgotu iestatījumu, kas ir eksportēts no oficiālās HandBrake GUI lietojumprogrammas, piemēram:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Ja jums ir problēmas ar pielāgotiem iestatījumiem, tas var būt saistīts ar zināmu kļūdu ar HandBrakeCLI (tiks fiksēts nākamajā HandBrakeCLI versijā). Lūdzu, skatiet šo, lai iegūtu pagaidu risinājumu:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Katram pielāgotajam iestatījumam ir jābūt savai līnijai, un, tāpat kā mapēm, ir jābūt pēc iespējas vairākiem sākotnējiem iestatījumiem kā avota mapēm.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Pirmā avota mape ---------> Pirmā pagaidu konvertēšanas mape ---------> Pirmā galamērķa mape @ Pielāgots iestatījums 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Otrā avota mape ---------> Otrā pagaidu konvertēšanas mape ---------> Otrā galamērķa mape @ Pielāgots iestatījums 2","See the following image for guidance:":"Norādiet šādu attēlu:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Ja izmantojat grafikas kartes kodējumu (piemēram, NVENC), VRAM ierobežojumu dēļ jums var būt nepieciešams samazināt HandBrake gadījumu skaitu (mēģināt 2 vai mazāk).","Select standard preset:":"Izvēlieties standarta iestatījumu:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Atklāts NVENC, lūdzu, pārliecinieties, vai ir samazināts HandBrakeCLI gadījumu skaits līdz 2 vai zemāk (vairumam grafikas karšu), vai arī var rasties kļūdas nepietiekamas VRAM dēļ. Šo iestatījumu var atrast cilnē Sistēma.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Importētais iepriekš iestatītais iestatījums.Ja jums rodas problēmas ar importētiem pielāgotiem iestatījumiem, tas var būt saistīts ar zināmu kļūdu ar HandBrakeCLI (tiks fiksēts nākamajā HandBrakeCLI versijā). Pagaidu risinājums ir noņemt \"\" PictureRotate \":\" 0: 0 \"\" no .json faila. Vairāk informācijas šeit:","Container:":"Konteiners:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Norādiet konteineru, kurā vēlaties, lai izejas failam būtu tāds, kā “.mp4”. Vairāk par konteineriem var uzzināt vietnē:","Enable periodic scanning:":"Iespējot periodisku skenēšanu:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast var kontrolēt jūsu avota mapes un palaist skenēšanu jauniem failiem noteiktā intervālā. Laika intervāls ir sekundēs, un noklusējuma vērtība ir 300 sekundes (5 minūtes). Ja šī opcija ir atlasīta, tad, nospiežot \"Skenēt un konvertēt\", programma pārvērš visus jaunos failus un tad sāksies atpakaļskaitīšanas taimeris. Tas paliks bezgalīgi, līdz apstāsies. Skenēšanas intervāls ir sadaļā Papildu iestatījumi.","Enable daily scanning:":"Iespējot ikdienas skenēšanu:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Periodiskas skenēšanas vietā varat izvēlēties, lai skenēšana tiktu veikta reizi dienā. Skenēšanas laiks tiek ievadīts papildu iestatījumu sadaļā hh: mm formātā, piemēram, '18: 30 '. Kad ir izvēlēts \"Skenēt un konvertēt\", programma gaidīs līdz norādītajam laikam, līdz tiks palaists skenēšanas un konvertēšanas process. Atkal, tas būs cilpas bezgalīgi, līdz apstājas.","Show/hide advanced:":"Rādīt / slēpt uzlabotas:","Scan interval (minimum 5 seconds):":"Skenēšanas intervāls (vismaz 5 sekundes):","Daily run time (hh:mm):":"Dienas darba laiks (hh: mm):","Output filename suffix:":"Izejas faila nosaukuma sufikss:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Tas nav obligāts. Jūs varat norādīt sufiksu, lai pievienotu faila nosaukuma beigām, piemēram, '_1080p' vai '_testconversion' utt.","If 'standard preset' is selected then all output files will have the same suffix.":"Ja ir izvēlēts “standarta iestatījums”, tad visiem izejas failiem būs tāds pats sufikss.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Ja ir izvēlēts 'custom preset', tad varat norādīt vienu sufiksu katrai avota mapei / pielāgotam iestatījumam. Pārliecinieties, ka katrs sufikss ir savā rindā. Piemēram, ja jums ir 2 avota mapes un izmantojat 'pielāgotu sākotnējo iestatījumu', jūs to varat ievietot faila nosaukuma sufiksa lodziņā:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Failu nosaukumi pirmajā avota mapē būs pievienoti “_720p”. Otrajā avota mapē esošajiem failiem pievienos “_1080p” izejas faila nosaukumam utt.","Include these file types:":"Iekļaut šos failu tipus:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"Ievadiet meklējamos failu tipus. Katram tipam jābūt atdalītam ar komatu. Noklusējuma ieraksts ir:","Exclude files smaller than (MB):":"Izslēdziet failus, kas ir mazāki par (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Norādiet, vai no reklāmguvumiem izslēgt failus, kas ir mazāki par noteiktu lielumu (megabaitos)","Exclude files larger than (MB):":"Izslēdziet failus, kas lielāki par (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Norādiet, vai no reklāmguvumiem izslēgt failus, kas lielāki par noteiktu izmēru (megabaitos)","Exclude filenames which include any of these words:":"Izslēdziet failu nosaukumus, kuros ir kāds no šiem vārdiem:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Skenējot failus, ievadiet filtrējamos atslēgvārdus. Piemēram, ja tiek ievadīts \"720p\", tad nekādi faili ar nosaukumu \"720p\" netiks konvertēti. Atkal, atslēgvārdiem jābūt atdalītiem ar komatu. Piemēram, filtra lodziņā ievadiet šādu tekstu:","Include files with any ":"Iekļaujiet failus ar jebkuru"," or all ":"vai visi"," of these":"no šiem","properties:":"rekvizīti:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Šeit jūs varat ievadīt video un audio rekvizītus, kuriem failiem jābūt konvertētiem (informācija tiek iegūta, izmantojot FFprobe). Īpašībām jābūt atdalītām ar komatu. Izmantojiet multivides informācijas skatītāja rīku, lai palīdzētu noteikt, kuras īpašības vēlaties iekļaut. Pārliecinieties, ka pēc pēdējā īpašuma ir ievietots komats. Piemēram, lai konvertētu tikai failus, kas ir kodēti, izmantojot h264 un aac stereo audio:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Ir vērts atzīmēt, ka šī īpašuma pārbaude tiek veikta pēc konversijas procesa sākšanas (lai ietaupītu laiku, veidojot rindu), tāpēc, lai gan konversijas rindā var parādīties faili, tie tiks izlaisti / iekļauti, ja tiks izpildīti pareizi nosacījumi.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Ja FFprobe spēj iegūt īpašības, tad rindas skatā slejā \"FFprobe\" parādīsies \"OK\".","Exclude files with any ":"Izslēdziet failus ar jebkuru"," of these ":"no šiem","The opposite of 'Include files with any or all of these properties'":"Pretēji \"Iekļaut failus ar jebkuru vai visām šīm īpašībām\"","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Šis ir neliels rīks, lai analizētu failu rekvizītus, lai palīdzētu jums noteikt, kuras rekvizītus vēlaties iekļaut / izslēgt iepriekš minētajās opcijās. Tā izmanto FFprobe, lai atgrieztu informāciju. Velciet un nometiet failus pelēkā lodziņā, lai tos analizētu. Piemēram, izmetot pārbaudes failā, var atgriezties šādi:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Ja jūs vēlaties izslēgt tādus failus kā konvertēšanu, tad jūs varat ievietot vairākus faila rekvizītus lodziņā \"Izslēgt failus ar jebkuru vai visām šīm īpašībām\" un atzīmējiet izvēles rūtiņu blakus \"viss\", nevis \"jebkurš\", tāpat kā:","Copy excluded files to destination:":"Kopēt izslēgtos failus uz galamērķi:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Ja izvēlaties šo opciju, faili, kas ir izslēgti no konversijas, tiks kopēti tieši uz mērķa mapi. Tas attiecas uz šādiem filtriem:","Exclude filenames which include any of these words":"Izslēdziet failu nosaukumus, kuros ir kāds no šiem vārdiem","Include files with any or all of these properties":"Iekļaujiet failus ar jebkuru vai visām šīm īpašībām","Exclude files with any or all of these properties":"Izslēdziet failus ar kādu no šīm īpašībām","Exclude files smaller than (MB)":"Neiekļaut failus, kas ir mazāki par (MB)","Exclude files larger than (MB)":"Neiekļaut failus, kas ir lielāki par (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Ņemiet vērā, ka tas attiecas arī uz izslēgtajiem failiem, jo tie neatbilst iepriekš minētajiem īpašuma nosacījumiem, kas ietverti, tāpēc nejauši kopējiet visu bibliotēku, kad mēģināt konvertēt tikai dažus failus.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Kopēšanas funkcija neattiecas uz šādiem filtriem (ti, filtriem neiekļautajiem failiem)","Include these file types":"Iekļaujiet šos failu tipus","Delete source files after conversion:":"Izdzēsiet avota failus pēc konvertēšanas:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Ja tas ir izvēlēts, tad, ja konversijas mēģinājums ir veiksmīgs, avota fails tiks izdzēsts. Šis process tiek veikts pašā beigās, pēc visu failu konvertēšanas. Tas nozīmē, ka jūs varat pārvērst tos pašus avota failus, izmantojot vairākus iestatījumus, visi vienā reizē. Pēc tam avota faili tiks izdzēsti.","Replace original file if converted file is smaller?(Compress attempt)":"Nomainiet sākotnējo failu, ja konvertētais fails ir mazāks? (Saspiest mēģinājumu)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Atzīmējiet šo izvēles rūtiņu, ja vēlaties, lai HBBatchBeast automātiski aizstātu sākotnējo avota failu, ja jaunais fails ir mazāks. Ja jaunais fails nav mazāks, tas tiks atstāts mērķa mapē.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Pārliecinieties, vai jūsu mērķa mape nav tāda pati kā / vai iekšpusē, jūsu avota mapē vai tā nedarbosies pareizi.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Kad HBBatchBeast ir mēģinājis saspiest konkrētu failu, tas pievienos šo faila ceļu uz kešatmiņu, lai tas turpmāk netiktu mēģināts. Varat apskatīt / rediģēt / notīrīt kešatmiņu, izmantojot dzeltenās pogas.","Replace original file always?":"Vai vienmēr nomainīt oriģinālo failu?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Sākotnējais fails tiks aizstāts neatkarīgi no tā, vai jaunais fails ir lielāks vai mazāks.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Pārliecinieties, vai jūsu mērķa mape nav tāda pati kā / vai iekšpusē, jūsu avota mapē vai tā nedarbosies pareizi.","Copy subtitle (srt) files to destination?":"Kopēt subtitru (srt) failus uz galamērķi?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Subtitru \".srt\" faili tiks automātiski kopēti uz mērķa mapi.","Automatically create temporary/destination folders if they don't exist?":"Automātiski izveidojiet pagaidu / mērķa mapes, ja tās nav?","Custom bat path to run after each conversion (leave blank if not using):":"Pielāgots sikspārņu ceļš, lai palaistu pēc katras konversijas (atstājiet tukšu, ja neizmantojat):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Ievadiet ceļu uz pielāgotu sērijveida failu, kuru vēlaties izpildīt pēc katras konversijas. Piemēram:","Batch files with timeout statements won't work. More info here:":"Sērijveida faili ar taimauta paziņojumiem nedarbosies. Vairāk informācijas šeit:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Atstājiet lodziņu pilnīgi tukšu, ja nevēlaties izmantot šo opciju (pārliecinieties, ka lodziņā nav slēptu rakstzīmju)","Run processes at low priority?":"Palaist procesus ar zemu prioritāti?","All conversion processes will be run at low priority, reducing processor usage.":"Visi reklāmguvumu procesi tiks izpildīti ar zemu prioritāti, samazinot procesora izmantošanu.","Remove apostrophes from filenames:":"Noņemt apostrofus no faila nosaukumiem:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Reklāmguvumi / veselības pārbaudes skenēšana var neizdoties, ja faila nosaukumos ir apostrofi. Pārbaudiet, vai automātiski noņemt apostrofus no failu nosaukumiem."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Šī funkcija var skenēt bojātus video failus, izmantojot funkciju HandBrake '--scan', lai gan tas ne vienmēr ir precīzs. Tā izmanto arī FFprobe, lai nodrošinātu otru atskaites punktu. Ja gan FFprobe, gan HandBrake neizdodas, tad pastāv liela iespēja, ka fails ir bojāts.","Move corrupt files into the following folder:":"Pārvietot bojātus failus šādā mapē:"," If checked, then any files which give errors will be moved into the specified folder.":"Ja tiek pārbaudīts, tad visi faili, kas piešķir kļūdas, tiks pārvietoti uz norādīto mapi.","Corrupt file folder:":"Korumpēta faila mape:","Run thorough file health check:":"Veikt rūpīgu faila veselības pārbaudi:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Ja tiek pārbaudīts, tad daudz lēnāka, rūpīgāka video veselības pārbaude tiks veikta, izmantojot FFmpeg, nevis HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Pamatojoties uz Desani 'ScanMedia.ps1', kas atrodas vietnē:","Attempt to repair files after thorough check:":"Mēģinājumi labot failus pēc rūpīgas pārbaudes:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Ja tiek pārbaudīts, HBBatchBeast mēģinās labot failus, izmantojot FFmpeg. Jauns fails ar sufiksu '_repaired' tiks izveidots tajā pašā mapē kā avota fails.","'CRF' value to use when attempting to repair files:":"\"CRF\" vērtība, ko izmanto, mēģinot labot failus:","The default 'CRF' value is 23. Please see the following for more information:":"Noklusējuma “CRF” vērtība ir 23. Lūdzu, skatiet tālāk sniegto informāciju, lai iegūtu plašāku informāciju:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"CRF skalas diapazons ir 0–51, kur 0 ir bezzudumu, 23 ir noklusējuma, un 51 ir sliktākā kvalitāte. Zemāka vērtība parasti noved pie augstākas kvalitātes, un subjektīvi saprātīgs diapazons ir 17–28. Uzskata, ka 17 vai 18 ir vizuāli bezzudumu vai gandrīz tā; tam vajadzētu būt tādam pašam vai gandrīz tādam pašam kā ievadam, bet tas nav tehniski zaudēts.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast saglabā sarakstu ar skenētajiem faila ceļiem, kas tiek ziņoti kā nekorekti. Notīriet kešatmiņu, lai veiktu jaunu skenēšanu visos failos.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Vienlaicīgi izmantojamo HandBrake / FFmpeg gadījumu skaits (ieteicams 4 vai mazāk):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Šis iestatījums attiecas gan uz \"Video veselības pārbaudi\", gan \"Scan and convert\" procesiem. Norādiet, cik daudz HandBrake vītņu jāizmanto. Maksimāli, lai gan nav ieteicams izmantot vairāk par 4. Lielāka summa var iesaldēt datoru, ja tas nav ļoti spēcīgs.","Queue size view limit?(Recommended 1000 or fewer):":"Rindas izmēra skata ierobežojums (ieteicams 1000 vai mazāk):","Automatically start \"Scan and convert\" when program opened?":"Automātiski sāk \"Skenēt un konvertēt\", kad programma ir atvērta?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Aizpildiet e-pasta datus, lai saņemtu e-pasta paziņojumus, ja veselības pārbaudes vai konversijas / mapes skatīšanās laikā radās kļūda. Nedarbosies ar kontiem, kuriem nepieciešama 2FA. Jums ir jāiespējo piekļuve mazāk drošām lietotnēm Gmail kontos.","Email address:":"Epasta adrese:","For example:":"Piemēram:","Email password(not saved):":"E-pasta parole (nav saglabāta):","SMTP server:":"SMTP serveris:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"Šī funkcija ļauj pārraudzīt konversijas / veselības pārbaudes statusu, izmantojot jebkuru tīmekļa pārlūkprogrammu. Noderīgi, ja darbojas serveri utt.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Ja tas ir iespējots, HBBatchBeast.io tiks nosūtīti šādi anonīmi dati:","API key":"API atslēga","Current status ('Searching', 'Running', 'Finished' etc)":"Pašreizējais statuss (“Meklēšana”, “Darbība”, “Pabeigts” utt.)","Number of:":"Skaits:","Remaining items":"Atlikušie vienumi","Successful items":"Veiksmīgi elementi","Errored items":"Kļūdaini vienumi","Cancelled items":"Atceltie vienumi","Worker percentages":"Darbinieku procenti","Last completed item time":"Pēdējais pabeigtais vienuma laiks","Enable remote monitoring?:":"Iespējot tālvadību ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Pamata salīdzinošās novērtēšanas lietderība, kas galvenokārt veidota, lai redzētu, kā 16 + kodols procesori veic vairākus HandBrake gadījumus, lai gan to var palaist jebkura veida procesorā.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Tas lejupielādēs h265 4k parauga failu (2,5MB) un veiks salīdzinošo rādītāju, izmantojot 4 HandBrake gadījumus ar iepriekš iestatītu \"ļoti ātru 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Rezultātus var augšupielādēt uz hbbatchbeast.io, ja izvēlaties.","Queue":"Rinda","Output this session":"Izvadiet šo sesiju","Media info viewer tool":"Multivides informācijas skatītāja rīks","View compress attempt cache":"Skatīt kompresijas mēģinājumu kešatmiņu","Clear compress attempt cache":"Notīrīt saspiešanas mēģinājumu kešatmiņu","Save config":"Saglabāt konfigurāciju","Scan only":"Tikai skenēšana","Scan and convert":"Skenēt un konvertēt","View scan/conversion summary log":"Skatīt skenēšanas / konversijas kopsavilkuma žurnālu","View individual file check/conversion log":"Skatiet atsevišķu failu pārbaudes / konvertēšanas žurnālu","View worker console output":"Skatīt darbinieku konsoles izeju","Health check":"Veselības pārbaude","Clear healthy file cache":"Notīrīt veselīgu failu kešatmiņu","View error log":"Skatīt kļūdu žurnālu","Email test":"E-pasta pārbaude","View master log":"Skatīt galveno žurnālu","Wiki help":"Wiki palīdzība","An application by HaveAGitGat":"HaveAGitGat iesniegums","New":"Jauns","Launch":"Uzsākt","Benchmark":"Salīdzinošais rādītājs","See results":"Skatīt rezultātus","Pause queue":"Pārtraukt rindu","Continue queue":"Turpināt rindu","Stop queue":"Apturēt rindu","Convert selected files":"Konvertējiet atlasītos failus","Toggle queue view":"Pārslēgt rindas skatu","Deselect all":"Atsijāt visu","Invert all":"Apgrieziet visu","Select all":"Izvēlēties visus","Toggle output view":"Pārslēgt izejas skatu"}