{
    "The number of custom presets does not match the number of source folders!": "Бројот на претходни поставувања не се совпаѓа со бројот на изворни папки!",
    "source folders have been detected.": "е откриен папки.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "се откриени сопствени претходно поставени линии. Ве молиме двојно проверете за невидливи прекини на линијата. Треба да има една патека на папка или претходно поставена по линија. Бидете сигурни дека не случајно сте создале празна линија.",
    "The number of filename suffixes does not match the number of source folders! ": "Бројот на суфиксот на името на датотеката не се совпаѓа со бројот на изворни папки!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "Наведени се линии на суфикс на името на датотеката. Ве молиме двојно проверете за невидливи прекини на линијата. Треба да има една патека на папка или суфикс на име на датотека по линија. Бидете сигурни дека не случајно сте создале празна линија.",
    "The number of source folders does not match the number of destination folders!": "Бројот на изворни папки не се совпаѓа со бројот на папки за одредиште!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "папки за дестинација биле откриени. Ве молиме двојно проверете за невидливи прекини на линијата. Треба да има една патека на папка по линија. Бидете сигурни дека не случајно сте создале празна линија.",
    "The number of source folders does not match the number of temporary conversion folders!": "Бројот на изворни папки не се совпаѓа со бројот на папки за привремена конверзија!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "папки за привремена конверзија се откриени. Ве молиме двојно проверете за невидливи прекини на линијата. Треба да има една патека на папка по линија. Бидете сигурни дека не случајно сте создале празна линија.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Внесете валиден контејнер како што е .mp4. Осигурајте се да го вклучите '.'",
    "Corrupt file folder": "Корумпирана датотека",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "не постои! Ве молиме проверете дали нема празни места или скриени знаци пред / по патеката",
    "Source folder": "Изворна папка",
    "Temporary conversion folder": "Папка за привремена конверзија",
    "appears to be the same as or is within source folder": "изгледа дека е ист како или е во изворната папка",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "што ќе спречи HBBatchBeast да функционира правилно. Променете ја папката за привремена конверзија во папка надвор од изворната папка. Ако сакате да ја користите функцијата 'Заменете оригинални датотеки', ве молиме изберете одредишна папка што не е иста како или во рамките на изворната папка, а потоа проверете го полето за замена 'Заменете оригинални датотеки секогаш' во поглавјето за напредни поставки . Отстранете го полето за проверка за привремена папка 'Привремена конверзија' бидејќи тоа нема да биде корисно во овој случај. Датотеките ќе бидат претворени во дестинационата папка и потоа се враќаат назад во изворната папка.",
    "Destination folder": "Целна папка",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "што ќе спречи HBBatchBeast да функционира правилно. Променете ја одредишната папка во папка надвор од изворната папка. Ако сакате да ја користите функцијата 'Заменете оригинални датотеки', ве молиме изберете одредишна папка што не е иста како или во рамките на изворната папка, а потоа проверете го полето за замена 'Заменете оригинални датотеки секогаш' во поглавјето за напредни поставки . Отстранете го полето за проверка за привремена папка 'Привремена конверзија' бидејќи тоа нема да биде корисно во овој случај. Датотеките ќе бидат претворени во дестинационата папка и потоа се враќаат назад во изворната папка.",
    "Error creating temporary conversion folder": "Грешка при создавање на привремена папка за конверзија",
    "Error creating destination folder": "Грешка при создавање на дестинација",
    "Please select to use HandBrake or FFmpeg!": "Изберете да користите HandBrake или FFmpeg!",
    "Please select a standard preset or input a custom one!": "Ве молиме изберете стандардна дефиниција или внесете сопствен избор!",
    "Please select a scan interval of 5 seconds or greater!": "Ве молиме изберете интервал на скенирање од 5 секунди или повеќе!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Ве молиме бидете сигурни дека бројот на истовремени HandBrake / FFmpeg инстанци за користење е еден или поголем!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Невалиден API клуч! Ве молиме кликнете 'Ново' на табот за далечинско следење за да генерирате нов клуч.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Ве молиме внесете дневно скенирање во 24-часовен формат: hh: mm (на пример 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "ИЗВЕШТАИТЕ НА ИСТОРИТЕТЕ ЌЕ СЕ БРИКУВААТ ПО ПРЕВЕДУВАЊЕ! Ве молиме тестирајте пред правилна употреба!",
    "Benchmark failed!": "Репер не успеа!",
    "Log does not exist!": "Логирањето не постои!",
    "Folder does not exist!": "Папката не постои!",
    "Error sending email! Please check your settings.": "Грешка при испраќање е-пошта! Проверете ги вашите поставки.",
    "Test email sent!": "Тест е-пошта е испратен!",
    "All worker processes have been stopped.": "Сите работнички процеси се прекинати.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Редицата ќе биде паузирана откако ќе се завршат тековните предмети. Дали сте сигурни дека сакате да ја паузирате задачата?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Почна пауза на чекање. Копчето \"Continue\" ќе се појави откако сите работници ќе паузираат.",
    "Healthy file cache cleared!": "Се чисти здравиот кеш на фајлови!",
    "Cache cleared!": "Кешот е исчистен!",
    "Cancel item": "Откажи ставка",
    "Please check the above checkbox to use this feature.": "Проверете го горното квадче за да ја користите оваа функција.",
    "Configuration": "Конфигурација",
    "Source folders": "Изворни папки",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Ова е изворната папка која ќе се скенира за медиумите. Папката треба да се внесе без коса црта. На пример:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Кутијата за изворната папка може да се прошири (притиснете Enter за да креирате нова линија). Ако сакате да наведете повеќе папки со извори, проверете дали патеката на изворната папка е на своја линија, како што се:",
    "Video health check": "Видео здравствена проверка",
    "Batch conversion and Folder watching": "Серија конверзија и Папка гледа",
    "Remote Monitoring (Beta)": "Далечински мониторинг (бета верзија)",
    "Benchmark (Beta)": "Репер (бета)",
    "System": "Систем",
    "Help": "Помош",
    "Temporary conversion folders": "Папки за привремена конверзија",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Ако \"Папка за привремена конверзија?\" е проверено, тогаш HandBrake ќе ги конвертира датотеките во таа папка. Откако ќе заврши конверзијата, датотеката ќе се премести во вашата \"Целна папка\". Ќе треба да наведете како многу папки за привремена конверзија како изворни папки. Вашата прва изворна папка ќе биде претворена во вашата прва папка за привремена конверзија, вашата втора изворна папка во вашата втора папка за привремена конверзија и така натаму. Осигурете се дека патеката на секоја привремена конверзија е на своја линија.",
    "Destination folders": "Целни папки",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Наведете патеки на целни папки. Повторно, ќе треба да наведете како многу папки за одредиште како изворни папки. Датотеките од вашата прва изворна папка ќе завршат во вашата прва дестинациска папка, вашите втора датотека со изворни папки во вашата втора дестинациска папка и така натаму.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Прва папка за извор ---------> Прва папка за привремена конверзија ---------> Прва дестинација",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Втора изворна папка ---------> Втора привремена папка за конверзија ---------> Втора целна папка",
    "etc": "итн",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast нема да работи правилно ако ја поставите папката за дестинација исто како и во изворната папка.",
    "Standard preset:": "Стандардна дефиниција:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Одберете ја дефиницијата за HandBrake со која сакате да ги конвертирате вашите датотеки. Ако е избрано \"Default preset\", сите датотеки во избраните папки ќе се конвертираат со користење на дефинираната дефиниција на HandBrake. Тука можете да најдете повеќе за предефинирањата на HandBrake:",
    "Custom preset:": "Прилагодена дефиниција:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Ако \"Custom preset\" тогаш треба да внесете сопствена сопствена дефиниција. HBBatchBeast го покрива \"HandBrakeCLI -i source-o дестинација\" дел од HandBrakeCLI влезот, така што треба да ги внесете параметрите на конверзија. На пример:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Ако користите FFmpeg, треба да ги одделите влезни и излезни параметри со запирка. Како:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Можете исто така да се поврзете со сопствена дефиниција која е извезена од официјалната апликација за HandBrake GUI на пример:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Ако имате проблеми со прилагодените поставувања, тоа може да се должи на позната бубачка со HandBrakeCLI (ќе биде поставена во следната порака за HandBrakeCLI). Ве молиме погледнете го ова за привремено решение:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Секоја прилагодена дефиниција треба да биде на своја линија и, слично на папките, треба да има што повеќе претходно поставени папки како изворни папки.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Прва изворна папка ---------> Прва папка за привремена конверзија ---------> Прва целна папка @ Прилагодена дефиниција 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Втора изворна папка ---------> Втора папка за привремена конверзија ---------> Втора целна папка @ Прилагодена дефиниција 2",
    "See the following image for guidance:": "Погледнете ја следнава слика за насоки:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Ако користите кодирање на графички картички (како што е NVENC), можеби ќе треба да го намалите бројот на инстанци HandBrake (обидете се со 2 или помалку) поради VRAM ограничувањата.",
    "Select standard preset:": "Изберете стандардна дефиниција:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC е откриен, ве молиме осигурајте се дека го намалите бројот на HandBrakeCLI инстанци до 2 или подолу (за повеќето графички картички) или може да наидете на грешки поради недоволен VRAM. Ова поставување може да се најде во табулаторот \"Систем\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Увезената дефиниција е откриена.Ако имате проблем со увезените сопствени поставки, може да се должи на позната бубачка со HandBrakeCLI (ќе биде поставена во следната порака за HandBrakeCLI). Привремено решение е да се отстрани \"PictureRotate\": \"0: 0\" од датотеката .json. Повеќе информации тука:",
    "Container:": "Контејнер:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Наведете го контејнерот што сакате да има излезната датотека како \".mp4\". Можете да дознаете повеќе за контејнери на:",
    "Enable periodic scanning:": "Овозможи периодично скенирање:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast може да ги надгледува папките на изворите и да изврши скенирање за нови датотеки во одреден интервал. Интервалното време е во секунди, а стандардно е 300 секунди (5 минути). Ако е избрана оваа опција, тогаш кога ќе притиснете \"Скенирај и конвертирај\", програмата ќе ги претвори сите нови датотеки и потоа ќе започне тајмерот за одбројување. Ова ќе се одвива бесконечно додека не запре. Интервалот на скенирање е во делот за напредни поставки.",
    "Enable daily scanning:": "Овозможете дневно скенирање:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Наместо периодично скенирање, можете да одберете за скенирање да се извршува еднаш дневно. Времето за скенирање е внесено во делот за напредни поставки во формат hh: mm како што е '18: 30 '. Откако ќе се избере \"Скенирај и конвертирај\", програмата ќе почека до одреденото време додека не изврши процес на скенирање и конверзија. Повторно, ова ќе се одвива бесконечно се додека не запре.",
    "Show/hide advanced:": "Покажи / скриј напредни:",
    "Scan interval (minimum 5 seconds):": "Интервал на скенирање (минимум 5 секунди):",
    "Daily run time (hh:mm):": "Дневно време за работа (hh: mm):",
    "Output filename suffix:": "Суфикс на излезното име на датотеката:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Ова е задолжително. Можете да наведете суфикс за додавање до крајот на вашето име на датотека како \"_1080p\" или \"_testconversion\" итн.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Ако е избрано \"стандардна дефиниција\" тогаш сите излезни датотеки ќе имаат ист суфикс.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Ако е избрано \"custom preset\" тогаш можете да наведете еден суфикс по изворна папка / прилагодена дефиниција. Бидете сигурни дека секој суфикс е на своја линија. На пример, ако имате 2 изворни папки и користите \"custom preset\", можете да го ставите ова во полето за суфикс на датотеката:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Датотеките во првата изворна папка ќе имаат \"_720p\" додадени на излезното име на датотека. Датотеките во втората изворна папка ќе имаат \"_1080p\" додадени на излезната датотека итн.",
    "Include these file types:": "Вклучете ги овие типови на датотеки:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Внесете ги типовите на датотеки за скенирање. Секој тип треба да биде одделен со запирка. Стандардниот запис е:",
    "Exclude files smaller than (MB):": "Исклучи датотеки помали од (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Наведете дали да ги исклучите датотеките помали од одредена големина од конверзија (во мегабајти)",
    "Exclude files larger than (MB):": "Исклучи ги датотеките поголеми од (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Наведете дали да ги исклучите датотеките поголеми од одредена големина од конверзија (во мегабајти)",
    "Exclude filenames which include any of these words:": "Исклучи ги имињата на датотеките кои вклучуваат било кој од овие зборови:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Внесете клучни зборови за филтрирање при скенирање на датотеки. На пример, ако се внесе \"720p\", тогаш сите датотеки со \"720p\" во насловот нема да се конвертираат. Повторно, клучни зборови треба да се одделат со запирка. На пример, внесете го следново во полето за филтрирање:",
    "Include files with any ": "Вклучи ги датотеките со било кој",
    " or all ": "или сите",
    " of these": "од нив",
    "properties:": "својства:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Овде можете да внесувате видео и аудио својства што датотеките мора да ги имаат за да бидат конвертирани (инфо извлечени со користење FFprobe). Својствата мора да бидат одделени со запирка. Користете ја алатката за преглед на медиумските информации за да помогнете да одредите кои својства сакате да ги вклучите. Осигурајте се да ставите запирка после последниот имот. На пример, само за конвертирање на датотеки кои се кодирани со користење на h264 и aac стерео аудио:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Вреди да се напомене дека оваа проверка на имотот е направена откако ќе започне процесот на конверзија (за да заштедите време при изградбата на редот), па затоа иако датотеките може да се појават во редот на конверзија, тие ќе бидат прескокнати / вклучени ако се исполнети точните услови.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Ако FFprobe е во можност да извлече својства, тогаш \"OK\" ќе се појави во колоната \"FFprobe\" во прегледот на редот.",
    "Exclude files with any ": "Исклучете ги датотеките со било кој",
    " of these ": "од нив",
    "The opposite of 'Include files with any or all of these properties'": "Спротивно на \"Вклучи датотеки со било кое или сите овие својства\"",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Ова е мала алатка за анализа на својствата на датотеките со цел да ви помогне да одредите кои својства сакате да ги вклучите / исклучите во горните опции. Таа користи FFprobe за враќање на информации. Повлечете и пуштете ги датотеките во сивата кутија за да ги анализирате. На пример, намалувањето во тест-датотеката може да го врати следново:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Ако барате да ги исклучите датотеките како ова од конвертирање, тогаш можете да поставите неколку својства на датотеки во полето \"Исклучи датотеки со било кое или сите овие својства\" и да го означите полето за избор покрај \"сите\" наместо \"било\", како што е:",
    "Copy excluded files to destination:": "Копирај ги исклучените датотеки до дестинацијата:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Ако ја изберете оваа опција, датотеките кои се исклучени од конверзија ќе бидат копирани директно во одредишната папка. Ова се однесува на следниве филтри:",
    "Exclude filenames which include any of these words": "Исклучи ги имињата на датотеките кои вклучуваат било кој од овие зборови",
    "Include files with any or all of these properties": "Вклучете ги датотеките со сите или сите овие својства",
    "Exclude files with any or all of these properties": "Исклучете ги датотеките со сите или сите овие својства",
    "Exclude files smaller than (MB)": "Исклучи датотеки помали од (MB)",
    "Exclude files larger than (MB)": "Исклучи ги датотеките поголеми од (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Забележете дека ова исто така важи и за датотеките исклучени, бидејќи тие не ги исполнуваат условите за сопственост \"Вклучи\" погоре, па не случајно копирајте цела библиотека, кога само се обидувате да конвертирате неколку датотеки.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Функцијата за копирање не се однесува на следниве филтри (т.е. датотеките исклучени поради филтерот)",
    "Include these file types": "Вклучете ги овие типови на датотеки",
    "Delete source files after conversion:": "Избришете изворни датотеки по конверзијата:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Ако ова е избрано, тогаш ако обидот за конверзија е успешен, изворната датотека ќе биде избришана. Овој процес се прави на самиот крај, по конверзија на сите датотеки. Ова значи дека можете да ги конвертирате истите изворни датотеки користејќи повеќе пресети, сите во еден. Изворните датотеки потоа ќе бидат избришани потоа.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Заменете ја оригиналната датотека ако конвертираната датотека е помала? (Компресирај обид)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Изберете го ова поле за избор ако сакате HBBatchBeast автоматски да ја замени оригиналната изворна датотека ако новата датотека е помала. Ако новата датотека не е помала, тогаш таа ќе биде оставена во дестинационата папка.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Осигурајте се дека вашата дестинација папка не е ист како / или во, вашата изворна папка или нема да работи правилно.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Откако HBBatchBeast се обиде да компресира одредена датотека, таа ќе додаде датотека патека до кеш, така што во иднина нема да се обиде повторно. Можете да го видите / уредувате / исчистите кешот со жолти копчиња.",
    "Replace original file always?": "Секогаш заменувајте ја оригиналната датотека?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Оригиналната датотека ќе биде заменета независно дали новата датотека е поголема или помала.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Повторно, осигурајте се дека вашата дестинација папка не е ист како / или во, вашата изворна папка или нема да работи правилно.",
    "Copy subtitle (srt) files to destination?": "Копирање на титл (srt) датотеки до дестинација?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Датотеките со преводи '.srt' автоматски ќе бидат копирани во одредишната папка.",
    "Automatically create temporary/destination folders if they don't exist?": "Автоматски креирајте привремени / дестинациски папки ако тие не постојат?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Прилагодена патека за патека која ќе се изврши по секоја конверзија (оставете го празно доколку не го користите):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Внесете ја патеката до сопствен пакет датотека која сакате да ја извршите по секоја конверзија. На пример:",
    "Batch files with timeout statements won't work. More info here:": "Групните датотеки со изјавите за откажување нема да работат. Повеќе информации тука:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Остави кутија целосно празна ако не сакате да ја користите оваа опција (проверете дали во кутијата нема скриени знаци)",
    "Run processes at low priority?": "Стартувај процеси со низок приоритет?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Сите процеси на конверзија ќе се стартуваат со низок приоритет, намалувајќи ја употребата на процесорот.",
    "Remove apostrophes from filenames:": "Отстрани апострофи од имињата на датотеките:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Скенирањето за конверзии / здравствени проверки може да не успее ако имињата на датотеките имаат апострофи. Проверете го ова автоматски да ги отстраните апострофовите од имињата на датотеките.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Оваа функција може да скенира за корумпирани видео датотеки користејќи функција \"--scan\" на HandBrake, иако ова не е секогаш точна. Исто така го користи FFprobe за да обезбеди втора референтна точка. Ако и двете FFprobe и HandBrake пропаднат тогаш постои голема можност дека датотеката е корумпирана.",
    "Move corrupt files into the following folder:": "Премести корумпирани датотеки во следната папка:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Ако е означено, тогаш сите датотеки што даваат грешки ќе бидат преместени во наведената папка.",
    "Corrupt file folder:": "Корумпирана папка со датотеки:",
    "Run thorough file health check:": "Извршете темелна здравствена проверка на датотеката:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Ако се провери, тогаш многу побавна, поцелосна видео-здравствена проверка ќе се изврши со користење на FFmpeg наместо HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Врз основа на Desani's \"ScanMedia.ps1\" се најде на:",
    "Attempt to repair files after thorough check:": "Обид да ги поправите датотеките по темелна проверка:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Ако е означено, HBBatchBeast ќе се обиде да ги поправи датотеките користејќи FFmpeg. Нова датотека со наставка \"_repaired\" ќе се креира во истата папка како изворната датотека.",
    "'CRF' value to use when attempting to repair files:": "Вредност 'CRF' за употреба при обид за поправка на датотеки:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Стандардната 'CRF' вредност е 23. Ве молиме погледнете го следново за повеќе информации:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Опсегот на скалата на CRF е 0-51, каде што 0 е загуба, 23 е стандардно, а 51 е најлош можен квалитет. Пониската вредност генерално води до повисок квалитет, а субјективно нормален опсег е 17-28. Размислете за 17 или 18 да биде визуелно без загуба или речиси така; тоа треба да изгледа исто или речиси исто како и влезот, но тоа не е технички без загуба.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast зачувува листа на скенирани патеки на датотеки пријавени како некорумпирани. Исчистете го кешот за да извршите ново скенирање на сите датотеки.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Број на истовремени HandBrake / FFmpeg инстанци за користење? (Препорачано 4 или помалку):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Ова поставување се однесува и на процесите за \"Video health check\" и \"Scan and convert\". Наведете колку теми од HandBrake да ги користите. Не постои максимум иако е препорачливо да не користите повеќе од 4. А поголема количина може да го замрзне вашиот компјутер, ако не е многу моќна.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Ограничување на преглед на големината на редот? (Препорачано 1000 или помалку):",
    "Automatically start \"Scan and convert\" when program opened?": "Автоматски стартувај \"Скенирај и конвертирај\" кога ќе се отвори програмата?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Пополнете ги деталите за е-пошта за да добивате известувања преку е-пошта ако се појави грешка за време на проверка на здравството или пренамена / преглед на фолдерот. Нема да работи со сметки за кои е потребна 2FA. Треба да овозможите пристап до помалку безбедни апликации на Gmail сметки.",
    "Email address:": "И-мејл адреса:",
    "For example:": "На пример:",
    "Email password(not saved):": "Лозинка за е-пошта (не е зачувана):",
    "SMTP server:": "SMTP сервер:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Оваа функција овозможува следење на статусот на пренамена / здравствена проверка со користење на кој било веб-пребарувач. Корисно кога се работи со сервери итн.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Ако е овозможено, следните анонимни податоци ќе бидат испратени до HBBatchBeast.io:",
    "API key": "API клуч",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Тековен статус (\"Пребарување\", \"Вклучување\", \"Завршено\" итн.)",
    "Number of:": "Број на:",
    "Remaining items": "Преостанати предмети",
    "Successful items": "Успешни предмети",
    "Errored items": "Произведени елементи",
    "Cancelled items": "Откажани ставки",
    "Worker percentages": "Работни проценти",
    "Last completed item time": "Последно завршено време на предметот",
    "Enable remote monitoring?:": "Овозможи далечински мониторинг ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Основна алатка за споредба е изградена главно за да се види како 16 + core процесорите вршат користење на повеќе HandBrake инстанци, иако може да се работи на било кој тип процесор.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Ова ќе преземе h265 4k примерочна датотека (2.5MB) и ќе изврши репер користејќи 4 HandBrake инстанци со претходно поставено \"Многу брзо 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Резултатите може да се подигнат на hbbatchbeast.io ако изберете.",
    "Queue": "Редица",
    "Output this session": "Излез оваа сесија",
    "Media info viewer tool": "Средство за преглед на информации за медиумите",
    "View compress attempt cache": "Погледнете кеш за обид за компресија",
    "Clear compress attempt cache": "Исчисти го кешот за обид за компресија",
    "Save config": "Зачувај конфигурација",
    "Scan only": "Само скенирај",
    "Scan and convert": "Скенирање и конвертирање",
    "View scan/conversion summary log": "Прегледај дневник за резиме на скенирање / конверзија",
    "View individual file check/conversion log": "Погледнете поединечни логови за проверка / конверзија на датотеки",
    "View worker console output": "Погледнете го работниот конзолен излез",
    "Health check": "Здравствен преглед",
    "Clear healthy file cache": "Исчистете здраво кеш на датотеки",
    "View error log": "Погледнете го логот за грешки",
    "Email test": "Тест за е-пошта",
    "View master log": "Погледнете го господарскиот лог",
    "Wiki help": "Вики-помош",
    "An application by HaveAGitGat": "Апликација од ИмагитГат",
    "New": "Ново",
    "Launch": "Лансира",
    "Benchmark": "Репер",
    "See results": "Видете резултати",
    "Pause queue": "Паузирај ја задачата",
    "Continue queue": "Продолжи ја задачата",
    "Stop queue": "Стоп за чекање",
    "Convert selected files": "Конвертирај ги избраните датотеки",
    "Toggle queue view": "Премести ја задачата за чекање",
    "Deselect all": "Деселектирајте ги сите",
    "Invert all": "Инвертирај ги сите",
    "Select all": "Селектирај се",
    "Toggle output view": "Вклучи излезниот приказ"
}