{"The number of custom presets does not match the number of source folders!":"Bilangan pratetap peribadi tidak sepadan dengan bilangan folder sumber!","source folders have been detected.":"folder sumber telah dikesan.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"baris pratetap tersuai telah dikesan. Sila semak double check line breaks. Harus ada satu laluan folder atau pratetap per baris. Pastikan anda tidak sengaja mencipta satu baris kosong.","The number of filename suffixes does not match the number of source folders! ":"Bilangan nama akhiran nama tidak sepadan dengan bilangan folder sumber!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"garisan sufik nama fail telah dikesan. Sila semak double check line breaks. Harus ada satu laluan folder atau nama akhiran nama setiap baris. Pastikan anda tidak sengaja mencipta satu baris kosong.","The number of source folders does not match the number of destination folders!":"Bilangan folder sumber tidak sepadan dengan bilangan folder destinasi!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"folder tujuan telah dikesan. Sila semak double check line breaks. Harus ada satu laluan folder per baris. Pastikan anda tidak sengaja mencipta satu baris kosong.","The number of source folders does not match the number of temporary conversion folders!":"Bilangan folder sumber tidak sepadan dengan bilangan folder penukaran sementara!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"folder penukaran sementara telah dikesan. Sila semak double check line breaks. Harus ada satu laluan folder per baris. Pastikan anda tidak sengaja mencipta satu baris kosong.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Sila masukkan bekas yang sah seperti '.mp4'. Pastikan untuk memasukkan '.'","Corrupt file folder":"Folder fail yang rosak","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"tidak wujud! Sila pastikan tiada ruang atau aksara tersembunyi sebelum / selepas laluan","Source folder":"Folder sumber","Temporary conversion folder":"Folder penukaran sementara","appears to be the same as or is within source folder":"nampaknya sama dengan atau berada dalam folder sumber","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"yang akan menghalang HBBatchBeast berfungsi dengan betul. Sila tukar folder penukaran sementara ke folder di luar folder sumber. Sekiranya anda mahu menggunakan 'Ganti ciri fail asal', sila pilih folder destinasi yang tidak sama, atau dalam folder sumber, dan kemudian semak kotak semak 'Ganti fail asal sentiasa' di bahagian tetapan lanjutan . Nyahtandai kotak semak sementara 'folder penukaran sementara' kerana tidak akan digunakan dalam kes ini. Fail akan ditukar ke dalam folder destinasi dan kemudian dipindahkan ke dalam folder sumber.","Destination folder":"Folder destinasi","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"yang akan menghalang HBBatchBeast berfungsi dengan betul. Sila tukar folder destinasi ke folder di luar folder sumber. Sekiranya anda mahu menggunakan 'Ganti ciri fail asal', sila pilih folder destinasi yang tidak sama, atau dalam folder sumber, dan kemudian semak kotak semak 'Ganti fail asal sentiasa' di bahagian tetapan lanjutan . Nyahtandai kotak semak sementara 'folder penukaran sementara' kerana tidak akan digunakan dalam kes ini. Fail akan ditukar ke dalam folder destinasi dan kemudian dipindahkan ke dalam folder sumber.","Error creating temporary conversion folder":"Ralat membuat folder penukaran sementara","Error creating destination folder":"Ralat membuat folder destinasi","Please select to use HandBrake or FFmpeg!":"Sila pilih untuk menggunakan HandBrake atau FFmpeg!","Please select a standard preset or input a custom one!":"Sila pilih pratetap standard atau input custom!","Please select a scan interval of 5 seconds or greater!":"Sila pilih selang imbasan 5 saat atau lebih!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Sila pastikan bilangan contoh HandBrake / FFmpeg serentak digunakan adalah satu atau lebih besar!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Kekunci API tidak sah! Sila klik 'Baru' pada tab pemantauan jauh untuk menghasilkan kunci baru.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Sila masukkan masa imbasan harian dalam format 24 jam: hh: mm (sebagai contoh 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"SUMBER FILES AKAN DIJALANKAN SELEPAS PERUNDINGAN! Sila uji sebelum digunakan dengan betul!","Benchmark failed!":"Penanda aras gagal!","Log does not exist!":"Log tidak wujud!","Folder does not exist!":"Folder tidak wujud!","Error sending email! Please check your settings.":"Ralat menghantar e-mel! Sila periksa tetapan anda.","Test email sent!":"E-mel ujian dihantar!","All worker processes have been stopped.":"Semua proses pekerja telah dihentikan.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Baris akan dihentikan sementara apabila item semasa selesai pemprosesan. Adakah anda pasti mahu menjeda barisan?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Jeda gilir gilir yang dimulakan.'Terus 'butang akan muncul sebaik sahaja semua pekerja telah dijeda.","Healthy file cache cleared!":"Cache fail yang bersih dibersihkan!","Cache cleared!":"Cache dibersihkan!","Cancel item":"Batalkan item","Please check the above checkbox to use this feature.":"Sila semak kotak pilihan di atas untuk menggunakan ciri ini.","Configuration":"Konfigurasi","Source folders":"Folder sumber","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Ini adalah folder sumber yang akan diimbas untuk media. Folder perlu dimasukkan dengan tiada garis miring. Sebagai contoh:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Kotak jalur folder sumber diperkembangkan (tekan enter untuk membuat barisan baru). Jika anda ingin menentukan beberapa folder sumber, pastikan setiap laluan folder sumber berada pada barisnya sendiri seperti:","Video health check":"Pemeriksaan kesihatan video","Batch conversion and Folder watching":"Penukaran batasan dan pengawasan Folder","Remote Monitoring (Beta)":"Pemantauan Jauh (Beta)","Benchmark (Beta)":"Penanda Aras (Beta)","System":"Sistem","Help":"Bantuan","Temporary conversion folders":"Folder penukaran sementara","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Jika \"Folder penukaran sementara?\" diperiksa, kemudian HandBrake akan menukar fail ke dalam folder itu. Apabila penukaran selesai, fail akan dipindahkan ke \"Folder tujuan\" anda. Anda perlu menentukan seberapa banyak folder penukaran sementara sebagai folder sumber. Folder sumber pertama anda akan ditukar menjadi folder penukaran sementara yang pertama, folder sumber kedua anda ke dalam folder penukaran sementara anda dan sebagainya. Pastikan setiap laluan folder penukaran sementara berada pada barisnya sendiri.","Destination folders":"Folder destinasi","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Tentukan laluan folder destinasi. Sekali lagi, anda perlu menentukan seberapa banyak folder tujuan sebagai folder sumber. Fail dari folder sumber pertama anda akan berakhir dalam folder destinasi pertama anda, fail folder sumber kedua dalam folder destinasi kedua dan sebagainya.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Folder sumber pertama ---------> folder penukaran sementara pertama ---------> folder destinasi pertama","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Folder sumber kedua ---------> Folder penukaran sementara kedua ---------> Folder tujuan kedua","etc":"dan lain-lain","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast tidak akan berfungsi dengan betul jika anda menetapkan folder tujuan sama seperti, atau di dalam, folder sumber.","Standard preset:":"Pratetap standard:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Pilih pratetap HandBrake yang anda ingin menukarkan fail anda. Jika \"Pratetap piawai\" dipilih, maka semua fail dalam folder yang dipilih akan ditukar menggunakan pratetap HandBrake yang ditentukan. Anda boleh mengetahui lebih lanjut mengenai pratetap HandBrake di sini:","Custom preset:":"Pratetap tersuai:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Jika \"Pratetap peribadi\" maka anda perlu memasukkan pratetap tersuai anda sendiri. HBBatchBeast merangkumi bahagian \"TanganBrakeCLI -i sumber -o destinasi\" input TanganBrakeCLI jadi anda perlu memasukkan parameter penukaran. Sebagai contoh:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Jika menggunakan FFmpeg, anda perlu memisahkan parameter input dan output dengan koma. Seperti:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Anda juga boleh memaut ke pratetap tersuai yang telah dieksport dari aplikasi GUI rasmi HandBrake contohnya:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Jika anda menghadapi masalah dengan pratetap tersuai, mungkin disebabkan oleh bug yang diketahui dengan HandBrakeCLI (akan ditetapkan dalam pelepas HandBrakeCLI seterusnya). Sila lihat ini untuk penyelesaian sementara:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Setiap pratetap peribadi perlu berada pada barisnya sendiri dan, sama seperti folder, perlu ada pratetap adat sebagai folder sumber.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Folder sumber pertama ---------> Folder penukaran sementara pertama ---------> Folder destinasi pertama @ Templat pratetap 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Folder sumber kedua ---------> Folder penukaran sementara kedua ---------> Folder destinasi kedua @ Praset tersuai 2","See the following image for guidance:":"Lihat imej berikut untuk panduan:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Jika menggunakan pengekodan kad grafik (seperti NVENC), maka anda mungkin perlu mengurangkan bilangan contoh HandBrake (cuba 2 atau kurang) disebabkan oleh batasan VRAM.","Select standard preset:":"Pilih pratetap standard:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC dikesan, sila pastikan untuk menurunkan jumlah contoh HandBrakeCLI ke 2 atau di bawah (untuk kebanyakan kad grafik) atau anda mungkin mengalami ralat kerana VRAM tidak mencukupi. Tetapan ini boleh didapati di tab \"Sistem\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Pratetap yang diimport dikesan.Jika anda menghadapi masalah dengan pratetap adat yang diimport, mungkin disebabkan oleh bug yang diketahui dengan HandBrakeCLI (akan ditetapkan dalam pelepas HandBrakeCLI seterusnya). Penyelesaian sementara adalah untuk menghapus '\"PictureRotate\": \"0: 0\"' dari fail .json. Maklumat lanjut di sini:","Container:":"Kontena:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Tentukan bekas yang anda ingin fail output seperti '.mp4'. Anda boleh mengetahui lebih lanjut mengenai bekas di:","Enable periodic scanning:":"Dayakan pengimbasan berkala:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast boleh memantau folder sumber anda dan menjalankan imbasan untuk fail baru pada selang yang ditentukan. Waktu selang berada dalam detik dengan lalai menjadi 300 saat (5 minit). Jika pilihan ini dipilih, maka apabila anda menekan \"Imbas dan menukar\", program ini akan menukar semua fail baru dan pemasa undur akan bermula. Ini akan dilampirkan sehingga terhenti. Selang imbasan berada di bahagian tetapan lanjutan.","Enable daily scanning:":"Dayakan pengimbasan harian:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Daripada imbasan berkala, anda boleh memilih untuk imbasan yang akan dijalankan sekali sehari. Waktu imbasan dimasukkan dalam bahagian tetapan lanjutan dalam format hh: mm seperti '18: 30 '. Sebaik sahaja \"Imbas dan menukar\" dipilih, program akan menunggu sehingga masa yang ditentukan sehingga menjalankan proses imbasan dan penukaran. Sekali lagi, ini akan dilampirkan sehingga terhenti.","Show/hide advanced:":"Tunjukkan / sembunyikan lanjut:","Scan interval (minimum 5 seconds):":"Selang imbasan (minimum 5 saat):","Daily run time (hh:mm):":"Masa larian harian (hh: mm):","Output filename suffix:":"Akhir nama fail output:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Ini adalah pilihan. Anda boleh menentukan akhiran untuk menambahkan pada akhir nama fail anda seperti '_1080p' atau '_testconversion' dsb.","If 'standard preset' is selected then all output files will have the same suffix.":"Jika 'pratetap standard' dipilih maka semua fail output akan mempunyai akhiran yang sama.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Jika 'pratetap tersuai' dipilih maka anda boleh menentukan satu akhiran setiap folder sumber / pratetap tersuai. Pastikan setiap akhiran berada pada barisnya sendiri. Sebagai contoh, jika anda mempunyai 2 folder sumber dan menggunakan 'pratetap peribadi', anda boleh memasukkannya ke dalam kotak nama akhiran suffix:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Fail dalam folder sumber pertama akan mempunyai '_720p' ditambah pada nama fail output. Fail dalam folder sumber kedua akan mempunyai '_1080p' ditambah pada nama fail output dan lain-lain","Include these file containers:":"Sertakan bekas fail ini:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Masukkan bekas fail untuk mengimbas. Setiap jenis perlu dipisahkan oleh koma. Kemasukan lalai ialah:","Exclude files smaller than (MB):":"Kecualikan fail yang lebih kecil daripada (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Tentukan sama ada untuk mengecualikan fail yang lebih kecil daripada saiz tertentu dari penukaran (dalam megabait)","Exclude files larger than (MB):":"Kecualikan fail yang lebih besar daripada (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Tentukan sama ada untuk mengecualikan fail yang lebih besar daripada saiz tertentu dari penukaran (dalam megabait)","Exclude filenames which include any of these words:":"Kecualikan nama fail yang termasuk mana-mana kata-kata berikut:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Masukkan kata kunci untuk ditapis semasa mengimbas fail. Sebagai contoh, jika \"720p\" dimasukkan, maka sebarang fail dengan \"720p\" dalam tajuk tidak akan ditukarkan. Sekali lagi, kata kunci perlu dipisahkan oleh koma. Sebagai contoh, masukkan yang berikut dalam kotak penapis:","Include files with any ":"Sertakan fail dengan mana-mana"," or all ":"atau semua"," of these":"ini","properties:":"hartanah:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Di sini anda boleh memasukkan sifat video dan audio yang mesti mempunyai fail untuk ditukar (info diekstrak menggunakan FFprobe). Ciri-ciri mesti dipisahkan oleh koma. Gunakan alat penonton maklumat media untuk membantu menentukan ciri-ciri yang ingin anda sertakan. Pastikan anda meletakkan koma selepas harta terakhir. Sebagai contoh, hanya untuk menukar fail yang dikodkan menggunakan audio stereo h264 dan aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Perlu diingat bahawa pemeriksaan harta ini dilakukan sebaik sahaja proses penukaran bermula (untuk menjimatkan masa semasa membina barisan), jadi walaupun fail mungkin muncul dalam barisan penukaran, mereka akan dilangkau / dimasukkan jika syarat yang betul dipenuhi.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Jika FFprobe dapat mengekstrak sifat, maka 'OK' akan muncul dalam lajur \"FFprobe\" dalam paparan giliran.","Exclude files with any ":"Kecualikan fail dengan mana-mana"," of these ":"ini","The opposite of 'Include files with any or all of these properties'":"Sebaliknya dari 'Sertakan fail dengan mana-mana atau semua sifat ini'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Ini adalah alat kecil untuk menganalisis sifat-sifat fail dengan untuk membantu anda menentukan sifat-sifat yang anda ingin sertakan / tidak termasuk dalam pilihan di atas. Ia menggunakan FFprobe untuk mengembalikan maklumat. Seret dan lepaskan fail ke dalam kotak kelabu untuk menganalisisnya. Sebagai contoh, menjatuhkan fail ujian mungkin mengembalikan yang berikut:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Sekiranya anda ingin mengecualikan fail seperti ini daripada ditukar, maka anda boleh meletakkan beberapa sifat fail ke dalam kotak \"Kecualikan fail dengan mana-mana atau semua sifat-sifat ini\" dan tandakan kotak pilihan di sebelah 'semua' dan bukannya ' seperti itu:","Copy excluded files to destination:":"Salin fail yang dikecualikan ke destinasi:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Jika anda memilih pilihan ini, maka fail yang telah dikecualikan daripada penukaran akan disalin terus ke folder tujuan. Ini terpakai kepada penapis berikut:","Exclude filenames which include any of these words":"Kecualikan nama fail yang termasuk mana-mana perkataan ini","Include files with any or all of these properties":"Sertakan fail dengan mana-mana atau semua sifat ini","Exclude files with any or all of these properties":"Kecualikan fail dengan mana-mana atau semua sifat ini","Exclude files smaller than (MB)":"Mengecualikan fail yang lebih kecil daripada (MB)","Exclude files larger than (MB)":"Tidak termasuk fail yang lebih besar daripada (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Perhatikan ini juga terpakai kepada fail yang dikecualikan kerana mereka tidak memenuhi syarat hartanah \"Sertakan\" di atas supaya tidak sengaja menyalin anda keseluruhan perpustakaan apabila anda hanya cuba menukar beberapa fail.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Ciri salin tidak terpakai kepada penapis berikut (iaitu fail yang dikecualikan kerana penapis)","Include these file types":"Sertakan jenis fail ini","Delete source files after conversion:":"Padam fail sumber selepas penukaran:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Jika ini dipilih, maka jika percubaan penukaran berhasil, fail sumber akan dihapuskan. Proses ini dilakukan pada akhirnya, selepas penukaran semua fail. Ini bermakna anda boleh menukar fail sumber yang sama menggunakan pelbagai pratetap, semuanya dalam satu masa. Fail sumber kemudian akan dipadam kemudian.","Replace original file if converted file is smaller?(Compress attempt)":"Ganti fail asal jika fail diubah menjadi lebih kecil? (Percubaan mampat)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Pilih kotak semak ini jika anda ingin HBBatchBeast untuk menggantikan fail sumber asal jika fail baru lebih kecil. Jika fail baru tidak lebih kecil, maka ia akan ditinggalkan dalam folder tujuan.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Pastikan folder tujuan anda tidak sama dengan / atau dalam, folder sumber anda atau ia tidak berfungsi dengan betul.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Sekali HBBatchBeast telah cuba untuk memampatkan fail tertentu, ia akan menambah laluan fail ke cache supaya ia tidak akan dicuba lagi pada masa akan datang. Anda boleh melihat / mengedit / membersihkan cache menggunakan butang kuning.","Replace original file always?":"Gantikan fail asal sentiasa?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Fail asal akan diganti tanpa mengira sama ada fail baru lebih besar atau lebih kecil.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Sekali lagi, pastikan folder tujuan anda tidak sama dengan / atau dalam, folder sumber anda atau ia tidak berfungsi dengan betul.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Sebaik sahaja HBBatchBeast telah transcoded fail tertentu, ia akan menambah laluan fail ke cache supaya ia tidak akan dicuba lagi pada masa akan datang. Anda boleh melihat / mengedit / membersihkan cache menggunakan butang kuning.","Copy subtitle (srt) files to destination?":"Salin fail sarikata (srt) ke destinasi?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Fail 'Subtitle' .srt 'akan disalin ke folder tujuan secara automatik.","Automatically create temporary/destination folders if they don't exist?":"Buat folder secara sementara / destinasi jika mereka tidak wujud?","Custom bat path to run after each conversion (leave blank if not using):":"Laluan kelawar tersuai untuk dijalankan selepas setiap penukaran (kosongkan jika tidak menggunakan):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Masukkan laluan ke fail kelompok tersuai yang anda ingin laksanakan selepas setiap penukaran. Sebagai contoh:","Batch files with timeout statements won't work. More info here:":"Fail kumpulan dengan pernyataan masa tidak akan berfungsi. Maklumat lanjut di sini:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Biarkan kotak kosong sepenuhnya jika anda tidak mahu menggunakan pilihan ini (pastikan tiada aksara tersembunyi di dalam kotak)","Run processes at low priority?":"Jalankan proses dengan keutamaan yang rendah?","All conversion processes will be run at low priority, reducing processor usage.":"Semua proses penukaran akan dijalankan dengan keutamaan yang rendah, mengurangkan penggunaan pemproses.","Remove apostrophes from filenames:":"Alih keluar tanda kutip dari nama fail:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Imbasan / pemeriksaan pemeriksaan kesihatan mungkin gagal jika nama fail mempunyai tanda titik masuk. Semak ini secara automatik mengeluarkan tanda kutip dari nama fail."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Ciri ini boleh mengimbas fail video yang rosak menggunakan ciri '--scan' HandBrake, walaupun ini tidak selalu tepat. Ia juga menggunakan FFprobe untuk menyediakan titik rujukan kedua. Jika kedua-dua FFprobe dan HandBrake gagal maka ada peluang yang tinggi bahawa fail itu rosak.","Move corrupt files into the following folder:":"Pindahkan fail rasuah ke dalam folder berikut:"," If checked, then any files which give errors will be moved into the specified folder.":"Jika disemak, maka sebarang fail yang memberikan ralat akan dipindahkan ke dalam folder yang ditentukan.","Corrupt file folder:":"Folder fail yang rosak:","Run thorough file health check:":"Jalankan pemeriksaan kesihatan fail menyeluruh:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Sekiranya diperiksa, maka pemeriksaan kesihatan video yang lebih perlahan dan menyeluruh akan dijalankan menggunakan FFmpeg dan bukannya HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Berdasarkan Desani's 'ScanMedia.ps1' didapati di:","Attempt to repair files after thorough check:":"Cuba untuk memperbaiki fail selepas pemeriksaan menyeluruh:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Sekiranya disemak, HBBatchBeast akan cuba membaiki fail menggunakan FFmpeg. Fail baru dengan akhiran '_repaired' akan dibuat dalam folder yang sama sebagai fail sumber.","'CRF' value to use when attempting to repair files:":"Nilai 'CRF' yang digunakan apabila cuba membaiki fail:","The default 'CRF' value is 23. Please see the following for more information:":"Nilai default 'CRF' ialah 23. Sila lihat perkara berikut untuk mendapatkan maklumat lanjut:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Julat skala CRF ialah 0-51, di mana 0 adalah lossless, 23 adalah lalai, dan 51 adalah kualiti yang paling mungkin. Nilai yang lebih rendah biasanya membawa kepada kualiti yang lebih tinggi, dan pelbagai subjek yang bersifat waras ialah 17-28. Pertimbangkan 17 atau 18 untuk menjadi lumpuh secara visual atau hampir; ia perlu kelihatan sama atau hampir sama dengan input tetapi ia tidak secara teknikal hilang.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast menyelamatkan senarai laluan fail yang diimbas yang dilaporkan sebagai tidak rosak. Kosongkan cache untuk melakukan imbasan baru pada semua fail.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Bilangan contoh HandBrake / FFmpeg serentak untuk digunakan? (Disyorkan 4 atau kurang):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Tetapan ini terpakai untuk kedua-dua proses \"pemeriksaan kesihatan Video\" dan \"Imbas dan menukar\". Tentukan berapa banyak benang HandBrake yang hendak digunakan. Tidak ada maksimum walaupun disyorkan untuk tidak menggunakan lebih dari 4. Jumlah yang lebih tinggi mungkin membekukan komputer anda jika tidak terlalu kuat.","Queue size view limit?(Recommended 1000 or fewer):":"Had pandangan saiz giliran? (Disyorkan 1000 atau kurang):","Automatically start \"Scan and convert\" when program opened?:":"Secara automatik bermula \"Imbas dan tukar\" apabila program dibuka:","Save verbose logs?:":"Simpan log verbose ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Semak kotak semak ini untuk menyimpan log sub-process terperinci. Ini termasuk konsol pekerja ouput. Ini akan menyebabkan kayu yang sangat besar.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Isi butiran e-mel untuk menerima pemberitahuan e-mel jika ralat ditemui semasa pemeriksaan kesihatan atau penukaran / folder menonton. Tidak akan berfungsi dengan akaun yang memerlukan 2FA. Anda perlu mendayakan akses kepada aplikasi kurang selamat pada akaun Gmail.","Email address:":"Alamat emel:","For example:":"Sebagai contoh:","Email password(not saved):":"Kata laluan e-mel (tidak disimpan):","SMTP server:":"Pelayan SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Ciri ini membolehkan pemantauan status pemeriksaan / pemeriksaan kesihatan menggunakan mana-mana penyemak imbas web. Berguna apabila menjalankan pelayan dan lain-lain Tiada nama fail yang dihantar.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Jika diaktifkan, data tanpa nama berikut akan dihantar kepada HBBatchBeast.io:","API key":"Kunci API","Current status ('Searching', 'Running', 'Finished' etc)":"Status semasa ('Mencari', 'Running', 'Selesai' dan lain-lain)","Number of:":"Sebilangan:","Remaining items":"Barang-barang yang tinggal","Successful items":"Perkara yang berjaya","Errored items":"Item yang ralat","Cancelled items":"Item yang dibatalkan","Worker percentages":"Peratusan pekerja","Last completed item time":"Masa item terakhir selesai","Enable remote monitoring?:":"Dayakan pemantauan jauh ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Utiliti asas penanda aras asas dibina terutamanya untuk melihat bagaimana 16+ pemproses teras melaksanakan menggunakan banyak contoh HandBrake walaupun ia boleh dijalankan pada sebarang jenis pemproses.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Ini akan memuat turun fail sample h265 4k (2.5MB) dan menjalankan penanda aras menggunakan 4 contoh HandBrake dengan pratetap \"Sangat cepat 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Keputusan boleh dimuat naik ke hbbatchbeast.io jika anda memilih.","Queue":"Beratur","Output this session":"Output sesi ini","Media info viewer tool":"Alat penonton maklumat media","View replaced file cache":"Lihat cache fail digantikan","Clear replaced file cache":"Kosongkan fail fail digantikan","Save config":"Simpan config","Scan only":"Imbas sahaja","Scan and convert":"Imbas dan tukar","View scan/conversion summary log":"Lihat imbasan / log ringkasan penukaran","View individual file check/conversion log":"Lihat log periksa / penukaran fail individu","View worker console output":"Lihat output konsol pekerja","Health check":"Pemeriksaan kesihatan","Clear healthy file cache":"Kosongkan cache fail yang sihat","View error log":"Lihat log ralat","Email test":"Ujian e-mel","View master log":"Lihat log induk","Wiki help":"Bantuan Wiki","An application by HaveAGitGat":"Permohonan oleh HaveAGitGat","New":"Baru","Launch":"Pelancaran","Benchmark":"Penanda aras","See results":"Lihat hasil","Pause queue":"Jeda giliran","Continue queue":"Teruskan giliran","Stop queue":"Berhenti giliran","Convert selected files":"Tukar fail terpilih","Toggle queue view":"Toggle view queue","Deselect all":"Nyahpilih semua","Invert all":"Invert semua","Select all":"Pilih semua","Toggle output view":"Togol paparan output"}