{"The number of custom presets does not match the number of source folders!":"In-numru ta 'presets tad-dwana ma jaqbilx man-numru ta' folders sors!","source folders have been detected.":"jinstabu folders tas-sors.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"linji issettjati minn qabel ġew skoperti. Jekk jogħġbok iċċekkja darbtejn għal ksur tal-linja inviżibbli. Għandu jkun hemm mogħdija waħda ta 'folder jew issettjati minn qabel għal kull linja. Kun żgur li ma ħolqtx aċċidentalment linja vojta.","The number of filename suffixes does not match the number of source folders! ":"In-numru ta 'suffissi ta' isem tal-file ma jaqbilx man-numru ta 'folders sors!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"ġew identifikati linji ta ’suffiss tal-file. Jekk jogħġbok iċċekkja darbtejn għal ksur tal-linja inviżibbli. Għandu jkun hemm mogħdija waħda tal-folder jew suffiss ta 'isem tal-file għal kull linja. Kun żgur li ma ħolqtx aċċidentalment linja vojta.","The number of source folders does not match the number of destination folders!":"In-numru ta 'folders tas-sors ma jaqbilx man-numru ta' folders tad-destinazzjoni!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"folders tad-destinazzjoni jkunu nstabu. Jekk jogħġbok iċċekkja darbtejn għal ksur tal-linja inviżibbli. Għandu jkun hemm mogħdija waħda tal-folder għal kull linja. Kun żgur li ma ħolqtx aċċidentalment linja vojta.","The number of source folders does not match the number of temporary conversion folders!":"In-numru ta 'folders tas-sors ma jaqbilx man-numru ta' folders ta 'konverżjoni temporanja!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"folders ta ’konverżjoni temporanja jkunu nstabu. Jekk jogħġbok iċċekkja darbtejn għal ksur tal-linja inviżibbli. Għandu jkun hemm mogħdija waħda tal-folder għal kull linja. Kun żgur li ma ħolqtx aċċidentalment linja vojta.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Jekk jogħġbok ikteb kontenitur validu bħal '.mp4'. Kun żgur li tinkludi l-'.'","Corrupt file folder":"Folder fajl korrotti","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ma jeżistix! Jekk jogħġbok kun żgur li m'hemmx spazji jew karattri moħbija qabel / wara t-triq","Source folder":"Folder tas-sors","Temporary conversion folder":"Folder ta 'konverżjoni temporanja","appears to be the same as or is within source folder":"tidher li hija l-istess bħal jew tinsab fil-folder tas-sors","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"li ma jħallix lil HBBatchBeast jaħdem sew. Jekk jogħġbok ibdel il-folder ta 'konverżjoni temporanja għal folder barra mill-folder tas-sors. Jekk trid tuża l- “Ibdel il-karatteristika tal-fajls oriġinali”, jekk jogħġbok agħżel folder tad-destinazzjoni li mhux l-istess bħal, jew ġewwa, il-folder tas-sors, u mbagħad iċċekkja l-kaxxa “Ibdel il-fajls oriġinali dejjem” fit-taqsima tal-issettjar avvanzat . Neħħi l-kaxxa tal-kaxxa tal-'Folder ta 'konverżjoni temporanja' temporanja peress li ma sservi għall-ebda użu f'dan il-każ. Il-fajls jiġu konvertiti fil-folder tad-destinazzjoni u mbagħad jiġu mċaqalqa lura fil-folder tas-sors.","Destination folder":"Folder tad-destinazzjoni","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"li ma jħallix lil HBBatchBeast jaħdem sew. Jekk jogħġbok ibdel il-folder tad-destinazzjoni għal folder barra mill-folder tas-sors. Jekk trid tuża l- “Ibdel il-karatteristika tal-fajls oriġinali”, jekk jogħġbok agħżel folder tad-destinazzjoni li mhux l-istess bħal, jew ġewwa, il-folder tas-sors, u mbagħad iċċekkja l-kaxxa “Ibdel il-fajls oriġinali dejjem” fit-taqsima tal-issettjar avvanzat . Neħħi l-kaxxa tal-kaxxa tal-'Folder ta 'konverżjoni temporanja' temporanja peress li ma sservi għall-ebda użu f'dan il-każ. Il-fajls jiġu konvertiti fil-folder tad-destinazzjoni u mbagħad jiġu mċaqalqa lura fil-folder tas-sors.","Error creating temporary conversion folder":"Żball fil-ħolqien ta 'folder ta' konverżjoni temporanja","Error creating destination folder":"Żball fil-ħolqien ta 'folder ta' destinazzjoni","Please select to use HandBrake or FFmpeg!":"Jekk jogħġbok agħżel li tuża HandBrake jew FFmpeg!","Please select a standard preset or input a custom one!":"Jekk jogħġbok agħżel issettjati minn qabel standard jew daħħal waħda custom!","Please select a scan interval of 5 seconds or greater!":"Jekk jogħġbok agħżel intervall ta ’skennjar ta’ 5 sekondi jew iktar!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Jekk jogħġbok kun żgur li n-numru ta 'każijiet simultanji ta' HandBrake / FFmpeg li għandhom jintużaw huwa wieħed jew aktar!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Ċavetta API mhux valida! Jekk jogħġbok ikklikkja 'Ġdid' fuq it-tab tal-monitoraġġ mill-bogħod biex tiġġenera ċavetta ġdida.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Jekk jogħġbok daħħal ħin ta 'skennjar ta' kuljum f'format ta '24 siegħa: hh: mm (per eżempju 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"FAJLS TA 'SORS Se jitħassru wara konverżjoni! Jekk jogħġbok ittestja qabel l-użu kif suppost!","Benchmark failed!":"Kriterju falla!","Log does not exist!":"Ir-reġistru ma jeżistix!","Folder does not exist!":"Folder ma jeżistix!","Error sending email! Please check your settings.":"Żball li bagħtet email! Jekk jogħġbok iċċekkja s-settings tiegħek.","Test email sent!":"Ittestja l-email mibgħuta!","All worker processes have been stopped.":"Il-proċessi kollha tal-ħaddiema twaqqfu.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Il-kju jieqaf ladarba l-oġġetti kurrenti jkunu lestew l-ipproċessar. Inti żgur li trid li nieqaf il-kju?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Il-pawża tal-kju mibdija. Il-buttuna “Tkompli” tidher ladarba l-ħaddiema kollha jkunu waqfu.","Healthy file cache cleared!":"Cache tal-fajl b'saħħtu mneħħi!","Cache cleared!":"Cache ikklerjat!","Cancel item":"Ikkanċella l-oġġett","Please check the above checkbox to use this feature.":"Jekk jogħġbok iċċekkja l-kaxxa ta 'hawn fuq biex tuża din il-karatteristika.","Configuration":"Konfigurazzjoni","Source folders":"Folders sors","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Dan huwa l-folder tas-sors li se jkun skannjat għall-midja. Il-folder irid jiddaħħal mingħajr slash. Pereżempju:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Il-kaxxa tal-path tas-sors tal-folder hija espansibbli (agħfas Enter biex toħloq linja ġdida). Jekk trid tispeċifika folders multipli tas-sors, kun żgur li kull triq tal-folder tas-sors tinsab fuq il-linja tagħha stess bħal:","Video health check":"Kontroll tas-saħħa tal-vidjow","Batch conversion and Folder watching":"Konverżjoni tal-lott u ħars tal-folders","Remote Monitoring (Beta)":"Monitoraġġ mill-Bogħod (Beta)","Benchmark (Beta)":"Kriterju (Beta)","System":"Sistema","Help":"Għajnuna","Temporary conversion folders":"Folders ta 'konverżjoni temporanja","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Jekk \"Folder ta 'konverżjoni temporanja?\" jiġi ċċekkjat, allura HandBrake jibdel il-fajls f'dik il-folder. Ladarba l-konverżjoni titlesta, il-fajl se jitpoġġa fil- \"folder tad-Destinazzjoni\" tiegħek. Int ser ikollok bżonn tispeċifika kemm jista 'jkun folders ta' konverżjoni temporanja daqs folders mis-sors. L-ewwel sors tal-folder tiegħek ser jiġi konvertit fl-ewwel folder ta 'konverżjoni temporanja tiegħek, it-tieni sors tal-folder tiegħek fit-tieni folder ta' konverżjoni temporanja tiegħek u oħrajn. Kun żgur li kull passaġġ ta 'folder temporanju ta' konverżjoni huwa fuq il-linja tagħha stess.","Destination folders":"Folders tad-destinazzjoni","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Speċifika l-mogħdijiet tal-folder tad-destinazzjoni. Għal darb'oħra, ser ikollok bżonn li tispeċifika kemm hemm folders tad-destinazzjoni daqs folders mis-sors. Fajls mill-folder tal-ewwel sors tiegħek jispiċċaw fil-folder tal-ewwel destinazzjoni tiegħek, il-fajls tat-tieni sors tas-sors tiegħek fit-tieni folder tad-destinazzjoni tiegħek u l-bqija.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Folder tal-ewwel sors ---------> L-ewwel folder ta 'konverżjoni temporanja ---------> Folder tal-ewwel destinazzjoni","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Folder tat-tieni sors ---------> It-tieni folder ta 'konverżjoni temporanja ---------> It-tieni folder tad-destinazzjoni","etc":"eċċ","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast ma jaħdimx sew jekk tissettja l-folder tad-destinazzjoni l-istess bħal, jew ġewwa, il-folder tas-sors.","Standard preset:":"Issettjati minn qabel standard:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Agħżel il-HandBrake issettjat minn qabel li tixtieq tikkonverti l-fajls tiegħek b '. Jekk tintgħażel \"Standard issettjati minn qabel\", il-fajls kollha fil-folders magħżula jiġu konvertiti bl-użu tal-preset speċifikat ta 'HandBrake. Tista 'ssib aktar dwar il-presets tal-HandBrake hawn:","Custom preset:":"Issettjati minn qabel","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Jekk \"Custom issettjati minn qabel\" imbagħad inti għandek bżonn tidħol issettjati minn qabel għall-individwu. HBBatchBeast ikopri l-parti \"HandBrakeCLI -i sors -o destinazzjoni\" tal-input ta 'HandBrakeCLI sabiex ikollok bżonn tidħol fil-parametri ta' konverżjoni. Pereżempju:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Jekk tuża FFmpeg, għandek bżonn tissepara l-parametri ta ’l-input u tal-ħruġ b’ virgola. Bħal:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Tista 'wkoll torbot ma' issettjati minn qabel skont l-ordni li ġew esportati mill-applikazzjoni uffiċjali tal-HandBrake GUI pereżempju:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Jekk qed ikollok xi diffikultà biex issettjati minn qabel, tista 'tkun minħabba xi bug magħruf bl-HandBrakeCLI (se jitwaħħal fir-rilaxx ta' HandBrakeCLI li jmiss). Jekk jogħġbok ara dan għal soluzzjoni temporanja:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Kull issettjati minn qabel jeħtieġ li tkun fuq il-linja tagħha stess u, simili għall-folders, jeħtieġ li jkun hemm daqshekk issettjati minn qabel tad-dwana daqs folders tas-sors.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Folder ta 'l-ewwel sors ---------> L-ewwel folder ta' konverżjoni temporanja ---------> Folder ta 'l-ewwel destinazzjoni @ Custom issettjati minn qabel 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Fowlder tat-tieni sors ---------> It-tieni folder ta 'konverżjoni temporanja ---------> It-tieni folder ta' destinazzjoni @ Issettjati minn qabel skont l-ordni 2","See the following image for guidance:":"Ara l-immaġini li ġejja bħala gwida:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Jekk tuża kodifikazzjoni tal-karta grafika (bħal NVENC), allura jista 'jkollok bżonn tnaqqas in-numru ta' każijiet HandBrake (ipprova 2 jew inqas) minħabba l-limitazzjonijiet tal-VRAM.","Select standard preset:":"Agħżel issettjati minn qabel standard:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC misjub, jekk jogħġbok kun żgur li tnaqqas in-numru ta ’każijiet HandBrakeCLI għal 2 jew inqas (għall-biċċa l-kbira tal-karti tal-grafika) jew tista’ tiltaqa ’ma’ żbalji minħabba VRAM mhux biżżejjed. Dan l-issettjar jista 'jinstab fit-tab \"Sistema\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Importat issettjat minn qabel issettjat. Jekk qed ikollok xi diffikultà bi presets tad-dwana importati, jista 'jkun minħabba xi bug magħruf bl-HandBrakeCLI (se jiġi ffissat fir-rilaxx ta' HandBrakeCLI li jmiss). Soluzzjoni temporanja hija li titneħħa '\"PictureRotate\": \"0: 0\" \"mill-fajl .json. Iktar informazzjoni hawn:","Container:":"Kontenitur:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Speċifika l-kontenitur li tixtieq li l-fajl tal-produzzjoni jkollu bħal.. Mp4 '. Tista 'ssir taf aktar dwar il-kontenituri f':","Enable periodic scanning:":"Enable skanjar perjodiku:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast jista 'jimmonitorja l-folders tas-sors tiegħek u jiskannja skans għal fajls ġodda f'intervall speċifikat. Il-ħin tal-intervall huwa f'sekondi bil-kontumaċja tkun 300 sekonda (5 minuti). Jekk tintgħażel din l-għażla, allura meta tagħfas \"Scan and convert\", il-programm jibdel kwalunkwe fajl ġdid u mbagħad jibda countdown timer. Dan se loop infinitament sakemm jitwaqqaf. L-intervall tal-iskannjar huwa fit-taqsima tal-issettjar avvanzat.","Enable daily scanning:":"Ħalli l-iskannjar ta 'kuljum:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Minflok skennjar perjodiku, tista 'tagħżel li skanja titmexxa darba kuljum. Il-ħin tal-iskan tiddaħħal fit-taqsima tal-issettjar avvanzat f'format ta 'siegħa: mm bħal '18: 30'. Ladarba \"Scan and convert\" tintgħażel, il-programm se jistenna sa l-ħin speċifikat sakemm jibda proċess ta 'skennjar u konverżjoni. Għal darb'oħra, dan se loop infinitament sakemm titwaqqaf.","Show/hide advanced:":"Uri / aħbi avvanzat:","Scan interval (minimum 5 seconds):":"Intervall ta 'skanjar (minimu ta' 5 sekondi):","Daily run time (hh:mm):":"Ħin tal-ġirja ta 'kuljum (hh: mm):","Output filename suffix:":"Is-suffiss tal-file tal-ħruġ:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Dan mhux obbligatorju. Tista 'tispeċifika suffiss biex iżżid mal-aħħar tal-isem tal-file tiegħek bħal' _1080p 'jew' _testconversion 'eċċ.","If 'standard preset' is selected then all output files will have the same suffix.":"Jekk tintgħażel 'issettjati minn qabel standard' il-fajls ta 'l-output kollha jkollhom l-istess suffiss.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Jekk tintgħażel “issettjati minn qabel”, allura tista 'tispeċifika suffiss wieħed għal kull folder ta' sors / issettjar minn qabel tad-dwana. Kun żgur li kull suffiss huwa fuq il-linja tiegħu stess. Pereżempju, jekk għandek żewġ folders tas-sors u qed tuża “issettjati minn qabel”, tista 'tpoġġi dan fil-kaxxa tas-suffiss tal-file:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Fajls fil-folder ta ’l-ewwel sors ikollu“ _720p ”miżjud ma’ l-isem tal-file tal-ħruġ. Fajls fit-tieni folder ta ’sors ikollhom“ _1080p ”miżjuda mal-output tal-isem tal-file eċċ.","Include these file containers:":"Inkludi dawn il-kontenituri tal-fajls:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Daħħal il-kontenituri tal-fajls għall-iskannjar. Kull tip jeħtieġ li jkun separat b 'virgola. L-entrata default hija:","Exclude files smaller than (MB):":"Eskluża fajls iżgħar minn (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Speċifika jekk għandhomx jiġu esklużi fajls iżgħar minn ċertu daqs mill-konverżjoni (f'megabytes)","Exclude files larger than (MB):":"Eskluża fajls ikbar minn (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Speċifika jekk għandhomx jiġu esklużi fajls ikbar minn ċertu daqs mill-konverżjoni (f'megabytes)","Exclude filenames which include any of these words:":"Eskluża l-ismijiet tal-filen li jinkludu xi waħda minn dawn il-kliem:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Ikteb il-kliem kjavi li għandhom jiġu ffiltrati meta ssir l-iskannjar għall-fajls. Pereżempju, jekk \"720p\" jiddaħħal, allura kwalunkwe fajl b '\"720p\" fit-titlu ma jiġix konvertit. Għal darb'oħra, il-kliem kjavi jeħtieġ li jiġu separati b 'virgola. Pereżempju, ikteb dan li ġej fil-kaxxa tal-filtru:","Include files with any ":"Inkludi fajls bi kwalunkwe"," or all ":"jew kollha kemm huma"," of these":"minn dawn","properties:":"proprjetajiet:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Hawnhekk tista 'tiddaħħal proprjetajiet tal-vidjow u tal-awdjo li l-fajls irid ikollhom sabiex jiġu konvertiti (info estratta bl-użu ta' FFprobe). Il-proprjetajiet iridu jiġu separati b 'virgola. Uża l-għodda ta 'telespettatur tal-informazzjoni tal-midja biex tgħin tiddetermina liema proprjetajiet tixtieq tinkludi. Kun żgur li tqiegħed virgola wara l-aħħar propjetà. Pereżempju, biex tikkonverti biss fajls li huma kodifikati bl-użu ta 'h264 u aac stereo audio:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Ta 'min jinnota li din il-verifika tal-proprjetà ssir ladarba jibda l-proċess ta' konverżjoni (biex jiffranka l-ħin waqt li tibni l-kju), għalhekk għalkemm il-fajls jistgħu jidhru fil-kju tal-konverżjoni, dawn jiġu skipati / inklużi jekk jiġu sodisfatti l-kundizzjonijiet korretti.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Jekk FFprobe jkun kapaċi jiġbed proprjetajiet, allura “OK” tidher fil-kolonna \"FFprobe\" fl-opinjoni tal-kju.","Exclude files with any ":"Eskluża fajls bi kwalunkwe"," of these ":"minn dawn","The opposite of 'Include files with any or all of these properties'":"L-oppost ta '“Inkludi fajls bi kwalunkwe waħda minn dawn il-proprjetajiet jew kollha kemm huma”","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Din hija għodda żgħira biex tanalizza l-proprjetajiet tal-fajl sabiex tgħinek tiddetermina liema proprjetajiet tixtieq tinkludi / teskludi fl-għażliet ta 'hawn fuq. Huwa juża FFprobe biex jirritorna l-informazzjoni. Drag u qatra fajls fil-kaxxa griża biex tanalizzahom. Pereżempju, it-tluq fil-fajl tat-test jista ’jirritorna dan li ġej:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Jekk qed tfittex li teskludi fajls bħal din milli jiġu konvertiti, allura inti tista 'tpoġġi diversi proprjetajiet tal-fajl fil-kaxxa \"Eskluża fajls bi kwalunkwe waħda jew kollha minn dawn il-proprjetajiet\" u ċċekkja l-kaxxa ta' kontroll ħdejn 'kollha' minflok 'kwalunkwe', bħal hekk:","Copy excluded files to destination:":"Ikkopja fajls esklużi sad-destinazzjoni:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Jekk tagħżel din l-għażla, allura fajls li ġew esklużi mill-konverżjoni jiġu kkupjati direttament fil-folder tad-destinazzjoni. Dan japplika għall-filtri li ġejjin:","Exclude filenames which include any of these words":"Eskluża l-ismijiet tal-filen li jinkludu xi waħda minn dawn il-kliem","Include files with any or all of these properties":"Inkludi fajls bi kwalunkwe waħda minn dawn il-proprjetajiet jew kollha kemm huma","Exclude files with any or all of these properties":"Eskluża fajls bi kwalunkwe waħda minn dawn il-proprjetajiet jew kollha kemm huma","Exclude files smaller than (MB)":"Eskluża fajls iżgħar minn (MB)","Exclude files larger than (MB)":"Eskluża fajls ikbar minn (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Innota li dan japplika wkoll għal fajls esklużi minħabba li ma jissodisfawx il-kundizzjonijiet tal-proprjetà \"Inkludi\" ta 'hawn fuq u għalhekk ma jikkopjawx aċċidentalment il-librerija intiera tiegħek meta qed tipprova tikkonverti biss ftit fajls.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Il-karatteristika tal-kopja ma tapplikax għall-filtri li ġejjin (jiġifieri fajls esklużi minħabba l-filtru)","Include these file types":"Inkludi dawn it-tipi ta 'fajls","Delete source files after conversion:":"Ħassar fajls tas-sors wara l-konverżjoni:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Jekk din tintgħażel, allura jekk tentattiv ta 'konverżjoni jirnexxi, il-fajl sors jitħassar. Dan il-proċess isir fl-aħħar nett, wara l-konverżjoni tal-fajls kollha. Dan ifisser li inti tista 'tikkonverti l-istess fajls tas-sors billi tuża diversi presets, kollha f'daqqa. Il-fajls sors imbagħad jitħassru wara.","Replace original file if converted file is smaller?(Compress attempt)":"Ibdel il-fajl oriġinali jekk il-fajl konvertit huwa iżgħar? (Ikkompressa tentattiv)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Agħżel din il-kaxxa jekk tixtieq HBBatchBeast biex tissostitwixxi awtomatikament il-fajl oriġinali oriġinali jekk il-fajl il-ġdid huwa iżgħar. Jekk il-fajl il-ġdid ma jkunx iżgħar, allura jitħalla fil-folder tad-destinazzjoni.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Kun żgur li l-folder tad-destinazzjoni tiegħek mhux l-istess bħal / jew ġewwa, il-folder tas-sors tiegħek jew ma jaħdimx sew.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Ladarba HBBatchBeast ipprova jikkompressa fajl speċifiku, se jżid dik il-passaġġ tal-fajl ma 'cache sabiex ma jerġax jipprova jerġa' jsir fil-futur. Tista 'tara / teditja / tnaddaf il-cache billi tuża l-buttuni sofor.","Replace original file always?":"Ibdel il-fajl oriġinali dejjem?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Il-fajl oriġinali se jinbidel irrispettivament minn jekk il-fajl il-ġdid huwiex akbar jew iżgħar.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Għal darb'oħra, kun żgur li l-folder tad-destinazzjoni tiegħek mhux l-istess bħal / jew ġewwa, il-folder tas-sors tiegħek jew ma jaħdimx sew.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Ladarba HBBatchBeast ikun ikkodifika fajl speċifiku, se jżid dik il-passaġġ tal-fajl ma 'cache sabiex ma jerġax jipprova jerġa' jsir fil-futur. Tista 'tara / teditja / tnaddaf il-cache billi tuża l-buttuni sofor.","Copy subtitle (srt) files to destination?":"Ikkopja fajls tas-sottotitolu (srt) lejn id-destinazzjoni?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Fajls tas-sottotitolu '.srt' jiġu kkupjati awtomatikament fil-folder tad-destinazzjoni.","Automatically create temporary/destination folders if they don't exist?":"Oħloq awtomatikament folders temporanji / tad-destinazzjoni jekk ma jeżistux?","Custom bat path to run after each conversion (leave blank if not using):":"Bastiment personalizzat li jibda jaħdem wara kull konverżjoni (ħalli vojt jekk mhux qed jintuża):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Daħħal it-triq għal fajl tal-lott tad-dwana li tixtieq twettaq wara kull konverżjoni. Pereżempju:","Batch files with timeout statements won't work. More info here:":"Lottijiet b'dikjarazzjonijiet tal-timeout ma jaħdmux. Iktar informazzjoni hawn:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Ħalli l-kaxxa kompletament vojta jekk ma tridx tuża din l-għażla (kun żgur li m'hemmx karattri moħbija fil-kaxxa)","Run processes at low priority?":"Mexxi l-proċessi bi prijorità baxxa?","All conversion processes will be run at low priority, reducing processor usage.":"Il-proċessi kollha ta 'konverżjoni għandhom jitmexxew bi prijorità baxxa, u jnaqqsu l-użu tal-proċessur.","Remove apostrophes from filenames:":"Neħħi l-appostropi mill-ismijiet tal-fajls:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Skansijiet ta 'konverżjoni / kontroll tas-saħħa jistgħu jfallu jekk l-ismijiet tal-fajls ikollhom appostropi. Iċċekkja dan biex awtomatikament ineħħi l-appostropi mill-ismijiet tal-filen."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Din il-karatteristika tista 'tiskannja għall-fajls tal-vidjo korrotti billi tuża l-karatteristika' - scan 'ta' HandBrake, għalkemm din mhix dejjem eżatta. Juża wkoll FFprobe biex jipprovdi t-tieni punt ta ’referenza. Jekk kemm FFprobe kif ukoll HandBrake ifallu allura hemm ċans kbir li l-fajl huwa korrott.","Move corrupt files into the following folder:":"Ċaqlaq il-fajls korrotti fil-folder li ġej:"," If checked, then any files which give errors will be moved into the specified folder.":"Jekk iċċekkjat, allura kwalunkwe fajl li jagħti żbalji se jitpoġġa fil-folder speċifikat.","Corrupt file folder:":"Fajl tal-fajl korrott:","Run thorough file health check:":"Eżamina sew is-saħħa tal-fajl bir-reqqa:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Jekk iċċekkjat, imbagħad kontroll tas-saħħa tal-vidjow ħafna iktar bil-mod, aktar bir-reqqa se jsir bl-użu ta ’FFmpeg minflok HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Ibbażat fuq “ScanMedia.ps1” ta 'Desani misjub f':","Attempt to repair files after thorough check:":"Ipprova tissewwa fajls wara kontroll bir-reqqa:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Jekk iċċekkjat, HBBatchBeast jipprova jissewwa fajls bl-użu ta 'FFmpeg. Se jinħoloq fajl ġdid bis-suffiss '_repaired' fl-istess folder tal-fajl tas-sors.","'CRF' value to use when attempting to repair files:":"Valur 'CRF' li għandu jintuża meta jipprova jissewwa fajls:","The default 'CRF' value is 23. Please see the following for more information:":"Il-valur default “CRF” huwa 23. Jekk jogħġbok ara dan li ġej għal aktar informazzjoni:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Il-firxa tal-iskala CRF hija 0-51, fejn 0 hija bla telf, 23 hija l-inadempjenza, u 51 hija l-agħar kwalità possibbli. Valur iktar baxx ġeneralment iwassal għal kwalità ogħla, u medda suġġettivament f'sensja hija ta '17–28. Ikkunsidra 17 jew 18 bħala viżwalment bla telf jew kważi hekk; għandha tidher l-istess jew kważi l-istess bħall-input imma mhijiex teknikament bla telf.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast jiffranka lista ta 'mogħdijiet skanjati ta' fajls irrappurtati bħala mhux korrotti. Neħħi l-cache biex twettaq skan ġdid fuq il-fajls kollha.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Numru ta 'każijiet simultanji ta' HandBrake / FFmpeg li għandhom jintużaw? (Rakkomandata 4 jew inqas):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Dan l-issettjar japplika kemm għall-proċessi ta '\"Kontroll tas-saħħa tal-vidjow\" kif ukoll \"Scan and convert\". Speċifika kemm għandek tuża ħjut HandBrake. M'hemm l-ebda massimu għalkemm huwa rrakkomandat li ma tużax aktar minn 4. Ammont ogħla jista 'jiffriża l-kompjuter tiegħek jekk mhux qawwi ħafna.","Queue size view limit?(Recommended 1000 or fewer):":"Limitu tad-daqs tad-daqs tal-kju? (Rakkomandata 1000 jew inqas):","Automatically start \"Scan and convert\" when program opened?:":"Ibda awtomatikament \"Scan and convert\" meta l-programm jinfetaħ ?:","Save verbose logs?:":"Ħlief zkuk verbi ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Iċċekkja din il-kaxxa biex issalva zkuk dettaljati tas-sottoproċess. Dan jinkludi l-console tal-ħaddiema ouput. Dan jikkawża zkuk kbar ħafna.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Imla d-dettalji ta ’l-email biex tirċievi notifiki ta’ l-email jekk ikun hemm żball waqt kontroll tas-saħħa jew konverżjoni / ħars tal-folder. Ma jaħdimx ma 'kontijiet li jeħtieġu 2FA. Ikollok bżonn li tippermetti aċċess għal apps inqas siguri fuq il-kontijiet tal-Gmail.","Email address:":"Indirizz elettroniku:","For example:":"Pereżempju:","Email password(not saved):":"Password tal-email (mhux salvat):","SMTP server:":"Server SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Din il-karatteristika tippermetti monitoraġġ tal-istatus ta 'konverżjoni / kontroll tas-saħħa bl-użu ta' kwalunkwe web-browser. Utli meta tħaddem is-servers eċċ. L-ebda isem tal-file ma jintbagħat.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Jekk attivat, id-data anonima li ġejja ser tintbagħat lil HBBatchBeast.io:","API key":"Ċavetta API","Current status ('Searching', 'Running', 'Finished' etc)":"Status kurrenti ('Tiftix', 'Running', 'Irfinut' eċċ)","Number of:":"Numru ta:","Remaining items":"Oġġetti li jifdal","Successful items":"Oġġetti ta 'suċċess","Errored items":"Oġġetti mħassra","Cancelled items":"Oġġetti mħassra","Worker percentages":"Perċentwali tal-ħaddiema","Last completed item time":"Ħin tal-oġġett li tlesta l-aħħar","Enable remote monitoring?:":"Inattiva l-monitoraġġ mill-bogħod ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Utilità bażika ta 'benchmarking mibnija prinċipalment biex tara kif 16+ proċessuri ewlenin iwettqu bl-użu ta' bosta każi ta 'HandBrake għalkemm tista' titħaddem fuq kwalunkwe tip ta 'proċessur.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Dan se jniżżel fajl tal-kampjun ta 'h265 4k (2.5MB) u jimxi punt ta' referenza billi juża 4 istanzi HandBrake bi preset \"Fast ħafna 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Ir-riżultati jistgħu jittellgħu fuq hbbatchbeast.io jekk tagħżel.","Queue":"Kju","Output this session":"Output din is-sessjoni","Media info viewer tool":"Għodda għat-telespettaturi tal-informazzjoni tal-Midja","View replaced file cache":"Ara cache tal-fajls mibdula","Clear replaced file cache":"Cache tal-fajls mibdula ċari","Save config":"Ħlief konfigur","Scan only":"Iċċekkja biss","Scan and convert":"Scan u konverti","View scan/conversion summary log":"Ara l-iskan / il-konverżjoni tal-ġabra fil-qosor","View individual file check/conversion log":"Ara l-fajl ta 'kontroll / konverżjoni tal-fajl individwali","View worker console output":"Ara l-output tal-console tal-ħaddiem","Health check":"Kontroll tas-saħħa","Clear healthy file cache":"Cache tal-fajls b'saħħithom ċari","View error log":"Ara l-log tal-iżball","Email test":"Test elettroniku","View master log":"Ara l-log master","Wiki help":"Wiki jgħinu","An application by HaveAGitGat":"Applikazzjoni minn HaveAGitGat","New":"Ġdid","Launch":"Tniedi","Benchmark":"Kriterju","See results":"Ara r-riżultati","Pause queue":"Nieqaf kju","Continue queue":"Kompli kju","Stop queue":"Waqqaf il-kju","Convert selected files":"Ikkonverti fajls magħżula","Toggle queue view":"Toggle view tal-kju","Deselect all":"Neħħi kollox","Invert all":"Aqleb kollox","Select all":"Agħżel kollox","Toggle output view":"Toggle ħsieb l-output"}