{
    "The number of custom presets does not match the number of source folders!": "Het aantal aangepaste presets komt niet overeen met het aantal bronmappen!",
    "source folders have been detected.": "bronmappen zijn gedetecteerd.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "aangepaste vooraf ingestelde regels zijn gedetecteerd. Controleer nogmaals op onzichtbare regeleinden. Er moet één mappad zijn of per regel worden ingesteld. Zorg ervoor dat je niet per ongeluk een lege regel hebt gemaakt.",
    "The number of filename suffixes does not match the number of source folders! ": "Het aantal achtervoegsels van bestandsnamen komt niet overeen met het aantal bronmappen!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "bestands achtervoegsellijnen zijn gedetecteerd. Controleer nogmaals op onzichtbare regeleinden. Er moet één mappad of achtervoegsel voor bestandsnamen per regel zijn. Zorg ervoor dat je niet per ongeluk een lege regel hebt gemaakt.",
    "The number of source folders does not match the number of destination folders!": "Het aantal bronmappen komt niet overeen met het aantal doelmappen!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "bestemmingsmappen zijn gedetecteerd. Controleer nogmaals op onzichtbare regeleinden. Er moet één mappad per regel zijn. Zorg ervoor dat je niet per ongeluk een lege regel hebt gemaakt.",
    "The number of source folders does not match the number of temporary conversion folders!": "Het aantal bronmappen komt niet overeen met het aantal tijdelijke conversiemappen!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "tijdelijke conversiemappen zijn gedetecteerd. Controleer nogmaals op onzichtbare regeleinden. Er moet één mappad per regel zijn. Zorg ervoor dat je niet per ongeluk een lege regel hebt gemaakt.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Voer een geldige container in zoals '.mp4'. Zorg ervoor dat u de '.'",
    "Corrupt file folder": "Corrupte bestandsmap",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "bestaat niet! Zorg ervoor dat er geen spaties of verborgen tekens vóór / na het pad zijn",
    "Source folder": "Bronmap",
    "Temporary conversion folder": "Tijdelijke conversiemap",
    "appears to be the same as or is within source folder": "lijkt hetzelfde te zijn als of bevindt zich in de bronmap",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "die voorkomen dat HBBatchBeast correct werkt. Wijzig de tijdelijke conversiemap in een map buiten de bronmap. Als u de functie 'Originele bestanden vervangen' wilt gebruiken, selecteert u een doelmap die niet gelijk is aan of binnen de bronmap en vinkt u het selectievakje 'Originele bestanden altijd vervangen' aan in het gedeelte 'Geavanceerde instellingen'. . Schakel het tijdelijke selectievakje 'Tijdelijke conversiemap' uit, omdat dit in dit geval geen nut heeft. Bestanden worden geconverteerd naar de doelmap en vervolgens teruggeplaatst in de bronmap.",
    "Destination folder": "Doelmap",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "die voorkomen dat HBBatchBeast correct werkt. Wijzig de doelmap naar een map buiten de bronmap. Als u de functie 'Originele bestanden vervangen' wilt gebruiken, selecteert u een doelmap die niet gelijk is aan of binnen de bronmap en vinkt u het selectievakje 'Originele bestanden altijd vervangen' aan in het gedeelte 'Geavanceerde instellingen'. . Schakel het tijdelijke selectievakje 'Tijdelijke conversiemap' uit, omdat dit in dit geval geen nut heeft. Bestanden worden geconverteerd naar de doelmap en vervolgens teruggeplaatst in de bronmap.",
    "Error creating temporary conversion folder": "Fout bij aanmaken tijdelijke conversiemap",
    "Error creating destination folder": "Fout bij het maken van de doelmap",
    "Please select to use HandBrake or FFmpeg!": "Selecteer alstublieft HandBrake of FFmpeg!",
    "Please select a standard preset or input a custom one!": "Selecteer een standaardvoorinstelling of voer een aangepaste in!",
    "Please select a scan interval of 5 seconds or greater!": "Selecteer een scaninterval van 5 seconden of meer!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Zorg ervoor dat het aantal gelijktijdige HandBrake / FFmpeg-instanties één of meer is!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Ongeldige API-sleutel! Klik op 'Nieuw' op het tabblad voor externe controle om een nieuwe sleutel te genereren.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Voer een dagelijkse scantijd in in 24-uursformaat: uu: mm (bijvoorbeeld 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "BRONBESTANDEN ZAL NA CONVERSIE WORDEN VERWIJDERD! Test alstublieft voor het juiste gebruik!",
    "Benchmark failed!": "Benchmark mislukt!",
    "Log does not exist!": "Log bestaat niet!",
    "Folder does not exist!": "Folder bestaat niet!",
    "Error sending email! Please check your settings.": "Fout bij verzenden van e-mail! Controleer uw instellingen.",
    "Test email sent!": "Test e-mail verzonden!",
    "All worker processes have been stopped.": "Alle werkprocessen zijn gestopt.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "De wachtrij wordt gepauzeerd zodra de huidige items zijn verwerkt. Weet je zeker dat je de wachtrij wilt pauzeren?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Wachtrij pauze gestart. De knop 'Doorgaan' wordt weergegeven als alle werknemers zijn onderbroken.",
    "Healthy file cache cleared!": "Gezonde bestandscache gewist!",
    "Cache cleared!": "Cache gewist!",
    "Cancel item": "Annuleer item",
    "Please check the above checkbox to use this feature.": "Vink het bovenstaande selectievakje aan om deze functie te gebruiken.",
    "Configuration": "Configuratie",
    "Source folders": "Bronmappen",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Dit is de bronmap die voor media wordt gescand. De map moet worden ingevoerd zonder een schuine streep achter te laten. Bijvoorbeeld:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Het pad van de bronmap is uitbreidbaar (druk op Enter om een nieuwe regel te maken). Als u meerdere bronmappen wilt opgeven, moet u ervoor zorgen dat elk pad van de bronmap op een eigen regel staat, zoals:",
    "Video health check": "Video health check",
    "Batch conversion and Folder watching": "Batch-conversie en map kijken",
    "Remote Monitoring (Beta)": "Remote Monitoring (Beta)",
    "Benchmark (Beta)": "Benchmark (bèta)",
    "System": "Systeem",
    "Help": "Helpen",
    "Temporary conversion folders": "Tijdelijke conversiemappen",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Als \"Tijdelijke conversiemap?\" is aangevinkt, dan zal HandBrake bestanden naar die map converteren. Zodra de conversie is voltooid, wordt het bestand naar uw \"bestemmingsmap\" verplaatst. U moet zoveel tijdelijke conversiemappen als bronmappen opgeven. Uw eerste bronmap wordt geconverteerd naar uw eerste tijdelijke conversiemap, uw tweede bronmap naar uw tweede tijdelijke conversiemap, enzovoort. Zorg ervoor dat elk tijdelijk conversiemappad op een eigen regel staat.",
    "Destination folders": "Bestemmingsmappen",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Geef de paden van de doelmap op. Nogmaals, u moet zoveel bestemmingsmappen opgeven als bronmappen. Bestanden uit uw eerste bronmap komen terecht in uw eerste doelmap, uw tweede bronmapbestanden in uw tweede doelmap enzovoort.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Eerste bronmap ---------> Eerste tijdelijke conversiemap ---------> Eerste doelmap",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Tweede bronmap ---------> Tweede tijdelijke conversiemap ---------> Tweede doelmap",
    "etc": "enz",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast zal niet goed werken als u de bestemmingsmap instelt op dezelfde manier als of binnen de bronmap.",
    "Standard preset:": "Standaard preset:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Selecteer de HandBrake-voorinstelling waarmee u uw bestanden wilt converteren. Als \"Standaardvoorinstelling\" is geselecteerd, worden alle bestanden in de geselecteerde mappen geconverteerd met de opgegeven HandBrake-voorinstelling. U kunt hier meer informatie vinden over handreminstellingen:",
    "Custom preset:": "Aangepaste preset:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Als u \"Aangepaste voorinstelling\" gebruikt, moet u uw eigen aangepaste voorinstelling invoeren. HBBatchBeast behandelt het \"HandBrakeCLI -i bron -o bestemming\" -gedeelte van de HandBrakeCLI-invoer, dus u moet de conversieparameters invoeren. Bijvoorbeeld:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Als u FFmpeg gebruikt, moet u de invoer- en uitvoerparameters scheiden met een komma. Zoals:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "U kunt ook een koppeling maken naar een aangepaste voorinstelling die is geëxporteerd uit de officiële HandBrake GUI-toepassing, bijvoorbeeld:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Als u problemen ondervindt met aangepaste presets, kan dit te wijten zijn aan een bekende bug met de HandBrakeCLI (wordt in de volgende release van HandBrakeCLI opgelost). Zie dit voor een tijdelijke oplossing:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Elke aangepaste voorinstelling moet op een eigen regel staan en, net als de mappen, moeten er evenveel aangepaste voorinstellingen zijn als bronmappen.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Eerste bronmap ---------> Eerste tijdelijke conversiemap ---------> Eerste doelmap @ Eigen voorinstelling 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Tweede bronmap ---------> Tweede tijdelijke conversiemap ---------> Tweede doelmap @ Eigen voorinstelling 2",
    "See the following image for guidance:": "Zie de volgende afbeelding voor hulp:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Als u grafische kaartcodering gebruikt (zoals NVENC), moet u mogelijk het aantal HandBrake-exemplaren verminderen (probeer 2 of minder) vanwege VRAM-beperkingen.",
    "Select standard preset:": "Selecteer standaard preset:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC gedetecteerd, zorg ervoor dat het aantal HandBrakeCLI-instanties is verlaagd naar 2 of lager (voor de meeste grafische kaarten) of er kunnen fouten optreden vanwege onvoldoende VRAM. Deze instelling is te vinden op het tabblad \"Systeem\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Geïmporteerd voorinstelling gedetecteerd. Als u problemen ondervindt met geïmporteerde aangepaste voorinstellingen, kan dit te wijten zijn aan een bekende bug met de HandBrakeCLI (wordt in de volgende HandBrakeCLI-release opgelost). Een tijdelijke oplossing is om '\"PictureRotate\": \"0: 0\"' uit het .json-bestand te verwijderen. Meer info hier:",
    "Container:": "Houder:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Geef de container op die u wilt dat het uitvoerbestand heeft, zoals '.mp4'. U kunt meer informatie vinden over containers op:",
    "Enable periodic scanning:": "Periodiek scannen inschakelen:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast kan uw bronmappen controleren en scans uitvoeren voor nieuwe bestanden met een opgegeven interval. De intervaltijd is in seconden met een standaardwaarde van 300 seconden (5 minuten). Als deze optie is geselecteerd, zal het programma, wanneer u op \"Scannen en converteren\" drukt, alle nieuwe bestanden converteren en zal een afteltimer beginnen. Dit zal oneindig lus totdat gestopt. Het scaninterval bevindt zich in het gedeelte met geavanceerde instellingen.",
    "Enable daily scanning:": "Schakel dagelijks scannen in:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "In plaats van periodiek scannen, kunt u kiezen voor een scan die eenmaal per dag wordt uitgevoerd. De scantijd wordt ingevoerd in het gedeelte geavanceerde instellingen in uu: mm-indeling zoals '18: 30 '. Nadat \"Scannen en converteren\" is geselecteerd, wacht het programma tot de aangegeven tijd totdat een scan- en conversieproces wordt uitgevoerd. Nogmaals, dit zal oneindig lus totdat gestopt.",
    "Show/hide advanced:": "Toon / verberg geavanceerd:",
    "Scan interval (minimum 5 seconds):": "Scaninterval (minimaal 5 seconden):",
    "Daily run time (hh:mm):": "Dagelijkse looptijd (uu: mm):",
    "Output filename suffix:": "Achtervoegsel uitvoerbestandsnaam:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Dit is optioneel. U kunt een achtervoegsel opgeven om toe te voegen aan het einde van uw bestandsnaam, zoals '_1080p' of '_testconversion', enzovoort.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Als 'standaardvoorinstelling' is geselecteerd, hebben alle uitvoerbestanden hetzelfde achtervoegsel.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Als 'aangepaste voorinstelling' is geselecteerd, kunt u één achtervoegsel opgeven per bronmap / aangepaste voorinstelling. Zorg ervoor dat elk achtervoegsel op een eigen regel staat. Als u bijvoorbeeld twee bronmappen hebt en 'aangepaste voorinstelling' gebruikt, kunt u dit in het vak achtervoegsel bestandsnaame plaatsen:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Bestanden in de eerste bronmap hebben '_720p' toegevoegd aan de bestandsnaam van de uitvoer. Bestanden in de tweede bronmap hebben '_1080p' toegevoegd aan de bestandsnaam van de uitvoer, etc.",
    "Include these file types:": "Neem deze bestandstypen op:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Voer de bestandstypen in die moeten worden gescand. Elk type moet worden gescheiden door een komma. Het standaarditem is:",
    "Exclude files smaller than (MB):": "Bestanden uitsluiten die kleiner zijn dan (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Geef op of bestanden die kleiner zijn dan een bepaald formaat moeten worden uitgesloten van conversie (in megabytes)",
    "Exclude files larger than (MB):": "Exclusief bestanden groter dan (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Opgeven of bestanden groter dan een bepaalde grootte moeten worden uitgesloten van conversie (in megabytes)",
    "Exclude filenames which include any of these words:": "Sluit bestandsnamen uit die een van deze woorden bevatten:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Voer trefwoorden in die moeten worden uitgefilterd bij het scannen naar bestanden. Als bijvoorbeeld \"720p\" wordt ingevoerd, worden alle bestanden met \"720p\" in de titel niet geconverteerd. Nogmaals, zoekwoorden moeten worden gescheiden door een komma. Voer bijvoorbeeld het volgende in het filtervak in:",
    "Include files with any ": "Bestanden opnemen met elke",
    " or all ": "of allemaal",
    " of these": "van deze",
    "properties:": "eigenschappen:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Hier kunt u de video- en audio-eigenschappen invoeren die bestanden nodig hebben om geconverteerd te kunnen worden (info geëxtraheerd met behulp van FFprobe). De eigenschappen moeten worden gescheiden door een komma. Gebruik de viewer voor mediagegevens om te bepalen welke eigenschappen u wilt opnemen. Zorg ervoor dat u een komma plaatst na de laatste eigenschap. Als u bijvoorbeeld alleen bestanden wilt converteren die zijn gecodeerd met h264 en aac-stereogeluid:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Het is vermeldenswaard dat deze eigenschapcheck wordt uitgevoerd zodra het conversieproces start (om tijd te besparen tijdens het bouwen van de wachtrij), dus hoewel bestanden in de conversiewachtrij kunnen verschijnen, zullen ze worden overgeslagen / opgenomen als aan de juiste voorwaarden wordt voldaan.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Als FFprobe eigenschappen kan extraheren, verschijnt een 'OK' in de kolom 'FFprobe' in de wachtrijweergave.",
    "Exclude files with any ": "Bestanden uitsluiten met om het even welk",
    " of these ": "van deze",
    "The opposite of 'Include files with any or all of these properties'": "Het tegenovergestelde van 'bestanden opnemen met een of al deze eigenschappen'",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Dit is een klein hulpmiddel om bestandseigenschappen te analyseren om u te helpen bepalen welke eigenschappen u wilt opnemen / uitsluiten in de bovenstaande opties. Het gebruikt FFprobe om informatie terug te sturen. Sleep bestanden naar het grijze vak om ze te analyseren. Als u bijvoorbeeld in een testbestand slaagt, wordt mogelijk het volgende geretourneerd:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Als u wilt voorkomen dat bestanden zoals deze worden geconverteerd, kunt u verschillende bestandseigenschappen in het vakje \"Bestanden uitsluiten met een of al deze eigenschappen\" plaatsen en het selectievakje naast 'alles' in plaats van 'geen' aanvinken. zoals zo:",
    "Copy excluded files to destination:": "Kopieer uitgesloten bestanden naar bestemming:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Als u deze optie selecteert, worden bestanden die zijn uitgesloten van conversie rechtstreeks naar de doelmap gekopieerd. Dit geldt voor de volgende filters:",
    "Exclude filenames which include any of these words": "Sluit bestandsnamen uit die een van deze woorden bevatten",
    "Include files with any or all of these properties": "Voeg bestanden toe met een of alle van deze eigenschappen",
    "Exclude files with any or all of these properties": "Sluit bestanden uit met een of alle van deze eigenschappen",
    "Exclude files smaller than (MB)": "Bestanden uitsluiten die kleiner zijn dan (MB)",
    "Exclude files larger than (MB)": "Bestanden uitsluiten die groter zijn dan (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Merk op dat dit ook geldt voor bestanden die zijn uitgesloten omdat ze niet voldoen aan de voorwaarden voor het opnemen van de bovenstaande voorwaarden, dus kopieer niet per ongeluk je hele bibliotheek wanneer je maar een paar bestanden probeert te converteren.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "De kopieerfunctie is niet van toepassing op de volgende filters (dwz bestanden die zijn uitgesloten vanwege het filter)",
    "Include these file types": "Neem deze bestandstypen op",
    "Delete source files after conversion:": "Verwijder bronbestanden na de conversie:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Als dit is geselecteerd, wordt het bronbestand verwijderd als een conversiepoging is gelukt. Dit proces wordt helemaal aan het einde van de conversie van alle bestanden uitgevoerd. Dit betekent dat je dezelfde bronbestanden met meerdere presets kunt converteren, alles in één keer. De bronbestanden worden daarna verwijderd.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Vervang origineel bestand als geconverteerd bestand kleiner is? (Comprimeer poging)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Schakel dit selectievakje in als u wilt dat HBBatchBeast automatisch het originele bronbestand vervangt als het nieuwe bestand kleiner is. Als het nieuwe bestand niet kleiner is, blijft het in de doelmap staan.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Zorg ervoor dat uw bestemmingsmap niet dezelfde is als / of in uw bronmap, anders werkt deze niet correct.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Nadat HBBatchBeast heeft geprobeerd een specifiek bestand te comprimeren, wordt dat bestandspad toegevoegd aan een cache zodat dit in de toekomst niet meer zal worden geprobeerd. U kunt de cache bekijken / bewerken / wissen met de gele knoppen.",
    "Replace original file always?": "Vervang het originele bestand altijd?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Het originele bestand wordt vervangen, ongeacht of het nieuwe bestand groter of kleiner is.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Nogmaals, zorg ervoor dat uw bestemmingsmap niet hetzelfde is als / of in uw bronmap, anders werkt deze niet goed.",
    "Copy subtitle (srt) files to destination?": "Ondertiteling (srt) bestanden naar bestemming kopiëren?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Ondertitels '.srt'-bestanden worden automatisch naar de doelmap gekopieerd.",
    "Automatically create temporary/destination folders if they don't exist?": "Automatisch tijdelijke / bestemmingsmappen maken als deze niet bestaan?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Aangepast bat-pad om na elke conversie uit te voeren (laat blanco indien niet gebruikt):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Voer het pad in naar een aangepast batchbestand dat u na elke conversie wilt uitvoeren. Bijvoorbeeld:",
    "Batch files with timeout statements won't work. More info here:": "Batchbestanden met timeout-instructies werken niet. Meer info hier:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Laat het vakje leeg als u deze optie niet wilt gebruiken (let op dat er geen verborgen tekens in de doos zitten)",
    "Run processes at low priority?": "Processen met lage prioriteit uitvoeren?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Alle conversieprocessen worden op een lage prioriteit uitgevoerd, waardoor het processorgebruik wordt verminderd.",
    "Remove apostrophes from filenames:": "Verwijder apostrofs uit bestandsnamen:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Conversies / gezondheidscheckscans kunnen mislukken als bestandsnamen apostrofs bevatten. Selecteer dit om automatisch apostrofs uit bestandsnamen te verwijderen.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Deze functie kan naar corrupte videobestanden zoeken met de '--scan'-functie van HandBrake, hoewel dit niet altijd correct is. Het gebruikt ook FFprobe om een tweede referentiepunt te bieden. Als zowel FFprobe als HandBrake falen, is er een grote kans dat het bestand corrupt is.",
    "Move corrupt files into the following folder:": "Verplaats corrupte bestanden naar de volgende map:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Indien aangevinkt, worden alle bestanden die fouten geven verplaatst naar de opgegeven map.",
    "Corrupt file folder:": "Corrupte bestandsmap:",
    "Run thorough file health check:": "Voer een grondige controle van de bestandsgezondheid uit:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Indien aangevinkt, zal een veel langzamere, meer grondige video-gezondheidscontrole worden uitgevoerd met behulp van FFmpeg in plaats van HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Gebaseerd op Desani's 'ScanMedia.ps1' gevonden op:",
    "Attempt to repair files after thorough check:": "Poging om bestanden te herstellen na grondige controle:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Indien ingeschakeld, probeert HBBatchBeast bestanden te herstellen met FFmpeg. Een nieuw bestand met het achtervoegsel '_repaired' wordt gemaakt in dezelfde map als het bronbestand.",
    "'CRF' value to use when attempting to repair files:": "'CRF'-waarde die moet worden gebruikt bij het herstellen van bestanden:",
    "The default 'CRF' value is 23. Please see the following for more information:": "De standaardwaarde voor 'CRF' is 23. Raadpleeg het volgende voor meer informatie:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Het bereik van de CRF-schaal is 0-51, waarbij 0 verliesloos is, 23 de standaardwaarde is en 51 de slechtste kwaliteit mogelijk. Een lagere waarde leidt over het algemeen tot een hogere kwaliteit en een subjectief gezond bereik is 17-28. Beschouw 17 of 18 als visueel verliesvrij of bijna als; het moet er hetzelfde of bijna hetzelfde uitzien als de invoer, maar het is technisch gezien geen verlies.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast slaat een lijst met gescande bestandspaden op die als niet-corrupt zijn gerapporteerd. Wis de cache om een nieuwe scan uit te voeren op alle bestanden.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Aantal te gebruiken HandBrake / FFmpeg-instanties tegelijk (aanbevolen 4 of minder):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Deze instelling is van toepassing op zowel de \"Video health check\" en \"Scan and convert\" -processen. Geef op hoeveel Handrem-draden moeten worden gebruikt. Er is geen maximum, hoewel het wordt aanbevolen om niet meer dan 4 te gebruiken. Een hoger aantal kan uw computer bevriezen als deze niet erg krachtig is.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Weergave limiet wachtrijgrootte (aanbevolen 1000 of minder):",
    "Automatically start \"Scan and convert\" when program opened?": "Start automatisch \"Scannen en converteren\" wanneer het programma wordt geopend?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Vul e-mailgegevens in om e-mailmeldingen te ontvangen als een fout wordt aangetroffen tijdens een statuscontrole of conversie / mapweergave. Werkt niet met accounts waarvoor 2FA nodig is. U moet toegang tot minder goed beveiligde apps in Gmail-accounts inschakelen.",
    "Email address:": "E-mailadres:",
    "For example:": "Bijvoorbeeld:",
    "Email password(not saved):": "E-mail wachtwoord (niet opgeslagen):",
    "SMTP server:": "SMTP-server:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Met deze functie kunt u de conversie / status van de status controleren met elke webbrowser. Handig bij het uitvoeren van servers etc.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Indien ingeschakeld, worden de volgende anonieme gegevens verzonden naar HBBatchBeast.io:",
    "API key": "API sleutel",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Huidige status ('Zoeken', 'Bezig met lopen', 'Klaar', enz.)",
    "Number of:": "Aantal:",
    "Remaining items": "Overige voorwerpen",
    "Successful items": "Succesvolle artikelen",
    "Errored items": "Foutieve items",
    "Cancelled items": "Geannuleerde items",
    "Worker percentages": "Arbeiderspercentages",
    "Last completed item time": "Laatst voltooide itemtijd",
    "Enable remote monitoring?:": "Bewaking op afstand inschakelen ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Een standaard benchmark-hulpprogramma dat voornamelijk is gebouwd om te zien hoe 16+ kernprocessors presteren met behulp van meerdere HandBrake-exemplaren, hoewel het op elk type processor kan worden uitgevoerd.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Hiermee downloadt u een h265 4k-voorbeeldbestand (2,5 MB) en voert u een benchmark uit met 4 HandBrake-exemplaren met vooraf ingestelde \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "De resultaten kunnen naar hbbatchbeast.io worden geüpload als u ervoor kiest.",
    "Queue": "Wachtrij",
    "Output this session": "Uitvoer van deze sessie",
    "Media info viewer tool": "Media info kijker tool",
    "View compress attempt cache": "Bekijk comprimeerpoging cache",
    "Clear compress attempt cache": "Wis de cache van de compressiepoging",
    "Save config": "Sla config",
    "Scan only": "Alleen scannen",
    "Scan and convert": "Scannen en converteren",
    "View scan/conversion summary log": "Bekijk overzicht van scan- / conversiesamenvatting",
    "View individual file check/conversion log": "Bekijk individueel bestand controle / conversie log",
    "View worker console output": "Bekijk de uitvoer van de werknemersconsole",
    "Health check": "Gezondheids controle",
    "Clear healthy file cache": "Wis gezond bestand cache",
    "View error log": "Bekijk foutenlogboek",
    "Email test": "E-mailtest",
    "View master log": "Bekijk hoofdlog",
    "Wiki help": "Wiki-help",
    "An application by HaveAGitGat": "Een applicatie van HaveAGitGat",
    "New": "nieuwe",
    "Launch": "Lancering",
    "Benchmark": "criterium",
    "See results": "Zie resultaten",
    "Pause queue": "Pauzeer rij",
    "Continue queue": "Doorgaan wachtrij",
    "Stop queue": "Stop wachtrij",
    "Convert selected files": "Converteer geselecteerde bestanden",
    "Toggle queue view": "Wisselwachtrijweergave",
    "Deselect all": "Deselecteer alles",
    "Invert all": "Alles omkeren",
    "Select all": "Selecteer alles",
    "Toggle output view": "Uitgangsweergave omschakelen"
}