{
    "The number of custom presets does not match the number of source folders!": "Antallet tilpassede forhåndsinnstillinger stemmer ikke overens med antall kildemapper!",
    "source folders have been detected.": "kildemapper er blitt oppdaget.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "Tilpassede forhåndsinnstilte linjer har blitt oppdaget. Vennligst dobbeltklikk for usynlige linjeskift. Det bør være en mappebane eller forhåndsinnstilt per linje. Pass på at du ikke har tilfeldigvis opprettet en tom linje.",
    "The number of filename suffixes does not match the number of source folders! ": "Antall filnavn suffikser stemmer ikke overens med antall kildemapper!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "filnavn suffiks linjer har blitt oppdaget. Vennligst dobbeltklikk for usynlige linjeskift. Det bør være en mappebane eller et filnavn-suffiks per linje. Pass på at du ikke har tilfeldigvis opprettet en tom linje.",
    "The number of source folders does not match the number of destination folders!": "Antall kildemapper samsvarer ikke med antall destinasjonsmapper!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "Destinasjonsmapper er blitt oppdaget. Vennligst dobbeltklikk for usynlige linjeskift. Det bør være en mappebane per linje. Pass på at du ikke har tilfeldigvis opprettet en tom linje.",
    "The number of source folders does not match the number of temporary conversion folders!": "Antall kildemapper samsvarer ikke med antall midlertidige konverteringsmapper!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "midlertidige konverteringsmapper er blitt oppdaget. Vennligst dobbeltklikk for usynlige linjeskift. Det bør være en mappebane per linje. Pass på at du ikke har tilfeldigvis opprettet en tom linje.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Vennligst skriv inn en gyldig container som '.mp4'. Pass på at du inkluderer \".\"",
    "Corrupt file folder": "Korrupt filmappe",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "eksisterer ikke! Sørg for at det ikke er mellomrom eller skjulte tegn før / etter banen",
    "Source folder": "Kilde mappe",
    "Temporary conversion folder": "Midlertidig konverteringsmappe",
    "appears to be the same as or is within source folder": "ser ut til å være det samme som eller er innenfor kildemappen",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "som forhindrer HBBatchBeast i å fungere riktig. Vennligst endre den midlertidige konverteringsmappen til en mappe utenfor kildemappen. Hvis du vil bruke funksjonen \"Erstatt originalfiler\", velg en destinasjonsmappe som ikke er den samme som eller i kildemappen, og merk av for «Erstatt originalfiler alltid» i avanserte innstillinger . Fjern merket for den midlertidige «Midlertidig konverteringsmappe» -kassen, da den ikke vil brukes i dette tilfellet. Filer blir konvertert til målmappen og deretter flyttet tilbake til kildemappen.",
    "Destination folder": "Målmappen",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "som forhindrer HBBatchBeast i å fungere riktig. Vennligst endre destinasjonsmappen til en mappe utenfor kildemappen. Hvis du vil bruke funksjonen \"Erstatt originalfiler\", velg en destinasjonsmappe som ikke er den samme som eller i kildemappen, og merk av for «Erstatt originalfiler alltid» i avanserte innstillinger . Fjern merket for den midlertidige «Midlertidig konverteringsmappe» -kassen, da den ikke vil brukes i dette tilfellet. Filer blir konvertert til målmappen og deretter flyttet tilbake til kildemappen.",
    "Error creating temporary conversion folder": "Feil ved oppretting av midlertidig konverteringsmappe",
    "Error creating destination folder": "Feil ved oppretting av målmappe",
    "Please select to use HandBrake or FFmpeg!": "Vennligst velg å bruke HandBrake eller FFmpeg!",
    "Please select a standard preset or input a custom one!": "Vennligst velg en standard forhåndsinnstilling eller skriv inn en egendefinert!",
    "Please select a scan interval of 5 seconds or greater!": "Vennligst velg et skanneintervall på 5 sekunder eller mer!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Vennligst kontroller at antall samtidige HandBrake / FFmpeg-instanser som skal brukes, er en eller flere!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Ugyldig API-nøkkel! Vennligst klikk \"Ny\" på fjernkontrollen for å generere en ny nøkkel.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Vennligst skriv inn en daglig skannetid i 24-timers format: hh: mm (for eksempel 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "KILDEFILER SKAL SLETTES ETTER KONVERSJON! Vennligst test før du bruker den!",
    "Benchmark failed!": "Benchmark mislyktes!",
    "Log does not exist!": "Loggen eksisterer ikke!",
    "Folder does not exist!": "Mappe eksisterer ikke!",
    "Error sending email! Please check your settings.": "Feil ved sending av e-post! Vennligst sjekk innstillingene dine.",
    "Test email sent!": "Test e-post sendt!",
    "All worker processes have been stopped.": "Alle arbeiderprosesser er stoppet.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Køen blir satt på pause når nåværende elementer er ferdigbehandlet. Er du sikker på at du vil sette køen på pause?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Køpause startet. Fortsett-knappen vises når alle arbeidstakere har stanset.",
    "Healthy file cache cleared!": "Sunn fil cache ryddet!",
    "Cache cleared!": "Cache ryddet!",
    "Cancel item": "Avbryt elementet",
    "Please check the above checkbox to use this feature.": "Vennligst sjekk boksen ovenfor for å bruke denne funksjonen.",
    "Configuration": "konfigurasjon",
    "Source folders": "Kildemapper",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Dette er kildemappen som skal skannes for media. Mappen må skrives inn uten slash. For eksempel:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Kildemappen sti boksen er utvidbar (trykk enter for å lage en ny linje). Hvis du vil angi flere kildemapper, må du kontrollere at hver kildemappebane er på egen linje, for eksempel:",
    "Video health check": "Video helsekontroll",
    "Batch conversion and Folder watching": "Batch konvertering og mappe watching",
    "Remote Monitoring (Beta)": "Fjernovervåkning (Beta)",
    "Benchmark (Beta)": "Benchmark (Beta)",
    "System": "System",
    "Help": "Hjelp",
    "Temporary conversion folders": "Midlertidige konverteringsmapper",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Hvis \"Midlertidig konverteringsmappe?\" er merket, vil HandBrake konvertere filer til den mappen. Når konverteringen er ferdig, blir filen flyttet til \"Destinasjonsmappen\". Du må angi så mange midlertidige konverteringsmapper som kildemapper. Din første kildemappe blir konvertert til din første midlertidige konverteringsmappe, den andre kildemappen din til den andre midlertidige konverteringsmappen og så videre. Pass på at hver midlertidige konverteringsmappebane er på egen linje.",
    "Destination folders": "Destinasjonsmapper",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Angi destinasjonsmappebaner. Igjen må du angi så mange destinasjonsmapper som kildemapper. Filer fra din første kildemappe vil ende opp i den første destinasjonsmappen din, andre kildemappefiler i den andre destinasjonsmappen din og så videre.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Første kildemappe ---------> Første midlertidig konverteringsmappe ---------> Første destinasjonsmappe",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Andre kildemappe ---------> Andre midlertidige konverteringsmappe ---------> Andre destinasjonsmappe",
    "etc": "etc",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast virker ikke riktig hvis du angir målmappen det samme som, eller innenfor, kildemappen.",
    "Standard preset:": "Standard forhåndsinnstilling:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Velg HandBrake-forhåndsinnstillingen du vil konvertere filene dine med. Hvis \"Standard forhåndsinnstilling\" er valgt, blir alle filer i de valgte mappene konvertert ved hjelp av den angitte håndbremsinnstillingen. Du finner mer om HandBrake-forhåndsinnstillinger her:",
    "Custom preset:": "Tilpasset forhåndsinnstilling:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Hvis \"Egendefinert forhåndsinnstilling\" må du angi din egen forhåndsinnstilte forhåndsinnstilling. HBBatchBeast dekker \"HandBrakeCLI -i source -o destinasjon\" -delen av HandBrakeCLI-inngangen, så du må angi konverteringsparametrene. For eksempel:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Hvis du bruker FFmpeg, må du skille inngangs- og utgangsparametrene med et komma. Som for eksempel:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Du kan også koble til et egendefinert forhåndsinnstilling som er eksportert fra det offisielle HandBrake GUI-programmet for eksempel:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Hvis du har problemer med tilpassede forhåndsinnstillinger, kan det skyldes en kjent feil med HandBrakeCLI (vil bli løst i neste HandBrakeCLI-utgivelse). Vennligst se dette for en midlertidig løsning:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Hver tilpasset forhåndsinnstilling må være på sin egen linje, og det må likevel være så mange egendefinerte forhåndsinnstillinger som kildemapper.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Første kildemappe ---------> Første midlertidig konverteringsmappe ---------> Første destinasjonsmappe @ Tilpasset forhåndsinnstilling 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Andre kildemappe ---------> Andre midlertidige konverteringsmappe ---------> Andre destinasjonsmappe @ Tilpasset forhåndsinnstilling 2",
    "See the following image for guidance:": "Se følgende bilde for veiledning:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Hvis du bruker grafikkortkoding (for eksempel NVENC), må du kanskje redusere antall HandBrake-forekomster (prøv 2 eller færre) på grunn av VRAM-begrensninger.",
    "Select standard preset:": "Velg standard forhåndsinnstilling:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC oppdaget, vær så snill å redusere antall HandBrakeCLI-forekomster til 2 eller under (for de fleste grafikkort), eller du kan støte på feil på grunn av ikke nok VRAM. Denne innstillingen finnes i kategorien \"System\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Importert forhåndsinnstilt detected.If du har problemer med importerte egendefinerte forhåndsinnstillinger, kan det skyldes en kjent feil med HandBrakeCLI (vil bli løst i neste HandBrakeCLI-utgivelse). En midlertidig løsning er å fjerne \"\" PictureRotate \":\" 0: 0 \"'fra .json-filen. Mer info her:",
    "Container:": "Container:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Angi beholderen du vil ha utdatafilen til, for eksempel '.mp4'. Du kan finne ut mer om containere på:",
    "Enable periodic scanning:": "Aktiver periodisk skanning:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast kan overvåke kildemappene dine og kjøre skanninger for nye filer ved et spesifisert intervall. Intervalltiden er i sekunder med standardinnstillingen som 300 sekunder (5 minutter). Hvis dette alternativet er valgt, så vil programmet konvertere nye filer når du trykker på \"Skann og konverter\", og deretter begynner en nedtellingstimer. Dette slår uendelig til det stoppes. Skanneintervallet er i avanserte innstillinger-delen.",
    "Enable daily scanning:": "Aktiver daglig skanning:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "I stedet for periodisk skanning kan du velge at en skanning skal kjøres en gang om dagen. Skannetiden er angitt i avanserte innstillinger i hh: mm-format, for eksempel '18: 30 '. Når \"Skann og konverter\" er valgt, venter programmet til den angitte tiden til du kjører en skanne- og konverteringsprosess. Igjen, dette vil sløyfe uendelig til stoppet.",
    "Show/hide advanced:": "Vis / skjul avansert:",
    "Scan interval (minimum 5 seconds):": "Skanneintervall (minimum 5 sekunder):",
    "Daily run time (hh:mm):": "Daglig kjøretid (hh: mm):",
    "Output filename suffix:": "Utgang filnavn suffiks:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Dette er valgfritt. Du kan angi et suffiks som skal legges til slutten av filnavnet ditt som '_1080p' eller '_testconversion' etc.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Hvis \"standard forhåndsinnstilt\" er valgt, vil alle utdatafiler ha samme suffiks.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Hvis 'tilpasset forhåndsinnstilling' er valgt, kan du angi et suffiks per kildemappe / egendefinert forhåndsinnstilling. Pass på at hvert suffiks er på egen linje. Hvis du for eksempel har 2 kildemapper og bruker 'egendefinert forhåndsinnstilt', kan du sette dette i filnavn-suffiks-boksen:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Filer i den første kildemappen vil ha '_720p' lagt til til filnavn. Filer i den andre kildemappen vil ha '_1080p' lagt til for å gi ut filnavn etc.",
    "Include these file types:": "Inkluder disse filtyper:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Skriv inn filtyper som skal skannes etter. Hver type må skilles med et komma. Standardoppføringen er:",
    "Exclude files smaller than (MB):": "Ekskluder filer som er mindre enn (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Angi om du vil ekskludere filer som er mindre enn en bestemt størrelse fra konvertering (i megabyte)",
    "Exclude files larger than (MB):": "Ekskluder filer som er større enn (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Angi om du vil ekskludere filer som er større enn en bestemt størrelse fra konvertering (i megabyte)",
    "Exclude filenames which include any of these words:": "Ekskluder filnavn som inneholder noen av disse ordene:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Skriv inn søkeord som skal filtreres ut når du søker etter filer. For eksempel, hvis \"720p\" er oppgitt, blir ikke noen filer med \"720p\" i tittelen konvertert. Igjen, søkeord må skilles med et komma. For eksempel, skriv inn følgende i filterboksen:",
    "Include files with any ": "Inkluder filer med noen",
    " or all ": "eller alle",
    " of these": "av disse",
    "properties:": "eiendommer:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Her kan du legge inn video- og lydegenskaper som filer må ha for å kunne konverteres (info hentet med FFprobe). Egenskapene må skilles med et komma. Bruk medieinfovisningsverktøyet til å avgjøre hvilke egenskaper du vil inkludere. Pass på at du legger et komma etter den siste egenskapen. For eksempel kan du kun konvertere filer som er kodet ved hjelp av h264 og aac stereo lyd:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Det er verdt å merke seg at denne egenskapskontrollen er gjort når konverteringsprosessen starter (for å spare tid mens du bygger køen), så selv om filer kan vises i konverteringskøen, blir de hoppet over / inkludert hvis de riktige betingelsene er oppfylt.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Hvis FFprobe er i stand til å trekke ut egenskaper, vises en \"OK\" i kolonnen \"FFprobe\" i køvisningen.",
    "Exclude files with any ": "Ekskluder filer med noen",
    " of these ": "av disse",
    "The opposite of 'Include files with any or all of these properties'": "Det motsatte av 'Inkluder filer med noen eller alle disse egenskapene'",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Dette er et lite verktøy for å analysere filegenskaper med for å hjelpe deg med å finne ut hvilke egenskaper du vil inkludere / ekskludere i alternativene ovenfor. Det bruker FFprobe å returnere informasjon. Dra og slipp filer i den grå boksen for å analysere dem. For eksempel kan slippe i en testfil returnere følgende:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Hvis du ønsker å ekskludere filer som dette fra å bli konvertert, kan du sette flere filegenskaper i boksen \"Ekskluder filer med noen eller alle disse egenskapene\" og merk av i boksen ved siden av \"alle\" i stedet for \"noen\" som så:",
    "Copy excluded files to destination:": "Kopier ekskluderte filer til destinasjon:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Hvis du velger dette alternativet, kopieres filer som er ekskludert fra konvertering direkte til målmappen. Dette gjelder for følgende filtre:",
    "Exclude filenames which include any of these words": "Ekskluder filnavn som inneholder noen av disse ordene",
    "Include files with any or all of these properties": "Inkluder filer med noen eller alle disse egenskapene",
    "Exclude files with any or all of these properties": "Ekskluder filer med noen eller alle disse egenskapene",
    "Exclude files smaller than (MB)": "Ekskluder filer mindre enn (MB)",
    "Exclude files larger than (MB)": "Ekskluder filer som er større enn (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Merk dette gjelder også filer ekskludert fordi de ikke oppfyller eiendomsbetingelsene \"Inkluder\" ovenfor, så ikke tilfeldigvis kopiere hele biblioteket når du bare prøver å konvertere noen få filer.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Kopieringsfunksjonen gjelder ikke for følgende filtre (dvs. filer ekskludert på grunn av filteret)",
    "Include these file types": "Inkluder disse filtyper",
    "Delete source files after conversion:": "Slett kildefiler etter konvertering:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Hvis dette er valgt, vil kildedata slettes hvis et konverteringsforsøk er vellykket. Denne prosessen er ferdig på slutten, etter konvertering av alle filer. Dette betyr at du kan konvertere de samme kildefilene ved hjelp av flere forhåndsinnstillinger, alt på en gang. Kildedataene vil da bli slettet etterpå.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Erstatt originalfil hvis konvertert fil er mindre? (Komprimer forsøk)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Merk av for dette hvis du vil at HBBatchBeast automatisk skal erstatte den opprinnelige kildefilen hvis den nye filen er mindre. Hvis den nye filen ikke er mindre, blir den igjen i målmappen.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Pass på at destinasjonsmappen din ikke er den samme som / eller innenfor, kildemappen din, eller den fungerer ikke som den skal.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Når HBBatchBeast har forsøkt å komprimere en bestemt fil, vil den legge til den filbanen til en cache slik at den ikke blir forsøkt igjen i fremtiden. Du kan vise / redigere / slette hurtigbufferen ved hjelp av de gule knappene.",
    "Replace original file always?": "Erstatt originalfil alltid?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Den opprinnelige filen vil bli erstattet, uansett om den nye filen er større eller mindre.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Igjen, sørg for at destinasjonsmappen din ikke er den samme som / eller innenfor, kildemappen din, eller den fungerer ikke som den skal.",
    "Copy subtitle (srt) files to destination?": "Kopier undertekst (srt) filer til destinasjon?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Subtitle '.srt' -filene kopieres automatisk til målmappen.",
    "Automatically create temporary/destination folders if they don't exist?": "Opprett automatisk midlertidige / destinasjonsmapper hvis de ikke eksisterer?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Tilpasset flaggermus for å kjøre etter hver konvertering (la være tom hvis den ikke brukes):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Skriv inn banen til en egendefinert batchfil som du vil utføre etter hver konvertering. For eksempel:",
    "Batch files with timeout statements won't work. More info here:": "Batchfiler med timeout-setninger virker ikke. Mer info her:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "La boksen være helt tom hvis du ikke vil bruke dette alternativet (pass på at det ikke er skjulte tegn i boksen)",
    "Run processes at low priority?": "Kjør prosesser med lav prioritet?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Alle konverteringsprosesser vil bli kjørt med lav prioritet, noe som reduserer prosessorbruk.",
    "Remove apostrophes from filenames:": "Fjern apostrophes fra filnavn:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Konverteringer / helsekontroll skanninger kan mislykkes hvis filnavn har apostrofer. Kontroller dette for å automatisk fjerne apostrofer fra filnavn.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Denne funksjonen kan skanne etter korrupte videofiler ved hjelp av HandBrake's'scan '-funksjon, selv om dette ikke alltid er korrekt. Den bruker også FFprobe til å gi et annet referansepunkt. Hvis både FFprobe og HandBrake mislykkes, er det stor sjanse for at filen er skadet.",
    "Move corrupt files into the following folder:": "Flytt korrupte filer til følgende mappe:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Hvis det er merket, vil eventuelle filer som gir feil, flyttes til den angitte mappen.",
    "Corrupt file folder:": "Korrupt filmappe:",
    "Run thorough file health check:": "Kjør grundig filhelsekontroll:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Hvis det er merket, vil en mye tregere og grundigere videohelsekontroll bli kjørt ved hjelp av FFmpeg i stedet for HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Basert på Desani's 'ScanMedia.ps1' funnet på:",
    "Attempt to repair files after thorough check:": "Forsøk på å reparere filer etter grundig sjekk:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Hvis det er merket, forsøker HBBatchBeast å reparere filer ved hjelp av FFmpeg. En ny fil med suffikset '_repaired' vil bli opprettet i samme mappe som kildefilen.",
    "'CRF' value to use when attempting to repair files:": "'CRF' verdi som skal brukes når du forsøker å reparere filer:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Standardverdien \"CRF\" er 23. Vennligst se følgende for mer informasjon:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Utvalget av CRF-skalaen er 0-51, hvor 0 er lossless, 23 er standard, og 51 er dårligst mulig. En lavere verdi fører generelt til høyere kvalitet, og et subjektivt sunt område er 17-28. Vurder 17 eller 18 for å være visuelt lossless eller nesten så; det skal se ut som det samme eller nesten det samme som inngangen, men det er ikke teknisk tapt.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast lagrer en liste over skannede filbaner som er rapportert som ukorrekte. Fjern hurtigbufferen for å utføre en fersk skanning på alle filer.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Antall samtidige HandBrake / FFmpeg-forekomster å bruke? (Anbefalt 4 eller færre):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Denne innstillingen gjelder både \"Video helse sjekk\" og \"Skann og konverter\" prosesser. Angi hvor mange HandBrake-tråder som skal brukes. Det er ikke noe maksimum, men det anbefales ikke å bruke mer enn 4. Et høyere beløp kan fryse datamaskinen hvis den ikke er veldig kraftig.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Visningsgrense for køestørrelse? (Anbefalt 1000 eller færre):",
    "Automatically start \"Scan and convert\" when program opened?": "Start automatisk \"Skann og konverter\" når programmet åpnes?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Fyll inn e-postdetaljer for å motta e-postvarsler hvis det oppdages en feil under en helsekontroll eller konvertering / mappvisning. Fungerer ikke med kontoer som krever 2FA. Du må aktivere tilgang til mindre sikre apper på Gmail-kontoer.",
    "Email address:": "Epostadresse:",
    "For example:": "For eksempel:",
    "Email password(not saved):": "E-postpassord (ikke lagret):",
    "SMTP server:": "SMTP-server:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Denne funksjonen tillater overvåking av konvertering / helse sjekk status ved hjelp av en hvilken som helst nettleser. Nyttig når du kjører servere etc.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Hvis aktivert, vil følgende anonyme data bli sendt til HBBatchBeast.io:",
    "API key": "API-nøkkel",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Nåværende status ('Søker', 'Kjører', 'Ferdig' etc)",
    "Number of:": "Antall:",
    "Remaining items": "Resterende gjenstander",
    "Successful items": "Suksessfulle ting",
    "Errored items": "Feilte elementer",
    "Cancelled items": "Avbrutt varer",
    "Worker percentages": "Arbeidsprosent",
    "Last completed item time": "Siste gjennomført varetid",
    "Enable remote monitoring?:": "Aktiver fjernovervåking ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Et grunnleggende benchmarking verktøy bygget hovedsakelig for å se hvordan 16+ kjerneprosessorer utfører bruk av flere HandBrake-forekomster, selv om det kan kjøres på alle typer prosessorer.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Dette vil laste ned en h265 4k-prøvefil (2.5MB) og kjøre et referansemål ved hjelp av 4 HandBrake-forekomster med forhåndsinnstilt \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Resultater kan lastes opp til hbbatchbeast.io hvis du velger.",
    "Queue": "Kø",
    "Output this session": "Utfør denne sesjonen",
    "Media info viewer tool": "Medieinformasjonsvisningsverktøy",
    "View compress attempt cache": "Se komprimere forsøk cache",
    "Clear compress attempt cache": "Slett komprimere forsøk cache",
    "Save config": "Lagre konfigurasjon",
    "Scan only": "Bare skanning",
    "Scan and convert": "Skann og konverter",
    "View scan/conversion summary log": "Se skanning / konvertering sammendrag logg",
    "View individual file check/conversion log": "Se individuell filkontroll / konverteringslogg",
    "View worker console output": "Se arbeidskonsollutgang",
    "Health check": "Helsesjekk",
    "Clear healthy file cache": "Klar sunn filbuffer",
    "View error log": "Se feillogg",
    "Email test": "E-posttest",
    "View master log": "Se hovedlogg",
    "Wiki help": "Wiki hjelp",
    "An application by HaveAGitGat": "En søknad fra HaveAGitGat",
    "New": "Ny",
    "Launch": "Launch",
    "Benchmark": "benchmark",
    "See results": "Se resultater",
    "Pause queue": "Pause kø",
    "Continue queue": "Fortsett køen",
    "Stop queue": "Stopp køen",
    "Convert selected files": "Konverter valgte filer",
    "Toggle queue view": "Bytt køevisning",
    "Deselect all": "Opphev alle",
    "Invert all": "Inverter alle",
    "Select all": "Velg alle",
    "Toggle output view": "Bytt utgangsvisning"
}