{"The number of custom presets does not match the number of source folders!":"Liczba niestandardowych ustawień wstępnych nie odpowiada liczbie folderów źródłowych!","source folders have been detected.":"wykryto foldery źródłowe.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"wykryto niestandardowe linie predefiniowane. Sprawdź dwukrotnie, czy nie ma niewidocznych podziałów linii. Powinna istnieć jedna ścieżka do folderu lub ustawienie wstępne w wierszu. Upewnij się, że przez przypadek nie utworzyłeś pustej linii.","The number of filename suffixes does not match the number of source folders! ":"Liczba przyrostków nazw plików nie odpowiada liczbie folderów źródłowych!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"linie sufiksu pliku zostały wykryte. Sprawdź dwukrotnie, czy nie ma niewidocznych podziałów linii. W każdym wierszu powinien znajdować się jeden folder lub przyrostek nazwy pliku. Upewnij się, że przez przypadek nie utworzyłeś pustej linii.","The number of source folders does not match the number of destination folders!":"Liczba folderów źródłowych nie odpowiada liczbie folderów docelowych!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"foldery docelowe zostały wykryte. Sprawdź dwukrotnie, czy nie ma niewidocznych podziałów linii. W wierszu powinna znajdować się jedna ścieżka do folderu. Upewnij się, że przez przypadek nie utworzyłeś pustej linii.","The number of source folders does not match the number of temporary conversion folders!":"Liczba folderów źródłowych nie odpowiada liczbie tymczasowych folderów konwersji!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"wykryto tymczasowe foldery konwersji. Sprawdź dwukrotnie, czy nie ma niewidocznych podziałów linii. W wierszu powinna znajdować się jedna ścieżka do folderu. Upewnij się, że przez przypadek nie utworzyłeś pustej linii.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Wprowadź prawidłowy kontener, taki jak „.mp4”. Upewnij się, że umieściłeś „.”","Corrupt file folder":"Uszkodzony folder plików","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"nie istnieje! Upewnij się, że przed / po ścieżce nie ma spacji ani ukrytych znaków","Source folder":"Folder źródłowy","Temporary conversion folder":"Tymczasowy folder konwersji","appears to be the same as or is within source folder":"wydaje się być taki sam lub znajduje się w folderze źródłowym","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"co uniemożliwi poprawne działanie HBBatchBeast. Zmień tymczasowy folder konwersji na folder poza folderem źródłowym. Jeśli chcesz użyć funkcji „Zastąp oryginalne pliki”, wybierz folder docelowy, który nie jest taki sam lub w folderze źródłowym, a następnie zaznacz pole wyboru „Zawsze zamieniaj oryginalne pliki” w sekcji ustawień zaawansowanych . Usuń zaznaczenie pola wyboru „Tymczasowy folder konwersji”, ponieważ w tym przypadku nie będzie on używany. Pliki zostaną przekonwertowane na folder docelowy, a następnie przeniesione z powrotem do folderu źródłowego.","Destination folder":"Folder docelowy","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"co uniemożliwi poprawne działanie HBBatchBeast. Zmień folder docelowy na folder poza folderem źródłowym. Jeśli chcesz użyć funkcji „Zastąp oryginalne pliki”, wybierz folder docelowy, który nie jest taki sam lub w folderze źródłowym, a następnie zaznacz pole wyboru „Zawsze zamieniaj oryginalne pliki” w sekcji ustawień zaawansowanych . Usuń zaznaczenie pola wyboru „Tymczasowy folder konwersji”, ponieważ w tym przypadku nie będzie on używany. Pliki zostaną przekonwertowane na folder docelowy, a następnie przeniesione z powrotem do folderu źródłowego.","Error creating temporary conversion folder":"Błąd podczas tworzenia tymczasowego folderu konwersji","Error creating destination folder":"Błąd podczas tworzenia folderu docelowego","Please select to use HandBrake or FFmpeg!":"Wybierz, aby użyć HandBrake lub FFmpeg!","Please select a standard preset or input a custom one!":"Wybierz standardowe ustawienie wstępne lub wprowadź niestandardowe ustawienie!","Please select a scan interval of 5 seconds or greater!":"Wybierz odstęp skanowania 5 sekund lub większy!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Upewnij się, że liczba jednoczesnych instancji HandBrake / FFmpeg jest jedna lub większa!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Nieprawidłowy klucz API! Kliknij „Nowy” na karcie zdalnego monitorowania, aby wygenerować nowy klucz.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Wprowadź dzienny czas skanowania w formacie 24-godzinnym: gg: mm (na przykład 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"PLIKI ŹRÓDŁOWE ZOSTANĄ USUNIĘTE PO KONWERSJI! Sprawdź przed prawidłowym użyciem!","Benchmark failed!":"Test nie powiódł się!","Log does not exist!":"Dziennik nie istnieje!","Folder does not exist!":"Folder nie istnieje!","Error sending email! Please check your settings.":"Błąd podczas wysyłania wiadomości e-mail! Sprawdź swoje ustawienia.","Test email sent!":"Przetestuj wysłaną wiadomość e-mail!","All worker processes have been stopped.":"Wszystkie procesy robocze zostały zatrzymane.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Kolejka zostanie wstrzymana po zakończeniu przetwarzania bieżących elementów. Czy na pewno chcesz wstrzymać kolejkę?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Zainicjowana pauza w kolejce. Przycisk „Kontynuuj” pojawi się po wstrzymaniu pracy wszystkich pracowników.","Healthy file cache cleared!":"Wyczyszczono pamięć podręczną plików!","Cache cleared!":"Skasowano pamięć podręczną!","Cancel item":"Anuluj element","Please check the above checkbox to use this feature.":"Zaznacz powyższe pole wyboru, aby użyć tej funkcji.","Configuration":"Konfiguracja","Source folders":"Foldery źródłowe","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"To jest folder źródłowy, który będzie skanowany w poszukiwaniu mediów. Folder należy wprowadzić bez ukośnika końcowego. Na przykład:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Pole ścieżki folderu źródłowego można rozszerzyć (naciśnij klawisz Enter, aby utworzyć nową linię). Jeśli chcesz określić wiele folderów źródłowych, upewnij się, że każda ścieżka folderu źródłowego znajduje się we własnej linii, na przykład:","Video health check":"Sprawdzanie kondycji wideo","Batch conversion and Folder watching":"Konwersja wsadowa i oglądanie folderów","Remote Monitoring (Beta)":"Zdalne monitorowanie (beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"System","Help":"Wsparcie","Temporary conversion folders":"Tymczasowe foldery konwersji","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Jeśli „Tymczasowy folder konwersji?” jest zaznaczone, HandBrake konwertuje pliki do tego folderu. Po zakończeniu konwersji plik zostanie przeniesiony do „folderu docelowego”. Musisz określić tyle tymczasowych folderów konwersji, ile folderów źródłowych. Twój pierwszy folder źródłowy zostanie przekonwertowany na pierwszy tymczasowy folder konwersji, drugi folder źródłowy na drugi tymczasowy folder konwersji i tak dalej. Upewnij się, że każda tymczasowa ścieżka do folderu konwersji znajduje się we własnej linii.","Destination folders":"Foldery docelowe","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Określ ścieżki folderu docelowego. Ponownie musisz określić tyle folderów docelowych, ile folderów źródłowych. Pliki z pierwszego folderu źródłowego trafią do pierwszego folderu docelowego, do plików drugiego folderu źródłowego w drugim folderze docelowym i tak dalej.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Pierwszy folder źródłowy ---------> Pierwszy tymczasowy folder konwersji ---------> Pierwszy folder docelowy","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Drugi folder źródłowy ---------> Drugi folder konwersji tymczasowej ---------> Drugi folder docelowy","etc":"itp","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast nie będzie działać poprawnie, jeśli ustawisz folder docelowy tak samo lub w folderze źródłowym.","Standard preset:":"Standardowe ustawienie wstępne:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Wybierz preset HandBrake, z którym chcesz przekonwertować pliki. Jeśli wybrano „Standardowe ustawienie wstępne”, wszystkie pliki w wybranych folderach zostaną przekonwertowane przy użyciu określonego ustawienia HandBrake. Więcej informacji o ustawieniach HandBrake znajdziesz tutaj:","Custom preset:":"Ustawienia niestandardowe:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Jeśli „Własne ustawienie wstępne”, musisz wprowadzić własne ustawienie wstępne. HBBatchBeast obejmuje część „HandBrakeCLI -i źródło -o miejsce docelowe” wejścia HandBrakeCLI, więc należy wprowadzić parametry konwersji. Na przykład:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Jeśli używasz FFmpeg, musisz oddzielić parametry wejściowe i wyjściowe przecinkiem. Jak na przykład:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Możesz również połączyć się z niestandardowym ustawieniem, które zostało wyeksportowane z oficjalnej aplikacji GUI HandBrake, na przykład:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Jeśli masz problemy z niestandardowymi ustawieniami, może to być spowodowane znanym błędem z HandBrakeCLI (zostanie naprawiony w następnym wydaniu HandBrakeCLI). Zobacz to, aby uzyskać tymczasowe rozwiązanie:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Każde ustawienie niestandardowe musi znajdować się na własnej linii i, podobnie jak w folderach, musi istnieć tyle niestandardowych ustawień wstępnych, co folderów źródłowych.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Pierwszy folder źródłowy ---------> Pierwszy tymczasowy folder konwersji ---------> Pierwszy folder docelowy @ Ustawienia niestandardowe 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Drugi folder źródłowy ---------> Drugi tymczasowy folder konwersji ---------> Drugi folder docelowy @ Własne ustawienie wstępne 2","See the following image for guidance:":"Zobacz poniższe zdjęcie, aby uzyskać wskazówki:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Jeśli używasz kodowania karty graficznej (takiego jak NVENC), może być konieczne zmniejszenie liczby instancji HandBrake (spróbuj 2 lub mniej) z powodu ograniczeń VRAM.","Select standard preset:":"Wybierz standardowe ustawienie:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Wykryto NVENC, pamiętaj, aby zmniejszyć liczbę instancji HandBrakeCLI do 2 lub poniżej (dla większości kart graficznych) lub możesz napotkać błędy z powodu niewystarczającej ilości pamięci VRAM. To ustawienie można znaleźć w zakładce „System”.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Wykryto zaimportowane ustawienie wstępne. Jeśli masz problemy z importowanymi ustawieniami niestandardowymi, przyczyną może być znany błąd związany z HandBrakeCLI (zostanie naprawiony w następnym wydaniu HandBrakeCLI). Tymczasowym rozwiązaniem jest usunięcie „PictureRotate”: „0: 0” z pliku .json. Więcej informacji tutaj:","Container:":"Pojemnik:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Określ kontener, który ma mieć plik wyjściowy, na przykład „.mp4”. Możesz dowiedzieć się więcej o kontenerach pod adresem:","Enable periodic scanning:":"Włącz skanowanie okresowe:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast może monitorować foldery źródłowe i uruchamiać skanowanie w poszukiwaniu nowych plików w określonych odstępach czasu. Czas interwału jest wyrażony w sekundach, przy czym domyślnie wynosi 300 sekund (5 minut). Jeśli ta opcja jest zaznaczona, po naciśnięciu przycisku „Skanuj i przekonwertuj” program skonwertuje wszystkie nowe pliki i rozpocznie się odliczanie czasu. Będzie to pętla nieskończenie, aż do zatrzymania. Odstęp skanowania znajduje się w sekcji ustawień zaawansowanych.","Enable daily scanning:":"Włącz codzienne skanowanie:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Zamiast okresowego skanowania można wybrać, aby skanowanie było uruchamiane raz dziennie. Czas skanowania jest wprowadzany w sekcji ustawień zaawansowanych w formacie gg: mm, np. „18: 30”. Po wybraniu opcji „Skanuj i przekonwertuj” program zaczeka do określonego czasu do uruchomienia procesu skanowania i konwersji. Ponownie będzie to pętla nieskończenie, aż do zatrzymania.","Show/hide advanced:":"Pokaż / ukryj zaawansowane:","Scan interval (minimum 5 seconds):":"Interwał skanowania (minimum 5 sekund):","Daily run time (hh:mm):":"Dzienny czas pracy (gg: mm):","Output filename suffix:":"Sufiks pliku wyjściowego:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"To jest opcjonalne. Możesz określić przyrostek dodawany na końcu nazwy pliku, np. „_1080p” lub „_testconversion” itd.","If 'standard preset' is selected then all output files will have the same suffix.":"Jeśli wybrano „standardowe ustawienie wstępne”, wszystkie pliki wyjściowe będą miały ten sam przyrostek.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Jeśli wybrano „niestandardowe ustawienie wstępne”, można określić jeden sufiks na folder źródłowy / ustawienie niestandardowe. Upewnij się, że każdy sufiks jest na własnej linii. Na przykład, jeśli masz 2 foldery źródłowe i używasz „ustawienia niestandardowego”, możesz umieścić to w polu przyrostka nazwy pliku:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Pliki w pierwszym folderze źródłowym będą miały „_720p” dodane do wyjściowej nazwy pliku. Pliki w drugim folderze źródłowym będą miały „_1080p” dodane do wyjściowej nazwy pliku itp.","Include these file containers:":"Dołącz te pojemniki na pliki:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Wprowadź kontenery plików do skanowania. Każdy typ musi być oddzielony przecinkiem. Domyślny wpis to:","Exclude files smaller than (MB):":"Wyklucz pliki mniejsze niż (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Określ, czy z konwersji wykluczyć pliki mniejsze niż określony rozmiar (w megabajtach)","Exclude files larger than (MB):":"Wyklucz pliki większe niż (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Określ, czy z konwersji wykluczyć pliki większe niż określony rozmiar (w megabajtach)","Exclude filenames which include any of these words:":"Wyklucz nazwy plików zawierające dowolne z tych słów:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Wprowadź słowa kluczowe, które mają być filtrowane podczas skanowania plików. Na przykład, jeśli wprowadzono „720p”, żadne pliki z tytułem „720p” nie zostaną przekonwertowane. Ponownie słowa kluczowe muszą być oddzielone przecinkiem. Na przykład wprowadź następujące informacje w polu filtru:","Include files with any ":"Dołącz pliki z dowolnym"," or all ":"lub wszystko"," of these":"tych","properties:":"nieruchomości:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"W tym miejscu możesz wprowadzić właściwości wideo i audio, które muszą mieć pliki, aby mogły zostać przekonwertowane (informacje wyodrębnione za pomocą FFprobe). Właściwości muszą być oddzielone przecinkiem. Użyj narzędzia przeglądarki informacji o multimediach, aby określić, które właściwości chcesz dołączyć. Upewnij się, że po ostatniej właściwości wstawiłeś przecinek. Na przykład, aby konwertować tylko pliki zakodowane za pomocą h264 i audio stereo aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Warto zauważyć, że ta kontrola właściwości jest przeprowadzana po rozpoczęciu procesu konwersji (aby zaoszczędzić czas podczas budowania kolejki), więc chociaż pliki mogą pojawić się w kolejce konwersji, zostaną pominięte / uwzględnione, jeśli spełnione zostaną odpowiednie warunki.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Jeśli FFprobe jest w stanie wyodrębnić właściwości, wówczas „OK” pojawi się w kolumnie „FFprobe” w widoku kolejki.","Exclude files with any ":"Wyklucz pliki za pomocą dowolnego"," of these ":"tych","The opposite of 'Include files with any or all of these properties'":"Przeciwieństwo „Uwzględnij pliki z dowolną lub wszystkimi tymi właściwościami”","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Jest to małe narzędzie do analizy właściwości plików, aby pomóc Ci określić, które właściwości chcesz włączyć / wyłączyć w powyższych opcjach. Używa FFprobe do zwracania informacji. Przeciągnij i upuść pliki do szarego pola, aby je przeanalizować. Na przykład upuszczenie w pliku testowym może zwrócić następujące informacje:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Jeśli chcesz wykluczyć takie pliki z konwersji, możesz umieścić kilka właściwości pliku w polu „Wyklucz pliki z dowolną lub wszystkimi z tych właściwości” i zaznacz pole wyboru obok „wszystkie” zamiast „dowolne”, w ten sposób:","Copy excluded files to destination:":"Skopiuj wykluczone pliki do miejsca docelowego:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Jeśli wybierzesz tę opcję, pliki wykluczone z konwersji zostaną skopiowane bezpośrednio do folderu docelowego. Dotyczy to następujących filtrów:","Exclude filenames which include any of these words":"Wyklucz nazwy plików zawierające dowolne z tych słów","Include files with any or all of these properties":"Dołącz pliki z dowolną lub wszystkimi tymi właściwościami","Exclude files with any or all of these properties":"Wyklucz pliki z dowolną lub wszystkimi tymi właściwościami","Exclude files smaller than (MB)":"Wyklucz pliki mniejsze niż (MB)","Exclude files larger than (MB)":"Wyklucz pliki większe niż (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Należy pamiętać, że dotyczy to również plików wykluczonych, ponieważ nie spełniają warunków własności „Uwzględnij” powyższych, więc nie należy przypadkowo kopiować całej biblioteki, gdy próbujesz tylko przekonwertować kilka plików.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Funkcja kopiowania nie dotyczy następujących filtrów (tzn. Plików wykluczonych z powodu filtra)","Include these file types":"Dołącz te typy plików","Delete source files after conversion:":"Usuń pliki źródłowe po konwersji:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Jeśli ta opcja zostanie wybrana, jeśli próba konwersji zakończy się powodzeniem, plik źródłowy zostanie usunięty. Proces ten odbywa się na samym końcu, po konwersji wszystkich plików. Oznacza to, że możesz konwertować te same pliki źródłowe za pomocą wielu ustawień wstępnych, wszystko za jednym razem. Pliki źródłowe zostaną następnie usunięte.","Replace original file if converted file is smaller?(Compress attempt)":"Zastąp oryginalny plik, jeśli przekonwertowany plik jest mniejszy?","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Zaznacz to pole wyboru, jeśli chcesz, aby HBBatchBeast automatycznie zastępował oryginalny plik źródłowy, jeśli nowy plik jest mniejszy. Jeśli nowy plik nie jest mniejszy, pozostanie w folderze docelowym.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Upewnij się, że folder docelowy nie jest taki sam jak w folderze źródłowym lub nie znajduje się w nim.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Gdy HBBatchBeast spróbuje skompresować określony plik, doda tę ścieżkę pliku do pamięci podręcznej, aby w przyszłości nie była ponownie próbowana. Możesz przeglądać / edytować / wyczyścić pamięć podręczną za pomocą żółtych przycisków.","Replace original file always?":"Zawsze zastępuj oryginalny plik?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Oryginalny plik zostanie zastąpiony niezależnie od tego, czy nowy plik jest większy, czy mniejszy.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Ponownie upewnij się, że folder docelowy nie jest taki sam jak w folderze źródłowym lub nie mieści się w nim.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Gdy HBBatchBeast przekoduje określony plik, doda tę ścieżkę pliku do pamięci podręcznej, aby w przyszłości nie była ponownie próbowana. Możesz przeglądać / edytować / wyczyścić pamięć podręczną za pomocą żółtych przycisków.","Copy subtitle (srt) files to destination?":"Skopiować pliki z napisami (srt) do miejsca docelowego?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Pliki napisów „.srt” zostaną automatycznie skopiowane do folderu docelowego.","Automatically create temporary/destination folders if they don't exist?":"Automatycznie twórz foldery tymczasowe / docelowe, jeśli nie istnieją?","Custom bat path to run after each conversion (leave blank if not using):":"Niestandardowa ścieżka nietoperza do uruchomienia po każdej konwersji (pozostaw puste, jeśli nie używasz):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Wprowadź ścieżkę do niestandardowego pliku wsadowego, który chcesz wykonać po każdej konwersji. Na przykład:","Batch files with timeout statements won't work. More info here:":"Pliki wsadowe ze wskazówkami limitu czasu nie będą działać. Więcej informacji tutaj:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Pozostaw pole całkowicie puste, jeśli nie chcesz korzystać z tej opcji (upewnij się, że w polu nie ma żadnych ukrytych znaków)","Run processes at low priority?":"Czy uruchamiasz procesy z niskim priorytetem?","All conversion processes will be run at low priority, reducing processor usage.":"Wszystkie procesy konwersji będą uruchamiane z niskim priorytetem, zmniejszając użycie procesora.","Remove apostrophes from filenames:":"Usuń apostrofy z nazw plików:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Skanowania konwersji / sprawdzania kondycji mogą się nie powieść, jeśli nazwy plików mają apostrofy. Zaznacz to pole, aby automatycznie usunąć apostrofy z nazw plików."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Ta funkcja może skanować w poszukiwaniu uszkodzonych plików wideo za pomocą funkcji „--scan” HandBrake, chociaż nie zawsze jest to dokładne. Używa również FFprobe, aby zapewnić drugi punkt odniesienia. Jeśli zarówno FFprobe, jak i HandBrake ulegną awarii, istnieje duże prawdopodobieństwo, że plik jest uszkodzony.","Move corrupt files into the following folder:":"Przenieś uszkodzone pliki do następującego folderu:"," If checked, then any files which give errors will be moved into the specified folder.":"Jeśli zaznaczone, wszystkie pliki, które zawierają błędy, zostaną przeniesione do określonego folderu.","Corrupt file folder:":"Uszkodzony folder plików:","Run thorough file health check:":"Uruchom dokładną kontrolę poprawności pliku:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Jeśli zaznaczone, to znacznie wolniejsze, dokładniejsze sprawdzanie kondycji wideo zostanie uruchomione za pomocą FFmpeg zamiast HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Na podstawie „ScanMedia.ps1” Desaniego znalezionego pod adresem:","Attempt to repair files after thorough check:":"Spróbuj naprawić pliki po dokładnym sprawdzeniu:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Jeśli zaznaczone, HBBatchBeast spróbuje naprawić pliki za pomocą FFmpeg. Nowy plik z przyrostkiem „_repaired” zostanie utworzony w tym samym folderze co plik źródłowy.","'CRF' value to use when attempting to repair files:":"Wartość „CRF” do użycia podczas próby naprawy plików:","The default 'CRF' value is 23. Please see the following for more information:":"Domyślna wartość „CRF” wynosi 23. Aby uzyskać więcej informacji, zobacz następujące informacje:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Zakres skali CRF wynosi 0–51, gdzie 0 jest bezstratne, 23 to wartość domyślna, a 51 jest najgorszą możliwą jakością. Niższa wartość zazwyczaj prowadzi do wyższej jakości, a subiektywnie zdrowy zakres to 17–28. Rozważmy, że 17 lub 18 jest wizualnie bezstratny lub prawie taki; powinien wyglądać tak samo lub prawie tak samo jak dane wejściowe, ale nie jest technicznie bezstratny.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast zapisuje listę skanowanych ścieżek plików zgłoszonych jako nieuszkodzone. Wyczyść pamięć podręczną, aby wykonać nowe skanowanie wszystkich plików.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Liczba jednoczesnych instancji HandBrake / FFmpeg do użycia? (Zalecane 4 lub mniej):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"To ustawienie dotyczy zarówno procesów „Sprawdzanie kondycji wideo”, jak i „Skanowanie i konwersja”. Określ, ile wątków HandBrake ma używać. Nie ma maksimum, chociaż zaleca się, aby nie używać więcej niż 4. Większa ilość może zamrozić komputer, jeśli nie jest zbyt silny.","Queue size view limit?(Recommended 1000 or fewer):":"Limit widoku rozmiaru kolejki (zalecane 1000 lub mniej):","Automatically start \"Scan and convert\" when program opened?:":"Automatycznie uruchom „Skanuj i konwertuj” po otwarciu programu ?:","Save verbose logs?:":"Zapisz pełne dzienniki ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Zaznacz to pole wyboru, aby zapisać szczegółowe dzienniki podprocesów. Obejmuje to także wyjście konsoli pracownika. Spowoduje to bardzo duże dzienniki.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Wypełnij dane e-mail, aby otrzymywać powiadomienia e-mail, jeśli napotkasz błąd podczas sprawdzania kondycji lub konwersji / oglądania folderu. Nie będzie działać z kontami, które wymagają 2FA. Musisz włączyć dostęp do mniej bezpiecznych aplikacji na kontach Gmail.","Email address:":"Adres e-mail:","For example:":"Na przykład:","Email password(not saved):":"Hasło e-mail (nie zapisane):","SMTP server:":"Serwer SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Ta funkcja umożliwia monitorowanie stanu konwersji / sprawdzania kondycji za pomocą dowolnej przeglądarki internetowej. Przydatne podczas uruchamiania serwerów itp. Nie są wysyłane żadne nazwy plików.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Jeśli ta opcja jest włączona, następujące anonimowe dane zostaną wysłane do HBBatchBeast.io:","API key":"Klucz API","Current status ('Searching', 'Running', 'Finished' etc)":"Aktualny stan („Wyszukiwanie”, „Bieganie”, „Zakończone” itp.)","Number of:":"Liczba:","Remaining items":"Pozostałe przedmioty","Successful items":"Udane przedmioty","Errored items":"Elementy usunięte","Cancelled items":"Anulowane przedmioty","Worker percentages":"Procenty pracowników","Last completed item time":"Ostatni ukończony czas elementu","Enable remote monitoring?:":"Włącz zdalne monitorowanie ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Podstawowe narzędzie do benchmarkingu, zbudowane głównie po to, aby zobaczyć, jak 16+ rdzeni procesorów wykonuje wiele instancji HandBrake, chociaż może być uruchamiany na dowolnym typie procesora.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Spowoduje to pobranie przykładowego pliku h265 4k (2,5 MB) i uruchomienie testu porównawczego przy użyciu 4 instancji HandBrake z ustawieniem „Bardzo szybka 1080p30”","Results can be uploaded to hbbatchbeast.io if you choose.":"Jeśli chcesz, możesz przesłać wyniki do hbbatchbeast.io.","Queue":"Kolejka","Output this session":"Wydrukuj tę sesję","Media info viewer tool":"Narzędzie do przeglądania informacji o multimediach","View replaced file cache":"Wyświetl zastąpioną pamięć podręczną plików","Clear replaced file cache":"Wyczyść zastąpioną pamięć podręczną plików","Save config":"Zapisz konfigurację","Scan only":"Tylko skanowanie","Scan and convert":"Skanuj i konwertuj","View scan/conversion summary log":"Wyświetl dziennik podsumowania skanowania / konwersji","View individual file check/conversion log":"Wyświetl indywidualny dziennik sprawdzania plików / dziennik konwersji","View worker console output":"Wyświetl dane wyjściowe konsoli pracownika","Health check":"Kontrola zdrowia","Clear healthy file cache":"Wyczyść zdrową pamięć podręczną plików","View error log":"Wyświetl dziennik błędów","Email test":"Test e-mail","View master log":"Wyświetl dziennik główny","Wiki help":"Pomoc Wiki","An application by HaveAGitGat":"Aplikacja od HaveAGitGat","New":"Nowy","Launch":"Uruchomić","Benchmark":"Reper","See results":"Zobacz wyniki","Pause queue":"Wstrzymaj kolejkę","Continue queue":"Kontynuuj kolejkę","Stop queue":"Zatrzymaj kolejkę","Convert selected files":"Konwertuj wybrane pliki","Toggle queue view":"Przełącz widok kolejki","Deselect all":"Odznacz wszystkie","Invert all":"Odwróć wszystko","Select all":"Zaznacz wszystko","Toggle output view":"Przełącz widok wyjściowy"}