{"The number of custom presets does not match the number of source folders!":"O número de predefinições personalizadas não corresponde ao número de pastas de origem!","source folders have been detected.":"as pastas de origem foram detectadas.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"linhas predefinidas personalizadas foram detectadas. Por favor, verifique novamente se há quebras de linha invisíveis. Deve haver um caminho de pasta ou predefinido por linha. Verifique se você não criou acidentalmente uma linha em branco.","The number of filename suffixes does not match the number of source folders! ":"O número de sufixos de nome de arquivo não corresponde ao número de pastas de origem!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"linhas de sufixo de nome de arquivo foram detectadas. Por favor, verifique novamente se há quebras de linha invisíveis. Deve haver um caminho de pasta ou sufixo de nome de arquivo por linha. Verifique se você não criou acidentalmente uma linha em branco.","The number of source folders does not match the number of destination folders!":"O número de pastas de origem não corresponde ao número de pastas de destino!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"pastas de destino foram detectadas. Por favor, verifique novamente se há quebras de linha invisíveis. Deve haver um caminho de pasta por linha. Verifique se você não criou acidentalmente uma linha em branco.","The number of source folders does not match the number of temporary conversion folders!":"O número de pastas de origem não corresponde ao número de pastas de conversão temporárias!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"pastas temporárias de conversão foram detectadas. Por favor, verifique novamente se há quebras de linha invisíveis. Deve haver um caminho de pasta por linha. Verifique se você não criou acidentalmente uma linha em branco.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Por favor insira um container válido como '.mp4'. Certifique-se de incluir o '.'","Corrupt file folder":"Pasta de arquivos corrompida","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"não existe! Por favor, certifique-se de que não há espaços ou caracteres ocultos antes / depois do caminho","Source folder":"Pasta de origem","Temporary conversion folder":"Pasta de conversão temporária","appears to be the same as or is within source folder":"parece ser o mesmo ou está dentro da pasta de origem","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"o que impedirá que o HBBatchBeast funcione corretamente. Por favor, altere a pasta de conversão temporária para uma pasta fora da pasta de origem. Se você quiser usar o recurso Substituir arquivos originais, selecione uma pasta de destino que não seja igual ou dentro da pasta de origem e marque a caixa de seleção Substituir arquivos originais sempre na seção de configurações avançadas . Desmarque a caixa de seleção temporária \"Pasta de conversão temporária\", pois não será usada neste caso. Os arquivos serão convertidos na pasta de destino e, em seguida, serão movidos de volta para a pasta de origem.","Destination folder":"Pasta de destino","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"o que impedirá que o HBBatchBeast funcione corretamente. Por favor, mude a pasta de destino para uma pasta fora da pasta de origem. Se você quiser usar o recurso Substituir arquivos originais, selecione uma pasta de destino que não seja igual ou dentro da pasta de origem e marque a caixa de seleção Substituir arquivos originais sempre na seção de configurações avançadas . Desmarque a caixa de seleção temporária \"Pasta de conversão temporária\", pois não será usada neste caso. Os arquivos serão convertidos na pasta de destino e, em seguida, serão movidos de volta para a pasta de origem.","Error creating temporary conversion folder":"Erro ao criar pasta de conversão temporária","Error creating destination folder":"Erro ao criar pasta de destino","Please select to use HandBrake or FFmpeg!":"Por favor, selecione para usar HandBrake ou FFmpeg!","Please select a standard preset or input a custom one!":"Por favor, selecione um pré-ajuste padrão ou insira um personalizado!","Please select a scan interval of 5 seconds or greater!":"Por favor, selecione um intervalo de verificação de 5 segundos ou mais!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Por favor, certifique-se de que o número de instâncias HandBrake / FFmpeg simultâneas a utilizar é de um ou mais!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Chave de API inválida! Por favor, clique em \"Novo\" na guia de monitoramento remoto para gerar uma nova chave.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Por favor, insira um tempo de verificação diária no formato de 24 horas: hh: mm (por exemplo, 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"ARQUIVOS FONTE SERÁ APAGADOS APÓS A CONVERSÃO! Por favor, teste antes de usar corretamente!","Benchmark failed!":"Referência falhou!","Log does not exist!":"Log não existe!","Folder does not exist!":"Pasta não existe!","Error sending email! Please check your settings.":"Erro ao enviar email! Por favor, verifique suas configurações.","Test email sent!":"Teste de email enviado!","All worker processes have been stopped.":"Todos os processos do trabalhador foram parados.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"A fila será pausada quando os itens atuais tiverem concluído o processamento. Tem certeza de que deseja pausar a fila?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Pausa na fila iniciada. O botão \"Continuar\" aparecerá quando todos os funcionários tiverem pausado.","Healthy file cache cleared!":"Cache de arquivos saudável limpo!","Cache cleared!":"Cache limpo!","Cancel item":"Cancelar item","Please check the above checkbox to use this feature.":"Por favor, marque a caixa de seleção acima para usar este recurso.","Configuration":"Configuração","Source folders":"Pastas de origem","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Esta é a pasta de origem que será digitalizada para mídia. A pasta precisa ser digitada sem barra. Por exemplo:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"A caixa do caminho da pasta de origem é expansível (pressione enter para criar uma nova linha). Se você quiser especificar várias pastas de origem, verifique se cada caminho de pasta de origem está em sua própria linha, como:","Video health check":"Verificação de integridade de vídeo","Batch conversion and Folder watching":"Conversão em lote e visualização de pastas","Remote Monitoring (Beta)":"Monitoramento Remoto (Beta)","Benchmark (Beta)":"Referência (beta)","System":"Sistema","Help":"Socorro","Temporary conversion folders":"Pastas de conversão temporária","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Se \"pasta de conversão temporária?\" está marcado, então o HandBrake irá converter arquivos para essa pasta. Quando a conversão estiver concluída, o arquivo será movido para a sua \"pasta de destino\". Você precisará especificar tantas pastas de conversão temporárias quanto as pastas de origem. Sua primeira pasta de origem será convertida em sua primeira pasta de conversão temporária, sua segunda pasta de origem em sua segunda pasta de conversão temporária e assim por diante. Certifique-se de que cada caminho da pasta de conversão temporária esteja na sua própria linha.","Destination folders":"Pastas de destino","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Especifique os caminhos da pasta de destino. Novamente, você precisará especificar tantas pastas de destino quanto as pastas de origem. Os arquivos da sua primeira pasta de origem terminarão na sua primeira pasta de destino, na segunda pasta de origem na sua segunda pasta de destino e assim por diante.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Primeira pasta de origem ---------> Primeira pasta de conversão temporária ---------> Primeira pasta de destino","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Segunda pasta de origem ---------> Segunda pasta de conversão temporária ---------> Segunda pasta de destino","etc":"etc","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"O HBBatchBeast não funcionará corretamente se você definir a pasta de destino da mesma forma ou dentro da pasta de origem.","Standard preset:":"Padrão predefinido:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Selecione a predefinição HandBrake com a qual você gostaria de converter seus arquivos. Se \"Standard preset\" for selecionado, todos os arquivos nas pastas selecionadas serão convertidos usando a predefinição HandBrake especificada. Você pode encontrar mais sobre as predefinições HandBrake aqui:","Custom preset:":"Predefinição personalizada:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Se \"Predefinição personalizada\", você precisará inserir sua própria predefinição personalizada. O HBBatchBeast cobre a parte \"HandBrakeCLI -i source -o destination\" da entrada HandBrakeCLI, portanto você precisa inserir os parâmetros de conversão. Por exemplo:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Se estiver usando o FFmpeg, você precisará separar os parâmetros de entrada e saída com uma vírgula. Tal como:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Você também pode vincular a uma predefinição personalizada que foi exportada do aplicativo oficial HandBrake GUI, por exemplo:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Se você está tendo problemas com predefinições personalizadas, pode ser devido a um bug conhecido com o HandBrakeCLI (será corrigido na próxima versão do HandBrakeCLI). Por favor, veja isso para uma solução temporária:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Cada predefinição personalizada precisa estar em sua própria linha e, de forma semelhante às pastas, é preciso haver tantas predefinições personalizadas quanto as pastas de origem.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Primeira pasta de origem ---------> Primeira pasta de conversão temporária ---------> Primeira pasta de destino @ Predefinição personalizada 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Segunda pasta de origem ---------> Segunda pasta de conversão temporária ---------> Segunda pasta de destino @ Predefinição personalizada 2","See the following image for guidance:":"Veja a seguinte imagem para orientação:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Se estiver usando codificação de placa gráfica (como NVENC), talvez seja necessário reduzir o número de instâncias de HandBrake (tente 2 ou menos) devido a limitações de VRAM.","Select standard preset:":"Selecione a predefinição padrão:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC detectado, por favor, certifique-se de diminuir o número de instâncias HandBrakeCLI para 2 ou abaixo (para a maioria das placas gráficas) ou você pode encontrar erros devido a não VRAM suficiente. Essa configuração pode ser encontrada na guia \"Sistema\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Preset importado detectado.Se você está tendo problemas com presets personalizados importados, pode ser devido a um bug conhecido com o HandBrakeCLI (será corrigido na próxima versão HandBrakeCLI). Uma solução temporária é remover o \"PictureRotate\": \"0: 0\" 'do arquivo .json. Mais informações aqui:","Container:":"Recipiente:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Especifique o contêiner que você deseja que o arquivo de saída tenha, como '.mp4'. Você pode descobrir mais sobre contêineres em:","Enable periodic scanning:":"Ativar varredura periódica:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"O HBBatchBeast pode monitorar suas pastas de origem e executar verificações de novos arquivos em um intervalo especificado. O intervalo de tempo é em segundos, com o padrão sendo 300 segundos (5 minutos). Se esta opção for selecionada, quando você pressionar \"Digitalizar e converter\", o programa converterá todos os novos arquivos e, em seguida, um cronômetro de contagem regressiva será iniciado. Isso fará um loop infinitamente até ser parado. O intervalo de verificação está na seção de configurações avançadas.","Enable daily scanning:":"Ativar varredura diária:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Em vez de digitalizar periodicamente, você pode escolher que uma varredura seja executada uma vez por dia. O tempo de varredura é inserido na seção de configurações avançadas no formato hh: mm, como '18: 30'. Depois de selecionar \"Digitalizar e converter\", o programa aguardará até o tempo especificado até a execução de um processo de digitalização e conversão. Mais uma vez, isso irá fazer um loop infinitamente até ser parado.","Show/hide advanced:":"Mostrar / ocultar avançado:","Scan interval (minimum 5 seconds):":"Intervalo de verificação (mínimo de 5 segundos):","Daily run time (hh:mm):":"Tempo de execução diário (hh: mm):","Output filename suffix:":"Sufixo do nome do arquivo de saída:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Isso é opcional. Você pode especificar um sufixo para adicionar ao final do seu nome de arquivo como '_1080p' ou '_testconversion' etc.","If 'standard preset' is selected then all output files will have the same suffix.":"Se 'predefinição padrão' for selecionada, todos os arquivos de saída terão o mesmo sufixo.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Se 'predefinição personalizada' for selecionada, você poderá especificar um sufixo por pasta de origem / predefinição personalizada. Certifique-se de que cada sufixo esteja em sua própria linha. Por exemplo, se você tiver duas pastas de origem e estiver usando 'predefinição personalizada', poderá colocar isso na caixa de sufixo do nome do arquivo:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Os arquivos na primeira pasta de origem terão '_720p' adicionado ao nome do arquivo de saída. Os arquivos na segunda pasta de origem terão '_1080p' adicionado ao nome do arquivo de saída, etc.","Include these file containers:":"Inclua esses contêineres de arquivos:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Digite os recipientes de arquivos para procurar. Cada tipo precisa ser separado por uma vírgula. A entrada padrão é:","Exclude files smaller than (MB):":"Exclua arquivos menores que (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Especifique se deseja excluir arquivos menores que um determinado tamanho da conversão (em megabytes)","Exclude files larger than (MB):":"Excluir arquivos maiores que (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Especifique se deseja excluir arquivos maiores que um determinado tamanho da conversão (em megabytes)","Exclude filenames which include any of these words:":"Exclua nomes de arquivos que incluam qualquer uma destas palavras:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Insira as palavras-chave a serem filtradas ao procurar arquivos. Por exemplo, se \"720p\" for inserido, todos os arquivos com \"720p\" no título não serão convertidos. Novamente, as palavras-chave precisam ser separadas por uma vírgula. Por exemplo, insira o seguinte na caixa de filtro:","Include files with any ":"Incluir arquivos com qualquer"," or all ":"ou tudo"," of these":"destes","properties:":"propriedades:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Aqui você pode inserir propriedades de vídeo e áudio que os arquivos devem ter para serem convertidos (informações extraídas usando o FFprobe). As propriedades devem ser separadas por uma vírgula. Use a ferramenta de visualização de informações da mídia para ajudar a determinar quais propriedades você gostaria de incluir. Certifique-se de colocar uma vírgula após a última propriedade. Por exemplo, para converter apenas arquivos codificados usando h264 e áudio estéreo aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Vale a pena observar que essa verificação de propriedade é feita assim que o processo de conversão é iniciado (para poupar tempo durante a criação da fila), portanto, embora os arquivos possam aparecer na fila de conversão, eles serão ignorados / incluídos se as condições corretas forem atendidas.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Se o FFprobe for capaz de extrair propriedades, um 'OK' aparecerá na coluna \"FFprobe\" na exibição da fila.","Exclude files with any ":"Excluir arquivos com qualquer"," of these ":"destes","The opposite of 'Include files with any or all of these properties'":"O oposto de \"Incluir arquivos com qualquer uma ou todas essas propriedades\"","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Esta é uma pequena ferramenta para analisar as propriedades do arquivo, a fim de ajudar você a determinar quais propriedades você gostaria de incluir / excluir nas opções acima. Ele usa o FFprobe para retornar informações. Arraste e solte os arquivos na caixa cinza para analisá-los. Por exemplo, soltando em um arquivo de teste pode retornar o seguinte:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Se você quiser excluir arquivos desse tipo de serem convertidos, coloque várias propriedades de arquivo na caixa \"Excluir arquivos com qualquer ou todas essas propriedades\" e marque a caixa de seleção ao lado de \"all\" em vez de \"any\", igual a:","Copy excluded files to destination:":"Copie os arquivos excluídos para o destino:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Se você selecionar essa opção, os arquivos que foram excluídos da conversão serão copiados diretamente para a pasta de destino. Isso se aplica aos seguintes filtros:","Exclude filenames which include any of these words":"Excluir nomes de arquivos que incluam qualquer uma dessas palavras","Include files with any or all of these properties":"Incluir arquivos com qualquer uma ou todas essas propriedades","Exclude files with any or all of these properties":"Excluir arquivos com qualquer uma ou todas essas propriedades","Exclude files smaller than (MB)":"Excluir arquivos menores que (MB)","Exclude files larger than (MB)":"Excluir arquivos maiores que (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Observe que isso também se aplica a arquivos excluídos porque eles não atendem às condições de propriedade \"Incluir\" dos itens acima, portanto, não copie acidentalmente sua biblioteca inteira quando estiver apenas tentando converter alguns arquivos.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"O recurso de cópia não se aplica aos seguintes filtros (ou seja, arquivos excluídos devido ao filtro)","Include these file types":"Inclua esses tipos de arquivo","Delete source files after conversion:":"Excluir arquivos de origem após a conversão:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Se isso for selecionado, se uma tentativa de conversão for bem-sucedida, o arquivo de origem será excluído. Este processo é feito no final, após a conversão de todos os arquivos. Isso significa que você pode converter os mesmos arquivos de origem usando várias predefinições, tudo de uma vez. Os arquivos de origem serão excluídos posteriormente.","Replace original file if converted file is smaller?(Compress attempt)":"Substitua o arquivo original se o arquivo convertido for menor (tentativa de compactação)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Marque esta caixa de seleção se desejar que o HBBatchBeast substitua automaticamente o arquivo de origem original se o novo arquivo for menor. Se o novo arquivo não for menor, ele será deixado na pasta de destino.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Certifique-se de que a pasta de destino não seja a mesma ou de dentro da sua pasta de origem ou que não funcione corretamente.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Depois que o HBBatchBeast tentar compactar um arquivo específico, ele adicionará esse caminho de arquivo a um cache para que ele não seja tentado novamente no futuro. Você pode visualizar / editar / limpar o cache usando os botões amarelos.","Replace original file always?":"Substituir o arquivo original sempre?","The original file will be replaced regardless of whether the new file is larger or smaller.":"O arquivo original será substituído, independentemente de o novo arquivo ser maior ou menor.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Novamente, certifique-se de que sua pasta de destino não seja a mesma de sua pasta de origem ou que ela não funcionará corretamente.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Depois que o HBBatchBeast transcodificar um arquivo específico, ele adicionará esse caminho de arquivo a um cache para que ele não seja tentado novamente no futuro. Você pode visualizar / editar / limpar o cache usando os botões amarelos.","Copy subtitle (srt) files to destination?":"Copiar arquivos de legenda (srt) para o destino?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Os arquivos de legenda '.srt' serão copiados para a pasta de destino automaticamente.","Automatically create temporary/destination folders if they don't exist?":"Criar automaticamente pastas temporárias / de destino, se elas não existirem?","Custom bat path to run after each conversion (leave blank if not using):":"Caminho de morcego personalizado para ser executado após cada conversão (deixe em branco se não estiver usando):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Introduza o caminho para um ficheiro batch personalizado que gostaria de executar após cada conversão. Por exemplo:","Batch files with timeout statements won't work. More info here:":"Arquivos em lote com instruções de tempo limite não funcionam. Mais informações aqui:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Deixe a caixa completamente vazia se você não quiser usar essa opção (certifique-se de que não haja caracteres ocultos na caixa)","Run processes at low priority?":"Executar processos com baixa prioridade?","All conversion processes will be run at low priority, reducing processor usage.":"Todos os processos de conversão serão executados com baixa prioridade, reduzindo o uso do processador.","Remove apostrophes from filenames:":"Remova apóstrofos de nomes de arquivos:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"As verificações de conversões / verificação de integridade poderão falhar se os nomes de arquivos tiverem apóstrofos. Verifique isso para remover automaticamente os apóstrofos dos nomes de arquivos."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Esse recurso pode procurar arquivos de vídeo corruptos usando o recurso '--scan' do HandBrake, embora isso nem sempre seja preciso. Ele também usa o FFprobe para fornecer um segundo ponto de referência. Se tanto o FFprobe quanto o HandBrake falharem, há uma grande chance de o arquivo estar corrompido.","Move corrupt files into the following folder:":"Mova os arquivos corrompidos para a seguinte pasta:"," If checked, then any files which give errors will be moved into the specified folder.":"Se marcado, todos os arquivos com erros serão movidos para a pasta especificada.","Corrupt file folder:":"Pasta de arquivos corrompida:","Run thorough file health check:":"Execute a verificação de integridade completa do arquivo:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Se marcada, uma verificação de integridade de vídeo mais lenta e mais detalhada será executada usando o FFmpeg em vez do HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Baseado no \"ScanMedia.ps1\" de Desani encontrado em:","Attempt to repair files after thorough check:":"Tente reparar os arquivos após a verificação completa:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Se marcado, o HBBatchBeast tentará reparar arquivos usando o FFmpeg. Um novo arquivo com o sufixo '_repaired' será criado na mesma pasta que o arquivo de origem.","'CRF' value to use when attempting to repair files:":"Valor 'CRF' para usar ao tentar reparar arquivos:","The default 'CRF' value is 23. Please see the following for more information:":"O valor padrão 'CRF' é 23. Por favor, veja o seguinte para mais informações:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"O intervalo da escala CRF é de 0 a 51, onde 0 é sem perdas, 23 é o padrão e 51 é a pior qualidade possível. Um valor mais baixo geralmente leva a uma qualidade mais alta, e um intervalo subjetivamente são entre 17 e 28. Considere 17 ou 18 para ser visualmente sem perda ou quase; deve parecer o mesmo ou quase o mesmo que a entrada, mas não é tecnicamente sem perdas.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"O HBBatchBeast salva uma lista de caminhos de arquivos verificados relatados como incorretos. Limpe o cache para executar uma nova varredura em todos os arquivos.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Número de instâncias HandBrake / FFmpeg simultâneas a serem usadas (Recomendado 4 ou menos):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Essa configuração se aplica aos processos \"Verificação de integridade de vídeo\" e \"Verificar e converter\". Especifique quantos HandBrake threads serão usados. Não há máximo, embora seja recomendado não usar mais de 4. Uma quantidade maior pode congelar seu computador se ele não for muito poderoso.","Queue size view limit?(Recommended 1000 or fewer):":"Limite da visualização do tamanho da fila? (Recomendado 1000 ou menos):","Automatically start \"Scan and convert\" when program opened?:":"Iniciar automaticamente \"Digitalizar e converter\" quando o programa é aberto ?:","Save verbose logs?:":"Salvar logs detalhados ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Marque esta caixa de seleção para salvar registros detalhados de subprocessos. Isso inclui a saída do console do trabalhador. Isso causará logs muito grandes.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Preencha os detalhes de e-mail para receber notificações por e-mail se um erro for encontrado durante uma verificação de integridade ou conversão / exibição de pastas. Não funciona com contas que exigem 2FA. Você precisa ativar o acesso a aplicativos menos seguros nas contas do Gmail.","Email address:":"Endereço de e-mail:","For example:":"Por exemplo:","Email password(not saved):":"Senha de email (não salva):","SMTP server:":"Servidor SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Esse recurso permite o monitoramento do status de conversão / verificação de integridade usando qualquer navegador da web. Útil ao executar servidores etc. Nenhum nome de arquivo é enviado.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Se habilitado, os seguintes dados anônimos serão enviados para o HBBatchBeast.io:","API key":"Chave API","Current status ('Searching', 'Running', 'Finished' etc)":"Estado atual ('Searching', 'Running', 'Finished' etc)","Number of:":"Número de:","Remaining items":"Itens restantes","Successful items":"Itens de sucesso","Errored items":"Itens errados","Cancelled items":"Itens cancelados","Worker percentages":"Percentagens de trabalhadores","Last completed item time":"Último horário do item concluído","Enable remote monitoring?:":"Ativar o monitoramento remoto ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Um utilitário de benchmarking básico construído principalmente para ver como 16 + processadores principais executam usando várias instâncias HandBrake, embora possa ser executado em qualquer tipo de processador.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Isso fará o download de um arquivo de amostra h265 4k (2.5MB) e executará um benchmark usando 4 instâncias HandBrake com preset \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Os resultados podem ser enviados para hbbatchbeast.io se você escolher.","Queue":"Fila","Output this session":"Saída desta sessão","Media info viewer tool":"Ferramenta de visualizador de informações de mídia","View replaced file cache":"Ver o cache de arquivos substituído","Clear replaced file cache":"Limpar o cache de arquivos substituído","Save config":"Salvar config","Scan only":"Apenas digitalizar","Scan and convert":"Digitalize e converta","View scan/conversion summary log":"Visualizar o log de resumo de varredura / conversão","View individual file check/conversion log":"Ver log de verificação / conversão de arquivos individuais","View worker console output":"Visualizar a saída do console do trabalhador","Health check":"Exame de saúde","Clear healthy file cache":"Limpar cache de arquivos saudável","View error log":"Visualizar log de erros","Email test":"Teste de e-mail","View master log":"Visualizar log principal","Wiki help":"Ajuda Wiki","An application by HaveAGitGat":"Um aplicativo por HaveAGitGat","New":"Novo","Launch":"Lançamento","Benchmark":"Referência","See results":"Veja os resultados","Pause queue":"Pausar fila","Continue queue":"Continue na fila","Stop queue":"Pare a fila","Convert selected files":"Converter arquivos selecionados","Toggle queue view":"Alternar exibição de fila","Deselect all":"Desmarcar todos","Invert all":"Inverter tudo","Select all":"Selecionar tudo","Toggle output view":"Alternar exibição de saída"}