{
    "The number of custom presets does not match the number of source folders!": "Numărul de presetări personalizate nu se potrivește cu numărul de directoare sursă!",
    "source folders have been detected.": "au fost detectate folderele sursă.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "au fost detectate linii prestabilite personalizate. Verificați dublu pentru pauze de linii invizibile. Ar trebui să existe o cale de directoare sau o presetare pe linie. Asigurați-vă că nu ați creat accidental o linie necompletată.",
    "The number of filename suffixes does not match the number of source folders! ": "Numărul sufixelor de nume de fișiere nu corespunde numărului de directoare sursă!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "fișierele sufixelor de nume de fișiere au fost detectate. Verificați dublu pentru pauze de linii invizibile. Ar trebui să existe o singură cale a dosarului sau sufixul fișierului pe linie. Asigurați-vă că nu ați creat accidental o linie necompletată.",
    "The number of source folders does not match the number of destination folders!": "Numărul de directoare sursă nu corespunde numărului de dosare de destinație!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "destinațiile de destinație au fost detectate. Verificați dublu pentru pauze de linii invizibile. Ar trebui să existe o singură cale de folder pe linie. Asigurați-vă că nu ați creat accidental o linie necompletată.",
    "The number of source folders does not match the number of temporary conversion folders!": "Numărul de directoare sursă nu se potrivește cu numărul de directoare de conversie temporară!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "dosarele de conversie temporară au fost detectate. Verificați dublu pentru pauze de linii invizibile. Ar trebui să existe o singură cale de folder pe linie. Asigurați-vă că nu ați creat accidental o linie necompletată.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Introduceți un container valid, cum ar fi \".mp4\". Asigurați-vă că ați inclus \".\"",
    "Corrupt file folder": "Dosarul de fișiere corupte",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "nu exista! Asigurați-vă că nu există spații sau caractere ascunse înainte / după cale",
    "Source folder": "Dosarul sursă",
    "Temporary conversion folder": "Dosarul de conversie temporară",
    "appears to be the same as or is within source folder": "pare să fie la fel sau în interiorul directorului sursă",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "care va împiedica funcționarea corectă a HBBatchBeast. Schimbați folderul de conversie temporară într-un dosar din afara directorului sursă. Dacă doriți să utilizați caracteristica \"Înlocuiți fișierele originale\", selectați un folder de destinație care nu este același cu directorul sursă și în interiorul acestuia, apoi bifați caseta de selectare \"Înlocuiți fișierele originale întotdeauna\" din secțiunea de setări avansate . Debifați caseta temporară de selectare \"Dosarul de conversie temporară\", deoarece în acest caz nu va fi utilă. Fișierele vor fi convertite în folderul destinație și apoi mutate înapoi în directorul sursă.",
    "Destination folder": "Dosar de destinație",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "care va împiedica funcționarea corectă a HBBatchBeast. Schimbați folderul de destinație într-un dosar din afara directorului sursă. Dacă doriți să utilizați caracteristica \"Înlocuiți fișierele originale\", selectați un folder de destinație care nu este același cu directorul sursă și în interiorul acestuia, apoi bifați caseta de selectare \"Înlocuiți fișierele originale întotdeauna\" din secțiunea de setări avansate . Debifați caseta temporară de selectare \"Dosarul de conversie temporară\", deoarece în acest caz nu va fi utilă. Fișierele vor fi convertite în folderul destinație și apoi mutate înapoi în directorul sursă.",
    "Error creating temporary conversion folder": "Eroare la crearea dosarului de conversie temporară",
    "Error creating destination folder": "Eroare la crearea directorului destinație",
    "Please select to use HandBrake or FFmpeg!": "Selectați să utilizați HandBrake sau FFmpeg!",
    "Please select a standard preset or input a custom one!": "Selectați o presetare standard sau introduceți o comandă standard!",
    "Please select a scan interval of 5 seconds or greater!": "Selectați un interval de scanare de 5 secunde sau mai mult!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Asigurați-vă că numărul de instanțe HandBrake / FFmpeg simultane de utilizat este unul sau mai mare!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Cheia API nevalidă! Faceți clic pe \"Nou\" din fila de monitorizare la distanță pentru a genera o nouă cheie.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Introduceți un timp de scanare zilnic în format de 24 de ore: hh: mm (de exemplu 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "FIȘIERE SOURCE VA FI DELETATE DUPĂ CONVERSIE! Verificați înainte de utilizarea corectă!",
    "Benchmark failed!": "Analiza comparativă a eșuat!",
    "Log does not exist!": "Jurnalul nu există!",
    "Folder does not exist!": "Dosarul nu există!",
    "Error sending email! Please check your settings.": "Eroare la trimiterea e-mailului Verificați setările.",
    "Test email sent!": "Email-ul de test trimis!",
    "All worker processes have been stopped.": "Toate procesele lucrătorilor au fost oprite.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Coada va fi oprită odată ce articolele curente au terminat procesarea. Sigur doriți să întrerupeți coada de așteptare?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "A fost inițiată o pauză de așteptare. Butonul \"Continuați\" va apărea odată ce toți lucrătorii s-au întrerupt.",
    "Healthy file cache cleared!": "Cache-ul de fișiere sănătoasă a fost șters!",
    "Cache cleared!": "Cache a fost eliminat!",
    "Cancel item": "Anulează produs",
    "Please check the above checkbox to use this feature.": "Verificați caseta de selectare de mai sus pentru a utiliza această funcție.",
    "Configuration": "configurație",
    "Source folders": "Sursă de directoare",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Acesta este dosarul sursă care va fi scanat pentru suporturi media. Dosarul trebuie să fie introdus fără slash. De exemplu:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Calea căii de cale sursă este extensibilă (apăsați enter pentru a crea o nouă linie). Dacă doriți să specificați mai multe directoare sursă, asigurați-vă că fiecare cale de cale sursă este pe propria linie, cum ar fi:",
    "Video health check": "Verificare de sănătate video",
    "Batch conversion and Folder watching": "Conversia în lot și urmărirea folderelor",
    "Remote Monitoring (Beta)": "Monitorizare la distanță (Beta)",
    "Benchmark (Beta)": "Benchmark (Beta)",
    "System": "Sistem",
    "Help": "Ajutor",
    "Temporary conversion folders": "Dosare de conversie temporară",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Dacă \"Dosarul de conversie temporară?\" este verificat, apoi HandBrake va converti fișierele în acel folder. După finalizarea conversiei, fișierul va fi mutat în \"dosarul Destinație\". Va trebui să specificați cât mai multe foldere temporare de conversie ca dosare sursă. Primul dosar sursă va fi convertit în primul folder de conversie temporară, cel de-al doilea folder sursă în cel de-al doilea dosar de conversie temporară și așa mai departe. Asigurați-vă că fiecare cale de folder temporar de conversie este pe propria linie.",
    "Destination folders": "Destinație dosare",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Specificați căile de destinație a destinației. Din nou, va trebui să specificați cât mai multe foldere destinație ca dosare sursă. Fișierele din primul folder sursă se vor termina în primul dosar de destinație, în fișierele din folderul sursă al doilea în al doilea folder de destinație și așa mai departe.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Primul dosar sursă ---------> Primul dosar de conversie temporară ---------> Primul dosar de destinație",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Al doilea director sursă ---------> Al doilea dosar de conversie temporară ---------> Al doilea dosar de destinație",
    "etc": "etc",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast nu va funcționa corect dacă setați directorul de destinație la fel sau în interiorul directorului sursă.",
    "Standard preset:": "Presetare standard:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Selectați presetarea HandBrake cu care doriți să vă convertiți fișierele. Dacă este selectată opțiunea \"Presetare standard\", toate fișierele din folderele selectate vor fi convertite utilizând setarea presetată HandBrake. Puteți afla mai multe despre presetările HandBrake aici:",
    "Custom preset:": "Setări personalizate:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Dacă este setat \"Pre-setare personalizată\", trebuie să introduceți presetări personalizate. HBBatchBeast acoperă partea \"HandBrakeCLI -i sursă -o destinație\" a intrării HandBrakeCLI, astfel că trebuie să introduceți parametrii de conversie. De exemplu:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Dacă utilizați FFmpeg, trebuie să separați parametrii de intrare și ieșire cu o virgulă. Precum:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "De asemenea, puteți să vă conectați la o presetare personalizată care a fost exportată din aplicația oficială HandBrake GUI, de exemplu:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Dacă întâmpinați probleme cu presetările personalizate, aceasta se poate datora unei erori cunoscute cu HandBrakeCLI (va fi rezolvată în următoarea versiune HandBrakeCLI). Consultați aceasta pentru o soluție temporară:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Fiecare presetare personalizată trebuie să fie pe propria linie și, similar cu dosarele, trebuie să existe presetări personalizate la fel ca și folderele sursă.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Primul dosar sursă ---------> Primul dosar de conversie temporară ---------> Primul director de destinație @ Preset particular 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Al doilea dosar sursă ---------> Al doilea dosar de conversie temporară ---------> Al doilea dosar destinație @ Setare personalizată 2",
    "See the following image for guidance:": "Consultați imaginea următoare pentru îndrumare:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Dacă utilizați codificarea plăcii grafice (cum ar fi NVENC), este posibil să fie necesar să reduceți numărul de instanțe HandBrake (încercați 2 sau mai puține) datorită limitărilor VRAM.",
    "Select standard preset:": "Selectați presetarea standard:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC detectat, asigurați-vă că reduceți numărul de instanțe HandBrakeCLI la 2 sau mai puțin (pentru majoritatea cardurilor grafice) sau puteți întâlni erori din cauza faptului că nu este suficient VRAM. Această setare poate fi găsită în fila \"Sistem\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "A fost detectată o presetare importată.Dacă aveți probleme cu presetările personalizate importate, aceasta se poate datora unei erori cunoscute cu HandBrakeCLI (va fi stabilită în următoarea versiune HandBrakeCLI). O soluție temporară este să ștergeți \"PictureRotate\": \"0: 0\" din fișierul .json. Mai multe informații aici:",
    "Container:": "container:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Specificați containerul pe care doriți ca fișierul de ieșire să aibă \".mp4\". Puteți afla mai multe despre containere la:",
    "Enable periodic scanning:": "Activați scanarea periodică:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast poate monitoriza folderele sursă și poate rula scanări pentru fișiere noi la un interval specificat. Timpul de intervale este în secunde, în mod implicit fiind de 300 de secunde (5 minute). Dacă această opțiune este selectată, atunci când apăsați pe \"Scanare și conversie\", programul va converti orice fișiere noi și apoi va începe un cronometru de numărătoare inversă. Acest lucru va fi infinit până când se va opri. Intervalul de scanare se află în secțiunea de setări avansate.",
    "Enable daily scanning:": "Activați scanarea zilnică:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "În loc de scanare periodică, puteți alege ca scanarea să fie difuzată o dată pe zi. Timpul de scanare este introdus în secțiunea setări avansate în format hh: mm, cum ar fi '18: 30 '. După selectarea opțiunii \"Scanare și conversie\", programul va aștepta până la ora specificată până la rularea procesului de scanare și conversie. Din nou, acest lucru se va încrucișa infinit până se va opri.",
    "Show/hide advanced:": "Afișați / ascundeți avansate:",
    "Scan interval (minimum 5 seconds):": "Interval de scanare (minim 5 secunde):",
    "Daily run time (hh:mm):": "Timpul de funcționare zilnic (hh: mm):",
    "Output filename suffix:": "Numele sufixului fișierului de ieșire:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Acest lucru este opțional. Puteți specifica un sufix pe care să-l adăugați la sfârșitul numelui fișierului, precum '_1080p' sau'testreversiunea 'etc.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Dacă este selectată \"presetare standard\", toate fișierele de ieșire vor avea același sufix.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Dacă este selectată opțiunea \"presetare personalizată\", puteți specifica un sufix pe fiecare folder sursă / setare personalizată. Asigurați-vă că fiecare sufix este pe propria linie. De exemplu, dacă aveți 2 foldere sursă și utilizați \"presetări personalizate\", puteți pune acest lucru în caseta de sufix nume fișier:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Fișierele din primul folder sursă vor avea \"_720p\" adăugat la numele fișierului de ieșire. Fișierele din cel de-al doilea folder sursă vor avea \"_1080p\" adăugat la numele fișierului de ieșire etc.",
    "Include these file types:": "Includeți aceste tipuri de fișiere:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Introduceți tipurile de fișiere pentru scanare. Fiecare tip trebuie să fie separat printr-o virgulă. Înregistrarea implicită este:",
    "Exclude files smaller than (MB):": "Excludeți fișierele mai mici decât (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Specificați dacă doriți să excludeți din conversie fișierele cu o dimensiune mai mică decât o anumită dimensiune (în megaocteți)",
    "Exclude files larger than (MB):": "Excludeți fișierele mai mari decât (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Specificați dacă să excludeți fișierele mai mari de o anumită dimensiune de la conversie (în megaocteți)",
    "Exclude filenames which include any of these words:": "Excludeți numele de fișiere care includ oricare dintre aceste cuvinte:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Introduceți cuvintele cheie care vor fi filtrate la scanarea fișierelor. De exemplu, dacă este introdus \"720p\", atunci toate fișierele cu \"720p\" din titlu nu vor fi convertite. Din nou, cuvintele cheie trebuie separate de o virgulă. De exemplu, introduceți următoarele în caseta de filtrare:",
    "Include files with any ": "Includeți fișiere cu orice",
    " or all ": "sau toate",
    " of these": "din acestea",
    "properties:": "proprietăţi:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Aici puteți introduce proprietățile video și audio pe care fișierele trebuie să le aibă pentru a fi convertite (info extrase utilizând FFprobe). Proprietățile trebuie separate prin virgulă. Utilizați instrumentul de vizualizare a informațiilor media pentru a vă ajuta să determinați ce proprietăți doriți să includeți. Asigurați-vă că ați pus o virgulă după ultima proprietate. De exemplu, pentru a converti numai fișiere care sunt codificate utilizând h264 și audio stereo aac:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Merită menționat faptul că această verificare a proprietății se realizează odată ce începe procesul de conversie (pentru a economisi timpul în construirea coadă), deci, deși fișierele pot apărea în coada de conversie, ele vor fi sărite dacă sunt îndeplinite condițiile corecte.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Dacă FFprobe este capabil să extragă proprietăți, atunci în coloana \"FFprobe\" în vizualizarea cozii va apărea un \"OK\".",
    "Exclude files with any ": "Excludeți fișierele cu orice",
    " of these ": "din acestea",
    "The opposite of 'Include files with any or all of these properties'": "Opusul opțiunii \"Includeți fișiere cu oricare sau toate aceste proprietăți\"",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Acesta este un instrument mic pentru a analiza proprietățile fișierelor pentru a vă ajuta să determinați care dintre proprietățile pe care doriți să le includeți / excludeți în opțiunile de mai sus. Utilizează FFprobe pentru a returna informații. Glisați și fixați fișierele în caseta gri pentru a le analiza. De exemplu, aruncarea într-un fișier de test ar putea să returneze următoarele:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Dacă doriți să excludeți ca fișierele de acest tip să fie convertite, atunci puteți plasa mai multe proprietăți de fișier în caseta \"Excludeți fișierele cu toate sau toate aceste proprietăți\" și bifați caseta de selectare de lângă \"toate\" în loc de \"orice\" ca astfel:",
    "Copy excluded files to destination:": "Copiați fișierele excluse la destinație:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Dacă selectați această opțiune, fișierele care au fost excluse din conversie vor fi copiate direct în dosarul destinație. Aceasta se aplică următoarelor filtre:",
    "Exclude filenames which include any of these words": "Excludeți numele de fișiere care includ oricare dintre aceste cuvinte",
    "Include files with any or all of these properties": "Includeți fișiere cu oricare sau toate aceste proprietăți",
    "Exclude files with any or all of these properties": "Excludeți fișierele cu oricare sau toate aceste proprietăți",
    "Exclude files smaller than (MB)": "Excludeți fișierele mai mici decât (MB)",
    "Exclude files larger than (MB)": "Excludeți fișierele mai mari decât (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Rețineți că acest lucru se aplică și fișierelor excluse deoarece nu îndeplinesc condițiile de proprietate \"Include\" de mai sus, astfel încât să nu copiați accidental că sunteți bibliotecă întreagă atunci când încercați doar să convertiți câteva fișiere.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Funcția de copiere nu se aplică următoarelor filtre (adică fișierele excluse din cauza filtrului)",
    "Include these file types": "Includeți aceste tipuri de fișiere",
    "Delete source files after conversion:": "Ștergeți fișierele sursă după conversie:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Dacă este selectată această opțiune, atunci dacă o încercare de conversie are succes, fișierul sursă va fi șters. Acest proces se face chiar la sfârșit, după conversia tuturor fișierelor. Aceasta înseamnă că puteți converti aceleași fișiere sursă utilizând mai multe presetări, toate într-un singur pas. După aceea, fișierele sursă vor fi șterse.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Înlocuiți fișierul original dacă fișierul convertit este mai mic? (Comprimare încercare)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Bifați această casetă de selectare dacă doriți ca HBBatchBeast să înlocuiască automat fișierul sursă original dacă noul fișier este mai mic. Dacă noul fișier nu este mai mic, acesta va fi lăsat în dosarul destinație.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Asigurați-vă că dosarul de destinație nu este același ca / sau în cadrul folderului dvs. sursă sau că nu va funcționa corect.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Odată ce HBBatchBeast a încercat să comprime un anumit fișier, acesta va adăuga acea cale de fișier către o memorie cache, astfel încât nu va mai fi încercată din nou în viitor. Puteți vizualiza / edita / șterge memoria cache folosind butoanele galbene.",
    "Replace original file always?": "Înlocuiți întotdeauna fișierul original?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Fișierul original va fi înlocuit indiferent dacă noul fișier este mai mare sau mai mic.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Din nou, asigurați-vă că dosarul de destinație nu este același ca / sau în cadrul folderului sursă sau că nu va funcționa corect.",
    "Copy subtitle (srt) files to destination?": "Copiați fișierele de subtitrări (srt) la destinație?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Subtitrările \".srt\" vor fi copiate automat în dosarul destinație.",
    "Automatically create temporary/destination folders if they don't exist?": "Creați automat dosare temporare / destinații dacă acestea nu există?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Calea de bagaje personalizată pentru a rula după fiecare conversie (lăsați necompletat dacă nu utilizați):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Introduceți calea către un fișier batch particularizat pe care doriți să îl executați după fiecare conversie. De exemplu:",
    "Batch files with timeout statements won't work. More info here:": "Fișierele batch cu declarații de expirare nu vor funcționa. Mai multe informații aici:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Lăsați caseta complet goală dacă nu doriți să utilizați această opțiune (asigurați-vă că în casetă nu există caractere ascunse)",
    "Run processes at low priority?": "Executați procese la o prioritate scăzută?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Toate procesele de conversie vor fi executate cu prioritate scăzută, reducând utilizarea procesorului.",
    "Remove apostrophes from filenames:": "Eliminați apostrofele din numele de fișiere:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Conversiile / scanările de verificare a sănătății pot eșua dacă numele de fișiere au apostrofuri. Bifați această opțiune pentru a elimina automat apostrofurile din numele de fișiere.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Această caracteristică poate scana fișiere video corupte utilizând funcția \"--scan\" a HandBrake, deși acest lucru nu este întotdeauna corect. De asemenea, utilizează FFprobe pentru a oferi un al doilea punct de referință. Dacă FFprobe și HandBrake nu reușesc atunci există o mare șansă ca fișierul să fie corupt.",
    "Move corrupt files into the following folder:": "Mutați fișierele corupte în următorul dosar:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Dacă este bifată, toate fișierele care dau erori vor fi mutate în dosarul specificat.",
    "Corrupt file folder:": "Dosarul de fișiere corupt:",
    "Run thorough file health check:": "Executați o verificare completă a fișierelor:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Dacă este bifată, atunci se va efectua o verificare mai bună a stării de sănătate a videoclipului, folosind FFmpeg în loc de HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Bazat pe \"ScanMedia.ps1\" de la Desani găsit la:",
    "Attempt to repair files after thorough check:": "Încercați să remediați fișierele după o verificare amănunțită:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Dacă este bifată, HBBatchBeast va încerca să repare fișierele utilizând FFmpeg. Un nou fișier cu sufixul '_repaired' va fi creat în același director ca și fișierul sursă.",
    "'CRF' value to use when attempting to repair files:": "Valoarea \"CRF\" de utilizat la încercarea de a repara fișierele:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Valoarea implicită \"CRF\" este 23. Pentru mai multe informații, consultați următoarele:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Intervalul scării CRF este 0-51, unde 0 este fără pierderi, 23 este implicit, iar 51 este cea mai slabă calitate posibilă. O valoare mai mică duce, în general, la o calitate superioară, iar un interval subiectiv normal este de 17-28. Luați în considerare 17 sau 18 pentru a fi vizual fără pierderi sau aproape; ar trebui să pară la fel sau aproape același cu intrarea, dar nu este tehnic fără pierderi.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast salvează o listă de căi de fișiere scanate raportate ca necorectate. Goliți memoria cache pentru a efectua o scanare nouă în toate fișierele.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Numărul de instanțe HandBrake / FFmpeg simultane de utilizat? (Recomandat 4 sau mai puține):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Această setare se aplică atât proceselor \"Verificare de sănătate video\", cât și proceselor \"Scanare și conversie\". Specificați câte fire de pe HandBrake să le utilizați. Nu există un maxim, deși este recomandat să nu se folosească mai mult de 4. O sumă mai mare poate îngheța computerul dacă nu este foarte puternic.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Limita de vizualizare a dimensiunii limitei (recomandată 1000 sau mai puțin):",
    "Automatically start \"Scan and convert\" when program opened?": "Pornește automat \"Scanare și conversie\" când programul este deschis?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Completați detaliile de e-mail pentru a primi notificări prin e-mail dacă apare o eroare în timpul unei verificări de sănătate sau a unei vizionări de conversie / dosar. Nu va funcționa cu conturile care necesită 2FA. Trebuie să activați accesul la aplicații mai puțin sigure în conturile Gmail.",
    "Email address:": "Adresa de email:",
    "For example:": "De exemplu:",
    "Email password(not saved):": "Email parola (nu este salvată):",
    "SMTP server:": "Server SMTP:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Această funcție permite monitorizarea stării de conversie / verificare a stării de sănătate utilizând orice browser web. Utile atunci când rulează servere etc.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Dacă este activată, următoarele date anonime vor fi trimise la HBBatchBeast.io:",
    "API key": "Cheia API",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Starea curentă (\"Căutarea\", \"Rularea\", \"Terminat\" etc.)",
    "Number of:": "Un numar de:",
    "Remaining items": "Articole rămase",
    "Successful items": "Elemente de succes",
    "Errored items": "Elemente eronate",
    "Cancelled items": "Elementele anulate",
    "Worker percentages": "Procentajele muncitorilor",
    "Last completed item time": "Ultimul moment al articolului",
    "Enable remote monitoring?:": "Activați monitorizarea la distanță ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Un utilitar benchmarking de bază construit în principal pentru a vedea cum 16+ procesoare de bază funcționează utilizând mai multe instanțe HandBrake, deși poate fi rulat pe orice tip de procesor.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Acesta va descărca un fișier eșantion h265 4k (2.5MB) și va rula un benchmark utilizând 4 instanțe HandBrake cu presetări \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Rezultatele pot fi încărcate în hbbatchbeast.io dacă alegeți.",
    "Queue": "Coadă",
    "Output this session": "Executați această sesiune",
    "Media info viewer tool": "Instrumentul pentru vizualizarea informațiilor media",
    "View compress attempt cache": "Vizualizați memoria cache de încercare",
    "Clear compress attempt cache": "Clear cache de încercare pentru comprimare",
    "Save config": "Salvați config",
    "Scan only": "Scanați numai",
    "Scan and convert": "Scanați și convertiți",
    "View scan/conversion summary log": "Vizualizați jurnalul sumar de scanare / conversie",
    "View individual file check/conversion log": "Vizualizați jurnalul individual de verificare / conversie",
    "View worker console output": "Vizualizați ieșirea consolei de lucru",
    "Health check": "Control medical",
    "Clear healthy file cache": "Clear cache de fișiere sănătoase",
    "View error log": "Vizualizați jurnalul de erori",
    "Email test": "Test de e-mail",
    "View master log": "Vedeți jurnalul master",
    "Wiki help": "Ajutor Wiki",
    "An application by HaveAGitGat": "O cerere de HaveAGitGat",
    "New": "Nou",
    "Launch": "Lansa",
    "Benchmark": "Benchmark",
    "See results": "Vedeți rezultatele",
    "Pause queue": "Întrerupeți coada de așteptare",
    "Continue queue": "Continuați coada",
    "Stop queue": "Opriți coada de așteptare",
    "Convert selected files": "Conversia fișierelor selectate",
    "Toggle queue view": "Comutați vizualizarea coadă",
    "Deselect all": "Deselectează-le pe toate",
    "Invert all": "Invertează-le pe toate",
    "Select all": "Selectează tot",
    "Toggle output view": "Comutați afișarea de ieșire"
}