{"The number of custom presets does not match the number of source folders!":"Количество пользовательских пресетов не соответствует количеству исходных папок!","source folders have been detected.":"исходные папки были обнаружены.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"пользовательские предустановленные линии были обнаружены. Пожалуйста, проверьте наличие невидимых разрывов строк. В каждой строке должен быть один путь к папке или предустановка. Убедитесь, что вы случайно не создали пустую строку.","The number of filename suffixes does not match the number of source folders! ":"Количество суффиксов имени файла не соответствует количеству исходных папок!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"строки суффикса имени файла были обнаружены. Пожалуйста, проверьте наличие невидимых разрывов строк. В каждой строке должен быть один путь к папке или суффикс имени файла. Убедитесь, что вы случайно не создали пустую строку.","The number of source folders does not match the number of destination folders!":"Количество исходных папок не соответствует количеству папок назначения!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"целевые папки были обнаружены. Пожалуйста, проверьте наличие невидимых разрывов строк. В каждой строке должен быть один путь к папке. Убедитесь, что вы случайно не создали пустую строку.","The number of source folders does not match the number of temporary conversion folders!":"Количество исходных папок не соответствует количеству временных папок преобразования!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"временные конверсионные папки были обнаружены. Пожалуйста, проверьте наличие невидимых разрывов строк. В каждой строке должен быть один путь к папке. Убедитесь, что вы случайно не создали пустую строку.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Пожалуйста, введите правильный контейнер, такой как .mp4. Обязательно добавьте «.»","Corrupt file folder":"Поврежденная папка","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"не существует! Пожалуйста, убедитесь, что нет пробелов или скрытых символов до / после пути","Source folder":"Исходная папка","Temporary conversion folder":"Папка временного преобразования","appears to be the same as or is within source folder":"выглядит так же, как или находится в исходной папке","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"что помешает HBBatchBeast работать правильно. Пожалуйста, измените временную папку преобразования на папку за пределами исходной папки. Если вы хотите использовать функцию «Заменить оригинальные файлы», выберите папку назначения, которая не совпадает с исходной папкой или находится внутри нее, а затем установите флажок «Всегда заменять оригинальные файлы» в разделе расширенных настроек. , Снимите временный флажок «Папка временного преобразования», так как в этом случае он не будет использоваться. Файлы будут преобразованы в папку назначения, а затем перемещены обратно в исходную папку.","Destination folder":"Папка назначения","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"что помешает HBBatchBeast работать правильно. Пожалуйста, измените папку назначения на папку за пределами исходной папки. Если вы хотите использовать функцию «Заменить оригинальные файлы», выберите папку назначения, которая не совпадает с исходной папкой или находится внутри нее, а затем установите флажок «Всегда заменять оригинальные файлы» в разделе расширенных настроек. , Снимите временный флажок «Папка временного преобразования», так как в этом случае он не будет использоваться. Файлы будут преобразованы в папку назначения, а затем перемещены обратно в исходную папку.","Error creating temporary conversion folder":"Ошибка создания временной папки преобразования","Error creating destination folder":"Ошибка создания папки назначения","Please select to use HandBrake or FFmpeg!":"Пожалуйста, выберите использовать HandBrake или FFmpeg!","Please select a standard preset or input a custom one!":"Пожалуйста, выберите стандартную предустановку или введите индивидуальную!","Please select a scan interval of 5 seconds or greater!":"Пожалуйста, выберите интервал сканирования 5 секунд или больше!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Пожалуйста, убедитесь, что число одновременных экземпляров HandBrake / FFmpeg для использования равно одному или больше!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Неверный ключ API! Пожалуйста, нажмите «Создать» на вкладке удаленного мониторинга, чтобы создать новый ключ.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Пожалуйста, введите ежедневное время сканирования в 24-часовом формате: чч: мм (например, 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"ИСТОЧНИКИ ФАЙЛОВ БУДУТ УДАЛЕНЫ ПОСЛЕ КОНВЕРСИИ! Пожалуйста, проверьте перед использованием!","Benchmark failed!":"Тест не удался!","Log does not exist!":"Лог не существует!","Folder does not exist!":"Папка не существует!","Error sending email! Please check your settings.":"Ошибка при отправке электронной почты! Пожалуйста, проверьте ваши настройки.","Test email sent!":"Тестовое письмо отправлено!","All worker processes have been stopped.":"Все рабочие процессы были остановлены.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Очередь будет приостановлена, как только текущие элементы закончат обработку. Вы уверены, что хотите приостановить очередь?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Инициирована пауза в очереди. Кнопка «Продолжить» появится после того, как все рабочие остановятся.","Healthy file cache cleared!":"Здоровый файловый кеш очищен!","Cache cleared!":"Кеш очищен!","Cancel item":"Отменить товар","Please check the above checkbox to use this feature.":"Пожалуйста, установите флажок выше, чтобы использовать эту функцию.","Configuration":"конфигурация","Source folders":"Исходные папки","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Это исходная папка, которая будет сканироваться на наличие мультимедиа. Папка должна быть введена без косой черты. Например:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Поле пути к исходной папке можно развернуть (нажмите Enter, чтобы создать новую строку). Если вы хотите указать несколько исходных папок, убедитесь, что путь к каждой исходной папке находится в отдельной строке, например:","Video health check":"Видео проверка здоровья","Batch conversion and Folder watching":"Пакетное преобразование и просмотр папок","Remote Monitoring (Beta)":"Удаленный мониторинг (бета)","Benchmark (Beta)":"Бенчмарк (бета)","System":"система","Help":"Помогите","Temporary conversion folders":"Папки временного преобразования","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Если «Папка временного преобразования?» проверяется, то HandBrake будет конвертировать файлы в эту папку. Как только преобразование будет завершено, файл будет перемещен в вашу «папку назначения». Вам нужно будет указать столько временных папок преобразования, сколько и исходных. Ваша первая исходная папка будет преобразована в вашу первую временную папку преобразования, ваша вторая исходная папка - во вторую временную папку преобразования и так далее. Убедитесь, что путь к каждой папке временного преобразования находится в отдельной строке.","Destination folders":"Папки назначения","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Укажите пути к папке назначения. Опять же, вам нужно указать столько папок назначения, сколько папок источника. Файлы из вашей первой исходной папки окажутся в вашей первой папке назначения, файлы вашей второй исходной папки во второй папке назначения и так далее.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Первая исходная папка ---------> Первая временная папка преобразования ---------> Первая папка назначения","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Вторая исходная папка ---------> Вторая временная папка преобразования ---------> Вторая целевая папка","etc":"так далее","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast не будет работать должным образом, если вы установите целевую папку такой же, как или в исходной папке.","Standard preset:":"Стандартная предустановка:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Выберите пресет HandBrake, с которым вы хотите конвертировать ваши файлы. Если выбран «Стандартный пресет», то все файлы в выбранных папках будут конвертированы с использованием указанного пресета HandBrake. Вы можете найти больше о пресетах HandBrake здесь:","Custom preset:":"Пользовательская предустановка:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Если «Пользовательская предустановка», то вам необходимо ввести свою собственную предустановку. HBBatchBeast покрывает часть «HandBrakeCLI -i source -o destination» ввода HandBrakeCLI, поэтому вам необходимо ввести параметры преобразования. Например:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Если вы используете FFmpeg, вам нужно разделить входные и выходные параметры запятой. Такие как:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Вы также можете сделать ссылку на пользовательский пресет, который был экспортирован из официального приложения HandBrake GUI, например:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Если у вас возникают проблемы с пользовательскими пресетами, это может быть связано с известной ошибкой в HandBrakeCLI (будет исправлена в следующей версии HandBrakeCLI). Пожалуйста, посмотрите это для временного решения:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Каждый пользовательский пресет должен находиться в отдельной строке, и, как и в случае с папками, в нем должно быть столько же пользовательских пресетов, сколько в исходных папках.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Первая исходная папка ---------> Первая временная папка преобразования ---------> Первая папка назначения @ Пользовательская предустановка 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Вторая исходная папка ---------> Вторая временная папка преобразования ---------> Вторая целевая папка @ Пользовательская предустановка 2","See the following image for guidance:":"Смотрите следующее изображение для руководства:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Если используется кодирование видеокарты (например, NVENC), вам может потребоваться уменьшить количество экземпляров HandBrake (попробуйте 2 или меньше) из-за ограничений VRAM.","Select standard preset:":"Выберите стандартную предустановку:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Обнаружен NVENC. Обязательно уменьшите количество экземпляров HandBrakeCLI до 2 или ниже (для большинства видеокарт), иначе вы можете столкнуться с ошибками из-за недостатка VRAM. Этот параметр можно найти на вкладке «Система».","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Обнаружен импортированный пресет. Если у вас возникли проблемы с импортированными пользовательскими пресетами, это может быть связано с известной ошибкой в HandBrakeCLI (будет исправлено в следующей версии HandBrakeCLI). Временное решение - удалить «PictureRotate»: «0: 0» из файла .json. Больше информации здесь:","Container:":"Контейнер:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Укажите контейнер, который вы хотите иметь в выходном файле, например «.mp4». Вы можете узнать больше о контейнерах на:","Enable periodic scanning:":"Включить периодическое сканирование:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast может отслеживать ваши исходные папки и запускать сканирование на наличие новых файлов с заданным интервалом. Интервал времени в секундах, по умолчанию 300 секунд (5 минут). Если выбрана эта опция, то при нажатии «Сканировать и конвертировать» программа преобразует любые новые файлы, после чего запускается таймер обратного отсчета. Это будет цикл до бесконечности, пока не остановится. Интервал сканирования указан в разделе дополнительных настроек.","Enable daily scanning:":"Включить ежедневное сканирование:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Вместо периодического сканирования вы можете выбрать сканирование, которое будет выполняться один раз в день. Время сканирования вводится в разделе расширенных настроек в формате чч: мм, например «18: 30». После выбора «Сканировать и преобразовать» программа будет ждать до указанного времени, пока не начнется процесс сканирования и преобразования. Опять же, это будет повторяться бесконечно, пока не остановится.","Show/hide advanced:":"Показать / скрыть расширенный:","Scan interval (minimum 5 seconds):":"Интервал сканирования (минимум 5 секунд):","Daily run time (hh:mm):":"Ежедневное время работы (чч: мм):","Output filename suffix:":"Выходной суффикс имени файла:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Это необязательно. Вы можете указать суффикс для добавления в конец вашего имени файла, например «_1080p» или «_testconversion» и т. Д.","If 'standard preset' is selected then all output files will have the same suffix.":"Если выбран «стандартный пресет», то все выходные файлы будут иметь одинаковый суффикс.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Если выбран «пользовательский пресет», вы можете указать один суффикс на исходную папку / пользовательский пресет. Убедитесь, что каждый суффикс находится в отдельной строке. Например, если у вас есть 2 исходные папки и вы используете «пользовательский пресет», вы можете поместить это в поле суффикса имени файла:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"К файлам в первой исходной папке будет добавлено _720p к выходному имени файла. К файлам во второй исходной папке будет добавлено _1080p к имени выходного файла и т. Д.","Include these file types:":"Включите эти типы файлов:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"Введите типы файлов для сканирования. Каждый тип должен быть разделен запятой. Запись по умолчанию:","Exclude files smaller than (MB):":"Исключить файлы размером менее (МБ):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Укажите, следует ли исключать файлы меньше определенного размера из преобразования (в мегабайтах)","Exclude files larger than (MB):":"Исключить файлы размером более (МБ):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Укажите, следует ли исключать из преобразования файлы размером более определенного (в мегабайтах)","Exclude filenames which include any of these words:":"Исключите имена файлов, которые включают любое из этих слов:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Введите ключевые слова для фильтрации при сканировании файлов. Например, если введено «720p», то любые файлы с «720p» в заголовке не будут преобразованы. Опять же, ключевые слова должны быть разделены запятой. Например, введите следующее в поле фильтра:","Include files with any ":"Включить файлы с любым"," or all ":"или все"," of these":"из этих","properties:":"свойства:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Здесь вы можете ввести видео и аудио свойства, которые должны иметь файлы для конвертации (информация извлекается с помощью FFprobe). Свойства должны быть разделены запятой. Используйте средство просмотра информации о мультимедиа, чтобы определить, какие свойства вы хотите включить. Обязательно ставьте запятую после последнего свойства. Например, чтобы преобразовать только те файлы, которые закодированы с использованием h264 и aac стереозвука:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Стоит отметить, что эта проверка свойства выполняется после запуска процесса преобразования (чтобы сэкономить время при построении очереди), поэтому, хотя файлы могут появляться в очереди преобразования, они будут пропущены / включены, если будут выполнены правильные условия.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Если FFprobe может извлекать свойства, в столбце «FFprobe» в представлении очереди появится «OK».","Exclude files with any ":"Исключить файлы с любым"," of these ":"из этих","The opposite of 'Include files with any or all of these properties'":"Противоположность «Включать файлы с любым или всеми этими свойствами»","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Это небольшой инструмент для анализа свойств файла, чтобы помочь вам определить, какие свойства вы хотите включить / исключить в вышеупомянутых параметрах. Он использует FFprobe для возврата информации. Перетащите файлы в серый ящик, чтобы проанализировать их. Например, удаление тестового файла может вернуть следующее:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Если вы хотите исключить файлы, подобные этим, из преобразования, вы можете поместить несколько свойств файла в поле «Исключить файлы с любыми или всеми этими свойствами» и установить флажок «все» вместо «любой», вот так:","Copy excluded files to destination:":"Скопируйте исключенные файлы в место назначения:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Если вы выберете эту опцию, то файлы, которые были исключены из преобразования, будут скопированы непосредственно в папку назначения. Это относится к следующим фильтрам:","Exclude filenames which include any of these words":"Исключить имена файлов, которые включают любое из этих слов","Include files with any or all of these properties":"Включить файлы с любым или всеми этими свойствами","Exclude files with any or all of these properties":"Исключить файлы с любым или всеми этими свойствами","Exclude files smaller than (MB)":"Исключить файлы размером менее (МБ)","Exclude files larger than (MB)":"Исключить файлы размером более (МБ)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Обратите внимание, что это также относится к исключенным файлам, поскольку они не соответствуют условиям свойства «Включить», указанным выше, поэтому не копируйте случайно всю библиотеку, когда вы пытаетесь преобразовать только несколько файлов.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Функция копирования не применяется к следующим фильтрам (то есть файлам, исключенным из-за фильтра)","Include these file types":"Включить эти типы файлов","Delete source files after conversion:":"Удалить исходные файлы после преобразования:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Если это выбрано, то при успешной попытке конвертации исходный файл будет удален. Этот процесс выполняется в самом конце, после конвертации всех файлов. Это означает, что вы можете конвертировать одни и те же исходные файлы, используя несколько пресетов, все за один раз. Исходные файлы будут затем удалены.","Replace original file if converted file is smaller?(Compress attempt)":"Заменить оригинальный файл, если преобразованный файл меньше? (Попытка сжатия)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Установите этот флажок, если вы хотите, чтобы HBBatchBeast автоматически заменял исходный исходный файл, если новый файл меньше. Если новый файл не меньше, он будет оставлен в папке назначения.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Убедитесь, что ваша папка назначения не совпадает с / или внутри вашей исходной папки, или она не будет работать должным образом.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Как только HBBatchBeast попытается сжать определенный файл, он добавит этот путь к файлу в кэш, чтобы в будущем его больше не пытались. Вы можете просматривать / редактировать / очищать кеш, используя желтые кнопки.","Replace original file always?":"Заменить оригинальный файл всегда?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Исходный файл будет заменен независимо от того, будет ли новый файл больше или меньше.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Опять же, убедитесь, что ваша папка назначения не совпадает с / или внутри вашей исходной папки, или она не будет работать должным образом.","Copy subtitle (srt) files to destination?":"Скопировать файлы субтитров (SRT) в место назначения?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Файлы с субтитрами «.srt» будут автоматически скопированы в папку назначения.","Automatically create temporary/destination folders if they don't exist?":"Автоматически создавать временные / целевые папки, если они не существуют?","Custom bat path to run after each conversion (leave blank if not using):":"Пользовательский путь к летучей мыши, запускаемый после каждого преобразования (оставьте пустым, если не используете):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Введите путь к пользовательскому пакетному файлу, который вы хотите выполнять после каждого преобразования. Например:","Batch files with timeout statements won't work. More info here:":"Пакетные файлы с инструкциями времени ожидания не будут работать. Больше информации здесь:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Оставьте поле полностью пустым, если вы не хотите использовать эту опцию (убедитесь, что в поле нет скрытых символов)","Run processes at low priority?":"Запустить процессы с низким приоритетом?","All conversion processes will be run at low priority, reducing processor usage.":"Все процессы преобразования будут выполняться с низким приоритетом, что снижает использование процессора.","Remove apostrophes from filenames:":"Удалить апострофы из имен файлов:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Проверка конверсий / проверки работоспособности может завершиться неудачей, если в именах файлов есть апострофы. Установите этот флажок, чтобы автоматически удалять апострофы из имен файлов."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Эта функция может сканировать поврежденные видеофайлы, используя функцию '--scan' в HandBrake, хотя это не всегда точно. Он также использует FFprobe для предоставления второй контрольной точки. Если FFprobe и HandBrake не работают, существует большая вероятность, что файл поврежден.","Move corrupt files into the following folder:":"Переместите поврежденные файлы в следующую папку:"," If checked, then any files which give errors will be moved into the specified folder.":"Если этот флажок установлен, все файлы, содержащие ошибки, будут перемещены в указанную папку.","Corrupt file folder:":"Поврежденная папка:","Run thorough file health check:":"Запустите тщательную проверку работоспособности файла:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Если флажок установлен, то гораздо более медленная и тщательная проверка работоспособности видео будет выполняться с использованием FFmpeg вместо HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Основано на «ScanMedia.ps1» Дезани, найденном по адресу:","Attempt to repair files after thorough check:":"Попытайтесь восстановить файлы после тщательной проверки:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Если флажок установлен, HBBatchBeast будет пытаться восстановить файлы с помощью FFmpeg. Новый файл с суффиксом _repaired будет создан в той же папке, что и исходный файл.","'CRF' value to use when attempting to repair files:":"Значение 'CRF' для использования при попытке восстановить файлы:","The default 'CRF' value is 23. Please see the following for more information:":"Значение по умолчанию «CRF» равно 23. Для получения дополнительной информации см. Следующее:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Диапазон шкалы CRF составляет 0–51, где 0 - без потерь, 23 - по умолчанию, а 51 - худшее возможное качество. Более низкое значение обычно приводит к более высокому качеству, а субъективно вменяемый диапазон составляет 17–28. Считайте 17 или 18 визуально без потерь или почти без; он должен выглядеть так же или почти так же, как входные данные, но он не является технически без потерь.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast сохраняет список путей отсканированных файлов, о которых сообщается, что они не повреждены. Очистите кеш, чтобы выполнить новое сканирование всех файлов.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Количество одновременных экземпляров HandBrake / FFmpeg? (Рекомендуется 4 или меньше):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Этот параметр применяется к процессам «Проверка работоспособности видео» и «Сканирование и преобразование». Укажите, сколько потоков HandBrake использовать. Максимума не существует, хотя рекомендуется не использовать больше 4. Более высокое количество может заморозить ваш компьютер, если он не очень мощный.","Queue size view limit?(Recommended 1000 or fewer):":"Предел размера очереди? (Рекомендуется 1000 или меньше):","Automatically start \"Scan and convert\" when program opened?":"Автоматически запускать «Сканировать и конвертировать» при открытии программы?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Заполните данные электронной почты, чтобы получать уведомления по электронной почте, если во время проверки работоспособности или преобразования / просмотра папки возникла ошибка. Не будет работать с учетными записями, которые требуют 2FA. Вам необходимо разрешить доступ к менее защищенным приложениям в учетных записях Gmail.","Email address:":"Адрес электронной почты:","For example:":"Например:","Email password(not saved):":"Пароль электронной почты (не сохранен):","SMTP server:":"SMTP-сервер:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"Эта функция позволяет отслеживать состояние конверсии / проверки работоспособности с помощью любого веб-браузера. Полезно при работе серверов и т. Д.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Если включено, следующие анонимные данные будут отправлены на HBBatchBeast.io:","API key":"Ключ API","Current status ('Searching', 'Running', 'Finished' etc)":"Текущее состояние («Поиск», «Выполняется», «Завершено» и т. Д.)","Number of:":"Количество:","Remaining items":"Остальные предметы","Successful items":"Успешные предметы","Errored items":"Предметы с ошибками","Cancelled items":"Отмененные предметы","Worker percentages":"Проценты работника","Last completed item time":"Время последнего выполненного элемента","Enable remote monitoring?:":"Включить удаленный мониторинг ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Базовая утилита для тестирования производительности, созданная главным образом для наблюдения за тем, как работают 16+ ядерных процессоров с использованием нескольких экземпляров HandBrake, хотя ее можно запускать на любом типе процессора","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Это загрузит образец файла h265 4k (2,5 МБ) и запустит тест, используя 4 экземпляра HandBrake с предустановкой «Очень быстро 1080p30».","Results can be uploaded to hbbatchbeast.io if you choose.":"Результаты могут быть загружены в hbbatchbeast.io, если вы выберете.","Queue":"Очередь","Output this session":"Вывести эту сессию","Media info viewer tool":"Инструмент для просмотра медиа информации","View compress attempt cache":"Просмотреть кэш попыток сжатия","Clear compress attempt cache":"Очистить кэш попыток сжатия","Save config":"Сохранить конфигурацию","Scan only":"Только сканирование","Scan and convert":"Сканирование и конвертирование","View scan/conversion summary log":"Просмотр журнала сканирования / конверсии","View individual file check/conversion log":"Просмотр отдельных файлов проверки / преобразования журнала","View worker console output":"Просмотр вывода рабочей консоли","Health check":"Проверка здоровья","Clear healthy file cache":"Очистить здоровый файловый кеш","View error log":"Просмотр журнала ошибок","Email test":"Тест по электронной почте","View master log":"Просмотреть основной журнал","Wiki help":"Помощь вики","An application by HaveAGitGat":"Приложение от HaveAGitGat","New":"новый","Launch":"запуск","Benchmark":"эталонный тест","See results":"Посмотреть результаты","Pause queue":"Пауза в очереди","Continue queue":"Продолжить очередь","Stop queue":"Остановить очередь","Convert selected files":"Конвертировать выбранные файлы","Toggle queue view":"Переключить вид очереди","Deselect all":"Убрать выделение со всего","Invert all":"Инвертировать все","Select all":"Выбрать все","Toggle output view":"Переключить вид вывода"}