{"The number of custom presets does not match the number of source folders!":"Število prednastavitev po meri se ne ujema s številom izvirnih map!","source folders have been detected.":"so bile odkrite izvorne mape.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"so bile zaznane prednastavljene vrstice po meri. Preverite, ali so nevidni prelomi vrstic. Na vrstico mora biti ena mapa ali prednastavitev. Prepričajte se, da niste pomotoma ustvarili prazne vrstice.","The number of filename suffixes does not match the number of source folders! ":"Število pripon datotek se ne ujema s številom izvirnih map!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"Odkrite so bile pripone za imena datotek. Preverite, ali so nevidni prelomi vrstic. Na vrstico mora biti ena pot do datoteke ali pripona datoteke. Prepričajte se, da niste pomotoma ustvarili prazne vrstice.","The number of source folders does not match the number of destination folders!":"Število izvirnih map se ne ujema s številom ciljnih map!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"so bile zaznane ciljne mape. Preverite, ali so nevidni prelomi vrstic. Na vrstico mora biti ena pot mape. Prepričajte se, da niste pomotoma ustvarili prazne vrstice.","The number of source folders does not match the number of temporary conversion folders!":"Število izvirnih map se ne ujema s številom začasnih map za pretvorbo!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"so bile zaznane začasne mape za konverzijo. Preverite, ali so nevidni prelomi vrstic. Na vrstico mora biti ena pot mape. Prepričajte se, da niste pomotoma ustvarili prazne vrstice.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Vnesite veljaven vsebnik, na primer \".mp4\". Prepričajte se, da ste vključili ».«","Corrupt file folder":"Poškodovana mapa datoteke","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ne obstaja! Prepričajte se, da pred potjo ali po njej ni presledkov ali skritih znakov","Source folder":"Izvorna mapa","Temporary conversion folder":"Začasna mapa za konverzijo","appears to be the same as or is within source folder":"zdi se, da je enaka ali je v izvorni mapi","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ki bo preprečila pravilno delovanje HBBatchBeast. Spremenite začasno mapo za pretvorbo v mapo zunaj izvorne mape. Če želite uporabljati funkcijo »Zamenjaj izvirne datoteke«, izberite ciljno mapo, ki ni ista ali v izvorni mapi, in potrdite polje »Zamenjaj vedno izvirne datoteke« v razdelku naprednih nastavitev. . Počistite potrditveno polje začasne mape »Začasna mapa za konverzijo«, ker v tem primeru ne bo uporabno. Datoteke bodo pretvorjene v ciljno mapo in nato ponovno v izvorno mapo.","Destination folder":"Ciljna mapa","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ki bo preprečila pravilno delovanje HBBatchBeast. Spremenite ciljno mapo v mapo zunaj izvorne mape. Če želite uporabljati funkcijo »Zamenjaj izvirne datoteke«, izberite ciljno mapo, ki ni ista ali v izvorni mapi, in potrdite polje »Zamenjaj vedno izvirne datoteke« v razdelku naprednih nastavitev. . Počistite potrditveno polje začasne mape »Začasna mapa za konverzijo«, ker v tem primeru ne bo uporabno. Datoteke bodo pretvorjene v ciljno mapo in nato ponovno v izvorno mapo.","Error creating temporary conversion folder":"Napaka pri ustvarjanju začasne mape za konverzijo","Error creating destination folder":"Napaka pri ustvarjanju ciljne mape","Please select to use HandBrake or FFmpeg!":"Prosimo, izberite uporabo ročnega zaviranja ali FFmpeg!","Please select a standard preset or input a custom one!":"Izberite standardno prednastavitev ali vnesite prilagojeno!","Please select a scan interval of 5 seconds or greater!":"Izberite interval skeniranja 5 sekund ali več!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Prepričajte se, da je število sočasno uporabljenih HandBrake / FFmpeg primerkov eno ali več!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Neveljaven ključ API-ja! Kliknite \"Novo\" na zavihku za oddaljeni nadzor, da ustvarite nov ključ.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Vnesite čas skeniranja v 24-urnem formatu: hh: mm (na primer 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"FILMI IZVORA bodo izbrisani po preobrazbi! Prosimo, preverite pred pravilno uporabo!","Benchmark failed!":"Merilo uspešnosti ni uspelo!","Log does not exist!":"Dnevnik ne obstaja!","Folder does not exist!":"Mapa ne obstaja!","Error sending email! Please check your settings.":"Napaka pri pošiljanju e-pošte! Preverite nastavitve.","Test email sent!":"Poslano testno e-poštno sporočilo!","All worker processes have been stopped.":"Vsi delovni procesi so bili ustavljeni.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Čakalna vrsta bo zaustavljena, ko bodo obdelani trenutni elementi. Ali ste prepričani, da želite zaustaviti čakalno vrsto?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Ko se vsi delavci ustavijo, se bo pojavil gumb za prekinitev čakalne vrste.","Healthy file cache cleared!":"Zdrava predpomnilnik datotek se počisti!","Cache cleared!":"Predpomnilnik je izbrisan!","Cancel item":"Prekliči element","Please check the above checkbox to use this feature.":"Če želite uporabiti to funkcijo, preverite zgornje potrditveno polje.","Configuration":"Konfiguracija","Source folders":"Izvorne mape","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"To je izvorna mapa, ki se bo skenirala za medije. Mape je treba vnesti brez zaključne poševnice. Na primer:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Polje poti izvorne mape je mogoče razširiti (pritisnite Enter, da ustvarite novo vrstico). Če želite določiti več izvirnih map, se prepričajte, da je vsaka pot izvirne mape v svoji vrstici, na primer:","Video health check":"Pregled stanja videoposnetka","Batch conversion and Folder watching":"Batch konverzijo in gledanje mape","Remote Monitoring (Beta)":"Oddaljeno spremljanje (beta)","Benchmark (Beta)":"Merilo uspešnosti (beta)","System":"Sistem","Help":"Pomoč","Temporary conversion folders":"Začasne mape za konverzije","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Če »Začasna mapa za konverzijo?« je označeno, potem bo HandBrake pretvoril datoteke v to mapo. Ko je konverzija končana, bo datoteka premaknjena v mapo »Cilj«. Kot izvorne mape boste morali podati toliko začasnih map za pretvorbo. Vaša prva izvirna mapa bo pretvorjena v vašo prvo začasno mapo za pretvorbo, v drugo izvorno mapo v drugo začasno mapo za konverzijo in tako naprej. Prepričajte se, da je vsaka začasna pot mape za konverzije na svoji vrstici.","Destination folders":"Ciljne mape","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Določite poti do ciljne mape. Še enkrat, kot izvorne mape morate določiti toliko ciljnih map. Datoteke iz vaše prve izvorne mape se bodo končale v vaši prvi ciljni mapi, datoteke druge izvorne mape v vaši drugi ciljni mapi in tako naprej.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Prva izvirna mapa ---------> Prva začasna mapa za konverzijo ---------> Prva ciljna mapa","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Druga mapa izvora ---------> Druga začasna mapa za konverzijo ---------> Druga ciljna mapa","etc":"itd","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast ne bo deloval pravilno, če boste ciljno mapo nastavili enako kot izvorno mapo ali znotraj nje.","Standard preset:":"Standardna prednastavitev:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Izberite prednastavitev HandBrake, s katero želite pretvoriti datoteke. Če je izbrana možnost \"Standard preset\", se vse datoteke v izbranih mapah pretvorijo z uporabo določene prednastavitve HandBrake. Več o prednastavitvah ročne zavore najdete tukaj:","Custom preset:":"Prednastavitev po meri:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Če je \"Custom preset\", morate vnesti lastno prednastavitev po meri. HBBatchBeast pokriva del \"HandBrakeCLI -i izvor -o destinacijo\" vnosa HandBrakeCLI, zato morate vnesti parametre pretvorbe. Na primer:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Če uporabljate FFmpeg, morate ločiti vhodne in izhodne parametre z vejico. Kot naprimer:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Lahko se povežete tudi s prednastavitvijo po meri, ki je bila izvožena iz uradne GUI aplikacije HandBrake, na primer:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Če imate težave s prednastavitvami po meri, je to lahko posledica znane napake s funkcijo HandBrakeCLI (bo popravljena v naslednji izdaji HandBrakeCLI). Oglejte si to za začasno rešitev:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Vsaka prednastavitev po meri mora biti na svoji liniji in podobno kot v mapah mora biti toliko prednastavitev po meri kot izvorne mape.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Prva izvirna mapa ---------> Prva začasna mapa za konverzijo ---------> Prva ciljna mapa @ Prednastavitev po meri 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Druga izvorna mapa ---------> Druga začasna mapa za konverzijo ---------> Druga ciljna mapa @ Custom preset 2","See the following image for guidance:":"Za navodila si oglejte naslednjo sliko:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Če uporabljate kodiranje grafične kartice (kot je NVENC), boste morda morali zaradi omejitev VRAM zmanjšati število primerkov HandBrake (poskusite 2 ali manj).","Select standard preset:":"Izberite standardno prednastavitev:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC je zaznal, se prepričajte, da ste zmanjšali število primerkov HandBrakeCLI na 2 ali manj (za večino grafičnih kartic) ali pa lahko naletite na napake zaradi premajhnega števila VRAM. To nastavitev lahko najdete na zavihku \"Sistem\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Zaznana je bila uvožena prednastavitev. Če imate težave z uvoženimi prednastavitvami po meri, je to lahko posledica znanega napake s funkcijo HandBrakeCLI (bo določena v naslednji izdaji HandBrakeCLI). Začasna rešitev je odstraniti \"PictureRotate\": \"0: 0\" iz datoteke .json. Več informacij tukaj:","Container:":"Zabojnik:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Podajte vsebnik, za katerega želite, da ima izhodna datoteka, na primer ».mp4«. Več o zabojnikih lahko izveste na:","Enable periodic scanning:":"Omogoči periodično pregledovanje:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast lahko spremlja vaše izvorne mape in zažene preglede za nove datoteke v določenem intervalu. Časovni interval je v sekundah, privzeta vrednost pa je 300 sekund (5 minut). Če je izbrana ta možnost, potem, ko pritisnete »Scan and convert«, bo program pretvoril vse nove datoteke in nato se bo začel odštevalnik. To se bo do konca ustavilo neskončno. Interval skeniranja je v razdelku naprednih nastavitev.","Enable daily scanning:":"Omogoči dnevno pregledovanje:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Namesto rednega skeniranja lahko izberete, ali naj se skeniranje izvaja enkrat na dan. Čas skeniranja se vnese v razdelek naprednih nastavitev v formatu hh: mm, kot je na primer '18: 30 '. Ko je izbrana možnost »Scan and convert«, bo program počakal do določenega časa, dokler ne zažene postopek skeniranja in pretvorbe. Tudi to se bo do konca ustavilo.","Show/hide advanced:":"Pokaži / skrij napredno:","Scan interval (minimum 5 seconds):":"Interval skeniranja (najmanj 5 sekund):","Daily run time (hh:mm):":"Dnevni čas delovanja (hh: mm):","Output filename suffix:":"Izhodna pripona imena datoteke:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"To ni obvezno. Določite lahko pripono, ki jo želite dodati na konec imena datoteke, na primer '_1080p' ali '_testconversion' itd.","If 'standard preset' is selected then all output files will have the same suffix.":"Če je izbrana možnost 'standard preset', bodo imele vse izhodne datoteke isto pripono.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Če je izbrana možnost 'custom preset', lahko določite eno pripono na izvorno mapo / prednastavitev po meri. Prepričajte se, da je vsaka pripona v svoji vrstici. Če imate na primer 2 izvorni mapi in uporabljate »prednastavitev po meri«, jo lahko postavite v polje pripone imena datoteke:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Datoteke v prvi izvorni mapi bodo dodane v datoteko \"_720p\". Datoteke v drugi izvorni mapi bodo imele dodano '_1080p' v izhodno ime datoteke itd.","Include these file containers:":"Vključi te vsebnike datotek:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Vnesite vsebnike datotek za iskanje. Vsak tip mora biti ločen z vejico. Privzeti vnos je:","Exclude files smaller than (MB):":"Izključi datoteke, manjše od (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Določite, ali želite iz konverzije izključiti datoteke, manjše od določene velikosti (v megabajtih)","Exclude files larger than (MB):":"Izključi datoteke, večje od (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Določite, ali želite iz konverzije izključiti datoteke, ki so večje od določene velikosti (v megabajtih)","Exclude filenames which include any of these words:":"Izključite imena datotek, ki vsebujejo katero koli od naslednjih besed:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Vnesite ključne besede, ki jih želite filtrirati med skeniranjem datotek. Če na primer vnesete »720p«, se vse datoteke z »720p« v naslovu ne pretvorijo. Ponovno moramo ključne besede ločiti z vejico. V polje za filter na primer vnesite naslednje:","Include files with any ":"Vključi datoteke s katerim koli"," or all ":"ali vse"," of these":"teh","properties:":"lastnosti:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Tukaj lahko vnašate video in avdio lastnosti, ki jih morajo imeti datoteke, da jih lahko pretvorite (info izčrpa s pomočjo FFprobe). Lastnosti morajo biti ločene z vejico. Z orodjem za prikazovanje podatkov o predstavnosti določite, katere lastnosti želite vključiti. Poskrbite, da boste za zadnjo lastnostjo postavili vejico. Na primer, pretvorite samo datoteke, ki so kodirane z uporabo h264 in stereo zvoka aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Treba je omeniti, da se to preverjanje lastnosti izvede, ko se začne postopek konverzije (da prihranimo čas pri gradnji čakalne vrste), čeprav se datoteke lahko pojavijo v čakalni vrsti za pretvorbo, bodo preskočene / vključene, če so izpolnjeni pravilni pogoji.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Če lahko FFprobe ekstrahira lastnosti, se bo v stolpcu \"FFprobe\" v pogledu čakalne vrste pojavil 'OK'.","Exclude files with any ":"Izključi datoteke s katerim koli"," of these ":"teh","The opposite of 'Include files with any or all of these properties'":"Nasprotno od »Vključi datoteke s katero koli ali vsemi temi lastnostmi«","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"To je majhno orodje za analizo lastnosti datotek, da bi vam pomagali ugotoviti, katere lastnosti želite vključiti / izključiti v zgornjih možnostih. Za vrnitev podatkov uporablja FFprobe. Povlecite in spustite datoteke v sivo polje, da jih analizirate. Spuščanje v preskusno datoteko lahko na primer vrne naslednje:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Če želite datoteke, kot je ta, izključiti iz pretvorbe, lahko v polje »Izključi datoteke s katero koli ali vse te lastnosti« vnesete več lastnosti datoteke in potrdite polje poleg »vsi« namesto »vse«, tako:","Copy excluded files to destination:":"Kopiraj izključene datoteke na cilj:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Če izberete to možnost, se datoteke, ki so bile izključene iz konverzije, kopirajo neposredno v ciljno mapo. To velja za naslednje filtre:","Exclude filenames which include any of these words":"Izključite imena datotek, ki vsebujejo katero koli od teh besed","Include files with any or all of these properties":"Vključite datoteke s katero koli ali vsemi temi lastnostmi","Exclude files with any or all of these properties":"Izključite datoteke s katero koli ali vsemi temi lastnostmi","Exclude files smaller than (MB)":"Izključi datoteke, manjše od (MB)","Exclude files larger than (MB)":"Izključi datoteke, večje od (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Upoštevajte, da to velja tudi za izvzete datoteke, ker ne ustrezajo pogojem lastnosti »Vključi« zgoraj, zato ne morete slučajno kopirati celotne knjižnice, ko poskušate pretvoriti le nekaj datotek.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Funkcija kopiranja ne velja za naslednje filtre (tj. Datoteke, ki so izključene zaradi filtra)","Include these file types":"Vključite te vrste datotek","Delete source files after conversion:":"Po konverziji izbrišite izvorne datoteke:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Če je ta možnost izbrana, bo v primeru uspešnega preusmeritve izvorna datoteka izbrisana. Ta proces se izvede na samem koncu, po konverziji vseh datotek. To pomeni, da lahko iste izvorne datoteke pretvorite z več prednastavitvami, vse naenkrat. Izvirne datoteke bodo nato izbrisane.","Replace original file if converted file is smaller?(Compress attempt)":"Če je pretvorjena datoteka manjša, zamenjajte izvirno datoteko? (Poskus stiskanja)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Izberite to potrditveno polje, če želite, da HBBatchBeast samodejno zamenja izvirno izvorno datoteko, če je nova datoteka manjša. Če nova datoteka ni manjša, bo ostala v ciljni mapi.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Poskrbite, da ciljna mapa ni ista kot v izvorni mapi ali ne bo delovala pravilno.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Ko bo HBBatchBeast poskušal stisniti določeno datoteko, bo to datoteko dodal v predpomnilnik, tako da se v prihodnje ne bo ponovil. Z rumenimi gumbi lahko pregledate / uredite / počistite predpomnilnik.","Replace original file always?":"Vedno zamenjajte izvirno datoteko?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Izvirna datoteka bo zamenjana ne glede na to, ali je nova datoteka večja ali manjša.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Še enkrat se prepričajte, da ciljna mapa ni ista kot v izvorni mapi ali ne bo delovala pravilno.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Ko je HBBatchBeast prekodiral določeno datoteko, bo to datoteko dodal v predpomnilnik, tako da v prihodnje ne bo več poskus. Z rumenimi gumbi lahko pregledate / uredite / počistite predpomnilnik.","Copy subtitle (srt) files to destination?":"Kopiranje datotek (srt) na cilj?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Datoteke s podnapisi \".srt\" se bodo samodejno kopirale v ciljno mapo.","Automatically create temporary/destination folders if they don't exist?":"Samodejno ustvarite začasne / ciljne mape, če ne obstajajo?","Custom bat path to run after each conversion (leave blank if not using):":"Pot po meri za predvajanje po vsakem preusmerjanju (pustite prazno, če ne uporabljate):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Vnesite pot do paketne datoteke po meri, ki jo želite izvesti po vsaki pretvorbi. Na primer:","Batch files with timeout statements won't work. More info here:":"Paketne datoteke s časovnimi stavkami ne bodo delovale. Več informacij tukaj:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Če ne želite uporabljati te možnosti, pustite polje popolnoma prazno (poskrbite, da v polju ni skritih znakov)","Run processes at low priority?":"Izvajajte procese z nizko prioriteto?","All conversion processes will be run at low priority, reducing processor usage.":"Vsi postopki konverzije se bodo izvajali z nizko prioriteto in zmanjšali porabo procesorja.","Remove apostrophes from filenames:":"Odstrani apostrofe iz imen datotek:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Konverzije / pregled stanja zdravja morda ne bodo uspešne, če imajo imena datotek v apostrofih. Izberite to možnost, če želite samodejno odstraniti apostrope iz imen datotek."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Ta funkcija omogoča skeniranje poškodovanih video datotek s funkcijo »--scan« HandBrake, čeprav to ni vedno natančno. Uporablja tudi FFprobe, da zagotovi drugo referenčno točko. Če FFprobe in HandBrake ne uspe, obstaja velika verjetnost, da je datoteka poškodovana.","Move corrupt files into the following folder:":"Premakni pokvarjene datoteke v to mapo:"," If checked, then any files which give errors will be moved into the specified folder.":"Če je označeno, bodo vse datoteke, ki dajo napake, premaknjene v določeno mapo.","Corrupt file folder:":"Poškodovana mapa datoteke:","Run thorough file health check:":"Izvedite podroben pregled stanja datoteke:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Če je označeno, se bo s FFmpeg namesto HandBrake izvajal precej počasnejši pregled videa."," Based on Desani's 'ScanMedia.ps1' found at:":"Na podlagi Desanijevega \"ScanMedia.ps1\", najdenega na:","Attempt to repair files after thorough check:":"Po temeljitem preverjanju poskusite popraviti datoteke:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Če je izbrano, bo HBBatchBeast poskušal popraviti datoteke s pomočjo FFmpeg. Nova datoteka s pripono »_repaired« bo ustvarjena v isti mapi kot izvorna datoteka.","'CRF' value to use when attempting to repair files:":"Vrednost 'CRF' za uporabo pri poskusu popravila datotek:","The default 'CRF' value is 23. Please see the following for more information:":"Privzeta vrednost \"CRF\" je 23. Za več informacij glejte naslednje:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Območje lestvice CRF je 0–51, pri čemer je 0 brez izgube, 23 je privzeto in 51 je najslabša možna kakovost. Nižja vrednost na splošno vodi do višje kakovosti, subjektivno razumno območje pa je 17–28. Razmislite o 17 ali 18, da je vizualno brez izgub ali skoraj tako; izgledati mora enako ali skoraj enako kot vhod, vendar tehnično ni brez izgube.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast shrani seznam poti skeniranih datotek, ki so bile prijavljene kot nepokvarjene. Počistite predpomnilnik in izvedite novo pregledovanje vseh datotek.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Število sočasnih primerkov za ročno zaviranje / FFmpeg za uporabo? (Priporočeno 4 ali manj):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Ta nastavitev velja za postopke »Preverjanje zdravja videoposnetkov« in »Optično branje in pretvorba«. Določite, koliko navadnih ročic je treba uporabiti. Ni najvišjega, čeprav je priporočljivo, da ne uporabljate več kot 4. Večji znesek lahko zamrzne vaš računalnik, če ni zelo zmogljiv.","Queue size view limit?(Recommended 1000 or fewer):":"Omejitev prikaza velikosti čakalne vrste? (Priporočeno 1000 ali manj):","Automatically start \"Scan and convert\" when program opened?:":"Samodejno zaženi »Optično branje in pretvorba«, ko se program odpre ?:","Save verbose logs?:":"Shranite podrobne dnevnike ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Potrdite to polje, da shranite podrobne dnevnike podprocesov. To vključuje delovno konzolo izhoda. To bo povzročilo zelo velike dnevnike.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Izpolnite e-poštne podatke, če želite prejeti e-poštna obvestila, če pride do napake med pregledom stanja ali pregledovanjem map. Ne bo delal z računi, ki zahtevajo 2FA. Na računu Gmail morate omogočiti dostop do manj varnih aplikacij.","Email address:":"Email naslov:","For example:":"Na primer:","Email password(not saved):":"Geslo za e-pošto (ni shranjeno):","SMTP server:":"Strežnik SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Ta funkcija omogoča spremljanje stanja konverzije / zdravstvenega pregleda s katerim koli spletnim brskalnikom. Uporabno pri zaganjanju strežnikov itd. Ni poslanih imen datotek.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Če je omogočeno, bodo na HBBatchBeast.io poslani naslednji anonimni podatki:","API key":"Ključ API","Current status ('Searching', 'Running', 'Finished' etc)":"Trenutno stanje (»Iskanje«, »Izvajanje«, »Dokončano« itd.)","Number of:":"Število:","Remaining items":"Preostali elementi","Successful items":"Uspešni elementi","Errored items":"Napačni elementi","Cancelled items":"Preklicani elementi","Worker percentages":"Odstotek delavcev","Last completed item time":"Čas zadnje končane postavke","Enable remote monitoring?:":"Omogoči daljinski nadzor ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Osnovni pripomoček za primerjalno analizo, zgrajen predvsem zato, da vidimo, kako 16+ jedrnih procesorjev deluje z več primerki HandBrake, čeprav ga je mogoče zagnati na vseh vrstah procesorjev.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"To bo preneslo vzorčno datoteko h265 4k (2.5MB) in zagnalo merilo z uporabo 4 primerkov HandBrake s prednastavitvijo \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Rezultate lahko naložite v hbbatchbeast.io, če se odločite.","Queue":"Čakalna vrsta","Output this session":"Izvedite to sejo","Media info viewer tool":"Orodje za prikazovanje informacij o predstavnosti","View replaced file cache":"Ogled zamenjanega predpomnilnika datotek","Clear replaced file cache":"Počisti zamenjani predpomnilnik datotek","Save config":"Shrani konfiguracijo","Scan only":"Samo optično branje","Scan and convert":"Skenirajte in pretvorite","View scan/conversion summary log":"Ogled dnevnika skeniranja / konverzije","View individual file check/conversion log":"Ogled dnevnika za preverjanje / pretvorbo posameznih datotek","View worker console output":"Oglejte si izhodne ukazne mize delavca","Health check":"Zdravstveni pregled","Clear healthy file cache":"Počisti zdrave predpomnilnike datotek","View error log":"Ogled dnevnika napak","Email test":"E-poštni test","View master log":"Ogled glavnega dnevnika","Wiki help":"Wiki pomoč","An application by HaveAGitGat":"Aplikacija HaveAGitGat","New":"Novo","Launch":"Kosilo","Benchmark":"Merilo uspešnosti","See results":"Oglejte si rezultate","Pause queue":"Začasno ustavite čakalno vrsto","Continue queue":"Nadaljuj s čakalno vrsto","Stop queue":"Ustavi čakalno vrsto","Convert selected files":"Pretvorite izbrane datoteke","Toggle queue view":"Preklapljanje pogleda čakalne vrste","Deselect all":"Odznačite vse","Invert all":"Obrni vse","Select all":"Izberi vse","Toggle output view":"Preklop prikaza izhodov"}