{"The number of custom presets does not match the number of source folders!":"Numri i parapëlqimeve të personalizuara nuk përputhet me numrin e dosjeve burimore!","source folders have been detected.":"janë zbuluar dosjet burimore.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"janë zbuluar linjat paraprake me porosi. Ju lutemi kontrolloni dy herë për ndërprerjet e linjave të padukshme. Duhet të ketë një shteg dosjeje ose paraprakisht për rresht. Sigurohuni që nuk keni krijuar aksidentalisht një vijë bosh.","The number of filename suffixes does not match the number of source folders! ":"Numri i suffixes filename nuk përputhet me numrin e dosjeve burim!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"linjat e prapashtesave të skedarit janë zbuluar. Ju lutemi kontrolloni dy herë për ndërprerjet e linjave të padukshme. Duhet të ketë një shteg dosjeje ose prapashtesë filename për rresht. Sigurohuni që nuk keni krijuar aksidentalisht një vijë bosh.","The number of source folders does not match the number of destination folders!":"Numri i dosjeve burimore nuk përputhet me numrin e dosjeve të destinacionit!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"dosjet e destinacionit janë zbuluar. Ju lutemi kontrolloni dy herë për ndërprerjet e linjave të padukshme. Duhet të ketë një shteg dosjeje për rresht. Sigurohuni që nuk keni krijuar aksidentalisht një vijë bosh.","The number of source folders does not match the number of temporary conversion folders!":"Numri i dosjeve burimore nuk përputhet me numrin e dosjeve të konvertimit të përkohshëm!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"janë zbuluar dosjet e konvertimit të përkohshëm. Ju lutemi kontrolloni dy herë për ndërprerjet e linjave të padukshme. Duhet të ketë një shteg dosjeje për rresht. Sigurohuni që nuk keni krijuar aksidentalisht një vijë bosh.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Futni një enë të vlefshme siç është '.mp4'. Sigurohuni që të përfshini '.'","Corrupt file folder":"Dosja e skedarëve të korruptuar","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"nuk ekziston! Sigurohuni që nuk ka hapësira apo karaktere të fshehura para / pas rrugës","Source folder":"Dosje burimore","Temporary conversion folder":"Dosja e përkohshme e konvertimit","appears to be the same as or is within source folder":"duket të jetë i njëjtë me ose është brenda dosjes së burimit","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"i cili do të parandalojë HBBatchBeast nga funksionimi i saktë. Ndryshoni dosjen e konvertimit të përkohshëm në një dosje jashtë dosjes së burimit. Nëse dëshironi të përdorni funksionin 'Replace original files', zgjidhni një dosje të destinacionit që nuk është e njëjtë me ose brenda dosjes së burimit dhe pastaj kontrolloni kutinë e zgjedhjes 'Replace original files always' në seksionin e cilësimeve të avancuara . Çaktivizo kutinë e zgjedhjes së përkohshme të \"dosjes së përkohshme të konvertimit\" pasi ajo nuk do të përdorë asnjë përdorim në këtë rast. Dosjet do të konvertohen në dosjen e destinacionit dhe pastaj do të zhvendosen përsëri në dosjen burimore.","Destination folder":"Dosja e Destinacionit","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"i cili do të parandalojë HBBatchBeast nga funksionimi i saktë. Ndrysho dosjen e destinacionit në një dosje jashtë dosjes së burimit. Nëse dëshironi të përdorni funksionin 'Replace original files', zgjidhni një dosje të destinacionit që nuk është e njëjtë me ose brenda dosjes së burimit dhe pastaj kontrolloni kutinë e zgjedhjes 'Replace original files always' në seksionin e cilësimeve të avancuara . Çaktivizo kutinë e zgjedhjes së përkohshme të \"dosjes së përkohshme të konvertimit\" pasi ajo nuk do të përdorë asnjë përdorim në këtë rast. Dosjet do të konvertohen në dosjen e destinacionit dhe pastaj do të zhvendosen përsëri në dosjen burimore.","Error creating temporary conversion folder":"Gabim në krijimin e dosjes së konvertimit të përkohshëm","Error creating destination folder":"Gabim gjatë krijimit të dosjes së destinacionit","Please select to use HandBrake or FFmpeg!":"Ju lutemi zgjidhni të përdorni HandBrake ose FFmpeg!","Please select a standard preset or input a custom one!":"Ju lutemi zgjidhni një standard të paravendosur ose futni një porosi!","Please select a scan interval of 5 seconds or greater!":"Ju lutemi zgjidhni një interval scan prej 5 sekonda ose më shumë!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Ju lutemi sigurohuni që numri i instancave HandBrake / FFmpeg të njëkohshme për t'u përdorur është një ose më shumë!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Çelësi i pavlefshëm i API! Ju lutemi klikoni 'New' në tabin e monitorimit të largët për të gjeneruar një çelës të ri.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Ju lutemi shkruani një kohë të përditshme scan në formatin 24 orë: hh: mm (për shembull 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"DOKUMENTAT E BURIMIT DO TË ZGJEDHET PAS KONVERSIONIT! Ju lutemi provoni para përdorimit të duhur!","Benchmark failed!":"Benchmark dështoi!","Log does not exist!":"Regjistri nuk ekziston!","Folder does not exist!":"Dosja nuk ekziston!","Error sending email! Please check your settings.":"Gabim në dërgimin e emailit! Kontrollo cilësimet e tua.","Test email sent!":"Mesazhi i testimit u dërgua!","All worker processes have been stopped.":"Të gjitha proceset e punëtorëve janë ndalur.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Rreshtimi do të ndalet pasi artikujt aktualë të kenë përfunduar përpunimin. Jeni i sigurt që doni ta ndalni radhën?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Pauza e rreshtit filloi. Butoni 'vazhdo' do të shfaqet sapo të gjithë punëtorët të ndalen.","Healthy file cache cleared!":"Skedar i shëndetshëm i skedarëve u pastrua!","Cache cleared!":"Cache u pastrua!","Cancel item":"Anulo artikullin","Please check the above checkbox to use this feature.":"Kontrollo kutinë e mësipërme për të përdorur këtë funksion.","Configuration":"konfiguracion","Source folders":"Dosjet e burimit","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Kjo është dosja burimore e cila do të skanohet për mediat. Dosja duhet të futet pa asnjë zvogëlim zvarritës. Për shembull:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Kutia e dosjes së dosjes së burimit mund të zgjerohet (shtypni enter për të krijuar një linjë të re). Nëse doni të specifikoni dosjet e shumëfishta burimesh, sigurohuni që çdo shteg dosje burimesh të jetë në linjën e vet si:","Video health check":"Kontrolli shëndetësor i videos","Batch conversion and Folder watching":"Konvertimi i serisë dhe shikimi i dosjeve","Remote Monitoring (Beta)":"Monitorimi në distancë (Beta)","Benchmark (Beta)":"Benchmark (Beta)","System":"sistem","Help":"Ndihmë","Temporary conversion folders":"Dosjet e përkohshme të konvertimit","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Nëse \"dosje e konvertimit të përkohshëm?\" është e kontrolluar, atëherë HandBrake do të konvertojë skedarët në atë dosje. Sapo të përfundojë konvertimi, skedari do të zhvendoset në dosjen tuaj \"Destinacioni\". Ju do të duhet të specifikoni sa më shumë dosje të konvertimit të përkohshëm si dosjet burimore. Dosja juaj e parë burimore do të konvertohet në dosjen tuaj të parë të konvertimit të përkohshëm, dosjen tuaj të dytë të burimit në dosjen tuaj të dytë të përkohshme të konvertimit dhe kështu me radhë. Sigurohuni që çdo rrugë e përkohshme e dosjes së konvertimit të jetë në vijën e vet.","Destination folders":"Dosjet e destinacionit","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Specifikoni shtigjet e dosjes së destinacionit. Përsëri, do t'ju duhet të specifikoni sa më shumë dosje të destinacionit si dosjet burimore. Dosjet nga dosja e parë burimore do të përfundojnë në dosjen tuaj të parë të destinacionit, skedarët e dosjes së dytë të dosjes së burimit në dosjen tuaj të dytë të destinacionit dhe kështu me radhë.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Dosja e burimit të parë ---------> Dosja e parë e konvertimit të përkohshëm ---------> Dosja e parë e destinacionit","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Dosja e dytë burimore ---------> Dosja e dytë e konvertimit të përkohshëm ---------> Dosja e dytë e destinacionit","etc":"etj","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast nuk do të funksionojë siç duhet nëse vendosni dosjen e destinacionit të njëjtë si ose brenda, dosjen burimore.","Standard preset:":"Preset standarde:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Përzgjidhni parazgjedhjen e HandBrake që dëshironi të konvertojë skedarët tuaj. Nëse është zgjedhur \"Standard preset\", atëherë të gjitha dosjet në dosjet e përzgjedhura do të konvertohen duke përdorur parazgjedhjen e paracaktuar të HandBrake. Ju mund të gjeni më shumë rreth Presets HandBrake këtu:","Custom preset:":"Parazgjedhja e personalizuar:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Nëse \"Custom preset\" atëherë ju duhet të shkruani parapagesën tuaj personale. HBBatchBeast mbulon pjesën \"HandBrakeCLI -i source -o destination\" të inputit HandBrakeCLI kështu që ju duhet të futni parametrat e konvertimit. Për shembull:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Nëse përdorni FFmpeg, duhet të ndani parametrat e hyrjes dhe të daljes me një presje. Të tilla si:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Ju gjithashtu mund të lidheni me një parazgjedhje me porosi që është eksportuar nga aplikacioni zyrtar i HandBrake GUI për shembull:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Nëse ke probleme me parazgjedhjet e personalizuara, kjo mund të jetë për shkak të një problemi të njohur me HandBrakeCLI (do të fiksohet në lëshimin tjetër të HandBrakeCLI). Ju lutem shihni këtë për një zgjidhje të përkohshme:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Çdo parakusht i personalizuar duhet të jetë në linjën e vet dhe, ngjashëm me dosjet, duhet të ketë po aq precace të personalizuara si dosjet burimore.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Dosja e parë e burimit ---------> Dosja e parë e konvertimit të përkohshëm ---------> Dosja e parë e destinacionit @ Parapëlqyeri personal 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Dosja e burimit të dytë ---------> Dosja e dytë e konvertimit të përkohshëm ---------> Dosja e dytë e destinacionit @ Parazgjedhja e personalizuar 2","See the following image for guidance:":"Shikoni imazhin e mëposhtëm për udhëzime:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Nëse përdorni encoding kartelë grafike (si NVENC), atëherë mund t'ju duhet të zvogëloni numrin e rasteve të HandBrake (provoni 2 ose më pak) për shkak të kufizimeve VRAM.","Select standard preset:":"Zgjidhni paraprakisht standarde:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC zbuluar, sigurohuni që të zvogëloni numrin e rasteve të HandBrakeCLI në 2 ose më poshtë (për shumicën e kartave grafike) ose mund të hasni gabime për shkak të VRAM-it jo të mjaftueshëm. Ky cilësim mund të gjendet në skedën \"Sistemi\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Parazgjedhja e importuar e zbuluar. Nëse ke probleme me parazgjedhjet e importuara të porosi, mund të jetë për shkak të një problemi të njohur me HandBrakeCLI (do të fiksohet në lirimin e ardhshëm të HandBrakeCLI). Një zgjidhje e përkohshme është që të hiqet \"PictureRotate\": \"0: 0\" nga skedari .json. Më shumë informacion këtu:","Container:":"enë:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Specifikoni enën që dëshironi që skedari i prodhimit të ketë të tilla si '.mp4'. Mund të gjeni më shumë rreth kontejnerëve në:","Enable periodic scanning:":"Aktivizo skanimin periodik:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast mund të monitorojë dosjet tuaja të burimit dhe të kryejë skanime për skedarë të rinj në një interval të caktuar. Koha e intervalit është në sekonda, ndërsa default është 300 sekonda (5 minuta). Nëse ky opsion është zgjedhur, atëherë kur shtypni \"Skano dhe konverto\", programi do të konvertojë çdo skedar të ri dhe pastaj do të fillojë një numërues i numërimit. Kjo do të përfundojë pafundësisht deri sa të ndalet. Intervali i skanimit është në seksionin e cilësimeve të avancuara.","Enable daily scanning:":"Aktivizo skanimin ditor:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Në vend të skanimit periodik, mund të zgjidhni që një skanim të kryhet një herë në ditë. Koha e skanimit futet në seksionin e cilësimeve të përparuara në formatin hh: mm si '18: 30 '. Pasi të zgjidhet \"Scan and convert\", programi do të presë deri në kohën e specifikuar derisa të ekzekutohet procesi i skanimit dhe konvertimit. Përsëri, kjo do të përfundojë pafundësisht deri sa të ndalet.","Show/hide advanced:":"Trego / fsheh avancuar:","Scan interval (minimum 5 seconds):":"Intervali i skanimit (minimum 5 sekonda):","Daily run time (hh:mm):":"Koha e përditshme e punës (hh: mm):","Output filename suffix:":"Prapashti i emrit të skedarit të produktit:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Kjo është fakultative. Ju mund të specifikoni një prapashtesë për të shtuar në fund të emrit tuaj të skedarit si '_1080p' ose '_testconversion' etj.","If 'standard preset' is selected then all output files will have the same suffix.":"Nëse përzgjidhet 'preset standarde' atëherë të gjitha skedarët e prodhimit do të kenë të njëjtin prapashtesë.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Nëse përzgjidhet 'preset me porosi' atëherë mund të specifikoni një prapashtesë për dosjen burimore / parazgjedhjen e personalizuar. Sigurohuni që çdo prapashtesë të jetë në vijën e vet. Për shembull, nëse keni dy dosje burimesh dhe po përdorni \"parazgjedhje me porosi\", mund ta vendosni këtë në kutinë e prapashtesës së skedarit:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Dosjet në dosjen e burimit të parë do të kenë '_720p' shtuar në filename të prodhimit. Dosjet në dosjen e burimit të dytë do të kenë '_1080p' shtuar në filename të prodhimit etj.","Include these file types:":"Përfshirja e këtyre llojeve të skedarëve:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"Futni llojet e skedarëve për të kërkuar. Çdo lloj duhet të ndahet me presje. Hyrja e parazgjedhur është:","Exclude files smaller than (MB):":"Përjashto dosjet më të vogla se (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Specifikoni nëse do të përjashtoni skedarët më të vegjël se një madhësi të caktuar nga konvertimi (në megabytes)","Exclude files larger than (MB):":"Përjashto skedarët më të mëdhenj se (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Specifikoni nëse do të përjashtoni skedarët më të mëdhenj se një madhësi të caktuar nga konvertimi (në megabytes)","Exclude filenames which include any of these words:":"Përjashtohen emrat e skedarëve që përfshijnë ndonjë nga këto fjalë:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Futni fjalë kyçe që filtrohen kur skanim për skedarë. Për shembull, nëse futet \"720p\", atëherë çdo skedar me \"720p\" në titull nuk do të konvertohet. Përsëri, fjalët kyçe duhet të ndahen me presje. Për shembull, futni sa vijon në kutinë e filtrit:","Include files with any ":"Përfshi skedarë me ndonjë"," or all ":"ose të gjitha"," of these":"nga këto","properties:":"Vetitë:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Këtu mund të jepni video dhe audio veçoritë që skedarët duhet të kenë në mënyrë që të konvertohen (info nxjerrë duke përdorur FFprobe). Pronat duhet të ndahen me presje. Përdorni mjetin e shikuesit të informacionit të medias për të ndihmuar në përcaktimin e pronave që dëshironi të përfshiheni. Sigurohuni që të vendosni një presje pas pronës së fundit. Për shembull, për të konvertuar skedarët që janë koduar duke përdorur h264 dhe audio stereo aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Vlen të përmendet se ky kontroll i pronësisë kryhet sapo të fillojë procesi i konvertimit (për të kursyer kohë gjatë ndërtimit të radhës), kështu që edhe pse skedarët mund të shfaqen në radhën e konvertimit, ato do të anashkalohen / përfshihen nëse plotësohen kushtet e duhura.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Nëse FFprobe është në gjendje të nxjerrë prona, atëherë një 'OK' do të shfaqet në kolonën \"FFprobe\" në pamjen e radhës.","Exclude files with any ":"Përjashto skedarët me ndonjë"," of these ":"nga këto","The opposite of 'Include files with any or all of these properties'":"E kundërta e 'Përfshij skedarë me ndonjë ose të gjitha këto prona'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Ky është një vegël e vogël për të analizuar pronat e skedarëve me qëllim që t'ju ndihmojë të përcaktoni se cilat prona do të donit të përfshiheni / përjashtoni në opsionet e mësipërme. Ai përdor FFprobe për kthimin e informacionit. Drag and drop files në kutinë gri për t'i analizuar ato. Për shembull, rënia në një skedë prove mund të kthehet në vijim:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Nëse jeni duke kërkuar të përjashtoni skedarët si kjo nga konvertimi, atëherë mund të vendosni disa prona të skedarëve në kutinë \"Përjashtoni skedarët me ndonjë apo të gjitha këto prona\" dhe kontrolloni kutinë e zgjedhjes pranë \"të gjitha\" në vend të \"ndonjë\" si kështu:","Copy excluded files to destination:":"Kopjo skedarët e përjashtuar në destinacion:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Nëse zgjidhni këtë opsion, skedarët që janë përjashtuar nga konvertimi do të kopjohen direkt në dosjen e destinacionit. Kjo vlen për filtrat e mëposhtëm:","Exclude filenames which include any of these words":"Përjashto emrat e skedarëve që përfshijnë ndonjë nga këto fjalë","Include files with any or all of these properties":"Përfshini skedarët me ndonjë ose të gjitha këto prona","Exclude files with any or all of these properties":"Përjashto skedarët me ndonjë ose të gjitha këto prona","Exclude files smaller than (MB)":"Përjashto skedarët më të vegjël se (MB)","Exclude files larger than (MB)":"Përjashto dosjet më të mëdha se (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Vini re se kjo vlen edhe për skedarët e përjashtuar, sepse ato nuk i plotësojnë kushtet e pronësisë \"Përfshijnë\" si më sipër, prandaj mos kopjoni aksidentalisht jeni bibliotekë e tërë kur jeni duke u përpjekur vetëm për të kthyer disa skedarë.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Tipari i kopjes nuk zbatohet për filtrat e mëposhtëm (p.sh. dosjet e përjashtuara për shkak të filtrit)","Include these file types":"Përfshini këto lloje skedari","Delete source files after conversion:":"Fshi skedarët burimor pas konvertimit:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Nëse kjo është përzgjedhur, atëherë nëse një përpjekje e konvertimit është e suksesshme, skedari i burimit do të fshihet. Ky proces është bërë në fund të fundit, pas konvertimit të të gjitha dosjeve. Kjo do të thotë që ju mund të konvertoni të njëjtat skedarë burimesh duke përdorur presets të shumta, të gjitha në një të shkuar. Dosjet e burimit pastaj do të fshihen më pas.","Replace original file if converted file is smaller?(Compress attempt)":"Replace skedarin origjinal nëse skedari i konvertuar është më i vogël? (Përpjekje për kompresim)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Zgjidhni këtë kuti nëse dëshironi që HBBatchBeast të zëvendësojë automatikisht skedarin origjinal të burimit nëse skedari i ri është më i vogël. Nëse skedari i ri nuk është më i vogël, atëherë do të mbetet në dosjen e destinacionit.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Sigurohuni që dosja juaj e destinacionit të mos jetë e njëjtë me / ose brenda, dosjen tuaj burimore ose nuk do të funksionojë siç duhet.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Pasi HBBatchBeast është përpjekur të compress një skedar të caktuar, ajo do të shtojë atë skedë të skedarit në një cache në mënyrë që ajo të mos tentohet përsëri në të ardhmen. Ju mund të shikoni / modifikoni / fshini cache duke përdorur butonat e verdhë.","Replace original file always?":"Replace file origjinale gjithmonë?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Dosja origjinale do të zëvendësohet pavarësisht nëse skedari i ri është më i madh ose më i vogël.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Përsëri, sigurohuni që dosja e destinacionit tuaj të mos jetë e njëjtë me / ose brenda, dosja e burimit ose ajo nuk do të funksionojë siç duhet.","Copy subtitle (srt) files to destination?":"Kopjoni skedarët e titrave (srt) në destinacion?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Dosjet e subtitle '.srt' do të kopjohen automatikisht në dosjen e destinacionit.","Automatically create temporary/destination folders if they don't exist?":"Krijo automatikisht dosje të përkohshme / destinacion nëse nuk ekzistojnë?","Custom bat path to run after each conversion (leave blank if not using):":"Shtegu me bateri të personalizuar për të kandiduar pas çdo konvertimi (lëni bosh nëse nuk përdorni):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Futni rrugën për një skedar grumbull me porosi që dëshironi të ekzekutoni pas çdo konvertimi. Për shembull:","Batch files with timeout statements won't work. More info here:":"Batch fotografi me deklarata timeout nuk do të funksionojë. Më shumë informacion këtu:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Lëreni kuti krejtësisht të zbrazët nëse nuk dëshironi të përdorni këtë opsion (sigurohuni që nuk ka karakter të fshehur në kuti)","Run processes at low priority?":"Kryen proceset me prioritet të ulët?","All conversion processes will be run at low priority, reducing processor usage.":"Të gjitha proceset e konvertimit do të funksionojnë me prioritet të ulët, duke zvogëluar përdorimin e procesorit.","Remove apostrophes from filenames:":"Hiq apostrofet nga emrat e skedarëve:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Konvertimet / kontrollet e kontrollit të shëndetit mund të dështojnë nëse emrat e skedave kanë apostrofë. Kontrolloni këtë për të hequr automatikisht apostrofat nga emrat e skedarëve."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Ky funksion mund të skanojë skedarët video të korruptuar duke përdorur funksionin '-scan' të HandBrake, edhe pse kjo nuk është gjithmonë e saktë. Gjithashtu përdor FFprobe për të siguruar një pikë referimi të dytë. Nëse të dy FFprobe dhe HandBrake dështojnë atëherë ekziston një shans i madh që skedari të jetë i korruptuar.","Move corrupt files into the following folder:":"Lëvizni skedarët e korruptuar në dosjen e mëposhtme:"," If checked, then any files which give errors will be moved into the specified folder.":"Nëse kontrollohet, atëherë çdo skedar që jep gabime do të zhvendoset në dosjen e specifikuar.","Corrupt file folder:":"Dosja e skedarëve të korruptuar:","Run thorough file health check:":"Kontrolloni skemën e plotë të skedarëve:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Nëse kontrollohet, atëherë një kontroll shumë më i ngadaltë dhe më i plotë i shëndetit të videos do të funksionojë duke përdorur FFmpeg në vend të HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Bazuar në 'ScanMedia.ps1' të Desanit gjendet në:","Attempt to repair files after thorough check:":"Përpjekja për të riparuar skedarët pas kontrollit të plotë:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Nëse kontrollohet, HBBatchBeast do të përpiqet të rregullojë skedarët duke përdorur FFmpeg. Një skedar i ri me prapashtesën '_repaired' do të krijohet në të njëjtën dosje si skedari burimor.","'CRF' value to use when attempting to repair files:":"Vlera 'CRF' për t'u përdorur kur përpiqesh të korrigjosh skedarët:","The default 'CRF' value is 23. Please see the following for more information:":"Vlera e parazgjedhur 'CRF' është 23. Ju lutem shihni më poshtë për më shumë informacion:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Gama e shkallës CRF është 0-51, ku 0 është humbje, 23 është default dhe 51 është cilësia më e keqe e mundshme. Një vlerë më e ulët në përgjithësi çon në cilësi më të lartë dhe një varg subjektivisht i arsyeshëm është 17-28. Konsideroni 17 ose 18 për të parë vizualisht pa humbje ose pothuajse aq; ajo duhet të duket e njëjtë ose pothuajse e njëjtë me inputin, por nuk është teknikisht humbje.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast kursen një listë të shtigjeve të skanuar të skedarëve të raportuar si të pacënuar. Pastroni cache për të kryer një skanim të ri në të gjitha skedarët.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Numri i instancave HandBrake / FFmpeg të njëkohshme për tu përdorur? (Rekomanduar 4 ose më pak):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Ky rregullim zbatohet si për \"kontrollin e shëndetit të videos\" ashtu edhe për \"skanimin dhe kthimin\". Specifikoni sa fije HandBrake duhet të përdorni. Nuk ka maksimum, edhe pse rekomandohet të mos përdorësh më shumë se 4. Një sasi më e lartë mund të ngrijë kompjuterin tuaj nëse nuk është shumë e fuqishme.","Queue size view limit?(Recommended 1000 or fewer):":"Kufiri i shikimit të madhësisë së radhës (1000 ose më shumë i rekomanduar):","Automatically start \"Scan and convert\" when program opened?":"Filloni automatikisht \"Skano dhe konverto\" kur programi u hap?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Plotësoni detajet e email-it për të marrë njoftime me email nëse ndodh një gabim gjatë kontrollit të shëndetit ose konvertimit / dosjes. Nuk do të punojë me llogari që kërkojnë 2FA. Duhet të aktivizosh qasje në aplikacione më pak të sigurta në llogaritë e Gmail.","Email address:":"Adresa e emailit:","For example:":"Për shembull:","Email password(not saved):":"Fjalëkalimi me email (nuk ruhet):","SMTP server:":"Serveri SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"Ky funksion lejon monitorimin e gjendjes së kontrollit të shndërrimit / kontrollit shëndetësor duke përdorur cilindo shfletues web. E dobishme kur drejton serverat etj.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Nëse aktivizohet, të dhënat e mëposhtme anonime do t'i dërgohen HBBatchBeast.io:","API key":"Çelës API","Current status ('Searching', 'Running', 'Finished' etc)":"Statusi aktual ('Kërkimi', 'Running', 'Finished' etj)","Number of:":"Numri i:","Remaining items":"Artikujt e mbetur","Successful items":"Artikujt e suksesshëm","Errored items":"Artikujt e gabuar","Cancelled items":"Artikuj anuluar","Worker percentages":"Përqindjet e punëtorëve","Last completed item time":"Kohëzgjatja e përfunduar e artikullit","Enable remote monitoring?:":"Aktivizo monitorimin e largët ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Një shërbim bazë benchmarking ndërtuar kryesisht për të parë se si 16 procesorë core kryejnë duke përdorur instrumente HandBrake shumta edhe pse ajo mund të drejtohet në çdo lloj procesor.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Kjo do të shkarkojë një skedar mostër h265 4k (2.5MB) dhe do të drejtojë një pikë referimi duke përdorur 4 raste HandBrake me paravendosjen \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Rezultatet mund të ngarkohen në hbbatchbeast.io nëse zgjidhni.","Queue":"Radhe","Output this session":"Shfaq këtë sesion","Media info viewer tool":"Mjet i shikuesve të informacionit të medias","View compress attempt cache":"Shikoni cache tentativë compress","Clear compress attempt cache":"Përsërisni cache-in e tentativës së compress","Save config":"Ruaj konfigurimin","Scan only":"Skanoni vetëm","Scan and convert":"Skano dhe konverto","View scan/conversion summary log":"Shikoni skedën përmbledhëse skanimi / konvertimi","View individual file check/conversion log":"Shiko pamjen individuale të skedarëve / konvertimeve","View worker console output":"Shiko produktin e konsolantit të punëtorëve","Health check":"Kontrolloni shëndetin","Clear healthy file cache":"Fshije skedarin e shëndetshëm të skedarit","View error log":"Shikoni logun e gabimeve","Email test":"Test elektronik","View master log":"Shiko pamjen master","Wiki help":"Ndihma Wiki","An application by HaveAGitGat":"Një aplikacion nga AjaGitGat","New":"I ri","Launch":"Nisja","Benchmark":"etapë","See results":"Shiko rezultatet","Pause queue":"Ndalo rradhë","Continue queue":"Vazhdo rreshtin","Stop queue":"Ndaluni radhët","Convert selected files":"Convert skedat e zgjedhura","Toggle queue view":"Toggle view radhë","Deselect all":"Hiqni të gjithë","Invert all":"Shmangni të gjitha","Select all":"Selektoj të gjitha","Toggle output view":"Ndrysho pamjen e prodhimit"}