{
    "The number of custom presets does not match the number of source folders!": "Број прилагођених пресета не одговара броју изворних фасцикли!",
    "source folders have been detected.": "откривени су изворни фолдери.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "откривене су прилагођене унапред постављене линије. Молимо Вас да двапут проверите невидљиве преломе редова. Треба да постоји једна путања до фасцикле или унапред подешена линија. Уверите се да нисте случајно направили празан ред.",
    "The number of filename suffixes does not match the number of source folders! ": "Број суфикса назива датотека не одговара броју изворних директоријума!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "Откривени су суфикси линија датотека. Молимо Вас да двапут проверите невидљиве преломе редова. На линију треба да буде један путања до датотеке или суфикс имена датотеке. Уверите се да нисте случајно направили празан ред.",
    "The number of source folders does not match the number of destination folders!": "Број изворних фасцикли не одговара броју одредишних фасцикли!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "одредишне фасцикле су откривене. Молимо Вас да двапут проверите невидљиве преломе редова. Требало би да постоји једна путања ка линији. Уверите се да нисте случајно направили празан ред.",
    "The number of source folders does not match the number of temporary conversion folders!": "Број изворних фасцикли не одговара броју привремених фасцикли за конверзију!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "Откривени су привремени фолдери за конверзију. Молимо Вас да двапут проверите невидљиве преломе редова. Требало би да постоји једна путања ка линији. Уверите се да нисте случајно направили празан ред.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Унесите важећи контејнер као што је '.мп4'. Обавезно укључите '.'",
    "Corrupt file folder": "Оштећена фасцикла датотеке",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "не постоји! Проверите да ли нема размака или скривених знакова пре / после путање",
    "Source folder": "Изворни фолдер",
    "Temporary conversion folder": "Привремени фолдер за конверзије",
    "appears to be the same as or is within source folder": "чини се да је иста као или је унутар изворног фолдера",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "што ће спречити да ХББатцхБеаст исправно функционише. Промените привремени фолдер за конверзију у фасциклу изван изворног фолдера. Ако желите да користите функцију \"Замени оригиналне датотеке\", изаберите одредишну фасциклу која није иста као изворна фасцикла или унутар ње, а затим потврдите избор у пољу за потврду \"Замени оригиналне датотеке увек\" у одељку Напредна подешавања . Опозовите избор у оквиру за потврду у привременом фасцикли „Привремени директоријум“ јер у овом случају неће користити. Датотеке ће бити конвертоване у одредишну фасциклу и затим враћене у изворни директоријум.",
    "Destination folder": "Жељена датотека",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "што ће спречити да ХББатцхБеаст исправно функционише. Промените одредишну фасциклу у фасциклу изван изворног фолдера. Ако желите да користите функцију \"Замени оригиналне датотеке\", изаберите одредишну фасциклу која није иста као изворна фасцикла или унутар ње, а затим потврдите избор у пољу за потврду \"Замени оригиналне датотеке увек\" у одељку Напредна подешавања . Опозовите избор у оквиру за потврду у привременом фасцикли „Привремени директоријум“ јер у овом случају неће користити. Датотеке ће бити конвертоване у одредишну фасциклу и затим враћене у изворни директоријум.",
    "Error creating temporary conversion folder": "Грешка при креирању привремене фасцикле за конверзије",
    "Error creating destination folder": "Грешка при креирању одредишне фасцикле",
    "Please select to use HandBrake or FFmpeg!": "Молимо да изаберете да користите ХандБраке или ФФмпег!",
    "Please select a standard preset or input a custom one!": "Изаберите стандардну поставку или унесите прилагођену!",
    "Please select a scan interval of 5 seconds or greater!": "Изаберите интервал скенирања од 5 секунди или више!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Уверите се да је број истовремених ХандБраке / ФФмпег инстанци један или већи!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Неважећи АПИ кључ! Кликните на \"Ново\" на картици за даљински надзор да бисте генерисали нови кључ.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Унесите време скенирања у 24-часовном формату: хх: мм (на пример 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "ФИЛЕ ИЗВОРА ће бити избрисане након конверзије! Молимо Вас да тестирате пре правилне употребе!",
    "Benchmark failed!": "Бенцхмарк није успио!",
    "Log does not exist!": "Лог не постоји!",
    "Folder does not exist!": "Фолдер не постоји!",
    "Error sending email! Please check your settings.": "Грешка приликом слања е-поште! Проверите подешавања.",
    "Test email sent!": "Послата је тест порука е-поште!",
    "All worker processes have been stopped.": "Сви радни процеси су заустављени.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Ред чекања ће бити паузиран након што тренутне ставке заврше обраду. Да ли сте сигурни да желите да паузирате ред?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Када се сви радници паузирају, појавит ће се гумб \"Настави\".",
    "Healthy file cache cleared!": "Очишћен је здрави кеш датотека!",
    "Cache cleared!": "Цацхе цлеар!",
    "Cancel item": "Откажи ставку",
    "Please check the above checkbox to use this feature.": "Молимо вас да означите горњи квадратић да бисте користили ову функцију.",
    "Configuration": "Конфигурација",
    "Source folders": "Изворне фасцикле",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Ово је изворни директоријум који ће бити скениран за медије. Фасцикла треба унети без косе црте. На пример:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Поље путање изворне фасцикле се може проширити (притисните ентер да бисте креирали нову линију). Ако желите да наведете више изворних фасцикли, проверите да ли је свака стаза директоријума у својој линији, као што су:",
    "Video health check": "Видео здравствени преглед",
    "Batch conversion and Folder watching": "Батцх конверзија и гледање мапе",
    "Remote Monitoring (Beta)": "Даљинско надгледање (Бета)",
    "Benchmark (Beta)": "Бенцхмарк (бета)",
    "System": "Систем",
    "Help": "Помоћ",
    "Temporary conversion folders": "Привремене фасцикле за конверзије",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Ако је \"Привремени директоријум?\" је означено, а затим ће ХандБраке конвертовати датотеке у тај фолдер. Када се конверзија заврши, датотека ће бити премјештена у вашу \"мапу одредишта\". Морате да наведете онолико привремених директоријума као изворне директоријуме. Ваш први изворни фолдер ће бити конвертован у вашу прву привремену фасциклу за конверзију, ваш други изворни директоријум у ваш други привремени директоријум и тако даље. Уверите се да је свака стаза привремене фасцикле за конверзије на својој линији.",
    "Destination folders": "Мапе одредишта",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Наведите путање циљне мапе. Опет, мораћете да наведете што више директоријума као изворне директоријуме. Датотеке из вашег првог изворног директоријума ће завршити у вашој првој одредишној мапи, друге датотеке из другог извора у вашој другој одредишној мапи и тако даље.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Први изворни фолдер ---------> Први привремени директоријум ---------> Прва одредишна мапа",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Други изворни директоријум ---------> Други привремени директоријум ---------> Други одредишни фолдер",
    "etc": "итд",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "ХББатцхБеаст не ради исправно ако одредишну фасциклу поставите на исти или унутар изворног фолдера.",
    "Standard preset:": "Стандардно подешавање:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Изаберите унапред подешену функцију ХандБраке коју желите да конвертујете. Ако је изабрана опција \"Стандард пресет\", све датотеке у изабраним фолдерима ће бити конвертоване коришћењем унапред подешене ХандБраке меморије. Више о пресетима за ХандБраке можете наћи овде:",
    "Custom preset:": "Прилагођено подешавање:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Ако је \"Цустом пресет\", онда морате да унесете сопствени прилагођени сет. ХББатцхБеаст покрива \"ХандБракеЦЛИ -и извор -о одредиште\" дио ХандБракеЦЛИ улаза тако да морате унијети параметре конверзије. На пример:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Ако користите ФФмпег, морате раздвојити улазне и излазне параметре зарезом. Као такав:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Можете се повезати и са прилагођеним подешавањима која су извезена из званичне апликације за графички интерфејс ХандБраке, на пример:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Ако имате проблема са прилагођеним унапред дефинисаним подешавањима, то може бити због познате грешке у ХандБракеЦЛИ (биће исправљена у следећем издању ХандБракеЦЛИ). Погледајте ово за привремено решење:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Сваки прилагођени сет треба да буде на својој линији и, слично као и фасцикле, мора постојати онолико прилагођених пресета као изворних директоријума.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Први изворни директоријум ---------> Први привремени директоријум ---------> Први одредишни фолдер @ Цустом пресет 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Други изворни директоријум ---------> Други привремени директоријум ---------> Други одредишни фолдер @ Цустом пресет 2",
    "See the following image for guidance:": "Погледајте следећу слику за смернице:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Ако користите кодирање графичке картице (као што је НВЕНЦ), можда ћете морати да смањите број примерака ХандБраке (покушајте са 2 или мање) због ограничења ВРАМ-а.",
    "Select standard preset:": "Изаберите стандардну поставку:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "НВЕНЦ је детектован, молимо вас да смањите број ХандБракеЦЛИ инстанци на 2 или испод (за већину графичких картица) или можете наићи на грешке због недовољног ВРАМ-а. Ова поставка се може наћи на картици \"Систем\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Откривен је увезени пресет.Ако имате проблема са увезеним прилагођеним подешавањима, то може бити због познате грешке у ХандБракеЦЛИ (биће поправљена у следећем издању ХандБракеЦЛИ). Привремено решење је да уклоните '' ПицтуреРотате '': '' 0: 0 '' из .јсон датотеке. Више информација овде:",
    "Container:": "Контејнер:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Наведите контејнер који желите да излазни фајл има, као што је '.мп4'. Више о контејнерима можете сазнати на:",
    "Enable periodic scanning:": "Омогући периодично скенирање:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "ХББатцхБеаст може пратити ваше изворне директорије и покренути скенирање за нове датотеке у одређеном интервалу. Време интервала је у секундама, а подразумевано је 300 секунди (5 минута). Ако је ова опција изабрана, онда када притиснете \"Скенирај и конвертуј\", програм ће конвертовати све нове датотеке и тада ће почети одбројавање. Ово ће се бесконачно скратити док се не заустави. Интервал скенирања налази се у секцији напредних поставки.",
    "Enable daily scanning:": "Омогући дневно скенирање:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Уместо повременог скенирања, можете одабрати да се скенирање изводи једном дневно. Време скенирања се уноси у одељак за напредна подешавања у формату хх: мм као што је '18: 30 '. Када се одабере \"Скенирај и конвертуј\", програм ће чекати до одређеног времена док не покрене процес скенирања и конверзије. Опет, ово ће се бесконачно скратити док се не заустави.",
    "Show/hide advanced:": "Прикажи / сакриј напредне:",
    "Scan interval (minimum 5 seconds):": "Интервал скенирања (минимум 5 секунди):",
    "Daily run time (hh:mm):": "Дневно време рада (хх: мм):",
    "Output filename suffix:": "Излазни суфикс имена датотеке:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Ово је опционално. Можете да наведете суфикс да бисте додали на крај имена датотеке као '_1080п' или '_тестцонверсион' итд.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Ако је изабрано 'стандард пресет' онда ће сви излазни фајлови имати исти суфикс.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Ако је изабрано 'цустом пресет', можете одредити један суфикс по изворном фолдеру / прилагођеном подешавању. Уверите се да је сваки суфикс на својој линији. На пример, ако имате 2 изворна директоријума и користите „прилагођено подешавање“, можете ставити ово у поље за суфикс имена датотеке:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Датотеке у првом изворном фолдеру ће имати '_720п' додану у излазни назив датотеке. Датотеке у другом изворном директоријуму ће имати '_1080п' у излазном називу датотеке итд.",
    "Include these file types:": "Укључи ове типове датотека:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Унесите типове датотека за скенирање. Сваки тип треба да буде одвојен зарезом. Подразумевани унос је:",
    "Exclude files smaller than (MB):": "Искључи датотеке мање од (МБ):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Наведите да ли ће се из конверзије (у мегабајтима) изузети датотеке мање од одређене величине",
    "Exclude files larger than (MB):": "Искључи датотеке веће од (МБ):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Наведите да ли ће се из конверзије изузети датотеке веће од одређене величине (у мегабајтима)",
    "Exclude filenames which include any of these words:": "Изузмите имена датотека која садрже било коју од ових речи:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Унесите кључне речи које ће се филтрирати приликом скенирања датотека. На пример, ако се унесе \"720п\", онда се датотеке са \"720п\" у наслову неће конвертовати. Поново, кључне речи морају бити раздвојене зарезом. На пример, унесите следеће у поље за филтер:",
    "Include files with any ": "Укључите датотеке са било којим",
    " or all ": "или све",
    " of these": "ових",
    "properties:": "својства:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Овде можете унети видео и аудио особине које датотеке морају имати да би биле конвертоване (инфо извучене помоћу ФФпробе). Својства морају бити одвојена зарезом. Користите алатку за приказивање информација о медијима да бисте утврдили која својства желите да укључите. Побрините се да ставите зарез након задњег својства. На пример, да бисте конвертовали само датотеке које су кодиране помоћу х264 и аац стерео звука:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Важно је напоменути да се ова провјера својстава врши након што се процес конверзије покрене (да би се уштедјело вријеме при изградњи реда), тако да иако се датотеке могу појавити у реду за претворбу, оне ће бити прескочене / укључене ако су испуњени исправни увјети.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Ако је ФФпробе способан да издвоји својства, онда ће се 'ОК' појавити у колони \"ФФпробе\" у приказу реда чекања.",
    "Exclude files with any ": "Искључите датотеке са било којим",
    " of these ": "ових",
    "The opposite of 'Include files with any or all of these properties'": "Супротно од \"Укључи датотеке са неким или свим овим својствима\"",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Ово је мали алат за анализирање својстава датотека како би вам помогао да одредите која својства желите укључити / искључити у горе наведене опције. Користи ФФпробе за враћање информација. Превуците и испустите датотеке у сиви оквир да бисте их анализирали. На пример, испуштање у тест датотеку може да врати следеће:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Ако желите да изузмете датотеке као што је ова из конвертоване, онда можете да ставите неколико својстава датотека у поље \"Искључи датотеке са било којим или свим овим својствима\" и потврдите избор у пољу за потврду поред \"све\" уместо \"било које\" овако:",
    "Copy excluded files to destination:": "Копирај искључене датотеке на одредиште:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Ако изаберете ову опцију, датотеке које су искључене из конверзије биће копиране директно у одредишну фасциклу. Ово се односи на следеће филтере:",
    "Exclude filenames which include any of these words": "Изузмите имена датотека која садрже било коју од ових речи",
    "Include files with any or all of these properties": "Укључите датотеке са било којим или свим овим својствима",
    "Exclude files with any or all of these properties": "Искључите датотеке са било којим или свим овим својствима",
    "Exclude files smaller than (MB)": "Искључи датотеке мање од (МБ)",
    "Exclude files larger than (MB)": "Искључи датотеке веће од (МБ)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Имајте на уму да се ово односи и на датотеке које су искључене јер не испуњавају услове својстава \"Укључи\" горе наведеног, тако да не случајно копирате читаву библиотеку када покушавате да конвертујете само неколико датотека.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Функција копирања не примењује се на следеће филтере (тј. Датотеке које су искључене због филтера)",
    "Include these file types": "Укључите ове типове датотека",
    "Delete source files after conversion:": "Брисање изворних датотека након конверзије:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Ако је ово изабрано, онда ако је покушај конверзије успешан, изворна датотека ће бити избрисана. Овај процес се обавља на самом крају, након конверзије свих датотека. То значи да можете да конвертујете исте изворне датотеке користећи више пресета, све у једном покрету. Након тога ће се избрисати изворне датотеке.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Замените оригиналну датотеку ако је конвертована датотека мања?",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Означите овај квадратић ако желите да ХББатцхБеаст аутоматски замени оригиналну изворну датотеку ако је нова датотека мања. Ако нова датотека није мања, остат ће у одредишној мапи.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Уверите се да одредишна фасцикла није иста као изворна фасцикла или она не ради исправно.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Када је ХББатцхБеаст покушао да компримује одређени фајл, он ће додати тај пут фајлу у кеш тако да га у будућности неће покушати поново. Можете прегледати / уредити / обрисати кеш помоћу жутих дугмади.",
    "Replace original file always?": "Замените оригинални фајл увек?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Оригинална датотека ће бити замењена без обзира да ли је нова датотека већа или мања.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Поново, уверите се да одредишна фасцикла није иста као изворна фасцикла или она неће функционисати исправно.",
    "Copy subtitle (srt) files to destination?": "Копирање датотека (срт) титла на одредиште?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Датотеке поднаслова '.срт' ће се аутоматски копирати у одредишну мапу.",
    "Automatically create temporary/destination folders if they don't exist?": "Аутоматски креирајте привремене / одредишне фасцикле ако не постоје?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Прилагођена стаза шишмиша за покретање након сваке конверзије (оставите празно ако не користите):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Унесите путању до прилагођене батцх датотеке коју желите да извршите након сваке конверзије. На пример:",
    "Batch files with timeout statements won't work. More info here:": "Батцх датотеке са тимеоут изјавама неће радити. Више информација овде:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Оставите поље потпуно празно ако не желите да користите ову опцију (проверите да у пољу нема скривених знакова)",
    "Run processes at low priority?": "Покренути процесе на ниском приоритету?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Сви процеси конверзије ће бити покренути на ниском приоритету, смањујући употребу процесора.",
    "Remove apostrophes from filenames:": "Уклони апострофе из имена датотека:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Конверзија / скенирање здравственог прегледа можда неће успети ако имена датотека имају апострофе. Означите ово да бисте аутоматски уклонили апострофе из имена датотека.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Ова функција може да скенира корумпиране видео датотеке помоћу функције „--сцан“ ХандБраке-а, иако то није увек тачно. Такође користи ФФпробе да обезбеди другу референтну тачку. Ако и ФФпробе и ХандБраке не успију, постоји велика вјеројатност да је датотека оштећена.",
    "Move corrupt files into the following folder:": "Премести оштећене датотеке у следећу фасциклу:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Ако је означено, све датотеке које дају грешке ће бити премјештене у наведену мапу.",
    "Corrupt file folder:": "Оштећена фасцикла датотеке:",
    "Run thorough file health check:": "Покрените детаљан преглед стања датотеке:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Ако је означено, тада ће се много спорије и темељитије прегледавање видеа обавити користећи ФФмпег умјесто ХандБраке.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "На основу Десанијевог \"СцанМедиа.пс1\" пронађеног на:",
    "Attempt to repair files after thorough check:": "Покушај поправљања датотека након темељите провјере:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Ако је означено, ХББатцхБеаст ће покушати да поправи датотеке користећи ФФмпег. Нова датотека са суфиксом '_репаиред' ће бити креирана у истој фасцикли као и изворна датотека.",
    "'CRF' value to use when attempting to repair files:": "'ЦРФ' вредност коју треба користити приликом покушаја поправљања датотека:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Подразумевана вредност \"ЦРФ\" је 23. Молимо погледајте следеће за више информација:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Опсег ЦРФ скале је 0–51, где је 0 без губитака, 23 је подразумевано, а 51 је најгори могући квалитет. Нижа вредност генерално доводи до вишег квалитета, а субјективно здрав разум је 17-28. Размотрите 17 или 18 да би били визуелно без губитака или скоро тако; требало би да изгледа исто или скоро исто као и улаз, али није технички без губитака.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "ХББатцхБеаст чува листу путања скенираних датотека које су пријављене као некорумпиране. Обришите кеш да бисте извршили ново скенирање свих датотека.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Број симултаних ХандБраке / ФФмпег инстанци за употребу? (Препоручено 4 или мање):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Ова поставка се односи на процесе \"Провера здравља видеозаписа\" и \"Скенирај и конвертуј\". Одредите колико ће се ручно обрађених тема користити. Нема максимума иако се препоручује да не користите више од 4. Већа количина може замрзнути ваш рачунар ако није јако моћан.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Ограничење приказа величине реда? (Препоручено 1000 или мање):",
    "Automatically start \"Scan and convert\" when program opened?": "Аутоматски покрени \"Скенирај и конвертуј\" када је програм отворен?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Попуните податке о е-пошти да бисте примали обавештења путем е-поште ако дође до грешке током прегледа здравља или конверзије / гледања директоријума. Неће радити са налозима који захтевају 2ФА. Потребно је да омогућите приступ мање безбедним апликацијама на Гмаил налозима.",
    "Email address:": "Адреса Е-поште:",
    "For example:": "На пример:",
    "Email password(not saved):": "Лозинка за е-пошту (није сачувана):",
    "SMTP server:": "СМТП сервер:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Ова функција омогућава праћење статуса конверзије / здравственог прегледа помоћу било ког веб-претраживача. Корисно када се покрећу сервери итд.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Ако је омогућено, следећи анонимни подаци ће бити послани на ХББатцхБеаст.ио:",
    "API key": "АПИ кључ",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Тренутни статус (\"Претраживање\", \"Покретање\", \"Завршено\" итд.)",
    "Number of:": "Број:",
    "Remaining items": "Преостали артикли",
    "Successful items": "Успешни предмети",
    "Errored items": "Ерроред итемс",
    "Cancelled items": "Отказане ставке",
    "Worker percentages": "Проценат радника",
    "Last completed item time": "Време завршене задње ставке",
    "Enable remote monitoring?:": "Омогући даљински надзор ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Основни услужни програм за бенчмаркинг изграђен је углавном како би се видјело како 16+ језгрени процесори раде с вишеструким ХандБраке инстанцама иако се може изводити на било којем типу процесора.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Ово ће преузети датотеку х265 4к (2.5МБ) и покренути бенцхмарк користећи 4 ХандБраке инстанце са унапред подешеном \"Вери Фаст 1080п30\".",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Резултати могу бити постављени на хббатцхбеаст.ио ако одаберете.",
    "Queue": "Куеуе",
    "Output this session": "Изведите ову сесију",
    "Media info viewer tool": "Алат за приказивање информација о медијима",
    "View compress attempt cache": "Прикажи кеш покушаја компресије",
    "Clear compress attempt cache": "Очисти кеш покушаја компресије",
    "Save config": "Сачувај конфигур",
    "Scan only": "Само скенирање",
    "Scan and convert": "Скенирајте и конвертујте",
    "View scan/conversion summary log": "Прикажите дневник скенирања / конверзије",
    "View individual file check/conversion log": "Погледајте дневник појединачних провера / конверзија датотека",
    "View worker console output": "Прикажи излаз конзоле за раднике",
    "Health check": "Здравствени преглед",
    "Clear healthy file cache": "Избриши кеш здравих датотека",
    "View error log": "Погледајте дневник грешака",
    "Email test": "Емаил тест",
    "View master log": "Прикажи главни дневник",
    "Wiki help": "Вики хелп",
    "An application by HaveAGitGat": "Апликацију ХавеАГитГат",
    "New": "Нев",
    "Launch": "Лансирање",
    "Benchmark": "Бенцхмарк",
    "See results": "Погледајте резултате",
    "Pause queue": "Паусе куеуе",
    "Continue queue": "Цонтинуе куеуе",
    "Stop queue": "Стоп куеуе",
    "Convert selected files": "Конвертујте изабране датотеке",
    "Toggle queue view": "Промена приказа реда чекања",
    "Deselect all": "Поништите све",
    "Invert all": "Инверт алл",
    "Select all": "Изабери све",
    "Toggle output view": "Промена приказа излаза"
}