{
    "The number of custom presets does not match the number of source folders!": "Antalet anpassade förinställningar matchar inte antalet källmappar!",
    "source folders have been detected.": "källmappar har detekterats.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "Anpassade förinställda linjer har detekterats. Vänligen dubbelkolla för osynliga raster. Det ska finnas en mappväg eller förinställd per rad. Se till att du inte oavsiktligt har skapat en tom linje.",
    "The number of filename suffixes does not match the number of source folders! ": "Antalet filnamn suffixer matchar inte antalet källmappar!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "Filnamn suffix linjer har detekterats. Vänligen dubbelkolla för osynliga raster. Det ska finnas en mappväg eller ett filnamns suffix per rad. Se till att du inte oavsiktligt har skapat en tom linje.",
    "The number of source folders does not match the number of destination folders!": "Antalet källmappar matchar inte antalet målmappar!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "destinationsmappar har detekterats. Vänligen dubbelkolla för osynliga raster. Det ska finnas en mappväg per rad. Se till att du inte oavsiktligt har skapat en tom linje.",
    "The number of source folders does not match the number of temporary conversion folders!": "Antalet källkataloger matchar inte antalet tillfälliga konverteringsmappar!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "tillfälliga konverteringsmappar har detekterats. Vänligen dubbelkolla för osynliga raster. Det ska finnas en mappväg per rad. Se till att du inte oavsiktligt har skapat en tom linje.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Var god ange en giltig container som \".mp4\". Var noga med att inkludera '.'",
    "Corrupt file folder": "Korrupt filmapp",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "existerar inte! Se till att det inte finns några mellanslag eller dolda tecken före / efter banan",
    "Source folder": "Källmapp",
    "Temporary conversion folder": "Midlertidig omvandlingsmapp",
    "appears to be the same as or is within source folder": "verkar vara densamma som eller ligger inom källkatalogen",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "vilket hindrar HBBatchBeast från att fungera korrekt. Ändra den temporära konverteringsmappen till en mapp utanför källkatalogen. Om du vill använda funktionen \"Byt originalfiler\", välj en destinationsmapp som inte är densamma som eller i källkatalogen och kryssrutan \"Ersätt originalfiler alltid\" i avsnittet avancerade inställningar . Avmarkera kryssrutan tillfälligt \"Tillfällig omvandlingsmapp\" eftersom det inte kommer att användas i det här fallet. Filerna konverteras till målmappen och flyttas sedan tillbaka till källkatalogen.",
    "Destination folder": "Målmapp",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "vilket hindrar HBBatchBeast från att fungera korrekt. Ändra destinationsmappen till en mapp utanför källkatalogen. Om du vill använda funktionen \"Byt originalfiler\", välj en destinationsmapp som inte är densamma som eller i källkatalogen och kryssrutan \"Ersätt originalfiler alltid\" i avsnittet avancerade inställningar . Avmarkera kryssrutan tillfälligt \"Tillfällig omvandlingsmapp\" eftersom det inte kommer att användas i det här fallet. Filerna konverteras till målmappen och flyttas sedan tillbaka till källkatalogen.",
    "Error creating temporary conversion folder": "Det gick inte att skapa en tillfällig konverteringsmapp",
    "Error creating destination folder": "Ett fel uppstod i destinationsmappen",
    "Please select to use HandBrake or FFmpeg!": "Vänligen välj för att använda HandBrake eller FFmpeg!",
    "Please select a standard preset or input a custom one!": "Var god välj en standardinställning eller skriv in en anpassad!",
    "Please select a scan interval of 5 seconds or greater!": "Vänligen välj ett skanningsintervall på 5 sekunder eller längre!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Se till att antalet samtidiga HandBrake / FFmpeg-instanser att använda är en eller flera!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Ogiltig API-nyckel! Klicka på \"Ny\" på fliken fjärrövervakning för att skapa en ny nyckel.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Ange en daglig skanningstid i 24-timmarsformat: hh: mm (till exempel 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "KILDEFILER SKALL SLUTAS EFTER OMFÖRING! Vänligen testa före korrekt användning!",
    "Benchmark failed!": "Benchmark misslyckades!",
    "Log does not exist!": "Logen finns inte!",
    "Folder does not exist!": "Mappa finns inte!",
    "Error sending email! Please check your settings.": "Det gick inte att skicka e-post! Kontrollera dina inställningar.",
    "Test email sent!": "Test e-post skickat!",
    "All worker processes have been stopped.": "Alla arbetarprocesser har blivit stoppade.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "Kön pausas när aktuella objekt har slutförts. Är du säker på att du vill pausa kön?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Köpa paus initierad. Fortsätt-knappen visas när alla arbetare har pausat.",
    "Healthy file cache cleared!": "Hälsosam fil cache rensas!",
    "Cache cleared!": "Cache cleared!",
    "Cancel item": "Avbryt objektet",
    "Please check the above checkbox to use this feature.": "Vänligen kontrollera ovanstående kryssrutan för att använda den här funktionen.",
    "Configuration": "Konfiguration",
    "Source folders": "Källmappar",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Detta är källkatalogen som ska skannas för media. Mappen måste anges utan slash. Till exempel:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Källfältet för källkatalog är expanderbart (tryck på enter för att skapa en ny rad). Om du vill ange flera källmappar, se till att varje källkortsväg är på egen linje, till exempel:",
    "Video health check": "Video hälsa kontroll",
    "Batch conversion and Folder watching": "Batchkonvertering och mappvisning",
    "Remote Monitoring (Beta)": "Fjärrövervakning (Beta)",
    "Benchmark (Beta)": "Benchmark (Beta)",
    "System": "Systemet",
    "Help": "Hjälp",
    "Temporary conversion folders": "Tillfälliga konverteringsmappar",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Om \"Midlertidig omvandlingsmapp?\" är markerad, så kommer HandBrake att konvertera filer till den mappen. När konverteringen är klar flyttas filen till din \"Destinationsmapp\". Du måste ange så många temporära konverteringsmappar som källmappar. Din första källkatalog kommer att konverteras till din första temporära omvandlingsmapp, din andra källkatalog i din andra temporära konverteringsmapp och så vidare. Se till att varje temporär omvandlingsmappsväg är på egen rad.",
    "Destination folders": "Målmappar",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Ange destinationsmappsbanor. Återigen måste du ange så många målmappar som källmappar. Filer från din första källkatalog hamnar i din första målmapp, dina andra källkatalogfiler i din andra destinationsmapp och så vidare.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Första källkatalogen ---------> Första tillfälliga konverteringsmappen ---------> Första destinationsmappen",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Andra källmappen ---------> Andra temporära konverteringsmappen ---------> Andra destinationsmappen",
    "etc": "etc",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast fungerar inte korrekt om du ställer in destinationsmappen samma som eller i källkatalogen.",
    "Standard preset:": "Standardinställning:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Välj HandBrake-förinställningen som du vill konvertera dina filer med. Om \"Standardinställd\" väljs kommer alla filer i de valda mapparna att konverteras med den angivna handbromsinställningen. Du hittar mer om handbroms förinställningar här:",
    "Custom preset:": "Anpassad förinställning:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Om \"Anpassad förinställning\" måste du ange din egen anpassade förinställning. HBBatchBeast täcker delen \"HandBrakeCLI -i source -o destination\" i HandBrakeCLI-ingången så att du måste ange konverteringsparametrarna. Till exempel:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Om du använder FFmpeg måste du separera ingångs- och utgångsparametrarna med ett komma. Som:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Du kan också länka till en anpassad förinställning som exporterats från den officiella HandBrake GUI-applikationen till exempel:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Om du har problem med egna förinställningar kan det bero på ett känt fel med HandBrakeCLI (kommer att fastställas i nästa HandBrakeCLI-utgåva). Vänligen se här för en tillfällig lösning:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Varje anpassad förinställning måste vara på egen linje och, liksom mapparna, måste det finnas lika många anpassade förinställningar som källmappar.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Första källmappen ---------> Första tillfälliga konverteringsmappen ---------> Första destinationsmappen @ Anpassad förinställning 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Andra källmappen ---------> Andra temporära konverteringsmappen ---------> Andra destinationsmappen @ Anpassad förinställning 2",
    "See the following image for guidance:": "Se följande bild för vägledning:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Om du använder grafikkortkodning (till exempel NVENC), kan du behöva minska antalet HandBrake-instanser (försök 2 eller färre) på grund av VRAM-begränsningar.",
    "Select standard preset:": "Välj standard förinställning:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC upptäckt, var god se till att sänka antalet HandBrakeCLI-instanser till 2 eller lägre (för de flesta grafikkort) eller att du kan stöta på fel på grund av att inte tillräckligt med VRAM. Den här inställningen finns på fliken \"System\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Importerad förinställd detected.If du har problem med importerade anpassade förinställningar, kan det bero på ett känt fel med HandBrakeCLI (kommer att fastställas i nästa HandBrakeCLI-release). En tillfällig lösning är att ta bort \"\" PictureRotate \":\" 0: 0 \"\" från .json-filen. Mer information här:",
    "Container:": "Behållare:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Ange behållaren som du vill att utdatafilen ska ha som \".mp4\". Du kan läsa mer om behållare på:",
    "Enable periodic scanning:": "Aktivera periodisk skanning:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast kan övervaka dina källmappar och skanna skanningar för nya filer vid ett visst intervall. Intervalltiden är i sekunder med standardvärdet 300 sekunder (5 minuter). Om det här alternativet är valt, när du trycker på \"Skanna och konvertera\", konverterar programmet några nya filer och sedan startar nedräkningstimern. Detta slår oändligt tills det är stoppat. Skanningsintervallet finns i avsnittet avancerade inställningar.",
    "Enable daily scanning:": "Aktivera daglig skanning:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Istället för periodisk skanning kan du välja att en skanning ska köras en gång om dagen. Skanningstiden anges i avsnittet avancerade inställningar i hh: mm-format som '18: 30 '. När \"Skanna och konvertera\" väljs kommer programmet att vänta tills angiven tid tills en skanning och omvandlingsprocess körs. Återigen kommer detta att slinga oändligt tills det stoppas.",
    "Show/hide advanced:": "Visa / dölj avancerad:",
    "Scan interval (minimum 5 seconds):": "Skanintervall (minst 5 sekunder):",
    "Daily run time (hh:mm):": "Daglig körtid (hh: mm):",
    "Output filename suffix:": "Utmatning filnamn suffix:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Detta är valfritt. Du kan ange ett suffix som läggs till i slutet av filnamnet som \"_1080p\" eller \"_testconversion\" etc.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Om \"standardinställning\" väljs kommer alla utdatafiler att ha samma suffix.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Om \"Custom Preset\" är vald kan du ange ett suffix per källkatalog / anpassad förinställning. Se till att varje suffix finns på egen rad. Om du till exempel har 2 källkataloger och använder \"anpassade förinställda\" kan du lägga till det i suffixfältet för filnamn:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Filer i den första källkatalogen kommer att ha \"_720p\" lagt till i filnamnet. Filer i den andra källkatalogen kommer att ha \"_1080p\" lagt till för att mata ut filnamn etc.",
    "Include these file types:": "Inkludera dessa filtyper:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Ange filtyperna för att söka efter. Varje typ måste separeras med ett komma. Standardinmatningen är:",
    "Exclude files smaller than (MB):": "Uteslut filer som är mindre än (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Ange om du vill utesluta filer som är mindre än en viss storlek från konvertering (i megabyte)",
    "Exclude files larger than (MB):": "Uteslut filer som är större än (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Ange om du vill utesluta filer som är större än en viss storlek från konvertering (i megabyte)",
    "Exclude filenames which include any of these words:": "Uteslut filnamn som innehåller något av följande ord:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Ange sökord som ska filtreras ut när du söker efter filer. Till exempel, om \"720p\" är inmatad, kommer inte några filer med \"720p\" i titeln att konverteras. Återigen måste nyckelord separeras med ett komma. Ange till exempel följande i filterrutan:",
    "Include files with any ": "Inkludera filer med någon",
    " or all ": "eller alla",
    " of these": "av dessa",
    "properties:": "egenskaper:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Här kan du mata in video- och ljudegenskaper som filer måste ha för att kunna konverteras (information som extraheras med FFprobe). Egenskaperna måste separeras med ett komma. Använd verktyget Media Info Viewer för att bestämma vilka egenskaper du vill inkludera. Se till att du anger ett kommatecken efter den sista egenskapen. Till exempel kan du bara konvertera filer som kodas med hjälp av h264 och aac stereo ljud:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Det är värt att notera att den här egenskapskontrollen är klar när konverteringsprocessen börjar (för att spara tid medan kön byggs), så även om filer kan visas i konverteringskönen, kommer de att hoppas över / inkluderas om de korrekta villkoren är uppfyllda.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Om FFprobe kan extrahera egenskaper, visas en \"OK\" i kolumnen \"FFprobe\" i könvy.",
    "Exclude files with any ": "Uteslut filer med någon",
    " of these ": "av dessa",
    "The opposite of 'Include files with any or all of these properties'": "Det motsatta av \"Inkludera filer med någon eller alla dessa egenskaper\"",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Detta är ett litet verktyg för att analysera filegenskaper med för att hjälpa dig att bestämma vilka egenskaper du vill inkludera / utesluta i ovanstående alternativ. Den använder FFprobe för att returnera information. Dra och släpp filer i den grå rutan för att analysera dem. Till exempel kan droppe i en testfil returnera följande:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Om du vill utesluta filer som detta från att konverteras kan du lägga flera filegenskaper i rutan \"Ta bort filer med någon eller alla dessa egenskaper\" och markera kryssrutan bredvid \"alla\" istället för \"någon\" såhär:",
    "Copy excluded files to destination:": "Kopiera exkluderade filer till destination:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Om du väljer det här alternativet kopieras filer som har uteslutits från konvertering direkt till destinationsmappen. Detta gäller följande filter:",
    "Exclude filenames which include any of these words": "Uteslut filnamn som innehåller något av dessa ord",
    "Include files with any or all of these properties": "Inkludera filer med någon eller alla dessa egenskaper",
    "Exclude files with any or all of these properties": "Uteslut filer med någon eller alla dessa egenskaper",
    "Exclude files smaller than (MB)": "Uteslut filer mindre än (MB)",
    "Exclude files larger than (MB)": "Uteslut filer som är större än (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Observera att detta också gäller filer som är uteslutna eftersom de inte uppfyller villkoren för \"Inkludera\" ovanstående, så att du inte kopior av misstag du är hela biblioteket när du bara försöker konvertera några filer.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Kopia funktionen gäller inte följande filter (dvs filer som är uteslutna på grund av filtret)",
    "Include these file types": "Inkludera dessa filtyper",
    "Delete source files after conversion:": "Radera källfiler efter konvertering:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Om det här är valt, kommer källfilen att raderas om ett konverteringsförsök lyckas. Denna process görs i slutet, efter konvertering av alla filer. Det innebär att du kan konvertera samma källfiler med flera förinställningar, allt på en gång. Källfilerna kommer sedan att raderas efteråt.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Ersätt originalfilen om konverterad fil är mindre? (Komprimera försök)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Markera den här kryssrutan om du vill att HBBatchBeast automatiskt ska ersätta den ursprungliga källfilen om den nya filen är mindre. Om den nya filen inte är mindre kommer den att vara kvar i målmappen.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Se till att din målmapp inte är densamma som / eller inom, din källkatalog eller det fungerar inte korrekt.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "När HBBatchBeast har försökt att komprimera en specifik fil lägger den den här sökvägen till en cache så att den inte kommer att försökas igen i framtiden. Du kan visa / redigera / rensa cacheminnet med de gula knapparna.",
    "Replace original file always?": "Ersätt originalfilen alltid?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Den ursprungliga filen kommer att ersättas oavsett om den nya filen är större eller mindre.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Återigen, se till att din målmapp inte är densamma som / eller inom, din källkatalog eller det fungerar inte korrekt.",
    "Copy subtitle (srt) files to destination?": "Kopiera textning (srt) filer till destinationen?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Texten '.srt' -filerna kopieras automatiskt till målmappen.",
    "Automatically create temporary/destination folders if they don't exist?": "Skapa automatiskt temporära / destinationsmappar om de inte existerar?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Anpassad flaggbana att köra efter varje konvertering (lämna tomt om du inte använder):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Ange sökvägen till en anpassad satsfil som du vill utföra efter varje konvertering. Till exempel:",
    "Batch files with timeout statements won't work. More info here:": "Batchfiler med timeout-utlåtanden fungerar inte. Mer information här:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Lämna rutan helt tom om du inte vill använda det här alternativet (se till att det inte finns några dolda tecken i rutan)",
    "Run processes at low priority?": "Kör processer med låg prioritet?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Alla konverteringsprocesser kommer att köras med låg prioritet, vilket minskar processorns användning.",
    "Remove apostrophes from filenames:": "Ta bort apostrofer från filnamn:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Omvandlingar / hälsokontrollsökningar kan misslyckas om filnamn har apostrofer in. Markera det här för att automatiskt ta bort apostrofer från filnamn.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Den här funktionen kan skanna efter korrupta videofiler med hjälp av HandBrake's \"scan \"-funktion, även om det inte alltid är korrekt. Det använder också FFprobe för att ge en andra referenspunkt. Om både FFprobe och HandBrake misslyckas är det en stor chans att filen är korrupt.",
    "Move corrupt files into the following folder:": "Flytta korrupta filer till följande mapp:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Om markerad, kommer alla filer som ger fel att flyttas till den angivna mappen.",
    "Corrupt file folder:": "Korrupt filmapp:",
    "Run thorough file health check:": "Kör noggrann filhälsokontroll:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Om den är markerad, kommer en mycket långsammare, mer noggrann videohälsokontroll att köras med hjälp av FFmpeg istället för HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Baserat på Desani s \"ScanMedia.ps1\" som finns på:",
    "Attempt to repair files after thorough check:": "Försök att reparera filer efter noggrann kontroll:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Om den är markerad försöker HBBatchBeast att reparera filer med hjälp av FFmpeg. En ny fil med suffixet '_repaired' kommer att skapas i samma mapp som källfilen.",
    "'CRF' value to use when attempting to repair files:": "\"CRF\" -värde att använda när du försöker reparera filer:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Standardvärdet \"CRF\" är 23. Vänligen se följande för mer information:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Området för CRF-skalan är 0-51, där 0 är förlustfri, 23 är standardvärdet och 51 är sämst möjlig kvalitet. Ett lägre värde leder i allmänhet till högre kvalitet, och ett subjektivt sunt intervall är 17-28. Betrakta 17 eller 18 för att vara visuellt förlustfri eller nästan så; det ska se ut som detsamma eller nästan samma som ingången men det är inte tekniskt förlustfritt.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast sparar en lista över skannade filvägar som rapporteras som oförsvarliga. Rensa cacheminnet för att utföra en ny sökning på alla filer.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Antal samtidiga HandBrake / FFmpeg-instanser att använda? (Rekommenderad 4 eller färre):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Denna inställning gäller både \"Video Health Check\" och \"Scan and Convert\" -processer. Ange hur många HandBrake-trådar som ska användas. Det finns inget maximalt men det rekommenderas att inte använda mer än 4. En högre mängd kan frysa datorn om den inte är mycket kraftfull.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Visningsgräns för köstorlek? (Rekommenderas 1000 eller färre):",
    "Automatically start \"Scan and convert\" when program opened?": "Starta automatiskt \"Skanna och konvertera\" när programmet öppnas?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Fyll i e-postinformation för att få e-postmeddelanden om ett fel uppstod under en hälsokontroll eller omvandling / mappvisning. Kommer inte att fungera med konton som kräver 2FA. Du måste aktivera åtkomst till mindre säkra appar på Gmail-konton.",
    "Email address:": "E-postadress:",
    "For example:": "Till exempel:",
    "Email password(not saved):": "E-postlösenord (ej sparat):",
    "SMTP server:": "SMTP-server:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Den här funktionen möjliggör övervakning av status för omvandling / hälsokontroll med någon webbläsare. Användbar när du kör servrar etc.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Om den är aktiverad kommer följande anonyma data att skickas till HBBatchBeast.io:",
    "API key": "API-nyckel",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Aktuell status ('Sökning', 'Running', 'Finished' etc)",
    "Number of:": "Antal:",
    "Remaining items": "Resterande föremål",
    "Successful items": "Framgångsrika saker",
    "Errored items": "Felaktiga objekt",
    "Cancelled items": "Avbrutna föremål",
    "Worker percentages": "Arbetsprocentandelar",
    "Last completed item time": "Sista slutdatumstiden",
    "Enable remote monitoring?:": "Aktivera fjärrövervakning ?:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Ett grundläggande benchmarkingverktyg byggde främst för att se hur 16+ kärnprocessorer utför flera HandBrake-instanser, även om det kan köras på alla typer av processorer.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Detta hämtar en h265 4k-provfil (2.5MB) och kör ett riktmärke med 4 HandBrake-instanser med förinställd \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Resultaten kan laddas upp till hbbatchbeast.io om du väljer.",
    "Queue": "Kö",
    "Output this session": "Utför denna session",
    "Media info viewer tool": "Media Info Viewer Tool",
    "View compress attempt cache": "Visa komprimeringsförsök cache",
    "Clear compress attempt cache": "Rensa cache för komprimeringsförsök",
    "Save config": "Spara konfiguration",
    "Scan only": "Endast skanna",
    "Scan and convert": "Skanna och konvertera",
    "View scan/conversion summary log": "Visa skanning / konvertering sammandragsloggen",
    "View individual file check/conversion log": "Visa enskild filkontroll / konverteringslogg",
    "View worker console output": "Visa arbetskonsolutgång",
    "Health check": "Hälsokontroll",
    "Clear healthy file cache": "Rensa friska filcache",
    "View error log": "Visa fellogg",
    "Email test": "E-posttest",
    "View master log": "Visa huvudlogg",
    "Wiki help": "Wiki hjälp",
    "An application by HaveAGitGat": "En ansökan från HaveAGitGat",
    "New": "Ny",
    "Launch": "Lansera",
    "Benchmark": "benchmark",
    "See results": "Se resultat",
    "Pause queue": "Pauskö",
    "Continue queue": "Fortsätt köen",
    "Stop queue": "Slutkö",
    "Convert selected files": "Konvertera valda filer",
    "Toggle queue view": "Växla kövy",
    "Deselect all": "Avmarkera alla",
    "Invert all": "Invertera alla",
    "Select all": "Välj alla",
    "Toggle output view": "Växla utskriftsvy"
}