{"The number of custom presets does not match the number of source folders!":"தனிப்பயன் முன்னமைவுகளின் எண்ணிக்கை மூல கோப்புறைகளின் எண்ணிக்கையுடன் பொருந்தவில்லை!","source folders have been detected.":"மூல கோப்புறைகள் கண்டறியப்பட்டுள்ளன.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"தனிப்பயன் முன்னமைக்கப்பட்ட கோடுகள் கண்டறியப்பட்டுள்ளன. கண்ணுக்கு தெரியாத வரி முறிவுகளுக்கு இருமுறை சரிபார்க்கவும். ஒரு கோப்புக்கு ஒரு கோப்புறை பாதை அல்லது முன்னமைக்கப்பட்டதாக இருக்க வேண்டும். நீங்கள் தற்செயலாக ஒரு வெற்று வரியை உருவாக்கவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.","The number of filename suffixes does not match the number of source folders! ":"கோப்பு பெயர் பின்னொட்டுகளின் எண்ணிக்கை மூல கோப்புறைகளின் எண்ணிக்கையுடன் பொருந்தவில்லை!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"கோப்பு பெயர் பின்னொட்டு கோடுகள் கண்டறியப்பட்டுள்ளன. கண்ணுக்கு தெரியாத வரி முறிவுகளுக்கு இருமுறை சரிபார்க்கவும். ஒரு கோட்டிற்கு ஒரு கோப்புறை பாதை அல்லது கோப்பு பெயர் பின்னொட்டு இருக்க வேண்டும். நீங்கள் தற்செயலாக ஒரு வெற்று வரியை உருவாக்கவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.","The number of source folders does not match the number of destination folders!":"மூல கோப்புறைகளின் எண்ணிக்கை இலக்கு கோப்புறைகளின் எண்ணிக்கையுடன் பொருந்தவில்லை!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"இலக்கு கோப்புறைகள் கண்டறியப்பட்டுள்ளன. கண்ணுக்கு தெரியாத வரி முறிவுகளுக்கு இருமுறை சரிபார்க்கவும். ஒரு வரிக்கு ஒரு கோப்புறை பாதை இருக்க வேண்டும். நீங்கள் தற்செயலாக ஒரு வெற்று வரியை உருவாக்கவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.","The number of source folders does not match the number of temporary conversion folders!":"மூல கோப்புறைகளின் எண்ணிக்கை தற்காலிக மாற்று கோப்புறைகளின் எண்ணிக்கையுடன் பொருந்தவில்லை!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"தற்காலிக மாற்று கோப்புறைகள் கண்டறியப்பட்டுள்ளன. கண்ணுக்கு தெரியாத வரி முறிவுகளுக்கு இருமுறை சரிபார்க்கவும். ஒரு வரிக்கு ஒரு கோப்புறை பாதை இருக்க வேண்டும். நீங்கள் தற்செயலாக ஒரு வெற்று வரியை உருவாக்கவில்லை என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"'.Mp4' போன்ற செல்லுபடியாகும் கொள்கலனை உள்ளிடவும். '.'","Corrupt file folder":"ஊழல் கோப்பு கோப்புறை","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"இல்லை! பாதைக்கு முன் / பின் இடைவெளிகள் அல்லது மறைக்கப்பட்ட எழுத்துக்கள் இல்லை என்பதை உறுதிப்படுத்தவும்","Source folder":"மூல கோப்புறை","Temporary conversion folder":"தற்காலிக மாற்று கோப்புறை","appears to be the same as or is within source folder":"மூல கோப்புறையில் உள்ளதைப் போலவே உள்ளது","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"இது HBBatchBeast சரியாக செயல்படுவதைத் தடுக்கும். தற்காலிக மாற்று கோப்புறையை மூல கோப்புறையின் வெளியே உள்ள கோப்புறையாக மாற்றவும். 'அசல் கோப்புகளை மாற்றவும்' என்பதைப் பயன்படுத்த விரும்பினால், தயவுசெய்து மூல கோப்புறையைப் போன்ற அல்லது அதற்குள் இல்லாத ஒரு இலக்கு கோப்புறையைத் தேர்ந்தெடுத்து, மேம்பட்ட அமைப்புகள் பிரிவில் 'அசல் கோப்புகளை எப்போதும் மாற்றவும்' தேர்வுப்பெட்டியை சரிபார்க்கவும். . தற்காலிக 'தற்காலிக மாற்று கோப்புறை' தேர்வுப்பெட்டியைத் தேர்வுநீக்குங்கள், ஏனெனில் இது இந்த வழக்கில் எந்தப் பயனும் இல்லை. கோப்புகள் இலக்கு கோப்புறையாக மாற்றப்பட்டு பின்னர் மூல கோப்புறையில் நகர்த்தப்படும்.","Destination folder":"இலக்கு கோப்புறை","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"இது HBBatchBeast சரியாக செயல்படுவதைத் தடுக்கும். இலக்கு கோப்புறையை மூல கோப்புறையின் வெளியே உள்ள கோப்புறையாக மாற்றவும். 'அசல் கோப்புகளை மாற்றவும்' என்பதைப் பயன்படுத்த விரும்பினால், தயவுசெய்து மூல கோப்புறையைப் போன்ற அல்லது அதற்குள் இல்லாத ஒரு இலக்கு கோப்புறையைத் தேர்ந்தெடுத்து, மேம்பட்ட அமைப்புகள் பிரிவில் 'அசல் கோப்புகளை எப்போதும் மாற்றவும்' தேர்வுப்பெட்டியை சரிபார்க்கவும். . தற்காலிக 'தற்காலிக மாற்று கோப்புறை' தேர்வுப்பெட்டியைத் தேர்வுநீக்குங்கள், ஏனெனில் இது இந்த வழக்கில் எந்தப் பயனும் இல்லை. கோப்புகள் இலக்கு கோப்புறையாக மாற்றப்பட்டு பின்னர் மூல கோப்புறையில் நகர்த்தப்படும்.","Error creating temporary conversion folder":"தற்காலிக மாற்று கோப்புறையை உருவாக்குவதில் பிழை","Error creating destination folder":"இலக்கு கோப்புறையை உருவாக்குவதில் பிழை","Please select to use HandBrake or FFmpeg!":"ஹேண்ட்பிரேக் அல்லது FFmpeg ஐப் பயன்படுத்த தேர்ந்தெடுக்கவும்!","Please select a standard preset or input a custom one!":"ஒரு நிலையான முன்னமைவைத் தேர்ந்தெடுக்கவும் அல்லது தனிப்பயன் ஒன்றை உள்ளிடவும்!","Please select a scan interval of 5 seconds or greater!":"5 விநாடிகள் அல்லது அதற்கு மேற்பட்ட ஸ்கேன் இடைவெளியைத் தேர்ந்தெடுக்கவும்!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"பயன்படுத்த ஒரே நேரத்தில் ஹேண்ட்பிரேக் / எஃப்.எஃப்.எம்.பி நிகழ்வுகளின் எண்ணிக்கை ஒன்று அல்லது அதற்கு மேற்பட்டது என்பதை உறுதிப்படுத்தவும்!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"தவறான API விசை! புதிய விசையை உருவாக்க தொலை கண்காணிப்பு தாவலில் 'புதியது' என்பதைக் கிளிக் செய்க.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"தினசரி ஸ்கேன் நேரத்தை 24 மணிநேர வடிவத்தில் உள்ளிடவும்: hh: mm (எடுத்துக்காட்டாக 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"மாற்றத்திற்குப் பிறகு மூல கோப்புகள் நீக்கப்படும்! சரியான பயன்பாட்டிற்கு முன் சோதிக்கவும்!","Benchmark failed!":"பெஞ்ச்மார்க் தோல்வியடைந்தது!","Log does not exist!":"பதிவு இல்லை!","Folder does not exist!":"கோப்புறை இல்லை!","Error sending email! Please check your settings.":"மின்னஞ்சல் அனுப்புவதில் பிழை! உங்கள் அமைப்புகளை சரிபார்க்கவும்.","Test email sent!":"சோதனை மின்னஞ்சல் அனுப்பப்பட்டது!","All worker processes have been stopped.":"அனைத்து தொழிலாளர் செயல்முறைகளும் நிறுத்தப்பட்டுள்ளன.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"தற்போதைய உருப்படிகள் செயலாக்கம் முடிந்ததும் வரிசை இடைநிறுத்தப்படும். வரிசையை இடைநிறுத்த விரும்புகிறீர்களா?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"வரிசை இடைநிறுத்தம் தொடங்கப்பட்டது. அனைத்து தொழிலாளர்களும் இடைநிறுத்தப்பட்டதும் 'தொடரவும்' பொத்தான் தோன்றும்.","Healthy file cache cleared!":"ஆரோக்கியமான கோப்பு கேச் அழிக்கப்பட்டது!","Cache cleared!":"கேச் அழிக்கப்பட்டது!","Cancel item":"உருப்படியை ரத்துசெய்","Please check the above checkbox to use this feature.":"இந்த அம்சத்தைப் பயன்படுத்த மேலே உள்ள தேர்வுப்பெட்டியை சரிபார்க்கவும்.","Configuration":"கட்டமைப்பு","Source folders":"மூல கோப்புறைகள்","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"இது மூல கோப்புறையாகும், இது ஊடகங்களுக்கு ஸ்கேன் செய்யப்படும். கோப்புறையை பின்னிணைப்பு இல்லாமல் உள்ளிட வேண்டும். உதாரணத்திற்கு:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"மூல கோப்புறை பாதை பெட்டி விரிவாக்கக்கூடியது (புதிய வரியை உருவாக்க Enter ஐ அழுத்தவும்). நீங்கள் பல மூல கோப்புறைகளைக் குறிப்பிட விரும்பினால், ஒவ்வொரு மூல கோப்புறை பாதையும் அதன் சொந்த வரியில் இருப்பதை உறுதிசெய்க:","Video health check":"வீடியோ சுகாதார சோதனை","Batch conversion and Folder watching":"தொகுதி மாற்றம் மற்றும் கோப்புறை பார்ப்பது","Remote Monitoring (Beta)":"தொலை கண்காணிப்பு (பீட்டா)","Benchmark (Beta)":"பெஞ்ச்மார்க் (பீட்டா)","System":"அமைப்பு","Help":"உதவி","Temporary conversion folders":"தற்காலிக மாற்று கோப்புறைகள்","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"\"தற்காலிக மாற்று கோப்புறை?\" சரிபார்க்கப்பட்டது, பின்னர் ஹேண்ட்பிரேக் கோப்புகளை அந்த கோப்புறையில் மாற்றும். மாற்றம் முடிந்ததும், கோப்பு உங்கள் \"இலக்கு கோப்புறையில்\" நகர்த்தப்படும். மூல கோப்புறைகளாக பல தற்காலிக மாற்று கோப்புறைகளை நீங்கள் குறிப்பிட வேண்டும். உங்கள் முதல் மூல கோப்புறை உங்கள் முதல் தற்காலிக மாற்று கோப்புறையாகவும், உங்கள் இரண்டாவது மூல கோப்புறை உங்கள் இரண்டாவது தற்காலிக மாற்று கோப்புறையாகவும் மாற்றப்படும். ஒவ்வொரு தற்காலிக மாற்று கோப்புறை பாதையும் அதன் சொந்த வரியில் இருப்பதை உறுதிசெய்க.","Destination folders":"இலக்கு கோப்புறைகள்","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"இலக்கு கோப்புறை பாதைகளை குறிப்பிடவும். மீண்டும், நீங்கள் மூல கோப்புறைகளாக பல இலக்கு கோப்புறைகளை குறிப்பிட வேண்டும். உங்கள் முதல் மூல கோப்புறையிலிருந்து கோப்புகள் உங்கள் முதல் இலக்கு கோப்புறையிலும், உங்கள் இரண்டாவது இலக்கு கோப்புறையில் உங்கள் இரண்டாவது மூல கோப்புறை கோப்புகளிலும் முடிவடையும்.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"முதல் மூல கோப்புறை ---------> முதல் தற்காலிக மாற்று கோப்புறை ---------> முதல் இலக்கு கோப்புறை","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"இரண்டாவது மூல கோப்புறை ---------> இரண்டாவது தற்காலிக மாற்று கோப்புறை ---------> இரண்டாவது இலக்கு கோப்புறை","etc":"போன்றவை","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"நீங்கள் இலக்கு கோப்புறையை மூல கோப்புறையைப் போலவே அமைத்தால் அல்லது HBBatchBeast சரியாக இயங்காது.","Standard preset:":"நிலையான முன்னமைவு:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"உங்கள் கோப்புகளை மாற்ற விரும்பும் ஹேண்ட்பிரேக் முன்னமைவைத் தேர்ந்தெடுக்கவும். \"நிலையான முன்னமைவு\" தேர்ந்தெடுக்கப்பட்டால், தேர்ந்தெடுக்கப்பட்ட கோப்புறைகளில் உள்ள அனைத்து கோப்புகளும் குறிப்பிட்ட ஹேண்ட்பிரேக் முன்னமைவைப் பயன்படுத்தி மாற்றப்படும். ஹேண்ட்பிரேக் முன்னமைவுகளைப் பற்றி மேலும் அறிய இங்கே:","Custom preset:":"தனிப்பயன் முன்னமைவு:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"\"தனிப்பயன் முன்னமைவு\" என்றால், நீங்கள் உங்கள் சொந்த தனிப்பயன் முன்னமைவை உள்ளிட வேண்டும். HBBatchBeast ஹேண்ட்பிரேக் சிஎல்ஐ உள்ளீட்டின் \"ஹேண்ட்பிரேக் சிஎல்ஐ -ஐ மூல-இலக்கு\" பகுதியை உள்ளடக்கியது, எனவே நீங்கள் மாற்று அளவுருக்களை உள்ளிட வேண்டும். உதாரணத்திற்கு:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"FFmpeg ஐப் பயன்படுத்தினால், நீங்கள் கமாவுடன் உள்ளீடு மற்றும் வெளியீட்டு அளவுருக்களைப் பிரிக்க வேண்டும். போன்றவை:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"எடுத்துக்காட்டாக, அதிகாரப்பூர்வ ஹேண்ட்பிரேக் ஜி.யு.ஐ பயன்பாட்டிலிருந்து ஏற்றுமதி செய்யப்பட்ட தனிப்பயன் முன்னமைவுடன் நீங்கள் இணைக்கலாம்:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"தனிப்பயன் முன்னமைவுகளில் உங்களுக்கு சிக்கல் இருந்தால், அது ஹேண்ட்பிரேக் சி.எல்.ஐ உடன் அறியப்பட்ட பிழை காரணமாக இருக்கலாம் (அடுத்த ஹேண்ட்பிரேக்.சி.எல் வெளியீட்டில் சரி செய்யப்படும்). தற்காலிக தீர்வுக்காக இதைப் பார்க்கவும்:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"ஒவ்வொரு தனிப்பயன் முன்னமைவும் அதன் சொந்த வரியில் இருக்க வேண்டும், மேலும் கோப்புறைகளைப் போலவே, மூல கோப்புறைகளைப் போல பல தனிப்பயன் முன்னமைவுகளும் இருக்க வேண்டும்.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"முதல் மூல கோப்புறை ---------> முதல் தற்காலிக மாற்று கோப்புறை ---------> முதல் இலக்கு கோப்புறை @ தனிப்பயன் முன்னமைக்கப்பட்ட 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"இரண்டாவது மூல கோப்புறை ---------> இரண்டாவது தற்காலிக மாற்று கோப்புறை ---------> இரண்டாவது இலக்கு கோப்புறை @ தனிப்பயன் முன்னமைக்கப்பட்ட 2","See the following image for guidance:":"வழிகாட்டலுக்கு பின்வரும் படத்தைப் பார்க்கவும்:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"கிராபிக்ஸ் கார்டு குறியாக்கத்தைப் பயன்படுத்தினால் (NVENC போன்றவை), நீங்கள் VRAM வரம்புகள் காரணமாக ஹேண்ட்பிரேக் நிகழ்வுகளின் எண்ணிக்கையை குறைக்க வேண்டும் (2 அல்லது அதற்கும் குறைவாக முயற்சிக்கவும்).","Select standard preset:":"நிலையான முன்னமைவைத் தேர்ந்தெடுக்கவும்:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC கண்டறியப்பட்டது, தயவுசெய்து ஹேண்ட்பிரேக்லி நிகழ்வுகளின் எண்ணிக்கையை 2 அல்லது அதற்குக் குறைவாக (பெரும்பாலான கிராபிக்ஸ் கார்டுகளுக்கு) குறைக்க உறுதிசெய்து கொள்ளுங்கள் அல்லது போதுமான VRAM இல்லாததால் பிழைகள் ஏற்படக்கூடும். இந்த அமைப்பை \"கணினி\" தாவலில் காணலாம்.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"இறக்குமதி செய்யப்பட்ட முன்னமைவு கண்டறியப்பட்டது. இறக்குமதி செய்யப்பட்ட தனிப்பயன் முன்னமைவுகளில் உங்களுக்கு சிக்கல் இருந்தால், அது ஹேண்ட்பிரேக் சி.எல்.ஐ உடன் அறியப்பட்ட பிழை காரணமாக இருக்கலாம் (அடுத்த ஹேண்ட்பிரேக்.சி.எல் வெளியீட்டில் சரி செய்யப்படும்). .Json கோப்பிலிருந்து '\"PictureRotate\": \"0: 0\"' ஐ அகற்றுவதே ஒரு தற்காலிக தீர்வாகும். மேலும் தகவல் இங்கே:","Container:":"கொள்கலன்:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"வெளியீட்டு கோப்பு '.mp4' போன்றதாக இருக்க விரும்பும் கொள்கலனைக் குறிப்பிடவும். கொள்கலன்களைப் பற்றி மேலும் அறிய இங்கே:","Enable periodic scanning:":"குறிப்பிட்ட கால ஸ்கேனிங்கை இயக்கு:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast உங்கள் மூல கோப்புறைகளை கண்காணிக்கலாம் மற்றும் ஒரு குறிப்பிட்ட இடைவெளியில் புதிய கோப்புகளுக்கான ஸ்கேன்களை இயக்கலாம். இடைவெளி நேரம் வினாடிகளில் உள்ளது, இயல்புநிலை 300 வினாடிகள் (5 நிமிடங்கள்). இந்த விருப்பம் தேர்ந்தெடுக்கப்பட்டால், நீங்கள் \"ஸ்கேன் செய்து மாற்றவும்\" அழுத்தும்போது, நிரல் எந்த புதிய கோப்புகளையும் மாற்றும், பின்னர் ஒரு கவுண்டவுன் டைமர் தொடங்கும். நிறுத்தப்படும் வரை இது எண்ணற்ற அளவில் சுழலும். ஸ்கேன் இடைவெளி மேம்பட்ட அமைப்புகள் பிரிவில் உள்ளது.","Enable daily scanning:":"தினசரி ஸ்கேனிங்கை இயக்கு:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"அவ்வப்போது ஸ்கேனிங் செய்வதற்குப் பதிலாக, ஒரு நாளைக்கு ஒரு முறை ஸ்கேன் இயக்க தேர்வு செய்யலாம். '18: 30 'போன்ற hh: mm வடிவத்தில் மேம்பட்ட அமைப்புகள் பிரிவில் ஸ்கேன் நேரம் உள்ளிடப்பட்டுள்ளது. \"ஸ்கேன் மற்றும் மாற்ற\" தேர்ந்தெடுக்கப்பட்டதும், ஸ்கேன் மற்றும் மாற்று செயல்முறையை இயக்கும் வரை நிரல் குறிப்பிட்ட நேரம் வரை காத்திருக்கும். மீண்டும், இது நிறுத்தப்படும் வரை எண்ணற்ற அளவில் சுழலும்.","Show/hide advanced:":"மேம்பட்டதைக் காட்டு / மறைக்க:","Scan interval (minimum 5 seconds):":"ஸ்கேன் இடைவெளி (குறைந்தபட்சம் 5 விநாடிகள்):","Daily run time (hh:mm):":"தினசரி இயக்க நேரம் (hh: mm):","Output filename suffix:":"வெளியீட்டு கோப்பு பெயர் பின்னொட்டு:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"இது விருப்பமானது. உங்கள் கோப்பு பெயரின் முடிவில் '_1080p' அல்லது '_testconversion' போன்றவற்றைச் சேர்க்க ஒரு பின்னொட்டைக் குறிப்பிடலாம்.","If 'standard preset' is selected then all output files will have the same suffix.":"'நிலையான முன்னமைவு' தேர்ந்தெடுக்கப்பட்டால், எல்லா வெளியீட்டு கோப்புகளுக்கும் ஒரே பின்னொட்டு இருக்கும்.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"'தனிப்பயன் முன்னமைவு' தேர்ந்தெடுக்கப்பட்டால், மூல கோப்புறை / தனிப்பயன் முன்னமைவுக்கு ஒரு பின்னொட்டைக் குறிப்பிடலாம். ஒவ்வொரு பின்னொட்டும் அதன் சொந்த வரியில் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். எடுத்துக்காட்டாக, உங்களிடம் 2 மூல கோப்புறைகள் இருந்தால், 'தனிப்பயன் முன்னமைவு' ஐப் பயன்படுத்துகிறீர்கள் என்றால், இதை நீங்கள் கோப்பு பெயர் பின்னொட்டு பெட்டியில் வைக்கலாம்:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"முதல் மூல கோப்புறையில் உள்ள கோப்புகள் வெளியீட்டு கோப்பு பெயரில் '_720p' சேர்க்கப்படும். இரண்டாவது மூல கோப்புறையில் உள்ள கோப்புகள் வெளியீட்டு கோப்பு பெயர் முதலியவற்றில் '_1080p' சேர்க்கப்படும்.","Include these file containers:":"இந்த கோப்பு கொள்கலன்களைச் சேர்க்கவும்:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"ஸ்கேன் செய்ய கோப்பு கொள்கலன்களை உள்ளிடவும். ஒவ்வொரு வகையையும் கமாவால் பிரிக்க வேண்டும். இயல்புநிலை நுழைவு:","Exclude files smaller than (MB):":"(MB) ஐ விட சிறிய கோப்புகளை விலக்கு:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"மாற்றத்திலிருந்து ஒரு குறிப்பிட்ட அளவை விட சிறிய கோப்புகளை விலக்க வேண்டுமா என்பதைக் குறிப்பிடவும் (மெகாபைட்டில்)","Exclude files larger than (MB):":"(MB) ஐ விட பெரிய கோப்புகளை விலக்கு:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"மாற்றத்திலிருந்து ஒரு குறிப்பிட்ட அளவை விட பெரிய கோப்புகளை விலக்க வேண்டுமா என்பதைக் குறிப்பிடவும் (மெகாபைட்டில்)","Exclude filenames which include any of these words:":"இந்த சொற்களில் ஏதேனும் ஒன்றை உள்ளடக்கிய கோப்பு பெயர்களை விலக்கு:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"கோப்புகளை ஸ்கேன் செய்யும் போது வடிகட்ட வேண்டிய முக்கிய வார்த்தைகளை உள்ளிடவும். எடுத்துக்காட்டாக, \"720p\" உள்ளிடப்பட்டால், தலைப்பில் \"720p\" உடன் எந்த கோப்புகளும் மாற்றப்படாது. மீண்டும், முக்கிய வார்த்தைகளை கமாவால் பிரிக்க வேண்டும். எடுத்துக்காட்டாக, வடிகட்டி பெட்டியில் பின்வருவனவற்றை உள்ளிடவும்:","Include files with any ":"எந்தவொரு கோப்புகளையும் சேர்க்கவும்"," or all ":"அல்லது அனைத்தும்"," of these":"இந்த","properties:":"பண்புகள்:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"கோப்புகளை மாற்றுவதற்கு உங்களிடம் இருக்க வேண்டிய வீடியோ மற்றும் ஆடியோ பண்புகளை இங்கே உள்ளிடலாம் (தகவல் FFprobe ஐப் பயன்படுத்தி பிரித்தெடுக்கப்படுகிறது). பண்புகளை கமாவால் பிரிக்க வேண்டும். நீங்கள் சேர்க்க விரும்பும் பண்புகளைத் தீர்மானிக்க உதவும் ஊடக தகவல் பார்வையாளர் கருவியைப் பயன்படுத்தவும். கடைசி சொத்துக்குப் பிறகு கமாவை வைப்பதை உறுதிசெய்க. எடுத்துக்காட்டாக, h264 மற்றும் aac ஸ்டீரியோ ஆடியோவைப் பயன்படுத்தி குறியாக்கம் செய்யப்பட்ட கோப்புகளை மட்டுமே மாற்ற:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"மாற்று செயல்முறை தொடங்கியதும் (வரிசையை உருவாக்கும் போது நேரத்தை மிச்சப்படுத்த) இந்த சொத்து சோதனை செய்யப்படுகிறது என்பது கவனிக்கத்தக்கது, எனவே மாற்று வரிசையில் கோப்புகள் தோன்றினாலும், சரியான நிபந்தனைகள் பூர்த்தி செய்யப்பட்டால் அவை தவிர்க்கப்படும் / சேர்க்கப்படும்.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"FFprobe பண்புகளை பிரித்தெடுக்க முடிந்தால், வரிசை பார்வையில் \"FFprobe\" நெடுவரிசையில் ஒரு 'சரி' தோன்றும்.","Exclude files with any ":"எந்தவொரு கோப்புகளையும் விலக்கவும்"," of these ":"இந்த","The opposite of 'Include files with any or all of these properties'":"'இந்த பண்புகளில் ஏதேனும் அல்லது அனைத்தையும் கொண்ட கோப்புகளைச் சேர்க்கவும்'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"மேலே உள்ள விருப்பங்களில் நீங்கள் சேர்க்க விரும்பும் / விலக்க விரும்பும் பண்புகளைத் தீர்மானிக்க உதவும் பொருட்டு கோப்பு பண்புகளை பகுப்பாய்வு செய்வதற்கான சிறிய கருவி இது. இது தகவல்களைத் தர FFprobe ஐப் பயன்படுத்துகிறது. கோப்புகளை பகுப்பாய்வு செய்ய சாம்பல் பெட்டியில் இழுத்து விடுங்கள். எடுத்துக்காட்டாக, சோதனைக் கோப்பில் கைவிடுவது பின்வருவனவற்றைத் தரக்கூடும்:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"இது போன்ற கோப்புகளை மாற்றுவதிலிருந்து நீங்கள் விலக்க விரும்பினால், நீங்கள் பல கோப்பு பண்புகளை \"இந்த அல்லது எந்தவொரு பண்புகளையும் கொண்ட கோப்புகளை விலக்கு\" பெட்டியில் வைக்கலாம் மற்றும் 'ஏதேனும்' என்பதற்கு பதிலாக 'அனைவருக்கும்' அடுத்துள்ள தேர்வுப்பெட்டியை சரிபார்க்கவும், போன்ற:","Copy excluded files to destination:":"விலக்கப்பட்ட கோப்புகளை இலக்குக்கு நகலெடுக்கவும்:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"இந்த விருப்பத்தை நீங்கள் தேர்வுசெய்தால், மாற்றத்திலிருந்து விலக்கப்பட்ட கோப்புகள் நேரடியாக இலக்கு கோப்புறையில் நகலெடுக்கப்படும். இது பின்வரும் வடிப்பான்களுக்கு பொருந்தும்:","Exclude filenames which include any of these words":"இந்த வார்த்தைகளில் ஏதேனும் அடங்கும் கோப்பு பெயர்களை விலக்கு","Include files with any or all of these properties":"இந்த பண்புகள் ஏதேனும் அல்லது அனைத்தையும் கொண்ட கோப்புகளைச் சேர்க்கவும்","Exclude files with any or all of these properties":"இந்த பண்புகள் ஏதேனும் அல்லது எல்லாவற்றையும் கொண்ட கோப்புகளை விலக்கவும்","Exclude files smaller than (MB)":"(MB) ஐ விட சிறிய கோப்புகளை விலக்கு","Exclude files larger than (MB)":"(MB) ஐ விட பெரிய கோப்புகளை விலக்கு","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"விலக்கப்பட்ட கோப்புகளுக்கும் இது பொருந்தும் என்பதை நினைவில் கொள்க, ஏனெனில் அவை மேலே உள்ள \"உள்ளடக்கு\" சொத்து நிலைமைகளை பூர்த்தி செய்யாது, எனவே நீங்கள் ஒரு சில கோப்புகளை மட்டுமே மாற்ற முயற்சிக்கும்போது தற்செயலாக உங்கள் முழு நூலகத்தையும் நகலெடுக்க வேண்டாம்.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"நகல் அம்சம் பின்வரும் வடிப்பான்களுக்கு பொருந்தாது (அதாவது வடிப்பான் காரணமாக கோப்புகள் விலக்கப்பட்டுள்ளன)","Include these file types":"இந்த கோப்பு வகைகளைச் சேர்க்கவும்","Delete source files after conversion:":"மாற்றத்திற்குப் பிறகு மூல கோப்புகளை நீக்கு:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"இது தேர்ந்தெடுக்கப்பட்டால், மாற்று முயற்சி வெற்றிகரமாக இருந்தால், மூல கோப்பு நீக்கப்படும். அனைத்து கோப்புகளையும் மாற்றிய பின், இந்த செயல்முறை மிகவும் முடிவில் செய்யப்படுகிறது. பல முன்னமைவுகளைப் பயன்படுத்தி ஒரே மூலக் கோப்புகளை ஒரே நேரத்தில் மாற்றலாம் என்பதே இதன் பொருள். மூல கோப்புகள் பின்னர் நீக்கப்படும்.","Replace original file if converted file is smaller?(Compress attempt)":"மாற்றப்பட்ட கோப்பு சிறியதாக இருந்தால் அசல் கோப்பை மாற்றவா? (முயற்சியை சுருக்கவும்)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"புதிய கோப்பு சிறியதாக இருந்தால் அசல் மூல கோப்பை தானாக மாற்ற HBBatchBeast விரும்பினால் இந்த தேர்வு பெட்டியைத் தேர்ந்தெடுக்கவும். புதிய கோப்பு சிறியதாக இல்லாவிட்டால், அது இலக்கு கோப்புறையில் விடப்படும்.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"உங்கள் இலக்கு கோப்புறை உங்கள் மூல கோப்புறையைப் போல / அல்லது அதற்குள் இல்லை என்பதை உறுதிப்படுத்தவும் அல்லது அது சரியாக இயங்காது.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast ஒரு குறிப்பிட்ட கோப்பை சுருக்க முயற்சித்தவுடன், அது அந்த கோப்பு பாதையை ஒரு தற்காலிக சேமிப்பில் சேர்க்கும், இதனால் எதிர்காலத்தில் இது மீண்டும் முயற்சிக்கப்படாது. மஞ்சள் பொத்தான்களைப் பயன்படுத்தி தற்காலிக சேமிப்பைக் காணலாம் / திருத்தலாம் / அழிக்கலாம்.","Replace original file always?":"அசல் கோப்பை எப்போதும் மாற்றவா?","The original file will be replaced regardless of whether the new file is larger or smaller.":"புதிய கோப்பு பெரியதா அல்லது சிறியதா என்பதைப் பொருட்படுத்தாமல் அசல் கோப்பு மாற்றப்படும்.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"மீண்டும், உங்கள் இலக்கு கோப்புறை உங்கள் மூல கோப்புறையைப் போல / அல்லது அதற்குள் இல்லை என்பதை உறுதிப்படுத்தவும் அல்லது அது சரியாக இயங்காது.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast ஒரு குறிப்பிட்ட கோப்பை டிரான்ஸ்கோட் செய்தவுடன், அது அந்த கோப்பு பாதையை ஒரு தற்காலிக சேமிப்பில் சேர்க்கும், இதனால் எதிர்காலத்தில் இது மீண்டும் முயற்சிக்கப்படாது. மஞ்சள் பொத்தான்களைப் பயன்படுத்தி தற்காலிக சேமிப்பைக் காணலாம் / திருத்தலாம் / அழிக்கலாம்.","Copy subtitle (srt) files to destination?":"வசன வரிகள் (srt) கோப்புகளை இலக்குக்கு நகலெடுக்கவா?","Subtitle '.srt' files will be copied to the destination folder automatically.":"'.Srt' கோப்புகள் தானாகவே இலக்கு கோப்புறையில் நகலெடுக்கப்படும்.","Automatically create temporary/destination folders if they don't exist?":"தற்காலிக / இலக்கு கோப்புறைகள் இல்லாவிட்டால் தானாக உருவாக்க வேண்டுமா?","Custom bat path to run after each conversion (leave blank if not using):":"ஒவ்வொரு மாற்றத்திற்கும் பிறகு இயக்க விருப்ப பேட் பாதை (பயன்படுத்தாவிட்டால் காலியாக விடவும்):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"ஒவ்வொரு மாற்றத்திற்கும் பிறகு நீங்கள் இயக்க விரும்பும் தனிப்பயன் தொகுதி கோப்புக்கான பாதையை உள்ளிடவும். உதாரணத்திற்கு:","Batch files with timeout statements won't work. More info here:":"காலாவதியான அறிக்கைகளுடன் கூடிய தொகுதி கோப்புகள் இயங்காது. மேலும் தகவல் இங்கே:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"இந்த விருப்பத்தைப் பயன்படுத்த விரும்பவில்லை என்றால் பெட்டியை முழுவதுமாக காலியாக விடுங்கள் (பெட்டியில் மறைக்கப்பட்ட எழுத்துக்கள் எதுவும் இல்லை என்பதை உறுதிப்படுத்தவும்)","Run processes at low priority?":"செயல்முறைகளை குறைந்த முன்னுரிமையில் இயக்கவா?","All conversion processes will be run at low priority, reducing processor usage.":"அனைத்து மாற்று செயல்முறைகளும் குறைந்த முன்னுரிமையில் இயங்கும், இது செயலி பயன்பாட்டைக் குறைக்கும்.","Remove apostrophes from filenames:":"கோப்பு பெயர்களில் இருந்து அப்போஸ்ட்ரோப்களை அகற்று:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"கோப்புப் பெயர்களில் அப்போஸ்ட்ரோப்கள் இருந்தால் மாற்றங்கள் / சுகாதார சோதனை ஸ்கேன் தோல்வியடையக்கூடும். கோப்பு பெயர்களில் இருந்து அப்போஸ்ட்ரோப்களை தானாக அகற்ற இதை சரிபார்க்கவும்."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"இந்த அம்சம் ஹேண்ட்பிரேக்கின் '- ஸ்கேன்' அம்சத்தைப் பயன்படுத்தி சிதைந்த வீடியோ கோப்புகளை ஸ்கேன் செய்யலாம், இருப்பினும் இது எப்போதும் துல்லியமாக இருக்காது. இது இரண்டாவது குறிப்பு புள்ளியை வழங்க FFprobe ஐப் பயன்படுத்துகிறது. FFprobe மற்றும் HandBrake இரண்டும் தோல்வியுற்றால், கோப்பு சிதைந்திருக்க அதிக வாய்ப்பு உள்ளது.","Move corrupt files into the following folder:":"சிதைந்த கோப்புகளை பின்வரும் கோப்புறையில் நகர்த்தவும்:"," If checked, then any files which give errors will be moved into the specified folder.":"சரிபார்க்கப்பட்டால், பிழைகள் தரும் எந்தக் கோப்புகளும் குறிப்பிட்ட கோப்புறையில் நகர்த்தப்படும்.","Corrupt file folder:":"ஊழல் கோப்பு கோப்புறை:","Run thorough file health check:":"முழுமையான கோப்பு சுகாதார சோதனை இயக்கவும்:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"சரிபார்க்கப்பட்டால், ஹேண்ட்பிரேக்கிற்கு பதிலாக FFmpeg ஐப் பயன்படுத்தி மிகவும் மெதுவான, முழுமையான வீடியோ சுகாதார சோதனை இயக்கப்படும்."," Based on Desani's 'ScanMedia.ps1' found at:":"தேசானியின் 'ScanMedia.ps1' ஐ அடிப்படையாகக் கொண்டது:","Attempt to repair files after thorough check:":"முழுமையான சோதனைக்குப் பிறகு கோப்புகளை சரிசெய்யும் முயற்சி:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"சரிபார்க்கப்பட்டால், HBBatchBeast FFmpeg ஐப் பயன்படுத்தி கோப்புகளை சரிசெய்ய முயற்சிக்கும். மூல கோப்பின் அதே கோப்புறையில் '_repired' பின்னொட்டுடன் புதிய கோப்பு உருவாக்கப்படும்.","'CRF' value to use when attempting to repair files:":"கோப்புகளை சரிசெய்ய முயற்சிக்கும்போது பயன்படுத்த வேண்டிய 'CRF' மதிப்பு:","The default 'CRF' value is 23. Please see the following for more information:":"இயல்புநிலை 'CRF' மதிப்பு 23. மேலும் தகவலுக்கு பின்வருவனவற்றைப் பார்க்கவும்:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"சி.ஆர்.எஃப் அளவின் வரம்பு 0–51 ஆகும், இங்கு 0 இழப்பற்றது, 23 இயல்புநிலை, மற்றும் 51 மிக மோசமான தரம். குறைந்த மதிப்பு பொதுவாக உயர் தரத்திற்கு வழிவகுக்கிறது, மேலும் ஒரு அகநிலை விவேகமான வரம்பு 17–28 ஆகும். 17 அல்லது 18 பார்வை இழப்பு இல்லாததாக அல்லது கிட்டத்தட்ட அவ்வாறு கருதுங்கள்; இது உள்ளீட்டைப் போலவே அல்லது கிட்டத்தட்ட ஒரே மாதிரியாக இருக்க வேண்டும், ஆனால் அது தொழில்நுட்ப ரீதியாக இழப்பற்றது அல்ல.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast ஒழுங்கற்றதாக புகாரளிக்கப்பட்ட ஸ்கேன் செய்யப்பட்ட கோப்பு பாதைகளின் பட்டியலைச் சேமிக்கிறது. எல்லா கோப்புகளிலும் புதிய ஸ்கேன் செய்ய தற்காலிக சேமிப்பை அழிக்கவும்.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"பயன்படுத்த ஒரே நேரத்தில் ஹேண்ட்பிரேக் / எஃப்.எஃப்.எம்.பி நிகழ்வுகளின் எண்ணிக்கை? (பரிந்துரைக்கப்பட்ட 4 அல்லது அதற்கும் குறைவானது):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"இந்த அமைப்பு \"வீடியோ சுகாதார சோதனை\" மற்றும் \"ஸ்கேன் மற்றும் மாற்ற\" செயல்முறைகளுக்கு பொருந்தும். எத்தனை ஹேண்ட்பிரேக் நூல்களைப் பயன்படுத்த வேண்டும் என்பதைக் குறிப்பிடவும். 4 க்கு மேல் பயன்படுத்த வேண்டாம் என்று பரிந்துரைக்கப்பட்டிருந்தாலும் அதிகபட்சம் இல்லை. அதிக அளவு உங்கள் கணினி மிகவும் சக்திவாய்ந்ததாக இல்லாவிட்டால் அதை உறைக்கக்கூடும்.","Queue size view limit?(Recommended 1000 or fewer):":"வரிசை அளவு பார்வை வரம்பு? (பரிந்துரைக்கப்படுகிறது 1000 அல்லது அதற்கும் குறைவானது):","Automatically start \"Scan and convert\" when program opened?:":"நிரல் திறக்கும்போது தானாகவே \"ஸ்கேன் செய்து மாற்ற\" என்பதைத் தொடங்கவா?:","Save verbose logs?:":"வாய்மொழி பதிவுகளை சேமிக்கவா?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"விரிவான துணை செயல்முறை பதிவுகளை சேமிக்க இந்த தேர்வுப்பெட்டியை சரிபார்க்கவும். இதில் தொழிலாளர் கன்சோல் வெளியீடு அடங்கும். இது மிகப் பெரிய பதிவுகளை ஏற்படுத்தும்.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"சுகாதார சோதனை அல்லது மாற்றம் / கோப்புறை பார்க்கும் போது பிழை ஏற்பட்டால் மின்னஞ்சல் அறிவிப்புகளைப் பெற மின்னஞ்சல் விவரங்களை நிரப்பவும். 2FA தேவைப்படும் கணக்குகளுடன் வேலை செய்யாது. ஜிமெயில் கணக்குகளில் குறைந்த பாதுகாப்பான பயன்பாடுகளுக்கான அணுகலை நீங்கள் இயக்க வேண்டும்.","Email address:":"மின்னஞ்சல் முகவரி:","For example:":"உதாரணத்திற்கு:","Email password(not saved):":"மின்னஞ்சல் கடவுச்சொல் (சேமிக்கப்படவில்லை):","SMTP server:":"SMTP சேவையகம்:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"எந்தவொரு இணைய உலாவியையும் பயன்படுத்தி மாற்றம் / சுகாதார சோதனை நிலையை கண்காணிக்க இந்த அம்சம் அனுமதிக்கிறது. சேவையகங்களை இயக்கும் போது பயனுள்ளதாக இருக்கும். கோப்பு பெயர்கள் எதுவும் அனுப்பப்படவில்லை.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"இயக்கப்பட்டால், பின்வரும் அநாமதேய தரவு HBBatchBeast.io க்கு அனுப்பப்படும்:","API key":"API விசை","Current status ('Searching', 'Running', 'Finished' etc)":"தற்போதைய நிலை ('தேடல்', 'இயங்கும்', 'முடிந்தது' போன்றவை)","Number of:":"எண்ணிக்கை:","Remaining items":"மீதமுள்ள பொருட்கள்","Successful items":"வெற்றிகரமான உருப்படிகள்","Errored items":"பிழையான உருப்படிகள்","Cancelled items":"ரத்து செய்யப்பட்ட உருப்படிகள்","Worker percentages":"தொழிலாளர் சதவீதம்","Last completed item time":"கடைசியாக பூர்த்தி செய்யப்பட்ட உருப்படி நேரம்","Enable remote monitoring?:":"தொலை கண்காணிப்பை இயக்கவா?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"16+ கோர் செயலிகள் பல ஹேண்ட்பிரேக் நிகழ்வுகளைப் பயன்படுத்தி எவ்வாறு செயல்படுகின்றன என்பதைக் காண முக்கியமாக கட்டமைக்கப்பட்ட ஒரு அடிப்படை தரப்படுத்தல் பயன்பாடு, இது எந்த வகை செயலியிலும் இயக்கப்படலாம்.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"இது ஒரு h265 4k மாதிரி கோப்பை (2.5MB) பதிவிறக்கம் செய்து முன்னமைக்கப்பட்ட \"வெரி ஃபாஸ்ட் 1080p30\" உடன் 4 ஹேண்ட்பிரேக் நிகழ்வுகளைப் பயன்படுத்தி ஒரு அளவுகோலை இயக்கும்.","Results can be uploaded to hbbatchbeast.io if you choose.":"நீங்கள் தேர்வு செய்தால் முடிவுகளை hbbatchbeast.io இல் பதிவேற்றலாம்.","Queue":"கியூ","Output this session":"இந்த அமர்வை வெளியிடுங்கள்","Media info viewer tool":"மீடியா தகவல் பார்வையாளர் கருவி","View replaced file cache":"மாற்றப்பட்ட கோப்பு தற்காலிக சேமிப்பைக் காண்க","Clear replaced file cache":"மாற்றப்பட்ட கோப்பு தற்காலிக சேமிப்பை அழிக்கவும்","Save config":"உள்ளமைவைச் சேமிக்கவும்","Scan only":"ஸ்கேன் மட்டுமே","Scan and convert":"ஸ்கேன் செய்து மாற்றவும்","View scan/conversion summary log":"ஸ்கேன் / மாற்று சுருக்கம் பதிவைக் காண்க","View individual file check/conversion log":"தனிப்பட்ட கோப்பு சோதனை / மாற்று பதிவைக் காண்க","View worker console output":"தொழிலாளர் கன்சோல் வெளியீட்டைக் காண்க","Health check":"சுகாதார சோதனை","Clear healthy file cache":"ஆரோக்கியமான கோப்பு தற்காலிக சேமிப்பை அழிக்கவும்","View error log":"பிழை பதிவைக் காண்க","Email test":"மின்னஞ்சல் சோதனை","View master log":"முதன்மை பதிவைக் காண்க","Wiki help":"விக்கி உதவி","An application by HaveAGitGat":"HaveAGitGat இன் பயன்பாடு","New":"புதிய","Launch":"வெளியீடு","Benchmark":"பெஞ்ச்மார்க்","See results":"முடிவுகளைப் பார்க்கவும்","Pause queue":"வரிசையை இடைநிறுத்து","Continue queue":"வரிசையைத் தொடரவும்","Stop queue":"வரிசையை நிறுத்துங்கள்","Convert selected files":"தேர்ந்தெடுக்கப்பட்ட கோப்புகளை மாற்றவும்","Toggle queue view":"வரிசை காட்சியை நிலைமாற்று","Deselect all":"அனைத்து தெரிவுகளையும் நிராகரி","Invert all":"அனைத்தையும் தலைகீழாக மாற்றுங்கள்","Select all":"அனைத்தையும் தெரிவுசெய்","Toggle output view":"வெளியீட்டு காட்சியை நிலைமாற்று"}