{"The number of custom presets does not match the number of source folders!":"అనుకూల ప్రీసెట్లు సంఖ్య మూల ఫోల్డర్ల సంఖ్యతో సరిపోలడం లేదు!","source folders have been detected.":"మూల ఫోల్డర్లు కనుగొనబడ్డాయి.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"అనుకూల ఆరంభ పంక్తులు కనుగొనబడ్డాయి. అదృశ్య పంక్తి విరామాల కోసం దయచేసి రెండుసార్లు తనిఖీ చేయండి. ఒక పంక్తికి ఒక ఫోల్డర్ మార్గం లేదా ప్రీసెట్ ఉండాలి. మీరు అనుకోకుండా ఖాళీ గీతను సృష్టించలేదని నిర్ధారించుకోండి.","The number of filename suffixes does not match the number of source folders! ":"ఫైల్ పేరు ప్రత్యయాల సంఖ్య సోర్స్ ఫోల్డర్ల సంఖ్యతో సరిపోలడం లేదు!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"ఫైల్ పేరు ప్రత్యయం పంక్తులు కనుగొనబడ్డాయి. అదృశ్య పంక్తి విరామాల కోసం దయచేసి రెండుసార్లు తనిఖీ చేయండి. ఒక పంక్తికి ఒక ఫోల్డర్ మార్గం లేదా ఫైల్ పేరు ప్రత్యయం ఉండాలి. మీరు అనుకోకుండా ఖాళీ గీతను సృష్టించలేదని నిర్ధారించుకోండి.","The number of source folders does not match the number of destination folders!":"సోర్స్ ఫోల్డర్ల సంఖ్య గమ్యం ఫోల్డర్ల సంఖ్యతో సరిపోలడం లేదు!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"గమ్యం ఫోల్డర్‌లు కనుగొనబడ్డాయి. అదృశ్య పంక్తి విరామాల కోసం దయచేసి రెండుసార్లు తనిఖీ చేయండి. ప్రతి పంక్తికి ఒక ఫోల్డర్ మార్గం ఉండాలి. మీరు అనుకోకుండా ఖాళీ గీతను సృష్టించలేదని నిర్ధారించుకోండి.","The number of source folders does not match the number of temporary conversion folders!":"సోర్స్ ఫోల్డర్ల సంఖ్య తాత్కాలిక మార్పిడి ఫోల్డర్ల సంఖ్యతో సరిపోలడం లేదు!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"తాత్కాలిక మార్పిడి ఫోల్డర్‌లు కనుగొనబడ్డాయి. అదృశ్య పంక్తి విరామాల కోసం దయచేసి రెండుసార్లు తనిఖీ చేయండి. ప్రతి పంక్తికి ఒక ఫోల్డర్ మార్గం ఉండాలి. మీరు అనుకోకుండా ఖాళీ గీతను సృష్టించలేదని నిర్ధారించుకోండి.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"దయచేసి '.mp4' వంటి చెల్లుబాటు అయ్యే కంటైనర్‌ను నమోదు చేయండి. '' ను చేర్చాలని నిర్ధారించుకోండి.","Corrupt file folder":"పాడైన ఫైల్ ఫోల్డర్","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ఉనికిలో లేదు! దయచేసి మార్గానికి ముందు / తరువాత ఖాళీలు లేదా దాచిన అక్షరాలు లేవని నిర్ధారించుకోండి","Source folder":"మూల ఫోల్డర్","Temporary conversion folder":"తాత్కాలిక మార్పిడి ఫోల్డర్","appears to be the same as or is within source folder":"సోర్స్ ఫోల్డర్‌లో ఉన్నట్లుగా లేదా ఉన్నట్లు కనిపిస్తుంది","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ఇది HBBatchBeast సరిగ్గా పనిచేయకుండా నిరోధిస్తుంది. దయచేసి తాత్కాలిక మార్పిడి ఫోల్డర్‌ను సోర్స్ ఫోల్డర్ వెలుపల ఉన్న ఫోల్డర్‌కు మార్చండి. మీరు 'ఒరిజినల్ ఫైల్స్ ఫీచర్‌ను పున lace స్థాపించుము' ఉపయోగించాలనుకుంటే, దయచేసి సోర్స్ ఫోల్డర్‌కు సమానమైన లేదా లోపల లేని గమ్యం ఫోల్డర్‌ను ఎంచుకుని, ఆపై అధునాతన సెట్టింగ్‌ల విభాగంలో 'అసలు ఫైల్‌లను ఎల్లప్పుడూ మార్చండి' చెక్‌బాక్స్‌ను తనిఖీ చేయండి . ఈ సందర్భంలో ఎటువంటి ఉపయోగం ఉండనందున తాత్కాలిక 'తాత్కాలిక మార్పిడి ఫోల్డర్' చెక్‌బాక్స్‌ను ఎంపిక చేయవద్దు. ఫైల్‌లు గమ్యం ఫోల్డర్‌గా మార్చబడతాయి మరియు తరువాత మూల ఫోల్డర్‌లోకి తిరిగి తరలించబడతాయి.","Destination folder":"గమ్యం ఫోల్డర్","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ఇది HBBatchBeast సరిగ్గా పనిచేయకుండా నిరోధిస్తుంది. దయచేసి గమ్యం ఫోల్డర్‌ను మూల ఫోల్డర్ వెలుపల ఉన్న ఫోల్డర్‌కు మార్చండి. మీరు 'ఒరిజినల్ ఫైల్స్ ఫీచర్‌ను పున lace స్థాపించుము' ఉపయోగించాలనుకుంటే, దయచేసి సోర్స్ ఫోల్డర్‌కు సమానమైన లేదా లోపల లేని గమ్యం ఫోల్డర్‌ను ఎంచుకుని, ఆపై అధునాతన సెట్టింగ్‌ల విభాగంలో 'అసలు ఫైల్‌లను ఎల్లప్పుడూ మార్చండి' చెక్‌బాక్స్‌ను తనిఖీ చేయండి . ఈ సందర్భంలో ఎటువంటి ఉపయోగం ఉండనందున తాత్కాలిక 'తాత్కాలిక మార్పిడి ఫోల్డర్' చెక్‌బాక్స్‌ను ఎంపిక చేయవద్దు. ఫైల్‌లు గమ్యం ఫోల్డర్‌గా మార్చబడతాయి మరియు తరువాత మూల ఫోల్డర్‌లోకి తిరిగి తరలించబడతాయి.","Error creating temporary conversion folder":"తాత్కాలిక మార్పిడి ఫోల్డర్‌ను సృష్టించడంలో లోపం","Error creating destination folder":"గమ్యం ఫోల్డర్‌ను సృష్టించడంలో లోపం","Please select to use HandBrake or FFmpeg!":"దయచేసి హ్యాండ్‌బ్రేక్ లేదా FFmpeg ని ఉపయోగించడానికి ఎంచుకోండి!","Please select a standard preset or input a custom one!":"దయచేసి ప్రామాణిక ప్రీసెట్‌ను ఎంచుకోండి లేదా అనుకూలమైనదాన్ని ఇన్‌పుట్ చేయండి!","Please select a scan interval of 5 seconds or greater!":"దయచేసి 5 సెకన్లు లేదా అంతకంటే ఎక్కువ స్కాన్ విరామాన్ని ఎంచుకోండి!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"దయచేసి ఉపయోగించాల్సిన ఏకకాల హ్యాండ్‌బ్రేక్ / ఎఫ్‌ఎఫ్‌ఎమ్‌పిగ్ ఉదంతాల సంఖ్య ఒకటి లేదా అంతకంటే ఎక్కువ అని నిర్ధారించుకోండి!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"చెల్లని API కీ! క్రొత్త కీని రూపొందించడానికి రిమోట్ పర్యవేక్షణ ట్యాబ్‌లోని 'క్రొత్తది' క్లిక్ చేయండి.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"దయచేసి రోజువారీ స్కాన్ సమయాన్ని 24 గంటల ఆకృతిలో నమోదు చేయండి: hh: mm (ఉదాహరణకు 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"మార్పిడి తర్వాత మూలం ఫైల్‌లు తొలగించబడతాయి! సరైన ఉపయోగం ముందు దయచేసి పరీక్షించండి!","Benchmark failed!":"బెంచ్మార్క్ విఫలమైంది!","Log does not exist!":"లాగ్ ఉనికిలో లేదు!","Folder does not exist!":"ఫోల్డర్ ఉనికిలో లేదు!","Error sending email! Please check your settings.":"ఇమెయిల్ పంపడంలో లోపం! దయచేసి మీ సెట్టింగులను తనిఖీ చేయండి.","Test email sent!":"పరీక్ష ఇమెయిల్ పంపబడింది!","All worker processes have been stopped.":"అన్ని కార్మికుల ప్రక్రియలు ఆగిపోయాయి.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"ప్రస్తుత అంశాలు ప్రాసెసింగ్ పూర్తయిన తర్వాత క్యూ పాజ్ చేయబడుతుంది. మీరు క్యూను పాజ్ చేయాలనుకుంటున్నారా?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"క్యూ పాజ్ ప్రారంభించబడింది. కార్మికులందరూ పాజ్ చేసిన తర్వాత 'కొనసాగించు' బటన్ కనిపిస్తుంది.","Healthy file cache cleared!":"ఆరోగ్యకరమైన ఫైల్ కాష్ క్లియర్ చేయబడింది!","Cache cleared!":"కాష్ క్లియర్ చేయబడింది!","Cancel item":"అంశాన్ని రద్దు చేయండి","Please check the above checkbox to use this feature.":"ఈ లక్షణాన్ని ఉపయోగించడానికి దయచేసి పై చెక్‌బాక్స్‌ను తనిఖీ చేయండి.","Configuration":"ఆకృతీకరణ","Source folders":"మూల ఫోల్డర్లు","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"ఇది మూలం ఫోల్డర్, ఇది మీడియా కోసం స్కాన్ చేయబడుతుంది. వెనుకంజలో ఉన్న స్లాష్ లేకుండా ఫోల్డర్‌ను నమోదు చేయాలి. ఉదాహరణకి:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"సోర్స్ ఫోల్డర్ పాత్ బాక్స్ విస్తరించదగినది (క్రొత్త పంక్తిని సృష్టించడానికి ఎంటర్ నొక్కండి). మీరు బహుళ సోర్స్ ఫోల్డర్‌లను పేర్కొనాలనుకుంటే, ప్రతి సోర్స్ ఫోల్డర్ మార్గం దాని స్వంత లైన్‌లో ఉందని నిర్ధారించుకోండి:","Video health check":"వీడియో ఆరోగ్య తనిఖీ","Batch conversion and Folder watching":"బ్యాచ్ మార్పిడి మరియు ఫోల్డర్ చూడటం","Remote Monitoring (Beta)":"రిమోట్ మానిటరింగ్ (బీటా)","Benchmark (Beta)":"బెంచ్మార్క్ (బీటా)","System":"వ్యవస్థ","Help":"సహాయం","Temporary conversion folders":"తాత్కాలిక మార్పిడి ఫోల్డర్లు","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"\"తాత్కాలిక మార్పిడి ఫోల్డర్?\" తనిఖీ చేయబడితే, హ్యాండ్‌బ్రేక్ ఫైల్‌లను ఆ ఫోల్డర్‌లోకి మారుస్తుంది. మార్పిడి పూర్తయిన తర్వాత, ఫైల్ మీ \"గమ్యం ఫోల్డర్\" లోకి తరలించబడుతుంది. మీరు సోర్స్ ఫోల్డర్‌ల వలె తాత్కాలిక మార్పిడి ఫోల్డర్‌లను పేర్కొనాలి. మీ మొదటి సోర్స్ ఫోల్డర్ మీ మొదటి తాత్కాలిక మార్పిడి ఫోల్డర్‌గా, మీ రెండవ సోర్స్ ఫోల్డర్‌ను మీ రెండవ తాత్కాలిక మార్పిడి ఫోల్డర్‌గా మార్చబడుతుంది. ప్రతి తాత్కాలిక మార్పిడి ఫోల్డర్ మార్గం దాని స్వంత మార్గంలో ఉందని నిర్ధారించుకోండి.","Destination folders":"గమ్యం ఫోల్డర్లు","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"గమ్యం ఫోల్డర్ మార్గాలను పేర్కొనండి. మళ్ళీ, మీరు సోర్స్ ఫోల్డర్‌ల వలె ఎక్కువ గమ్యం ఫోల్డర్‌లను పేర్కొనాలి. మీ మొదటి సోర్స్ ఫోల్డర్ నుండి ఫైళ్ళు మీ మొదటి గమ్యం ఫోల్డర్‌లో, మీ రెండవ గమ్యం ఫోల్డర్‌లోని మీ రెండవ సోర్స్ ఫోల్డర్ ఫైల్‌లలో ముగుస్తాయి.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"మొదటి మూల ఫోల్డర్ ---------> మొదటి తాత్కాలిక మార్పిడి ఫోల్డర్ ---------> మొదటి గమ్యం ఫోల్డర్","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"రెండవ మూల ఫోల్డర్ ---------> రెండవ తాత్కాలిక మార్పిడి ఫోల్డర్ ---------> రెండవ గమ్యం ఫోల్డర్","etc":"etc","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"మీరు గమ్యం ఫోల్డర్‌ను సోర్స్ ఫోల్డర్ మాదిరిగానే లేదా లోపల సెట్ చేస్తే HBBatchBeast సరిగా పనిచేయదు.","Standard preset:":"ప్రామాణిక ప్రీసెట్:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"మీరు మీ ఫైళ్ళను మార్చాలనుకుంటున్న హ్యాండ్‌బ్రేక్ ప్రీసెట్‌ను ఎంచుకోండి. \"ప్రామాణిక ప్రీసెట్\" ఎంచుకోబడితే, ఎంచుకున్న ఫోల్డర్‌లలోని అన్ని ఫైల్‌లు పేర్కొన్న హ్యాండ్‌బ్రేక్ ప్రీసెట్ ఉపయోగించి మార్చబడతాయి. హ్యాండ్‌బ్రేక్ ప్రీసెట్లు గురించి మీరు ఇక్కడ మరింత తెలుసుకోవచ్చు:","Custom preset:":"అనుకూల ప్రీసెట్:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"\"కస్టమ్ ప్రీసెట్\" అయితే, మీరు మీ స్వంత కస్టమ్ ప్రీసెట్‌ను నమోదు చేయాలి. HBBatchBeast హ్యాండ్‌బ్రేక్‌క్లి ఇన్పుట్‌లోని \"హ్యాండ్‌బ్రేక్‌క్లి-ఐ సోర్స్-ఓ గమ్యం\" భాగాన్ని కవర్ చేస్తుంది కాబట్టి మీరు మార్పిడి పారామితులను నమోదు చేయాలి. ఉదాహరణకి:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"FFmpeg ఉపయోగిస్తుంటే, మీరు ఇన్పుట్ మరియు అవుట్పుట్ పారామితులను కామాతో వేరు చేయాలి. వంటివి:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"మీరు అధికారిక హ్యాండ్‌బ్రేక్ GUI అప్లికేషన్ నుండి ఎగుమతి చేయబడిన కస్టమ్ ప్రీసెట్‌కు కూడా లింక్ చేయవచ్చు:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"మీకు కస్టమ్ ప్రీసెట్‌లతో సమస్య ఉంటే, అది హ్యాండ్‌బ్రేక్‌క్లితో తెలిసిన బగ్ వల్ల కావచ్చు (తదుపరి హ్యాండ్‌బ్రేక్‌సిఎల్‌ఐ విడుదలలో పరిష్కరించబడుతుంది). దయచేసి తాత్కాలిక పరిష్కారం కోసం దీనిని చూడండి:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"ప్రతి కస్టమ్ ప్రీసెట్ దాని స్వంత లైన్‌లో ఉండాలి మరియు ఫోల్డర్‌ల మాదిరిగానే, సోర్స్ ఫోల్డర్‌ల వలె చాలా కస్టమ్ ప్రీసెట్లు ఉండాలి.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"మొదటి సోర్స్ ఫోల్డర్ ---------> మొదటి తాత్కాలిక మార్పిడి ఫోల్డర్ ---------> మొదటి గమ్యం ఫోల్డర్ @ కస్టమ్ ప్రీసెట్ 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"రెండవ సోర్స్ ఫోల్డర్ ---------> రెండవ తాత్కాలిక మార్పిడి ఫోల్డర్ ---------> రెండవ గమ్యం ఫోల్డర్ @ కస్టమ్ ప్రీసెట్ 2","See the following image for guidance:":"మార్గదర్శకత్వం కోసం క్రింది చిత్రాన్ని చూడండి:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"గ్రాఫిక్స్ కార్డ్ ఎన్‌కోడింగ్ (NVENC వంటివి) ఉపయోగిస్తుంటే, మీరు VRAM పరిమితుల కారణంగా హ్యాండ్‌బ్రేక్ ఉదంతాల సంఖ్యను తగ్గించాల్సి ఉంటుంది (2 లేదా అంతకంటే తక్కువ ప్రయత్నించండి).","Select standard preset:":"ప్రామాణిక ప్రీసెట్ ఎంచుకోండి:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC కనుగొనబడింది, దయచేసి హ్యాండ్‌బ్రేక్‌క్లి ఉదాహరణల సంఖ్యను 2 లేదా అంతకంటే తక్కువకు తగ్గించాలని నిర్ధారించుకోండి (చాలా గ్రాఫిక్స్ కార్డుల కోసం) లేదా తగినంత VRAM లేకపోవడం వల్ల మీరు లోపాలను ఎదుర్కొంటారు. ఈ సెట్టింగ్ \"సిస్టమ్\" టాబ్‌లో చూడవచ్చు.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"దిగుమతి చేసిన ప్రీసెట్ కనుగొనబడింది.మీరు దిగుమతి చేసుకున్న కస్టమ్ ప్రీసెట్‌లతో ఇబ్బంది పడుతుంటే, అది హ్యాండ్‌బ్రేక్‌క్లితో తెలిసిన బగ్ వల్ల కావచ్చు (తదుపరి హ్యాండ్‌బ్రేక్‌సిఎల్‌ఐ విడుదలలో పరిష్కరించబడుతుంది). .Json ఫైల్ నుండి '\"PictureRotate\": \"0: 0\"' ను తొలగించడం తాత్కాలిక పరిష్కారం. ఇక్కడ మరింత సమాచారం:","Container:":"కంటైనర్:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"మీరు అవుట్పుట్ ఫైల్ '.mp4' వంటి కంటైనర్ను పేర్కొనండి. కంటైనర్ల గురించి మీరు ఇక్కడ మరింత తెలుసుకోవచ్చు:","Enable periodic scanning:":"ఆవర్తన స్కానింగ్‌ను ప్రారంభించండి:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast మీ సోర్స్ ఫోల్డర్‌లను పర్యవేక్షించగలదు మరియు పేర్కొన్న వ్యవధిలో క్రొత్త ఫైల్‌ల కోసం స్కాన్‌లను అమలు చేస్తుంది. విరామం సమయం సెకన్లలో ఉంటుంది, డిఫాల్ట్ 300 సెకన్లు (5 నిమిషాలు). ఈ ఎంపికను ఎంచుకుంటే, మీరు \"స్కాన్ చేసి మార్చండి\" నొక్కినప్పుడు, ప్రోగ్రామ్ ఏదైనా క్రొత్త ఫైళ్ళను మారుస్తుంది మరియు తరువాత కౌంట్డౌన్ టైమర్ ప్రారంభమవుతుంది. ఇది ఆగిపోయే వరకు అనంతంగా లూప్ అవుతుంది. స్కాన్ విరామం అధునాతన సెట్టింగ్‌ల విభాగంలో ఉంది.","Enable daily scanning:":"రోజువారీ స్కానింగ్‌ను ప్రారంభించండి:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"ఆవర్తన స్కానింగ్‌కు బదులుగా, మీరు స్కాన్‌ను రోజుకు ఒకసారి అమలు చేయడానికి ఎంచుకోవచ్చు. '18: 30 'వంటి hh: mm ఆకృతిలో అధునాతన సెట్టింగ్‌ల విభాగంలో స్కాన్ సమయం నమోదు చేయబడింది. \"స్కాన్ మరియు కన్వర్ట్\" ఎంచుకోబడిన తర్వాత, స్కాన్ మరియు మార్పిడి ప్రక్రియను అమలు చేసే వరకు ప్రోగ్రామ్ పేర్కొన్న సమయం వరకు వేచి ఉంటుంది. మళ్ళీ, ఇది ఆగిపోయే వరకు అనంతంగా లూప్ అవుతుంది.","Show/hide advanced:":"అధునాతనంగా చూపించు / దాచండి:","Scan interval (minimum 5 seconds):":"స్కాన్ విరామం (కనిష్టంగా 5 సెకన్లు):","Daily run time (hh:mm):":"రోజువారీ పరుగు సమయం (hh: mm):","Output filename suffix:":"అవుట్పుట్ ఫైల్ పేరు ప్రత్యయం:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"ఇది ఐచ్ఛికం. '_1080p' లేదా '_testconversion' వంటి మీ ఫైల్ పేరు చివర జోడించడానికి మీరు ప్రత్యయం పేర్కొనవచ్చు.","If 'standard preset' is selected then all output files will have the same suffix.":"'ప్రామాణిక ప్రీసెట్' ఎంచుకోబడితే, అన్ని అవుట్పుట్ ఫైళ్ళకు ఒకే ప్రత్యయం ఉంటుంది.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"'కస్టమ్ ప్రీసెట్' ఎంచుకోబడితే, మీరు సోర్స్ ఫోల్డర్ / కస్టమ్ ప్రీసెట్‌కు ఒక ప్రత్యయం పేర్కొనవచ్చు. ప్రతి ప్రత్యయం దాని స్వంత లైన్‌లో ఉందని నిర్ధారించుకోండి. ఉదాహరణకు, మీకు 2 సోర్స్ ఫోల్డర్లు ఉంటే మరియు 'కస్టమ్ ప్రీసెట్' ఉపయోగిస్తుంటే, మీరు దీన్ని ఫైల్ పేరు ప్రత్యయం పెట్టెలో ఉంచవచ్చు:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"మొదటి సోర్స్ ఫోల్డర్‌లోని ఫైల్‌లు అవుట్పుట్ ఫైల్ పేరుకు '_720p' జోడించబడతాయి. రెండవ సోర్స్ ఫోల్డర్‌లోని ఫైల్‌లు అవుట్పుట్ ఫైల్ పేరు మొదలైన వాటికి '_1080p' జోడించబడతాయి.","Include these file containers:":"ఈ ఫైల్ కంటైనర్లను చేర్చండి:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"స్కాన్ చేయడానికి ఫైల్ కంటైనర్లను నమోదు చేయండి. ప్రతి రకాన్ని కామాతో వేరు చేయాలి. డిఫాల్ట్ ఎంట్రీ:","Exclude files smaller than (MB):":"(MB) కంటే చిన్న ఫైల్‌లను మినహాయించండి:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"మార్పిడి నుండి (మెగాబైట్లలో) నిర్దిష్ట పరిమాణం కంటే చిన్న ఫైల్‌లను మినహాయించాలా వద్దా అని పేర్కొనండి","Exclude files larger than (MB):":"(MB) కంటే పెద్ద ఫైల్‌లను మినహాయించండి:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"మార్పిడి నుండి ఒక నిర్దిష్ట పరిమాణం కంటే పెద్ద ఫైల్‌లను మినహాయించాలా వద్దా అని పేర్కొనండి (మెగాబైట్లలో)","Exclude filenames which include any of these words:":"ఈ పదాలలో దేనినైనా కలిగి ఉన్న ఫైల్ పేర్లను మినహాయించండి:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"ఫైళ్ళ కోసం స్కాన్ చేసేటప్పుడు ఫిల్టర్ చేయవలసిన కీలకపదాలను నమోదు చేయండి. ఉదాహరణకు, \"720p\" ఎంటర్ చేస్తే, అప్పుడు టైటిల్‌లో \"720p\" ఉన్న ఏదైనా ఫైల్‌లు మార్చబడవు. మళ్ళీ, కీలకపదాలను కామాతో వేరు చేయాలి. ఉదాహరణకు, ఫిల్టర్ బాక్స్‌లో కింది వాటిని నమోదు చేయండి:","Include files with any ":"ఏదైనా ఫైల్‌లను చేర్చండి"," or all ":"లేదా అన్నీ"," of these":"వీటిలో","properties:":"లక్షణాలు:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"ఫైళ్ళను మార్చడానికి మీరు తప్పనిసరిగా కలిగి ఉన్న వీడియో మరియు ఆడియో లక్షణాలను ఇక్కడ ఇన్పుట్ చేయవచ్చు (FFprobe ఉపయోగించి సేకరించిన సమాచారం). లక్షణాలను కామాతో వేరు చేయాలి. మీరు ఏ లక్షణాలను చేర్చాలనుకుంటున్నారో గుర్తించడంలో సహాయపడటానికి మీడియా సమాచార వీక్షకుల సాధనాన్ని ఉపయోగించండి. చివరి ఆస్తి తర్వాత కామాతో ఉండేలా చూసుకోండి. ఉదాహరణకు, h264 మరియు aac స్టీరియో ఆడియోలను ఉపయోగించి ఎన్కోడ్ చేయబడిన ఫైళ్ళను మాత్రమే మార్చడానికి:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"మార్పిడి ప్రక్రియ ప్రారంభమైన తర్వాత (క్యూ నిర్మించేటప్పుడు సమయాన్ని ఆదా చేయడానికి) ఈ ఆస్తి తనిఖీ చేయబడుతుందని గమనించాలి, కాబట్టి మార్పిడి క్యూలో ఫైళ్లు కనిపించినప్పటికీ, సరైన షరతులు నెరవేరితే అవి దాటవేయబడతాయి / చేర్చబడతాయి.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"FFprobe లక్షణాలను సంగ్రహించగలిగితే, క్యూ వీక్షణలోని \"FFprobe\" కాలమ్‌లో 'OK' కనిపిస్తుంది.","Exclude files with any ":"ఏదైనా ఫైల్‌లను మినహాయించండి"," of these ":"వీటిలో","The opposite of 'Include files with any or all of these properties'":"'ఈ లక్షణాలలో ఏదైనా లేదా అన్నింటితో ఫైల్‌లను చేర్చండి'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"పై ఎంపికలలో మీరు ఏ లక్షణాలను చేర్చాలనుకుంటున్నారో / మినహాయించాలనుకుంటున్నారో గుర్తించడంలో మీకు సహాయపడటానికి ఫైల్ లక్షణాలను విశ్లేషించడానికి ఇది ఒక చిన్న సాధనం. ఇది సమాచారాన్ని తిరిగి ఇవ్వడానికి FFprobe ని ఉపయోగిస్తుంది. ఫైళ్ళను విశ్లేషించడానికి బూడిద పెట్టెలోకి లాగండి. ఉదాహరణకు, పరీక్ష ఫైల్‌లో పడటం కింది వాటిని తిరిగి ఇవ్వవచ్చు:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"మీరు ఇలాంటి ఫైళ్ళను మార్చకుండా మినహాయించాలని చూస్తున్నట్లయితే, మీరు అనేక ఫైల్ లక్షణాలను \"ఏదైనా లేదా అన్ని లక్షణాలతో ఫైళ్ళను మినహాయించు\" బాక్స్‌లో ఉంచవచ్చు మరియు 'ఏదైనా' బదులుగా 'అన్నీ' పక్కన ఉన్న చెక్‌బాక్స్‌ను తనిఖీ చేయవచ్చు, వంటి:","Copy excluded files to destination:":"మినహాయించిన ఫైల్‌లను గమ్యస్థానానికి కాపీ చేయండి:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"మీరు ఈ ఎంపికను ఎంచుకుంటే, మార్పిడి నుండి మినహాయించబడిన ఫైల్‌లు నేరుగా గమ్యం ఫోల్డర్‌కు కాపీ చేయబడతాయి. ఇది క్రింది ఫిల్టర్‌లకు వర్తిస్తుంది:","Exclude filenames which include any of these words":"ఈ పదాలలో దేనినైనా కలిగి ఉన్న ఫైల్ పేర్లను మినహాయించండి","Include files with any or all of these properties":"ఈ లక్షణాలలో ఏదైనా లేదా అన్నింటితో ఫైళ్ళను చేర్చండి","Exclude files with any or all of these properties":"ఈ లక్షణాలలో ఏదైనా లేదా అన్నింటితో ఫైళ్ళను మినహాయించండి","Exclude files smaller than (MB)":"(MB) కంటే చిన్న ఫైల్‌లను మినహాయించండి","Exclude files larger than (MB)":"(MB) కంటే పెద్ద ఫైల్‌లను మినహాయించండి","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"పైన పేర్కొన్న \"చేర్చండి\" ఆస్తి పరిస్థితులకు అనుగుణంగా లేనందున ఇది మినహాయించిన ఫైళ్ళకు కూడా వర్తిస్తుందని గమనించండి, కాబట్టి మీరు కొన్ని ఫైళ్ళను మాత్రమే మార్చడానికి ప్రయత్నిస్తున్నప్పుడు అనుకోకుండా మీ మొత్తం లైబ్రరీని కాపీ చేయవద్దు.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"ఈ క్రింది ఫిల్టర్‌లకు కాపీ ఫీచర్ వర్తించదు (అనగా ఫిల్టర్ కారణంగా ఫైళ్లు మినహాయించబడ్డాయి)","Include these file types":"ఈ ఫైల్ రకాలను చేర్చండి","Delete source files after conversion:":"మార్పిడి తర్వాత మూల ఫైళ్ళను తొలగించండి:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"ఇది ఎంచుకోబడితే, మార్పిడి ప్రయత్నం విజయవంతమైతే, సోర్స్ ఫైల్ తొలగించబడుతుంది. అన్ని ఫైళ్ళను మార్చిన తరువాత, ఈ ప్రక్రియ చాలా చివరిలో జరుగుతుంది. దీని అర్థం మీరు ఒకే సోర్స్ ఫైళ్ళను బహుళ ప్రీసెట్లు ఉపయోగించి మార్చవచ్చు, అన్నీ ఒకేసారి. సోర్స్ ఫైల్స్ తరువాత తొలగించబడతాయి.","Replace original file if converted file is smaller?(Compress attempt)":"మార్చబడిన ఫైల్ చిన్నదిగా ఉంటే అసలు ఫైల్‌ను భర్తీ చేయాలా? (కుదించు ప్రయత్నం)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"క్రొత్త ఫైల్ చిన్నగా ఉంటే HBBatchBeast అసలు సోర్స్ ఫైల్‌ను స్వయంచాలకంగా భర్తీ చేయాలనుకుంటే ఈ చెక్ బాక్స్‌ను ఎంచుకోండి. క్రొత్త ఫైల్ చిన్నది కాకపోతే, అది గమ్యం ఫోల్డర్‌లో ఉంచబడుతుంది.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"మీ గమ్యం ఫోల్డర్ మీ మూల ఫోల్డర్ / లేదా లోపల లేదని నిర్ధారించుకోండి లేదా అది సరిగ్గా పనిచేయదు.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast ఒక నిర్దిష్ట ఫైల్‌ను కుదించడానికి ప్రయత్నించిన తర్వాత, అది ఆ ఫైల్ మార్గాన్ని కాష్‌కు జోడిస్తుంది, తద్వారా భవిష్యత్తులో మళ్లీ ప్రయత్నించబడదు. మీరు పసుపు బటన్లను ఉపయోగించి కాష్‌ను చూడవచ్చు / సవరించవచ్చు / క్లియర్ చేయవచ్చు.","Replace original file always?":"అసలు ఫైల్‌ను ఎల్లప్పుడూ మార్చాలా?","The original file will be replaced regardless of whether the new file is larger or smaller.":"క్రొత్త ఫైల్ పెద్దదా లేదా చిన్నదా అనే దానితో సంబంధం లేకుండా అసలు ఫైల్ భర్తీ చేయబడుతుంది.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"మళ్ళీ, మీ గమ్యం ఫోల్డర్ మీ మూల ఫోల్డర్ / లేదా లోపల లేదని నిర్ధారించుకోండి లేదా అది సరిగ్గా పనిచేయదు.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast ఒక నిర్దిష్ట ఫైల్‌ను ట్రాన్స్‌కోడ్ చేసిన తర్వాత, అది ఆ ఫైల్ మార్గాన్ని కాష్‌కు జోడిస్తుంది, తద్వారా భవిష్యత్తులో మళ్లీ ప్రయత్నించబడదు. మీరు పసుపు బటన్లను ఉపయోగించి కాష్‌ను చూడవచ్చు / సవరించవచ్చు / క్లియర్ చేయవచ్చు.","Copy subtitle (srt) files to destination?":"ఉపశీర్షిక (srt) ఫైళ్ళను గమ్యస్థానానికి కాపీ చేయాలా?","Subtitle '.srt' files will be copied to the destination folder automatically.":"ఉపశీర్షిక '.srt' ఫైల్స్ స్వయంచాలకంగా గమ్యం ఫోల్డర్‌కు కాపీ చేయబడతాయి.","Automatically create temporary/destination folders if they don't exist?":"తాత్కాలిక / గమ్యం ఫోల్డర్‌లు లేకపోతే వాటిని స్వయంచాలకంగా సృష్టించాలా?","Custom bat path to run after each conversion (leave blank if not using):":"ప్రతి మార్పిడి తర్వాత అమలు చేయడానికి అనుకూల బ్యాట్ మార్గం (ఉపయోగించకపోతే ఖాళీగా ఉంచండి):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"ప్రతి మార్పిడి తర్వాత మీరు అమలు చేయాలనుకుంటున్న కస్టమ్ బ్యాచ్ ఫైల్‌కు మార్గాన్ని ఇన్పుట్ చేయండి. ఉదాహరణకి:","Batch files with timeout statements won't work. More info here:":"సమయం ముగిసిన స్టేట్‌మెంట్‌లతో బ్యాచ్ ఫైల్‌లు పనిచేయవు. ఇక్కడ మరింత సమాచారం:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"మీరు ఈ ఎంపికను ఉపయోగించకూడదనుకుంటే బాక్స్ పూర్తిగా ఖాళీగా ఉంచండి (పెట్టెలో దాచిన అక్షరాలు లేవని నిర్ధారించుకోండి)","Run processes at low priority?":"తక్కువ ప్రాధాన్యతతో ప్రక్రియలను అమలు చేయాలా?","All conversion processes will be run at low priority, reducing processor usage.":"అన్ని మార్పిడి ప్రక్రియలు తక్కువ ప్రాధాన్యతతో నడుస్తాయి, ప్రాసెసర్ వినియోగాన్ని తగ్గిస్తాయి.","Remove apostrophes from filenames:":"ఫైల్ పేర్ల నుండి అపోస్ట్రోఫ్లను తొలగించండి:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"ఫైల్ పేర్లలో అపోస్ట్రోఫ్‌లు ఉంటే మార్పిడులు / ఆరోగ్య తనిఖీ స్కాన్లు విఫలం కావచ్చు. ఫైల్ పేర్ల నుండి అపోస్ట్రోఫులను స్వయంచాలకంగా తొలగించడానికి దీన్ని తనిఖీ చేయండి."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"ఈ లక్షణం హ్యాండ్‌బ్రేక్ యొక్క '- స్కాన్' లక్షణాన్ని ఉపయోగించి పాడైన వీడియో ఫైల్‌ల కోసం స్కాన్ చేయగలదు, అయినప్పటికీ ఇది ఎల్లప్పుడూ ఖచ్చితమైనది కాదు. ఇది రెండవ రిఫరెన్స్ పాయింట్‌ను అందించడానికి FFprobe ని కూడా ఉపయోగిస్తుంది. ఎఫ్‌ఎఫ్‌ప్రోబ్ మరియు హ్యాండ్‌బ్రేక్ రెండూ విఫలమైతే, ఫైల్ పాడైపోయే అవకాశం ఉంది.","Move corrupt files into the following folder:":"పాడైన ఫైల్‌లను క్రింది ఫోల్డర్‌లోకి తరలించండి:"," If checked, then any files which give errors will be moved into the specified folder.":"తనిఖీ చేస్తే, లోపాలు ఇచ్చే ఏదైనా ఫైల్‌లు పేర్కొన్న ఫోల్డర్‌లోకి తరలించబడతాయి.","Corrupt file folder:":"పాడైన ఫైల్ ఫోల్డర్:","Run thorough file health check:":"పూర్తి ఫైల్ ఆరోగ్య తనిఖీని అమలు చేయండి:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"తనిఖీ చేస్తే, హ్యాండ్‌బ్రేక్‌కు బదులుగా ఎఫ్‌ఎఫ్‌ఎంపెగ్ ఉపయోగించి చాలా నెమ్మదిగా, మరింత సమగ్రమైన వీడియో హెల్త్ చెక్ అమలు చేయబడుతుంది."," Based on Desani's 'ScanMedia.ps1' found at:":"దేశానీ యొక్క 'ScanMedia.ps1' ఆధారంగా ఇక్కడ కనుగొనబడింది:","Attempt to repair files after thorough check:":"క్షుణ్ణంగా తనిఖీ చేసిన తర్వాత ఫైళ్ళను రిపేర్ చేసే ప్రయత్నం:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"తనిఖీ చేస్తే, HBBatchBeast FFmpeg ఉపయోగించి ఫైళ్ళను రిపేర్ చేయడానికి ప్రయత్నిస్తుంది. సోర్స్ ఫైల్ వలె అదే ఫోల్డర్‌లో '_ రిపేర్డ్' ప్రత్యయంతో క్రొత్త ఫైల్ సృష్టించబడుతుంది.","'CRF' value to use when attempting to repair files:":"ఫైళ్ళను రిపేర్ చేయడానికి ప్రయత్నించినప్పుడు ఉపయోగించాల్సిన 'CRF' విలువ:","The default 'CRF' value is 23. Please see the following for more information:":"డిఫాల్ట్ 'CRF' విలువ 23. మరింత సమాచారం కోసం కింది వాటిని చూడండి:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"CRF స్కేల్ యొక్క పరిధి 0–51, ఇక్కడ 0 లాస్‌లెస్, 23 డిఫాల్ట్, మరియు 51 చెత్త నాణ్యత సాధ్యమే. తక్కువ విలువ సాధారణంగా అధిక నాణ్యతకు దారితీస్తుంది, మరియు ఆత్మాశ్రయంగా సేన్ పరిధి 17–28. 17 లేదా 18 దృశ్యమానంగా నష్టపోకుండా లేదా దాదాపుగా పరిగణించండి; ఇది ఇన్‌పుట్‌తో సమానంగా లేదా దాదాపుగా ఒకేలా ఉండాలి కానీ సాంకేతికంగా నష్టపోదు.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast అవినీతి రహితంగా నివేదించబడిన స్కాన్ చేసిన ఫైల్ మార్గాల జాబితాను సేవ్ చేస్తుంది. అన్ని ఫైల్‌లలో తాజా స్కాన్ చేయడానికి కాష్‌ను క్లియర్ చేయండి.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"ఉపయోగించాల్సిన ఏకకాల హ్యాండ్‌బ్రేక్ / ఎఫ్‌ఎఫ్‌ఎమ్‌పిగ్ ఉదంతాల సంఖ్య? (సిఫార్సు చేయబడిన 4 లేదా అంతకంటే తక్కువ):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"ఈ సెట్టింగ్ \"వీడియో హెల్త్ చెక్\" మరియు \"స్కాన్ అండ్ కన్వర్ట్\" ప్రక్రియలకు వర్తిస్తుంది. ఎన్ని హ్యాండ్‌బ్రేక్ థ్రెడ్‌లు ఉపయోగించాలో పేర్కొనండి. 4 కంటే ఎక్కువ ఉపయోగించకూడదని సిఫార్సు చేసినప్పటికీ గరిష్టంగా లేదు. మీ కంప్యూటర్ చాలా శక్తివంతమైనది కాకపోతే ఎక్కువ మొత్తం స్తంభింపజేయవచ్చు.","Queue size view limit?(Recommended 1000 or fewer):":"క్యూ పరిమాణం వీక్షణ పరిమితి? (సిఫార్సు 1000 లేదా అంతకంటే తక్కువ):","Automatically start \"Scan and convert\" when program opened?:":"ప్రోగ్రామ్ తెరిచినప్పుడు స్వయంచాలకంగా \"స్కాన్ చేసి మార్చండి\"?","Save verbose logs?:":"వెర్బోస్ లాగ్లను సేవ్ చేయాలా?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"వివరణాత్మక ఉప-ప్రాసెస్ లాగ్‌లను సేవ్ చేయడానికి ఈ చెక్‌బాక్స్‌ను తనిఖీ చేయండి. ఇందులో వర్కర్ కన్సోల్ అవుపుట్ ఉంటుంది. ఇది చాలా పెద్ద లాగ్లకు కారణమవుతుంది.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"ఆరోగ్య తనిఖీ లేదా మార్పిడి / ఫోల్డర్ చూసేటప్పుడు లోపం సంభవించినట్లయితే ఇమెయిల్ నోటిఫికేషన్లను స్వీకరించడానికి ఇమెయిల్ వివరాలను పూరించండి. 2FA అవసరమయ్యే ఖాతాలతో పనిచేయదు. మీరు Gmail ఖాతాల్లో తక్కువ సురక్షిత అనువర్తనాలకు ప్రాప్యతను ప్రారంభించాలి.","Email address:":"ఇమెయిల్ చిరునామా:","For example:":"ఉదాహరణకి:","Email password(not saved):":"ఇమెయిల్ పాస్‌వర్డ్ (సేవ్ చేయబడలేదు):","SMTP server:":"SMTP సర్వర్:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"ఈ లక్షణం ఏదైనా వెబ్ బ్రౌజర్‌ను ఉపయోగించి మార్పిడి / ఆరోగ్య తనిఖీ స్థితిని పర్యవేక్షించడానికి అనుమతిస్తుంది. సర్వర్‌లను నడుపుతున్నప్పుడు ఉపయోగపడుతుంది. ఫైల్ పేర్లు పంపబడవు.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"ప్రారంభించబడితే, కింది అనామక డేటా HBBatchBeast.io కు పంపబడుతుంది:","API key":"API కీ","Current status ('Searching', 'Running', 'Finished' etc)":"ప్రస్తుత స్థితి ('శోధించడం', 'రన్నింగ్', 'పూర్తయింది' మొదలైనవి)","Number of:":"సంఖ్య:","Remaining items":"మిగిలిన అంశాలు","Successful items":"విజయవంతమైన అంశాలు","Errored items":"తప్పు చేసిన అంశాలు","Cancelled items":"రద్దు చేసిన అంశాలు","Worker percentages":"కార్మికుల శాతం","Last completed item time":"చివరిగా పూర్తయిన అంశం సమయం","Enable remote monitoring?:":"రిమోట్ పర్యవేక్షణను ప్రారంభించాలా?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"16+ కోర్ ప్రాసెసర్‌లు బహుళ హ్యాండ్‌బ్రేక్ ఉదంతాలను ఉపయోగించి ఎలా పని చేస్తాయో చూడటానికి ప్రధానంగా నిర్మించిన ప్రాథమిక బెంచ్‌మార్కింగ్ యుటిలిటీ ఏ రకమైన ప్రాసెసర్‌నైనా అమలు చేయగలదు.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"ఇది h265 4k నమూనా ఫైల్ (2.5MB) ను డౌన్‌లోడ్ చేస్తుంది మరియు ప్రీసెట్ \"వెరీ ఫాస్ట్ 1080p30\" తో 4 హ్యాండ్‌బ్రేక్ ఉదంతాలను ఉపయోగించి బెంచ్‌మార్క్‌ను అమలు చేస్తుంది.","Results can be uploaded to hbbatchbeast.io if you choose.":"మీరు ఎంచుకుంటే ఫలితాలను hbbatchbeast.io కు అప్‌లోడ్ చేయవచ్చు.","Queue":"క్యూ","Output this session":"ఈ సెషన్‌ను అవుట్పుట్ చేయండి","Media info viewer tool":"మీడియా సమాచారం వీక్షకుల సాధనం","View replaced file cache":"భర్తీ చేయబడిన ఫైల్ కాష్‌ను చూడండి","Clear replaced file cache":"భర్తీ చేసిన ఫైల్ కాష్‌ను క్లియర్ చేయండి","Save config":"ఆకృతీకరణను సేవ్ చేయండి","Scan only":"స్కాన్ మాత్రమే","Scan and convert":"స్కాన్ చేసి మార్చండి","View scan/conversion summary log":"స్కాన్ / మార్పిడి సారాంశం లాగ్‌ను చూడండి","View individual file check/conversion log":"వ్యక్తిగత ఫైల్ చెక్ / మార్పిడి లాగ్ చూడండి","View worker console output":"వర్కర్ కన్సోల్ అవుట్‌పుట్‌ను చూడండి","Health check":"ఆరోగ్య పరీక్ష","Clear healthy file cache":"ఆరోగ్యకరమైన ఫైల్ కాష్‌ను క్లియర్ చేయండి","View error log":"లోపం లాగ్‌ను చూడండి","Email test":"ఇమెయిల్ పరీక్ష","View master log":"మాస్టర్ లాగ్ చూడండి","Wiki help":"వికీ సహాయం","An application by HaveAGitGat":"HaveAGitGat ద్వారా ఒక అప్లికేషన్","New":"న్యూ","Launch":"ప్రారంభం","Benchmark":"బెంచ్మార్క్","See results":"ఫలితాలను చూడండి","Pause queue":"క్యూను పాజ్ చేయండి","Continue queue":"క్యూ కొనసాగించండి","Stop queue":"క్యూ ఆపు","Convert selected files":"ఎంచుకున్న ఫైల్‌లను మార్చండి","Toggle queue view":"క్యూ వీక్షణను టోగుల్ చేయండి","Deselect all":"అన్నీ ఎంపికను తీసివేయండి","Invert all":"అన్నీ విలోమం చేయండి","Select all":"అన్ని ఎంచుకోండి","Toggle output view":"అవుట్పుట్ వీక్షణను టోగుల్ చేయండి"}