{
    "The number of custom presets does not match the number of source folders!": "కస్టమ్ ప్రీసెట్లు సంఖ్య మూలం ఫోల్డర్ల సంఖ్య సరిపోలడం లేదు!",
    "source folders have been detected.": "మూలం ఫోల్డర్లు గుర్తించబడ్డాయి.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "కస్టమ్ ఆరంభ పంక్తులు గుర్తించబడ్డాయి. దయచేసి అదృశ్య లైన్ విరామాలకు డబుల్ తనిఖీ చేయండి. ఒక ఫోల్డర్ మార్గం ఉండాలి లేదా పంక్తికి ముందుగానే అమర్చాలి. మీరు అనుకోకుండా ఖాళీ పంక్తిని సృష్టించలేదని నిర్ధారించుకోండి.",
    "The number of filename suffixes does not match the number of source folders! ": "ఫైల్పేరు ప్రత్యయల సంఖ్య సోర్స్ ఫోల్డర్ల సంఖ్యతో సరిపోలలేదు!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "ఫైల్పేరు ప్రత్యయం రేఖలు గుర్తించబడ్డాయి. దయచేసి అదృశ్య లైన్ విరామాలకు డబుల్ తనిఖీ చేయండి. పంక్తికి ఒక ఫోల్డర్ మార్గం లేదా ఫైల్ నేమ్ ప్రత్యయం ఉండాలి. మీరు అనుకోకుండా ఖాళీ పంక్తిని సృష్టించలేదని నిర్ధారించుకోండి.",
    "The number of source folders does not match the number of destination folders!": "మూలం ఫోల్డర్ల సంఖ్య గమ్య ఫోల్డర్ల సంఖ్యతో సరిపోలలేదు!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "గమ్యం ఫోల్డర్లు గుర్తించబడ్డాయి. దయచేసి అదృశ్య లైన్ విరామాలకు డబుల్ తనిఖీ చేయండి. పంక్తికి ఒక ఫోల్డర్ మార్గం ఉండాలి. మీరు అనుకోకుండా ఖాళీ పంక్తిని సృష్టించలేదని నిర్ధారించుకోండి.",
    "The number of source folders does not match the number of temporary conversion folders!": "మూలం ఫోల్డర్ల సంఖ్య తాత్కాలిక మార్పిడి ఫోల్డర్ల సంఖ్యతో సరిపోలలేదు!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "తాత్కాలిక మార్పిడి ఫోల్డర్లు గుర్తించబడ్డాయి. దయచేసి అదృశ్య లైన్ విరామాలకు డబుల్ తనిఖీ చేయండి. పంక్తికి ఒక ఫోల్డర్ మార్గం ఉండాలి. మీరు అనుకోకుండా ఖాళీ పంక్తిని సృష్టించలేదని నిర్ధారించుకోండి.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "దయచేసి '.mp4' వంటి చెల్లుబాటు అయ్యే కంటైనర్ను నమోదు చేయండి. '.'",
    "Corrupt file folder": "ఫైల్ ఫోల్డర్ను అరికట్టండి",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "ఉనికిలో లేదు! దయచేసి మార్గానికి ముందు / ముందు ఖాళీలు లేదా రహస్య అక్షరాలు లేవని నిర్ధారించుకోండి",
    "Source folder": "మూలం ఫోల్డర్",
    "Temporary conversion folder": "తాత్కాలిక మార్పిడి ఫోల్డర్",
    "appears to be the same as or is within source folder": "మూలం ఫోల్డర్లో ఉన్నట్లుగా ఉంటుంది",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "సరిగ్గా పనిచేయకుండా HBBatchBeast ను నిరోధిస్తుంది. మూలం ఫోల్డర్ వెలుపల ఫోల్డర్కు తాత్కాలిక మార్పిడి ఫోల్డర్ను మార్చండి. మీరు 'అసలైన ఫైల్స్ ఫీచర్ ను భర్తీ చేయాలని' కోరుకుంటే, దయచేసి గమ్య ఫోల్డర్ను మూలం ఫోల్డర్లోనే కాకుండా లోపల ఉన్న ఫోర్ట్ ఫోల్డర్ ను ఎంచుకుని, ఆపై అధునాతన సెట్టింగుల విభాగంలో 'ఎల్లప్పుడూ అసలు ఫైల్లను భర్తీ చేయండి' తనిఖీ చేయండి . తాత్కాలిక 'తాత్కాలిక మార్పిడి ఫోల్డర్' తనిఖీ పెట్టె ఎంపికను తీసివేయండి, ఎందుకంటే ఈ సందర్భంలో ఉపయోగం లేదు. ఫైల్లు గమ్యం ఫోల్డర్ లోకి మార్చబడతాయి మరియు మూలం ఫోల్డర్కు తిరిగి వెళ్తాయి.",
    "Destination folder": "గమ్యం ఫోల్డర్",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "సరిగ్గా పనిచేయకుండా HBBatchBeast ను నిరోధిస్తుంది. దయచేసి మూలం ఫోల్డర్ వెలుపల ఫోల్డర్కు గమ్య ఫోల్డర్ను మార్చండి. మీరు 'అసలైన ఫైల్స్ ఫీచర్ ను భర్తీ చేయాలని' కోరుకుంటే, దయచేసి గమ్య ఫోల్డర్ను మూలం ఫోల్డర్లోనే కాకుండా లోపల ఉన్న ఫోర్ట్ ఫోల్డర్ ను ఎంచుకుని, ఆపై అధునాతన సెట్టింగుల విభాగంలో 'ఎల్లప్పుడూ అసలు ఫైల్లను భర్తీ చేయండి' తనిఖీ చేయండి . తాత్కాలిక 'తాత్కాలిక మార్పిడి ఫోల్డర్' తనిఖీ పెట్టె ఎంపికను తీసివేయండి, ఎందుకంటే ఈ సందర్భంలో ఉపయోగం లేదు. ఫైల్లు గమ్యం ఫోల్డర్ లోకి మార్చబడతాయి మరియు మూలం ఫోల్డర్కు తిరిగి వెళ్తాయి.",
    "Error creating temporary conversion folder": "తాత్కాలిక మార్పిడి ఫోల్డర్ను సృష్టించడంలో లోపం",
    "Error creating destination folder": "గమ్యం ఫోల్డర్ను సృష్టించడంలో లోపం",
    "Please select to use HandBrake or FFmpeg!": "హ్యాండ్బ్రేక్ లేదా FFmpeg ఉపయోగించడానికి దయచేసి ఎంచుకోండి!",
    "Please select a standard preset or input a custom one!": "దయచేసి ఒక ప్రామాణిక ఆరంభమును ఎంచుకోండి లేదా ఒకదానిని ఇన్పుట్ చేయండి!",
    "Please select a scan interval of 5 seconds or greater!": "దయచేసి 5 సెకన్లు లేదా అంతకంటే ఎక్కువ స్కాన్ విరామంని ఎంచుకోండి!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "ఒకేసారి హ్యాండ్బ్రేక్ / FFmpeg సందర్భాల్లో ఉపయోగించడానికి ఒకటి లేదా అంతకంటే ఎక్కువ అని నిర్ధారించుకోండి!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "చెల్లని API కీ! దయచేసి క్రొత్త కీని రూపొందించడానికి రిమోట్ పర్యవేక్షణ ట్యాబ్లో 'క్రొత్తది' క్లిక్ చేయండి.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "దయచేసి 24 గంటల ఆకృతిలో రోజువారీ స్కాన్ సమయం ఇవ్వండి: hh: mm (ఉదాహరణకు 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "కన్వర్షన్ తర్వాత SOURCE ఫైల్లు తొలగించబడతాయి! సరైన ఉపయోగం ముందు దయచేసి పరీక్షించండి!",
    "Benchmark failed!": "బెంచ్మార్క్ విఫలమైంది!",
    "Log does not exist!": "లాగ్ ఉనికిలో లేదు!",
    "Folder does not exist!": "ఫోల్డర్ ఉనికిలో లేదు!",
    "Error sending email! Please check your settings.": "ఇమెయిల్ పంపడంలో లోపం! దయచేసి మీ సెట్టింగులను తనిఖీ చేయండి.",
    "Test email sent!": "టెస్ట్ ఇమెయిల్ పంపబడింది!",
    "All worker processes have been stopped.": "అన్ని కార్మికుల ప్రక్రియలు నిలిపివేయబడ్డాయి.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "ప్రస్తుత అంశాలను ప్రాసెస్ చేయడం పూర్తయిన తర్వాత క్యూ ఆగిపోతుంది. మీరు క్యూ ని పాజ్ చేయాలనుకుంటున్నారా?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "క్యూ విరామం ప్రారంభమైంది. అన్ని కార్మికులు పాజ్ చేసిన తర్వాత 'కాంటినెయిన్' బటన్ కనిపిస్తుంది.",
    "Healthy file cache cleared!": "ఆరోగ్యకరమైన ఫైల్ క్యాష్ క్లియర్ చేయబడింది!",
    "Cache cleared!": "కాష్ క్లియర్ చేయబడింది!",
    "Cancel item": "అంశాన్ని రద్దు చేయండి",
    "Please check the above checkbox to use this feature.": "దయచేసి ఈ లక్షణాన్ని ఉపయోగించడానికి ఎగువ తనిఖీ పెట్టెను తనిఖీ చేయండి.",
    "Configuration": "ఆకృతీకరణ",
    "Source folders": "మూల ఫోల్డర్లు",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "ఇది మీడియాకు స్కాన్ చేయబడే మూలం ఫోల్డర్. ఫోల్డర్ స్లాష్ లేకుండా ఫోల్డర్ను నమోదు చేయాలి. ఉదాహరణకి:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "సోర్స్ ఫోల్డర్ పాత్ బాక్స్ విస్తరించదగినది (ఒక కొత్త లైన్ సృష్టించడానికి ఎంటర్ ప్రెస్). మీరు బహుళ సోర్స్ ఫోల్డర్లను పేర్కొనదలిస్తే, ప్రతి సోర్స్ ఫోల్డర్ పాత్ దాని సొంత లైన్లో ఉన్నట్లు నిర్ధారించుకోండి:",
    "Video health check": "వీడియో ఆరోగ్య తనిఖీ",
    "Batch conversion and Folder watching": "బ్యాచ్ మార్పిడి మరియు ఫోల్డర్ చూడటం",
    "Remote Monitoring (Beta)": "రిమోట్ పర్యవేక్షణ (బీటా)",
    "Benchmark (Beta)": "బెంచ్మార్క్ (బీటా)",
    "System": "వ్యవస్థ",
    "Help": "సహాయం",
    "Temporary conversion folders": "తాత్కాలిక మార్పిడి ఫోల్డర్లు",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "\"తాత్కాలిక మార్పిడి ఫోల్డర్?\" తనిఖీ చేయబడుతుంది, అప్పుడు హ్యాండ్బ్రేక్ ఫైళ్ళను ఫోల్డర్లోకి మారుస్తుంది. మార్పిడి ముగిసిన తర్వాత, ఫైల్ మీ \"గమ్యం ఫోల్డర్\" లోకి తరలించబడుతుంది. మూల ఫోల్డర్ల వలె మీరు అనేక తాత్కాలిక మార్పిడి ఫోల్డర్లను పేర్కొనాలి. మీ మొదటి మూలం ఫోల్డర్ మీ మొదటి తాత్కాలిక మార్పిడి ఫోల్డర్, మీ రెండవ తాత్కాలిక మార్పిడి ఫోల్డర్ లోకి మీ రెండవ మూలం ఫోల్డర్గా మార్చబడుతుంది. ప్రతి తాత్కాలిక మార్పిడి ఫోల్డర్ పథం దాని స్వంత మార్గంలో ఉందని నిర్ధారించుకోండి.",
    "Destination folders": "గమ్య ఫోల్డర్లు",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "గమ్యస్థాన ఫోల్డర్ మార్గాలను పేర్కొనండి. మళ్ళీ, మీరు మూల ఫోల్డర్ల వలె అనేక గమ్యస్థాన ఫోల్డర్లను పేర్కొనాలి. మీ మొదటి ఫోర్ట్ ఫోల్డర్లోని ఫైల్లు మీ మొదటి గమ్యస్థాన ఫోల్డర్లో, మీ రెండవ ఫోర్ట్ ఫోల్డర్లోని మీ రెండవ మూలం ఫోల్డర్ ఫైల్లో ముగుస్తాయి.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "మొదటి మూలం ఫోల్డర్ ---------> మొదటి తాత్కాలిక మార్పిడి ఫోల్డర్ ---------> ఫస్ట్ గమ్యం ఫోల్డర్",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "రెండవ మూలం ఫోల్డర్ ---------> రెండవ తాత్కాలిక మార్పిడి ఫోల్డర్ ---------> రెండవ గమ్యస్థాన ఫోల్డర్",
    "etc": "etc",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "HBBatchBeast సరిగ్గా పనిచేయదు మీరు గమ్యం ఫోల్డర్ను అదే విధంగా, లేదా లోపల, మూలం ఫోల్డర్లో సెట్ చేస్తే.",
    "Standard preset:": "ప్రామాణిక ఆరంభము:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "మీరు మీ ఫైళ్ళను మార్చాలనుకుంటున్న హ్యాండ్బ్రేక్ ప్రీసెట్ను ఎంచుకోండి. \"స్టాండర్డ్ ప్రీసెట్\" ఎంపిక చేయబడినట్లయితే, ఎంచుకున్న ఫోల్డర్లలోని అన్ని ఫైల్లు పేర్కొన్న హ్యాండ్బ్రేక్ ప్రీసెట్ ఉపయోగించి మార్చబడతాయి. మీరు ఇక్కడ హ్యాండ్బ్రేక్ ప్రీసెట్లు గురించి మరింత తెలుసుకోవచ్చు:",
    "Custom preset:": "కస్టమ్ ముందుగానే అమర్చిన:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "\"కస్టమ్ ప్రీసెట్\" అప్పుడు మీరు మీ స్వంత కస్టమ్ ఆరంభంలో నమోదు చేయాలి. HBBatchBeast హ్యాండ్బ్రేక్ CLI ఇన్పుట్ యొక్క \"HandBrakeCLI -i source -o గమ్యం\" భాగంను వర్తిస్తుంది, కాబట్టి మీరు మార్పిడి పారామితులను నమోదు చేయాలి. ఉదాహరణకి:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "FFmpeg ను వాడుతున్నట్లయితే, మీరు కామాతో ఇన్పుట్ మరియు అవుట్పుట్ పారామితులను వేరు చేయాలి. ఇలాంటివి:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "మీరు అధికారిక హ్యాండ్బ్రేక్ GUI దరఖాస్తు నుండి ఎగుమతి చేయబడిన కస్టమ్ ప్రీసెట్కు కూడా లింక్ చేయవచ్చు:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "మీరు కస్టమ్ ప్రీసెట్లు తో సమస్య ఉంటే, అది హ్యాండ్బ్యాక్ CLI తో తెలిసిన బగ్ వలన కావచ్చు (తరువాతి HandBrakeCLI విడుదలలో పరిష్కరించబడుతుంది). దయచేసి ఇది తాత్కాలిక పరిష్కారం కోసం చూడండి:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "ప్రతి అనుకూల ఆరంభ దాని సొంత లైన్ లో ఉండాలి మరియు, ఫోల్డర్లను పోలి, మూల ఫోల్డర్ల వంటి అనేక కస్టమ్ ప్రీసెట్లు ఉండాలి.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "మొదటి మూలం ఫోల్డర్ ---------> మొదటి తాత్కాలిక మార్పిడి ఫోల్డర్ ---------> ఫస్ట్ గమ్యం ఫోల్డర్ @ కంటి ముందు 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "రెండవ మూలం ఫోల్డర్ ---------> రెండవ తాత్కాలిక మార్పిడి ఫోల్డర్ ---------> రెండవ గమ్యం ఫోల్డర్ @ కస్టమ్ ఆరంభ 2",
    "See the following image for guidance:": "మార్గదర్శకానికి క్రింది చిత్రం చూడండి:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "గ్రాఫిక్స్ కార్డు ఎన్కోడింగ్ (NVENC వంటివి) వుపయోగిస్తే, మీరు VRAM పరిమితుల కారణంగా హ్యాండ్బ్రేక్ సందర్భాల్లో (2 లేదా తక్కువ ప్రయత్నించండి) సంఖ్యను తగ్గించవచ్చు.",
    "Select standard preset:": "ప్రామాణిక ఆరంభ ఎంపికను ఎంచుకోండి:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "NVENC గుర్తించబడింది, దయచేసి హ్యాండ్బ్యాక్ CLI సందర్భాల్లో 2 లేదా అంతకంటే తక్కువ (చాలా గ్రాఫిక్స్ కార్డుల కోసం) తగ్గించవచ్చో లేదో లేదా మీరు తగినంత VRAM కారణంగా లోపాలను ఎదుర్కోవచ్చు. \"సెట్టింగ్\" ట్యాబ్లో ఈ సెట్టింగ్ కనుగొనవచ్చు.",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "దిగుమతి చేయబడిన ప్రీసెట్ కనుగొనబడింది.మీరు దిగుమతి చేసుకున్న కస్టమ్ ప్రీసెట్లుతో ఇబ్బంది పడుతుంటే, ఇది హ్యాండ్బ్యాక్ CLI తో తెలిసిన బగ్ వలన కావచ్చు (తదుపరి హ్యాండ్బ్యాక్ CLI విడుదలలో పరిష్కరించబడుతుంది). \"తాత్కాలిక పరిష్కారం\" \"పిక్చర్రోటేట్\" ను తొలగించడం: \". 0: 0\" '.json ఫైల్ నుండి. ఇక్కడ మరింత సమాచారం:",
    "Container:": "కంటైనర్:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "మీరు '.mp4' వంటి అవుట్పుట్ ఫైల్ను కావాలనుకునే కంటైనర్ను పేర్కొనండి. మీరు కంటైనర్ల గురించి మరింత తెలుసుకోవచ్చు:",
    "Enable periodic scanning:": "ఆవర్తన స్కానింగ్ని ప్రారంభించు:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "HBBatchBeast మీ సోర్స్ ఫోల్డర్లను పర్యవేక్షించగలదు మరియు పేర్కొన్న విరామంలో కొత్త ఫైళ్ళ కోసం స్కాన్లను అమలు చేయవచ్చు. విరామం సమయం డిఫాల్ట్ 300 సెకన్లు (5 నిమిషాలు) సెకన్లలో ఉంది. ఈ ఐచ్చికాన్ని ఎంచుకున్నట్లయితే, మీరు \"స్కాన్ మరియు కన్వర్ట్\" నొక్కితే, ప్రోగ్రామ్ ఏ కొత్త ఫైళ్ళను మారుస్తుంది మరియు తర్వాత కౌంట్డౌన్ టైమర్ ప్రారంభం అవుతుంది. ఇది అకస్మాత్తుగా ఆపివేసే వరకు లూప్ అవుతుంది. స్కాన్ విరామం అధునాతన సెట్టింగ్ల విభాగంలో ఉంది.",
    "Enable daily scanning:": "రోజువారీ స్కానింగ్ను ప్రారంభించు:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "ఆవర్తన స్కానింగ్కు బదులుగా, మీరు ఒక స్కాన్ రోజుకు ఒకసారి అమలు చేయడానికి ఎంచుకోవచ్చు. స్కాన్ సమయం hh: mm ఫార్మాట్ '18: 30 'వంటి అధునాతన సెట్టింగ్ల విభాగంలో నమోదు చేయబడింది. \"స్కాన్ మరియు కన్వర్ట్\" ఎంపిక చేసిన తర్వాత, ప్రోగ్రామ్ స్కాన్ మరియు మార్పిడి ప్రక్రియ అమలు చేయడానికి నిర్దిష్ట సమయం వరకు వేచి ఉంటుంది. మళ్ళీ, ఇది అకస్మాత్తుగా లూప్ అయ్యేంత వరకు నిలిపివేయబడుతుంది.",
    "Show/hide advanced:": "ఆధునిక చూపు / దాచు:",
    "Scan interval (minimum 5 seconds):": "స్కాన్ విరామం (కనీసం 5 సెకన్లు):",
    "Daily run time (hh:mm):": "రోజువారీ పరుగు సమయం (hh: mm):",
    "Output filename suffix:": "అవుట్పుట్ ఫైల్ పేరు ప్రత్యయం:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "ఇది ఐచ్ఛికం. మీరు '_1080p' లేదా '_testconversion' వంటి మీ ఫైల్ పేరు ముగింపుకు జోడించడానికి అంత్యప్రత్యయాన్ని పేర్కొనవచ్చు.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "'ప్రామాణిక ఆరంభ' ఎంచుకున్నట్లయితే అప్పుడు అన్ని అవుట్పుట్ ఫైల్స్ ఒకే అంశంపై ఉంటాయి.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "'కస్టమ్ ప్రీసెట్' ఎంచుకున్నట్లయితే అప్పుడు మీరు సోర్స్ ఫోల్డర్ / కస్టమ్ ప్రీసెట్కు ఒక ప్రత్యయంను పేర్కొనవచ్చు. ప్రతి ప్రత్యయం దాని సొంత లైన్ లో ఉంది నిర్ధారించుకోండి. ఉదాహరణకు, మీరు 2 సోర్స్ ఫోల్డర్లను కలిగి ఉంటే మరియు 'కస్టమ్ ప్రీసెట్' ను ఉపయోగిస్తుంటే, మీరు దీన్ని ఫైల్పేరు ప్రత్యయం పెట్టెలో పెట్టవచ్చు:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "మొదటి మూల ఫోల్డర్లోని ఫైల్స్ '_720p' ను ఫైల్ అవుట్పుట్కు జోడించాయి. రెండవ సోర్స్ ఫోల్డర్ లోని ఫైల్స్ '_1080p' అవుట్పుట్ ఫేనామెమ్ మొదలైనవికి జోడించబడతాయి.",
    "Include these file types:": "ఈ ఫైల్ రకాలను చేర్చండి:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "స్కాన్ చేయడానికి ఫైల్ రకాలను నమోదు చేయండి. ప్రతి రకం కామాతో వేరు చేయబడాలి. డిఫాల్ట్ ఎంట్రీ:",
    "Exclude files smaller than (MB):": "(MB) కంటే తక్కువ ఫైళ్ళను మినహాయించండి:",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "మార్పిడి నుండి కొంత పరిమాణాన్ని (మెగాబైట్లలో) చిన్నదిగా మినహాయించాలో లేదో పేర్కొనండి",
    "Exclude files larger than (MB):": "MB (MB) కంటే పెద్దదిగా మినహాయించండి:",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "మార్పిడి నుండి కొంత పరిమాణం కంటే పెద్ద ఫైళ్ళను మినహాయించాలా లేదో పేర్కొనండి (మెగాబైట్లలో)",
    "Exclude filenames which include any of these words:": "ఈ పదాలను కలిగి ఉన్న ఫైల్పేలను మినహాయించండి:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "ఫైళ్ళ కోసం స్కానింగ్ చేసేటప్పుడు ఫిల్టర్ చేయడానికి కీపదాలను నమోదు చేయండి. ఉదాహరణకు, \"720p\" ఎంటర్ చేసినట్లయితే, శీర్షికలో \"720p\" తో ఉన్న ఏదైనా ఫైల్లు మార్చబడవు. మళ్ళీ, కీలకపదాలు కామాతో వేరు చేయబడాలి. ఉదాహరణకు, వడపోత పెట్టెలో ఈ క్రిందివాటిని నమోదు చేయండి:",
    "Include files with any ": "ఏదైనా ఫైల్లను చేర్చండి",
    " or all ": "లేదా అన్ని",
    " of these": "వీటిలో",
    "properties:": "లక్షణాలు:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "ఇక్కడ మీరు ఇన్పుట్ చేయగలిగే వీడియో మరియు ఆడియో లక్షణాలను మీరు మార్చవచ్చు (FFprobe ఉపయోగించి సేకరించిన సమాచారం). లక్షణాలు కామాతో వేరుచేయబడాలి. మీరు చేర్చాలనుకునే లక్షణాలను గుర్తించడంలో సహాయపడటానికి మీడియా సమాచార దర్శని సాధనాన్ని ఉపయోగించండి. చివరి ఆస్తి తర్వాత కామాతో ఉంచాలని నిర్ధారించుకోండి. ఉదాహరణకు, h264 మరియు aac స్టీరియో ఆడియోలను ఉపయోగించి ఎన్కోడ్ చేయబడిన ఫైల్లను మాత్రమే మార్చేందుకు:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "మార్పిడి ప్రాసెస్ మొదలవుతుంది (క్యూ నిర్మాణ సమయంలో సమయం ఆదాచేయడానికి) ఒకసారి ఈ ఆస్తి చెక్ చేయబడుతుంది, అందువలన ఫైల్స్ మార్పిడి క్రమంలో కనిపిస్తాయి, అయితే వాటిని సరైన పరిస్థితులు కలుసుకున్నట్లయితే వాటిని తొలగించబడతాయి.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "FFprobe లక్షణాలను సంగ్రహించగలిగితే, అప్పుడు 'OK' అనేది క్యూ వీక్షణలో \"FFprobe\" కాలమ్లో కనిపిస్తుంది.",
    "Exclude files with any ": "ఏదైనా ఫైల్లను మినహాయించండి",
    " of these ": "వీటిలో",
    "The opposite of 'Include files with any or all of these properties'": "వ్యతిరేక 'ఈ లక్షణాలు ఏ లేదా అన్ని ఫైళ్లను చేర్చండి'",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "పైన తెలిపిన ఐచ్చికాలలో మినహాయించి / మినహాయించాలనుకునే లక్షణాలను గుర్తించడంలో మీకు సహాయపడటానికి ఇది ఫైల్ లక్షణాలను విశ్లేషించడానికి ఇది ఒక చిన్న సాధనం. ఇది సమాచారం అందించడానికి FFprobe ను ఉపయోగిస్తుంది. వాటిని విశ్లేషించడానికి బూడిద పెట్టెలో ఫైళ్లను డ్రాగ్ చేసి డ్రాప్ చెయ్యండి. ఉదాహరణకు, ఒక పరీక్ష ఫైల్ లో పడిపోవటం కింది విధంగా ఉండవచ్చు:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "మీరు ఇలా మార్చినట్లుగా ఫైళ్లను మినహాయించాలని చూస్తున్నట్లయితే, మీరు \"ఈ లక్షణాల యొక్క ఏదైనా లేదా మొత్తం ఫైళ్ళతో మినహాయించు\" బాక్స్లో అనేక ఫైల్ లక్షణాలను ఉంచవచ్చు మరియు 'ఏ' బదులుగా 'అన్నీ' ప్రక్కన ఉన్న చెక్బాక్స్ను తనిఖీ చేయవచ్చు, వంటి:",
    "Copy excluded files to destination:": "మినహాయించిన ఫైళ్ళను గమ్యస్థానానికి కాపీ చేయండి:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "మీరు ఈ ఎంపికను ఎంచుకుంటే, మార్పిడి నుండి మినహాయించిన ఫైల్లు ప్రత్యక్షంగా ఫోల్డర్కు కాపీ చేయబడతాయి. ఇది క్రింది ఫిల్టర్లకు వర్తిస్తుంది:",
    "Exclude filenames which include any of these words": "ఈ పదాలు ఏవైనా ఉన్న ఫైల్పేలను మినహాయించండి",
    "Include files with any or all of these properties": "ఈ లక్షణాలలో ఏవైనా లేదా అన్నింటితో ఫైళ్లను చేర్చండి",
    "Exclude files with any or all of these properties": "ఈ లక్షణాలలో ఏదైనా లేదా అన్నింటితో ఫైళ్లను మినహాయించండి",
    "Exclude files smaller than (MB)": "ఫైళ్లను (MB) కంటే తక్కువగా మినహాయించండి",
    "Exclude files larger than (MB)": "(MB) కంటే పెద్ద ఫైళ్ళను మినహాయించండి",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "ఇది పైన పేర్కొన్న ఆస్తి పరిస్థితుల్లో \"చేర్చండి\" అనుగుణంగా లేనందున ఇది మినహాయించబడిన ఫైళ్ళకు కూడా వర్తిస్తుంది, కాబట్టి మీరు కొన్ని ఫైళ్ళను మాత్రమే మార్చాలని ప్రయత్నిస్తున్నప్పుడు అనుకోకుండా మొత్తం లైబ్రరీని కాపీ చేసుకోకండి.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "కాపీ లక్షణం కింది ఫిల్టర్లకు వర్తించదు (అంటే వడపోత కారణంగా మినహాయించబడిన ఫైల్లు)",
    "Include these file types": "ఈ ఫైల్ రకాలను చేర్చండి",
    "Delete source files after conversion:": "మార్పిడి తర్వాత మూల ఫైళ్లను తొలగించండి:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "ఇది ఎంపిక చేయబడితే, మార్పిడి ప్రయత్నం విజయవంతమైతే, మూలం ఫైల్ తొలగించబడుతుంది. ఈ ప్రక్రియ అన్ని ఫైళ్ళను మార్చిన తరువాత చాలా చివరికి జరుగుతుంది. దీని అర్థం, మీరు బహుళ ప్రీసెట్లు ఉపయోగించి ఒకే మూలాన్ని ఫైళ్లను మార్చవచ్చు, అన్నింటికీ ఒక్కటే. మూలం ఫైళ్లు తర్వాత తొలగించబడతాయి.",
    "Replace original file if converted file is smaller?(Compress attempt)": "మార్చిన ఫైల్ చిన్నగా ఉంటే అసలు ఫైల్ భర్తీ చేయాలా? (కంప్రెస్ ప్రయత్నం)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "క్రొత్త ఫైల్ చిన్నదిగా ఉంటే అసలు మూలం ఫైల్ను HBBatchBeast స్వయంచాలకంగా భర్తీ చేయాలనుకుంటే ఈ చెక్ బాక్స్ను ఎంచుకోండి. క్రొత్త ఫైల్ చిన్నది కాకపోతే, అది గమ్య ఫోల్డర్లో మిగిలిపోతుంది.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "మీ గమ్య ఫోల్డర్ మీ మూలం ఫోల్డర్లోనే కాదు లేదా సరిగ్గా పనిచేయదు అని నిర్ధారించుకోండి.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "ఒకసారి HBBatchBeast ఒక నిర్దిష్ట ఫైల్ను కుదించడానికి ప్రయత్నించింది, అది ఆ కాష్కి ఫైల్ పాత్ను జోడిస్తుంది, తద్వారా ఇది భవిష్యత్తులో మళ్లీ ప్రయత్నించబడదు. మీరు పసుపు బటన్లను ఉపయోగించి / కాష్ను క్లియర్ / కాష్ క్లియర్ చేయవచ్చు.",
    "Replace original file always?": "అసలు ఫైల్ను ఎల్లప్పుడూ భర్తీ చేయాలా?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "క్రొత్త ఫైల్ పెద్దది లేదా చిన్నది కాదా అనేదానితో అసలు ఫైల్ భర్తీ చేయబడుతుంది.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "మళ్ళీ, మీ గమ్య ఫోల్డర్ మీ మూలం ఫోల్డర్లోనే కాదు లేదా సరిగ్గా పనిచేయదు అని నిర్ధారించుకోండి.",
    "Copy subtitle (srt) files to destination?": "గమ్యస్థానానికి ఉపశీర్షిక (srt) ఫైళ్ళను కాపీ చేయాలా?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "ఉపశీర్షిక '.rtt' ఫైళ్లు స్వయంచాలకంగా గమ్యం ఫోల్డర్కు కాపీ చేయబడతాయి.",
    "Automatically create temporary/destination folders if they don't exist?": "తాత్కాలిక / గమ్యం ఫోల్డర్లను స్వయంచాలకంగా సృష్టించలేదా?",
    "Custom bat path to run after each conversion (leave blank if not using):": "ప్రతి మార్పిడి తర్వాత అమలు చేయడానికి అనుకూల బ్యాట్ మార్గం (ఉపయోగించకుండా ఖాళీగా వదలండి):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "మీరు ప్రతి మార్పిడి తర్వాత అమలు చేయాలనుకునే అనుకూల బ్యాచ్ ఫైల్కు మార్గం ఇవ్వండి. ఉదాహరణకి:",
    "Batch files with timeout statements won't work. More info here:": "సమయం ముగిసిన స్టేట్మెంట్లతో బ్యాచ్ ఫైళ్లు పనిచేయవు. ఇక్కడ మరింత సమాచారం:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "మీరు ఈ ఐచ్ఛికాన్ని ఉపయోగించకూడదనుకుంటే, పెట్టె పూర్తిగా ఖాళీగా వదిలేయండి (పెట్టెలో దాచిన అక్షరాలు లేవు అని నిర్ధారించుకోండి)",
    "Run processes at low priority?": "తక్కువ ప్రాధాన్యతతో ప్రాసెస్లను అమలు చేయాలా?",
    "All conversion processes will be run at low priority, reducing processor usage.": "అన్ని మార్పిడి ప్రక్రియలు ప్రాసెసర్ వినియోగాన్ని తగ్గించడం ద్వారా తక్కువ ప్రాధాన్యతతో అమలు చేయబడతాయి.",
    "Remove apostrophes from filenames:": "ఫైల్ పేజెస్ నుండి అపాస్ట్రప్రోలు తొలగించు:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "ఫైల్ పేర్లలో అపాస్ట్రప్రోలు ఉన్నట్లయితే సంభాషణలు / ఆరోగ్య తనిఖీ స్కాన్లు విఫలమౌతాయి.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "హ్యాండ్బ్రేక్ యొక్క'Scan 'లక్షణాన్ని ఉపయోగించి అవినీతి వీడియో ఫైళ్ళ కోసం ఈ ఫీచర్ స్కాన్ చేయవచ్చు, అయితే ఇది ఎల్లప్పుడూ ఖచ్చితమైనది కాదు. రెండవ సూచనను అందించడానికి ఇది FFprobe ను కూడా ఉపయోగిస్తుంది. FFprobe మరియు హ్యాండ్బ్రేక్ రెండూ విఫలమైతే, ఫైల్ చాలా అవినీతికి గురవుతుంది.",
    "Move corrupt files into the following folder:": "అవినీతి ఫైళ్లను క్రింది ఫోల్డర్లోకి తరలించండి:",
    " If checked, then any files which give errors will be moved into the specified folder.": "పరిశీలించినట్లయితే, లోపాలను ఇచ్చే ఏదైనా ఫైల్లు పేర్కొన్న ఫోల్డర్లోకి తరలించబడతాయి.",
    "Corrupt file folder:": "ఫైల్ ఫోల్డర్ అస్పష్టంగా ఉంది:",
    "Run thorough file health check:": "క్షుణ్ణమైన ఫైల్ ఆరోగ్య పరీక్షను అమలు చేయండి:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "తనిఖీ చేస్తే, అప్పుడు చాలా నెమ్మదిగా, మరింత క్షుణ్ణంగా ఉన్న వీడియో ఆరోగ్య పరీక్ష FFmpeg బదులుగా హ్యాండ్బ్రేక్ ఉపయోగించి అమలు అవుతుంది.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Desani యొక్క 'ScanMedia.ps1' ఆధారంగా కనుగొనబడింది:",
    "Attempt to repair files after thorough check:": "క్షుణ్ణమైన చెక్ చేసిన తర్వాత ఫైళ్లను రిపేరు చేయడానికి ప్రయత్నించు:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "తనిఖీ చేస్తే, HBBatchBeast FFmpeg ఉపయోగించి ఫైళ్లను మరమ్మత్తు ప్రయత్నిస్తుంది. మూలం ఫైల్ వలె అదే ఫోల్డర్లో ప్రత్యయం '_repaired' తో క్రొత్త ఫైల్ సృష్టించబడుతుంది.",
    "'CRF' value to use when attempting to repair files:": "ఫైళ్లను సరిచేయడానికి ప్రయత్నించినప్పుడు ఉపయోగించడానికి 'CRF' విలువ:",
    "The default 'CRF' value is 23. Please see the following for more information:": "డిఫాల్ట్ 'CRF' విలువ 23. మరింత సమాచారం కోసం కిందివాటిని చూడండి:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "CRF స్కేల్ యొక్క పరిధి 0-51, 0 ఎక్కడైతే నష్టం, 23 అప్రమేయం, మరియు 51 చెత్త నాణ్యత సాధ్యమే. తక్కువ విలువ సాధారణంగా అధిక నాణ్యతకు దారితీస్తుంది, మరియు ఒక సబ్జెక్టివ్ సీన్ పరిధి 17-28. 17 లేదా 18 భావాలను దృష్టిలో ఉంచుకొని లేదా దాదాపుగా అలాంటిదిగా పరిగణించండి; ఇది ఇన్పుట్ వలె అదే లేదా దాదాపు ఒకే విధంగా ఉండాలి కానీ ఇది సాంకేతికంగా నష్టం లేదు.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "HBBatchBeast స్కాన్ చేయబడిన ఫైల్ మార్గాల జాబితాను uncorrupt గా నివేదించింది. అన్ని ఫైల్ల తాజా స్కాన్ చేయడానికి కాష్ను క్లియర్ చేయండి.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "ఒకేసారి హ్యాండ్బ్రేక్ / FFmpeg సందర్భాల్లో సంఖ్యను ఉపయోగించాలా? (సిఫార్సు 4 లేదా తక్కువ):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "ఈ అమరిక \"వీడియో ఆరోగ్య పరీక్ష\" మరియు \"స్కాన్ మరియు కన్వర్ట్\" ప్రక్రియలకు వర్తిస్తుంది. ఎంత హ్యాండ్బ్రేక్ థ్రెడ్లు ఉపయోగించాలో పేర్కొనండి. గరిష్టంగా ఇది 4 కంటే ఎక్కువ ఉపయోగించకూడదని సిఫార్సు చేస్తున్నప్పటికీ గరిష్టంగా లేదు. ఇది చాలా శక్తివంతమైనది కాకపోతే మీ కంప్యూటర్ను అధిక మొత్తంలో స్తంభింపజేయవచ్చు.",
    "Queue size view limit?(Recommended 1000 or fewer):": "క్యూ పరిమాణం వీక్షణ పరిమితి? (సిఫార్సు 1000 లేదా తక్కువ):",
    "Automatically start \"Scan and convert\" when program opened?": "కార్యక్రమం తెరిచినప్పుడు స్వయంచాలకంగా \"స్కాన్ చేసి మార్చండి\" ప్రారంభించాలా?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "ఆరోగ్య తనిఖీ లేదా కన్వర్షన్ / ఫోల్డర్ చూడటం లోపం ఏర్పడినట్లయితే ఇమెయిల్ నోటిఫికేషన్లను స్వీకరించడానికి ఇమెయిల్ వివరాలను పూరించండి. 2FA అవసరమయ్యే ఖాతాలతో పని చేయవు. మీరు Gmail ఖాతాలపై తక్కువ సురక్షిత అనువర్తనాలకు ప్రాప్యతను ప్రారంభించాలి.",
    "Email address:": "ఇమెయిల్ చిరునామా:",
    "For example:": "ఉదాహరణకి:",
    "Email password(not saved):": "ఇమెయిల్ పాస్వర్డ్ (సేవ్ చేయబడలేదు):",
    "SMTP server:": "SMTP సర్వర్:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "ఈ ఫీచర్ ఏ వెబ్ బ్రౌజర్ ఉపయోగించి మార్పిడి / ఆరోగ్య తనిఖీ స్థితి పర్యవేక్షణను అనుమతిస్తుంది. సర్వర్లు మొదలైనప్పుడు నడుస్తుంది.",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "ప్రారంభించబడితే, క్రింది అనామక డేటా HBBatchBeast.io కి పంపబడుతుంది:",
    "API key": "API కీ",
    "Current status ('Searching', 'Running', 'Finished' etc)": "ప్రస్తుత స్థితి ('శోధిస్తోంది', 'రన్నింగ్', 'పూర్తయింది' మొదలైనవి)",
    "Number of:": "సంఖ్య:",
    "Remaining items": "మిగిలి ఉన్న అంశాలు",
    "Successful items": "విజయవంతమైన అంశాలు",
    "Errored items": "సరిదిద్దబడిన అంశాలు",
    "Cancelled items": "రద్దు చేయబడిన అంశాలు",
    "Worker percentages": "వర్కర్ శాతాలు",
    "Last completed item time": "చివరి అంశాన్ని పూర్తి చేసిన సమయం",
    "Enable remote monitoring?:": "రిమోట్ పర్యవేక్షణను ప్రారంభించాలా?",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "ఒక ప్రాధమిక బెంచ్మార్క్ యుటిలిటీ ప్రధానంగా 16+ కోర్ ప్రాసెసర్లు బహుళ హ్యాండ్బ్రేక్ సందర్భాల్లో ఎలా పని చేస్తుందో చూసేటట్లు నిర్మించాయి, అయితే ఇది ఏ రకమైన ప్రాసెసర్ అయినా అమలు చేయగలదు.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "ఇది ఒక h265 4k నమూనా ఫైల్ (2.5MB) ను డౌన్ లోడ్ చేస్తుంది మరియు ముందుగా 4 హ్యాండ్బ్రేక్ సంభాషణలను ఉపయోగించి \"బట్ ఫాస్ట్ 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "మీరు ఎంచుకుంటే ఫలితాలు hbbatchbeast.io కు అప్లోడ్ చేయబడతాయి.",
    "Queue": "క్యూ",
    "Output this session": "ఈ సెషన్ను అవుట్పుట్ చేయండి",
    "Media info viewer tool": "మీడియా సమాచార దర్శని సాధనం",
    "View compress attempt cache": "కంప్రెస్ ప్రయత్నం కాష్ను వీక్షించండి",
    "Clear compress attempt cache": "క్లిస్ట్ కాష్ కాష్ క్లియర్ చేయండి",
    "Save config": "కాన్ఫిగరేషన్ను సేవ్ చేయండి",
    "Scan only": "స్కాన్ మాత్రమే",
    "Scan and convert": "స్కాన్ చేసి మార్చండి",
    "View scan/conversion summary log": "స్కాన్ / మార్పిడి సంగ్రహ లాగ్ను వీక్షించండి",
    "View individual file check/conversion log": "వ్యక్తిగత ఫైలు చెక్ / మార్పిడి లాగ్ను వీక్షించండి",
    "View worker console output": "కార్మికుడు కన్సోల్ అవుట్పుట్ను వీక్షించండి",
    "Health check": "ఆరోగ్య పరీక్ష",
    "Clear healthy file cache": "ఆరోగ్యకరమైన ఫైల్ కాష్ను క్లియర్ చేయండి",
    "View error log": "లోపం లాగ్ను వీక్షించండి",
    "Email test": "ఇమెయిల్ పరీక్ష",
    "View master log": "మాస్టర్ లాగ్ను వీక్షించండి",
    "Wiki help": "వికీ సహాయం",
    "An application by HaveAGitGat": "HaveAGitGat ద్వారా ఒక అనువర్తనం",
    "New": "న్యూ",
    "Launch": "ప్రారంభం",
    "Benchmark": "బెంచ్మార్క్",
    "See results": "ఫలితాలను చూడండి",
    "Pause queue": "క్యూను పాజ్ చేయండి",
    "Continue queue": "కొనసాగించు క్యూ",
    "Stop queue": "క్యూ ఆపు",
    "Convert selected files": "ఎంచుకున్న ఫైళ్ళను మార్చండి",
    "Toggle queue view": "క్యూ వీక్షణను టోగుల్ చేయండి",
    "Deselect all": "అన్ని ఎంపికలను తీసివేయండి",
    "Invert all": "అన్నిటినీ విలోమం చేయండి",
    "Select all": "అన్ని ఎంచుకోండి",
    "Toggle output view": "అవుట్పుట్ వీక్షణను టోగుల్ చేయండి"
}