{"Source folder - see help tab for monitoring multiple folders":"โฟลเดอร์ต้นทาง - ดูแถบช่วยเหลือสำหรับการตรวจสอบหลาย ๆ โฟลเดอร์","Video health check":"ตรวจสุขภาพวิดีโอ","Batch conversion and Folder watching":"การแปลงชุดและการดูโฟลเดอร์","Remote Monitoring (Beta)":"การตรวจสอบระยะไกล (เบต้า)","Benchmark (Beta)":"เกณฑ์มาตรฐาน (เบต้า)","System":"ระบบ","Help":"ช่วยด้วย","Temporary conversion folder?":"โฟลเดอร์การแปลงชั่วคราวหรือไม่","Destination folder":"โฟลเดอร์ปลายทาง","Destination folder:":"โฟลเดอร์ปลายทาง:","Standard preset:":"ค่ามาตรฐานล่วงหน้า:","Custom preset:":"ที่กำหนดไว้ล่วงหน้าที่กำหนดเอง:","Select standard preset:":"เลือกค่ามาตรฐานล่วงหน้า:","nvenc detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"ตรวจพบ nvenc โปรดตรวจสอบให้แน่ใจว่าลดจำนวนของ HandBrakeCLI อินสแตนซ์เป็น 2 หรือต่ำกว่า (สำหรับการ์ดกราฟิกส่วนใหญ่) หรือคุณอาจพบข้อผิดพลาดเนื่องจาก VRAM ไม่เพียงพอ การตั้งค่านี้สามารถพบได้ในแท็บ \"ระบบ\"","Container:":"คอนเทนเนอร์:","Enable periodic scanning?:":"เปิดใช้งานการสแกนเป็นระยะหรือไม่:","Enable daily scanning?:":"เปิดใช้งานการสแกนทุกวันหรือไม่:","Show/hide advanced:":"แสดง / ซ่อนขั้นสูง:","Scan interval (minimum 5 seconds):":"สแกนช่วงเวลา (ขั้นต่ำ 5 วินาที):","Daily run time (hh:mm):":"เวลาทำงานรายวัน (hh: mm):","Include these file types:":"รวมประเภทไฟล์เหล่านี้:","Exclude files smaller than (MB):":"ยกเว้นไฟล์ที่เล็กกว่า (MB):","Exclude files larger than (MB):":"ยกเว้นไฟล์ที่มีขนาดใหญ่กว่า (MB):","Exclude file names which include any of these words:":"ยกเว้นชื่อไฟล์ที่มีคำเหล่านี้:","Include files with any ":"รวมถึงไฟล์ใด ๆ ด้วย"," or all ":"หรือทั้งหมด"," of these":"ของเหล่านี้","properties:":"คุณสมบัติ:","Exclude files with any ":"ไม่รวมไฟล์ใด ๆ"," of these ":"ของเหล่านี้","Copy excluded files to destination?":"คัดลอกไฟล์ที่ยกเว้นไปยังปลายทางหรือไม่","Delete source files after conversion?:":"ลบไฟล์ต้นฉบับหลังจากทำการแปลงหรือไม่:","Replace original file if converted file is smaller?(Compress attempt)":"แทนที่ไฟล์ต้นฉบับหากไฟล์ที่แปลงมีขนาดเล็กกว่านี้ (พยายามบีบอัด)","Replace original file always?":"แทนที่ไฟล์ต้นฉบับเสมอหรือไม่","Copy subtitle (srt) files to destination?":"คัดลอกไฟล์คำบรรยาย (srt) ไปยังปลายทางหรือไม่","Automatically create temp/destination folders if they don't exist?":"สร้างโฟลเดอร์ชั่วคราว / โฟลเดอร์ปลายทางโดยอัตโนมัติหากไม่มีอยู่?","Custom bat path to run after each conversion (leave blank if not using):":"เส้นทางค้างคาวที่กำหนดเองเพื่อเรียกใช้หลังจากการแปลงแต่ละครั้ง (ปล่อยว่างไว้หากไม่ได้ใช้):","Run processes at low priority?":"เรียกใช้กระบวนการที่มีลำดับความสำคัญต่ำหรือไม่","Move corrupt files into the following folder?:":"ย้ายไฟล์ที่เสียหายไปยังโฟลเดอร์ต่อไปนี้หรือไม่:","Corrupt file folder:":"โฟลเดอร์ไฟล์เสียหาย:","HBBB saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBB บันทึกรายการเส้นทางไฟล์ที่สแกนที่รายงานว่าไม่เสียหาย ล้างแคชเพื่อทำการสแกนใหม่ในไฟล์ทั้งหมด","Number of simultaneous Handbrake instances to use?(Recommended<=4):":"จำนวนอินสแตนซ์ Handbrake พร้อมกันที่จะใช้? (แนะนำ <= 4):","Queue size view limit?(Recommended <=1000):":"ขีด จำกัด จำนวนการดูขนาดคิว (แนะนำ <= 1,000):","Automatically start \"Scan and convert\" when program opened?":"เริ่ม \"สแกนและแปลง\" โดยอัตโนมัติเมื่อเปิดโปรแกรมหรือไม่","Email address:":"ที่อยู่อีเมล:","Email password(not saved):":"รหัสผ่านอีเมล (ไม่ได้บันทึก):","SMTP server:":"เซิร์ฟเวอร์ SMTP:","This feature allows monitoring of batch conversion status using any web-browser. Useful when running servers etc.":"คุณสมบัตินี้ช่วยให้สามารถตรวจสอบสถานะการแปลงเป็นชุดโดยใช้เว็บเบราว์เซอร์ใดก็ได้ มีประโยชน์เมื่อใช้เซิร์ฟเวอร์ ฯลฯ","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"หากเปิดใช้งานข้อมูลที่ไม่ระบุชื่อต่อไปนี้จะถูกส่งไปยัง HBBatchBeast.io:","API key":"รหัส API","Current status ('Searching', 'Running', 'Finished' etc)":"สถานะปัจจุบัน ('ค้นหา', 'กำลังทำงาน', 'เสร็จสิ้น' ฯลฯ )","Number of:":"จำนวน:","Remaining items":"รายการที่เหลืออยู่","Successful items":"รายการที่ประสบความสำเร็จ","Errored items":"รายการที่มีข้อผิดพลาด","Cancelled items":"รายการที่ถูกยกเลิก","Worker percentages":"เปอร์เซ็นต์คนงาน","Last completed item time":"เวลารายการเสร็จสมบูรณ์ล่าสุด","Enable remote monitoring?:":"เปิดใช้งานการตรวจสอบระยะไกลหรือไม่:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"ยูทิลิตี้การเปรียบเทียบพื้นฐานที่สร้างขึ้นเพื่อดูว่าโปรเซสเซอร์ 16+ คอร์ทำงานอย่างไรโดยใช้ HandBrake อินสแตนซ์หลายตัวแม้ว่ามันจะสามารถทำงานกับโปรเซสเซอร์ชนิดใดก็ได้","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"สิ่งนี้จะทำการดาวน์โหลดไฟล์ตัวอย่าง h265 4k (2.5MB) และเรียกใช้เกณฑ์มาตรฐานโดยใช้อินสแตนซ์ของ HandBrake 4 ตัวพร้อมพรีเซ็ต \"Very Fast 1080p30\" ที่ตั้งไว้ล่วงหน้า","Results can be uploaded to hbbatchbeast.io if you choose.":"ผลลัพธ์สามารถอัปโหลดไปยัง hbbatchbeast.io หากคุณเลือก","Queue":"คิว","Output this session":"เอาท์พุทเซสชั่นนี้","Media info viewer tool":"เครื่องมือดูข้อมูลสื่อ","View compress attempt cache":"ดูแคชความพยายามในการบีบอัด","Clear compress attempt cache":"ล้างแคชความพยายามบีบอัด","Save config":"บันทึกการกำหนดค่า","Scan only":"สแกนเท่านั้น","Scan and convert":"สแกนและแปลง","View scan/conversion summary log":"ดูบันทึกสรุปการสแกน / การแปลง","View individual file check/conversion log":"ดูแต่ละไฟล์ตรวจสอบ / บันทึกการแปลง","View HB console output":"ดูเอาต์พุตคอนโซล HB","Health check":"ตรวจสุขภาพ","Clear healthy file cache":"ล้างแคชไฟล์เพื่อสุขภาพ","View error log":"ดูบันทึกข้อผิดพลาด","Email test":"ทดสอบอีเมล์","View system error log":"ดูบันทึกข้อผิดพลาดของระบบ","Wiki help":"ช่วยวิกิ","An application by HaveAGitGat":"แอปพลิเคชันโดย HaveAGitGat","New":"ใหม่","Launch":"เปิด","Benchmark":"เกณฑ์มาตรฐาน","See results":"ดูผลลัพธ์","Pause queue":"หยุดคิวชั่วคราว","Continue queue":"ต่อคิว","Stop queue":"หยุดคิว","Convert selected files":"แปลงไฟล์ที่เลือก","Toggle queue view":"สลับมุมมองคิว","Select all":"เลือกทั้งหมด","Deselect all":"ยกเลิกการเลือกทั้งหมด","Invert all":"กลับทั้งหมด","Toggle output view":"สลับมุมมองเอาต์พุต"}