{"The number of custom presets does not match the number of source folders!":"จำนวนที่ตั้งไว้ล่วงหน้าที่กำหนดเองไม่ตรงกับจำนวนของโฟลเดอร์ต้นทาง!","source folders have been detected.":"ตรวจพบโฟลเดอร์ต้นทางแล้ว","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"ตรวจพบบรรทัดที่กำหนดล่วงหน้าที่กำหนดเอง โปรดตรวจสอบอีกครั้งว่ามีตัวแบ่งบรรทัดที่มองไม่เห็น ควรมีหนึ่งเส้นทางโฟลเดอร์หรือที่ตั้งไว้ล่วงหน้าต่อบรรทัด ตรวจสอบให้แน่ใจว่าคุณไม่ได้สร้างบรรทัดว่างโดยไม่ตั้งใจ","The number of filename suffixes does not match the number of source folders! ":"จำนวนคำต่อท้ายชื่อไฟล์ไม่ตรงกับจำนวนโฟลเดอร์ต้นทาง!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"ตรวจพบบรรทัดต่อท้ายชื่อไฟล์ โปรดตรวจสอบอีกครั้งว่ามีตัวแบ่งบรรทัดที่มองไม่เห็น ควรมีหนึ่งเส้นทางโฟลเดอร์หรือคำต่อท้ายชื่อไฟล์ต่อบรรทัด ตรวจสอบให้แน่ใจว่าคุณไม่ได้สร้างบรรทัดว่างโดยไม่ตั้งใจ","The number of source folders does not match the number of destination folders!":"จำนวนโฟลเดอร์ต้นทางไม่ตรงกับจำนวนโฟลเดอร์ปลายทาง!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"ตรวจพบโฟลเดอร์ปลายทางแล้ว โปรดตรวจสอบอีกครั้งว่ามีตัวแบ่งบรรทัดที่มองไม่เห็น ควรมีหนึ่งเส้นทางโฟลเดอร์ต่อบรรทัด ตรวจสอบให้แน่ใจว่าคุณไม่ได้สร้างบรรทัดว่างโดยไม่ตั้งใจ","The number of source folders does not match the number of temporary conversion folders!":"จำนวนโฟลเดอร์ต้นทางไม่ตรงกับจำนวนโฟลเดอร์การแปลงชั่วคราว!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"ตรวจพบโฟลเดอร์การแปลงชั่วคราว โปรดตรวจสอบอีกครั้งว่ามีตัวแบ่งบรรทัดที่มองไม่เห็น ควรมีหนึ่งเส้นทางโฟลเดอร์ต่อบรรทัด ตรวจสอบให้แน่ใจว่าคุณไม่ได้สร้างบรรทัดว่างโดยไม่ตั้งใจ","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"โปรดป้อนที่เก็บที่ถูกต้องเช่น '.mp4' ตรวจสอบให้แน่ใจว่าได้รวม '.'","Corrupt file folder":"โฟลเดอร์ไฟล์เสียหาย","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"ไม่ได้อยู่! โปรดตรวจสอบให้แน่ใจว่าไม่มีช่องว่างหรือตัวอักษรที่ซ่อนอยู่ก่อน / หลังเส้นทาง","Source folder":"โฟลเดอร์ต้นทาง","Temporary conversion folder":"โฟลเดอร์การแปลงชั่วคราว","appears to be the same as or is within source folder":"ดูเหมือนจะเหมือนกับหรืออยู่ในโฟลเดอร์ต้นทาง","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ซึ่งจะป้องกัน HBBatchBeast จากการทำงานอย่างถูกต้อง โปรดเปลี่ยนโฟลเดอร์การแปลงชั่วคราวเป็นโฟลเดอร์ที่อยู่นอกโฟลเดอร์ต้นทาง หากคุณต้องการใช้คุณสมบัติ 'แทนที่ไฟล์ต้นฉบับ' โปรดเลือกโฟลเดอร์ปลายทางที่ไม่เหมือนกับหรือภายในโฟลเดอร์ต้นทางจากนั้นเลือกช่องทำเครื่องหมาย 'แทนที่ไฟล์ต้นฉบับเสมอ' ในส่วนการตั้งค่าขั้นสูง . ยกเลิกการทำเครื่องหมายที่ช่อง 'โฟลเดอร์แปลงชั่วคราว' เนื่องจากจะไม่มีประโยชน์ในกรณีนี้ ไฟล์จะถูกแปลงเป็นโฟลเดอร์ปลายทางจากนั้นย้ายกลับไปยังโฟลเดอร์ต้นทาง","Destination folder":"โฟลเดอร์ปลายทาง","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"ซึ่งจะป้องกัน HBBatchBeast จากการทำงานอย่างถูกต้อง โปรดเปลี่ยนโฟลเดอร์ปลายทางเป็นโฟลเดอร์ภายนอกโฟลเดอร์ต้นทาง หากคุณต้องการใช้คุณสมบัติ 'แทนที่ไฟล์ต้นฉบับ' โปรดเลือกโฟลเดอร์ปลายทางที่ไม่เหมือนกับหรือภายในโฟลเดอร์ต้นทางจากนั้นเลือกช่องทำเครื่องหมาย 'แทนที่ไฟล์ต้นฉบับเสมอ' ในส่วนการตั้งค่าขั้นสูง . ยกเลิกการทำเครื่องหมายที่ช่อง 'โฟลเดอร์แปลงชั่วคราว' เนื่องจากจะไม่มีประโยชน์ในกรณีนี้ ไฟล์จะถูกแปลงเป็นโฟลเดอร์ปลายทางจากนั้นย้ายกลับไปยังโฟลเดอร์ต้นทาง","Error creating temporary conversion folder":"เกิดข้อผิดพลาดในการสร้างโฟลเดอร์การแปลงชั่วคราว","Error creating destination folder":"เกิดข้อผิดพลาดในการสร้างโฟลเดอร์ปลายทาง","Please select to use HandBrake or FFmpeg!":"โปรดเลือกเพื่อใช้ HandBrake หรือ FFmpeg!","Please select a standard preset or input a custom one!":"โปรดเลือกค่ามาตรฐานหรือป้อนค่าที่กำหนดเอง!","Please select a scan interval of 5 seconds or greater!":"กรุณาเลือกช่วงเวลาสแกน 5 วินาทีหรือมากกว่า!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"โปรดตรวจสอบให้แน่ใจว่าจำนวนของ HandBrake / FFmpeg อินสแตนซ์ที่ใช้พร้อมกันเป็นหนึ่งหรือมากกว่า!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"รหัส API ไม่ถูกต้อง! โปรดคลิก 'ใหม่' บนแท็บการตรวจสอบระยะไกลเพื่อสร้างรหัสใหม่","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"โปรดป้อนเวลาสแกนรายวันในรูปแบบ 24 ชั่วโมง: hh: mm (เช่น 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"ไฟล์ที่มาจะถูกลบหลังจากการแปลง! กรุณาทดสอบก่อนใช้งานที่เหมาะสม!","Benchmark failed!":"เกณฑ์มาตรฐานล้มเหลว!","Log does not exist!":"ไม่มีบันทึก!","Folder does not exist!":"ไม่มีโฟลเดอร์!","Error sending email! Please check your settings.":"เกิดข้อผิดพลาดในการส่งอีเมล! โปรดตรวจสอบการตั้งค่าของคุณ","Test email sent!":"ส่งอีเมลทดสอบแล้ว!","All worker processes have been stopped.":"กระบวนการของผู้ปฏิบัติงานทั้งหมดหยุดทำงาน","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"คิวจะถูกหยุดชั่วคราวเมื่อรายการปัจจุบันเสร็จสิ้นการประมวลผล คุณแน่ใจหรือว่าต้องการหยุดคิวชั่วคราว","Queue pause initiated.'Continue' button will appear once all workers have paused.":"เริ่มคิวหยุดชั่วคราวปุ่ม 'ดำเนินการต่อ' จะปรากฏขึ้นเมื่อพนักงานทุกคนหยุดชั่วคราว","Healthy file cache cleared!":"ล้างแคชไฟล์เพื่อสุขภาพแล้ว!","Cache cleared!":"ล้างแคชแล้ว!","Cancel item":"ยกเลิกรายการ","Please check the above checkbox to use this feature.":"โปรดทำเครื่องหมายในช่องด้านบนเพื่อใช้คุณสมบัตินี้","Configuration":"องค์ประกอบ","Source folders":"โฟลเดอร์ต้นทาง","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"นี่คือโฟลเดอร์ซอร์สซึ่งจะถูกสแกนหาสื่อ โฟลเดอร์จะต้องป้อนโดยไม่มีเครื่องหมายทับต่อท้าย ตัวอย่างเช่น:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"กล่องพา ธ โฟลเดอร์ต้นทางสามารถขยายได้ (กด Enter เพื่อสร้างบรรทัดใหม่) หากคุณต้องการระบุหลายซอร์สโฟลเดอร์ตรวจสอบให้แน่ใจว่าแต่ละพา ธ ของโฟลเดอร์ต้นทางอยู่ในบรรทัดของตนเองเช่น:","Video health check":"ตรวจสุขภาพวิดีโอ","Batch conversion and Folder watching":"การแปลงชุดและการดูโฟลเดอร์","Remote Monitoring (Beta)":"การตรวจสอบระยะไกล (เบต้า)","Benchmark (Beta)":"เกณฑ์มาตรฐาน (เบต้า)","System":"ระบบ","Help":"ช่วยด้วย","Temporary conversion folders":"โฟลเดอร์การแปลงชั่วคราว","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"หาก \"โฟลเดอร์การแปลงชั่วคราว\" มีการตรวจสอบแล้ว HandBrake จะแปลงไฟล์เป็นโฟลเดอร์นั้น เมื่อการแปลงเสร็จสิ้นไฟล์จะถูกย้ายไปยัง \"โฟลเดอร์ปลายทาง\" ของคุณ คุณจะต้องระบุโฟลเดอร์การแปลงชั่วคราวให้มากที่สุดเท่าโฟลเดอร์ต้นทาง โฟลเดอร์แหล่งที่มาแรกของคุณจะถูกแปลงเป็นโฟลเดอร์การแปลงชั่วคราวครั้งแรกของคุณโฟลเดอร์แหล่งที่สองของคุณไปยังโฟลเดอร์การแปลงชั่วคราวครั้งที่สองเป็นต้น ตรวจสอบให้แน่ใจว่าแต่ละเส้นทางโฟลเดอร์การแปลงชั่วคราวอยู่ในเส้นทางของตัวเอง","Destination folders":"โฟลเดอร์ปลายทาง","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"ระบุเส้นทางโฟลเดอร์ปลายทาง อีกครั้งคุณจะต้องระบุโฟลเดอร์ปลายทางให้มากที่สุดเท่าโฟลเดอร์ต้นทาง ไฟล์จากโฟลเดอร์ต้นทางแรกของคุณจะสิ้นสุดในโฟลเดอร์ปลายทางแรกของคุณไฟล์โฟลเดอร์ต้นทางที่สองในโฟลเดอร์ปลายทางที่สองเป็นต้น","First source folder ---------> First temporary conversion folder ---------> First destination folder":"โฟลเดอร์ที่มาแรก ---------> โฟลเดอร์การแปลงชั่วคราวครั้งแรก ---------> โฟลเดอร์ปลายทางแรก","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"โฟลเดอร์แหล่งที่สอง ---------> โฟลเดอร์แปลงชั่วคราวที่สอง ---------> โฟลเดอร์ปลายทางที่สอง","etc":"ฯลฯ","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast จะทำงานไม่ถูกต้องหากคุณตั้งค่าโฟลเดอร์ปลายทางเหมือนหรือภายในโฟลเดอร์ต้นทาง","Standard preset:":"ค่ามาตรฐานล่วงหน้า:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"เลือก HandBrake preset ที่คุณต้องการแปลงไฟล์ด้วย หากเลือก \"Standard preset\" ไฟล์ทั้งหมดในโฟลเดอร์ที่เลือกจะถูกแปลงโดยใช้ HandBrake preset ที่ระบุ คุณสามารถหาข้อมูลเพิ่มเติมเกี่ยวกับ HandBrake ที่ตั้งไว้ล่วงหน้าได้ที่นี่:","Custom preset:":"ที่กำหนดไว้ล่วงหน้าที่กำหนดเอง:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"หาก \"กำหนดล่วงหน้าเอง\" คุณต้องป้อนค่ากำหนดล่วงหน้าเอง HBBatchBeast ครอบคลุมส่วน \"HandBrakeCLI -i ต้นทาง -o ปลายทาง\" ของอินพุต HandBrakeCLI ดังนั้นคุณต้องป้อนพารามิเตอร์การแปลง ตัวอย่างเช่น:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"หากใช้ FFmpeg คุณต้องแยกพารามิเตอร์อินพุตและเอาต์พุตด้วยเครื่องหมายจุลภาค เช่น:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"คุณสามารถเชื่อมโยงไปยังค่าที่กำหนดล่วงหน้าที่กำหนดเองซึ่งส่งออกจากแอปพลิเคชัน HandBrake GUI อย่างเป็นทางการเช่น:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"หากคุณมีปัญหากับการตั้งค่าล่วงหน้าที่กำหนดเองอาจเป็นเพราะบั๊กที่รู้จักกับ HandBrakeCLI (จะได้รับการแก้ไขใน HandBrakeCLI รุ่นถัดไป) โปรดดูสิ่งนี้สำหรับวิธีแก้ปัญหาชั่วคราว:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"พรีเซ็ตแบบกำหนดเองแต่ละรายการจะต้องอยู่ในบรรทัดของตัวเองและคล้ายกับโฟลเดอร์จะต้องมีพรีเซ็ตแบบกำหนดเองจำนวนมากเป็นโฟลเดอร์ซอร์ส","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"โฟลเดอร์ที่มาแรก ---------> โฟลเดอร์การแปลงชั่วคราวครั้งแรก ---------> โฟลเดอร์ปลายทางแรก @ กำหนดล่วงหน้าเอง 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"โฟลเดอร์ต้นทางที่สอง ---------> โฟลเดอร์การแปลงชั่วคราวที่สอง ---------> โฟลเดอร์ปลายทางที่สอง @ กำหนดล่วงหน้าเอง 2","See the following image for guidance:":"ดูภาพต่อไปนี้สำหรับคำแนะนำ:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"หากใช้การเข้ารหัสกราฟิกการ์ด (เช่น NVENC) คุณอาจต้องลดจำนวนของ HandBrake อินสแตนซ์ (ลอง 2 หรือน้อยกว่า) เนื่องจากข้อ จำกัด VRAM","Select standard preset:":"เลือกค่ามาตรฐานล่วงหน้า:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"ตรวจพบ NVENC โปรดตรวจสอบให้แน่ใจว่าได้ลดจำนวน HandBrakeCLI อินสแตนซ์เป็น 2 หรือต่ำกว่า (สำหรับการ์ดกราฟิกส่วนใหญ่) หรือคุณอาจพบข้อผิดพลาดเนื่องจาก VRAM ไม่เพียงพอ การตั้งค่านี้สามารถพบได้ในแท็บ \"ระบบ\"","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"ตรวจพบการตั้งค่าล่วงหน้าที่นำเข้าหากคุณมีปัญหาเกี่ยวกับการตั้งค่าล่วงหน้าที่กำหนดเองที่นำเข้าอาจเป็นเพราะมีข้อบกพร่องที่รู้จักกับ HandBrakeCLI (จะได้รับการแก้ไขใน HandBrakeCLI รุ่นถัดไป) ทางออกชั่วคราวคือการลบ '\"PictureRotate\": \"0: 0\"' จากไฟล์. json ข้อมูลเพิ่มเติมที่นี่:","Container:":"คอนเทนเนอร์:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"ระบุคอนเทนเนอร์ที่คุณต้องการให้ไฟล์เอาต์พุตมีเช่น '.mp4' คุณสามารถหาข้อมูลเพิ่มเติมเกี่ยวกับตู้คอนเทนเนอร์ได้ที่:","Enable periodic scanning:":"เปิดใช้งานการสแกนเป็นระยะ:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast สามารถตรวจสอบโฟลเดอร์ต้นทางของคุณและเรียกใช้การสแกนหาไฟล์ใหม่ในช่วงเวลาที่กำหนด ช่วงเวลาเป็นวินาทีโดยค่าเริ่มต้นคือ 300 วินาที (5 นาที) หากเลือกตัวเลือกนี้จากนั้นเมื่อคุณกด \"สแกนและแปลง\" โปรแกรมจะแปลงไฟล์ใหม่และตัวจับเวลานับถอยหลังจะเริ่มขึ้น นี่จะวนซ้ำไปเรื่อย ๆ จนกว่าจะหยุด ช่วงเวลาสแกนอยู่ในส่วนการตั้งค่าขั้นสูง","Enable daily scanning:":"เปิดใช้งานการสแกนรายวัน:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"แทนที่จะสแกนเป็นระยะคุณสามารถเลือกให้สแกนได้หนึ่งครั้งต่อวัน เวลาสแกนถูกป้อนในส่วนการตั้งค่าขั้นสูงในรูปแบบ hh: mm เช่น '18: 30 ' เมื่อเลือก \"สแกนและแปลง\" โปรแกรมจะรอจนกว่าถึงเวลาที่กำหนดจนกว่าจะใช้กระบวนการสแกนและการแปลง อีกครั้งนี่จะวนซ้ำไปเรื่อย ๆ จนกว่าจะหยุด","Show/hide advanced:":"แสดง / ซ่อนขั้นสูง:","Scan interval (minimum 5 seconds):":"สแกนช่วงเวลา (ขั้นต่ำ 5 วินาที):","Daily run time (hh:mm):":"เวลาทำงานรายวัน (hh: mm):","Output filename suffix:":"คำต่อท้ายชื่อไฟล์ที่ส่งออก:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"นี่เป็นทางเลือก คุณสามารถระบุคำต่อท้ายเพื่อเพิ่มท้ายชื่อไฟล์ของคุณเช่น '_1080p' หรือ '_testconversion' เป็นต้น","If 'standard preset' is selected then all output files will have the same suffix.":"หากเลือก 'มาตรฐานที่ตั้งไว้ล่วงหน้า' ไฟล์เอาต์พุตทั้งหมดจะมีคำต่อท้ายเหมือนกัน","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"หากเลือก 'กำหนดล่วงหน้าเอง' คุณสามารถระบุคำต่อท้ายหนึ่งรายการต่อโฟลเดอร์ต้นทาง / กำหนดล่วงหน้าเอง ตรวจสอบให้แน่ใจว่าแต่ละคำต่อท้ายอยู่ในบรรทัดของตัวเอง ตัวอย่างเช่นหากคุณมี 2 โฟลเดอร์ต้นทางและใช้ 'การตั้งค่าล่วงหน้าที่กำหนดเอง' คุณสามารถวางสิ่งนี้ลงในกล่องคำต่อท้ายชื่อไฟล์:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"ไฟล์ในโฟลเดอร์ซอร์สแรกจะเพิ่ม '_720p' ลงในชื่อไฟล์เอาต์พุต ไฟล์ในโฟลเดอร์ซอร์สที่สองจะเพิ่ม '_1080p' ลงในชื่อไฟล์เอาต์พุต ฯลฯ","Include these file containers:":"รวมไฟล์คอนเทนเนอร์เหล่านี้:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"ป้อนไฟล์คอนเทนเนอร์เพื่อสแกน แต่ละประเภทจะต้องคั่นด้วยเครื่องหมายจุลภาค รายการเริ่มต้นคือ:","Exclude files smaller than (MB):":"ยกเว้นไฟล์ที่เล็กกว่า (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"ระบุว่าจะยกเว้นไฟล์ที่เล็กกว่าขนาดที่กำหนดจากการแปลง (เป็นเมกะไบต์)","Exclude files larger than (MB):":"ยกเว้นไฟล์ที่มีขนาดใหญ่กว่า (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"ระบุว่าจะยกเว้นไฟล์ที่มีขนาดใหญ่กว่าขนาดที่แน่นอนจากการแปลง (เป็นเมกะไบต์)","Exclude filenames which include any of these words:":"ยกเว้นชื่อไฟล์ที่มีคำเหล่านี้:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"ป้อนคำหลักที่จะถูกกรองเมื่อทำการสแกนไฟล์ ตัวอย่างเช่นหากป้อน \"720p\" ดังนั้นไฟล์ใด ๆ ที่มี \"720p\" ในชื่อจะไม่ถูกแปลง อีกครั้งคำหลักจะต้องคั่นด้วยเครื่องหมายจุลภาค ตัวอย่างเช่นป้อนข้อมูลต่อไปนี้ในกล่องตัวกรอง:","Include files with any ":"รวมถึงไฟล์ใด ๆ ด้วย"," or all ":"หรือทั้งหมด"," of these":"ของเหล่านี้","properties:":"คุณสมบัติ:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"ที่นี่คุณสามารถป้อนคุณสมบัติวิดีโอและเสียงที่ไฟล์ต้องมีเพื่อแปลง (แยกข้อมูลโดยใช้ FFprobe) คุณสมบัติจะต้องคั่นด้วยเครื่องหมายจุลภาค ใช้เครื่องมือเครื่องมือดูข้อมูลสื่อเพื่อช่วยพิจารณาคุณสมบัติที่คุณต้องการรวม ตรวจสอบให้แน่ใจว่าใส่เครื่องหมายจุลภาคหลังคุณสมบัติสุดท้าย ตัวอย่างเช่นหากต้องการแปลงไฟล์ที่เข้ารหัสโดยใช้ h264 และ aac stereo audio เท่านั้น:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"เป็นที่น่าสังเกตว่าการตรวจสอบคุณสมบัตินี้เสร็จสิ้นเมื่อกระบวนการแปลงเริ่มต้น (เพื่อประหยัดเวลาในขณะที่สร้างคิว) ดังนั้นแม้ว่าไฟล์อาจปรากฏในคิวการแปลงไฟล์เหล่านั้นจะถูกข้ามไป","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"หาก FFprobe สามารถดึงคุณสมบัติได้ดังนั้น 'OK' จะปรากฏในคอลัมน์ \"FFprobe\" ในมุมมองคิว","Exclude files with any ":"ไม่รวมไฟล์ใด ๆ"," of these ":"ของเหล่านี้","The opposite of 'Include files with any or all of these properties'":"ตรงข้ามของ 'รวมไฟล์กับคุณสมบัติเหล่านี้ใด ๆ หรือทั้งหมด'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"นี่เป็นเครื่องมือขนาดเล็กสำหรับวิเคราะห์คุณสมบัติไฟล์ด้วยเพื่อช่วยคุณกำหนดคุณสมบัติที่คุณต้องการรวม / ไม่รวมในตัวเลือกด้านบน มันใช้ FFprobe เพื่อส่งคืนข้อมูล ลากและวางไฟล์ลงในกล่องสีเทาเพื่อวิเคราะห์ ตัวอย่างเช่นการดร็อปไฟล์ทดสอบอาจส่งคืนสิ่งต่อไปนี้:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"หากคุณต้องการแยกไฟล์เช่นนี้ออกจากการแปลงคุณสามารถใส่คุณสมบัติไฟล์หลายอย่างลงในช่อง \"ยกเว้นไฟล์ที่มีคุณสมบัติเหล่านี้อย่างใดอย่างหนึ่งหรือทั้งหมด\" แล้วเลือกช่องทำเครื่องหมายถัดจาก 'ทั้งหมด' แทน 'ใด ๆ ' ชอบมาก:","Copy excluded files to destination:":"คัดลอกไฟล์ที่ไม่รวมไปยังปลายทาง:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"หากคุณเลือกตัวเลือกนี้ไฟล์ที่ถูกแยกออกจากการแปลงจะถูกคัดลอกไปยังโฟลเดอร์ปลายทางโดยตรง สิ่งนี้ใช้กับตัวกรองต่อไปนี้:","Exclude filenames which include any of these words":"ยกเว้นชื่อไฟล์ซึ่งรวมถึงคำใด ๆ เหล่านี้","Include files with any or all of these properties":"รวมไฟล์ด้วยคุณสมบัติเหล่านี้ใด ๆ หรือทั้งหมด","Exclude files with any or all of these properties":"ไม่รวมไฟล์ที่มีคุณสมบัติเหล่านี้ใด ๆ หรือทั้งหมด","Exclude files smaller than (MB)":"ยกเว้นไฟล์ที่เล็กกว่า (MB)","Exclude files larger than (MB)":"ยกเว้นไฟล์ที่มีขนาดใหญ่กว่า (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"โปรดทราบว่าวิธีนี้ใช้ได้กับไฟล์ที่ไม่รวมเนื่องจากไม่ตรงตามเงื่อนไขคุณสมบัติ \"รวม\" ข้างต้นดังนั้นอย่าคัดลอกไฟล์ไลบรารีทั้งหมดของคุณโดยไม่ได้ตั้งใจเมื่อคุณพยายามแปลงไฟล์เพียงไม่กี่ไฟล์","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"คุณสมบัติการคัดลอกใช้ไม่ได้กับตัวกรองต่อไปนี้ (เช่นไฟล์ที่ถูกแยกออกเนื่องจากตัวกรอง)","Include these file types":"รวมประเภทไฟล์เหล่านี้","Delete source files after conversion:":"ลบไฟล์ต้นฉบับหลังจากการแปลง:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"หากเลือกตัวเลือกนี้หากความพยายามในการแปลงสำเร็จไฟล์ต้นฉบับจะถูกลบ กระบวนการนี้จะทำในตอนท้ายหลังจากการแปลงไฟล์ทั้งหมด ซึ่งหมายความว่าคุณสามารถแปลงไฟล์ต้นฉบับเดียวกันโดยใช้สถานีที่ตั้งไว้ล่วงหน้าหลายรายการทั้งหมดในครั้งเดียว ไฟล์ต้นฉบับจะถูกลบหลังจากนั้น","Replace original file if converted file is smaller?(Compress attempt)":"แทนที่ไฟล์ต้นฉบับหากไฟล์ที่แปลงมีขนาดเล็กกว่านี้ (พยายามบีบอัด)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"เลือกช่องทำเครื่องหมายนี้หากคุณต้องการให้ HBBatchBeast แทนที่ไฟล์ต้นฉบับต้นฉบับโดยอัตโนมัติหากไฟล์ใหม่มีขนาดเล็กลง หากไฟล์ใหม่ไม่เล็กไฟล์จะถูกเก็บไว้ในโฟลเดอร์ปลายทาง","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"ตรวจสอบให้แน่ใจว่าโฟลเดอร์ปลายทางของคุณไม่เหมือนกับ / หรือภายในโฟลเดอร์ต้นทางหรือไม่ทำงานอย่างถูกต้อง","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"เมื่อ HBBatchBeast พยายามบีบอัดไฟล์เฉพาะมันจะเพิ่มพา ธ ของไฟล์นั้นไปยังแคชเพื่อไม่ให้ลองอีกครั้งในอนาคต คุณสามารถดู / แก้ไข / ล้างแคชโดยใช้ปุ่มสีเหลือง","Replace original file always?":"แทนที่ไฟล์ต้นฉบับเสมอหรือไม่","The original file will be replaced regardless of whether the new file is larger or smaller.":"ไฟล์ต้นฉบับจะถูกแทนที่โดยไม่คำนึงว่าไฟล์ใหม่มีขนาดใหญ่หรือเล็กลง","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"อีกครั้งตรวจสอบให้แน่ใจว่าโฟลเดอร์ปลายทางของคุณไม่เหมือนกับ / หรือภายในโฟลเดอร์ต้นทางหรือไม่ทำงานอย่างถูกต้อง","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"เมื่อ HBBatchBeast ทำการแปลงไฟล์เฉพาะแล้วมันจะเพิ่มพา ธ ของไฟล์นั้นไปยังแคชเพื่อไม่ให้มันถูกลองอีกครั้งในอนาคต คุณสามารถดู / แก้ไข / ล้างแคชโดยใช้ปุ่มสีเหลือง","Copy subtitle (srt) files to destination?":"คัดลอกไฟล์คำบรรยาย (srt) ไปยังปลายทางหรือไม่","Subtitle '.srt' files will be copied to the destination folder automatically.":"ไฟล์คำบรรยาย '.srt' จะถูกคัดลอกไปยังโฟลเดอร์ปลายทางโดยอัตโนมัติ","Automatically create temporary/destination folders if they don't exist?":"สร้างโฟลเดอร์ชั่วคราว / โฟลเดอร์ปลายทางโดยอัตโนมัติหากไม่มีอยู่?","Custom bat path to run after each conversion (leave blank if not using):":"เส้นทางค้างคาวที่กำหนดเองเพื่อเรียกใช้หลังจากการแปลงแต่ละครั้ง (ปล่อยว่างไว้หากไม่ได้ใช้):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"ป้อนเส้นทางไปยังไฟล์แบตช์ที่กำหนดเองซึ่งคุณต้องการดำเนินการหลังจากการแปลงแต่ละครั้ง ตัวอย่างเช่น:","Batch files with timeout statements won't work. More info here:":"ไฟล์แบตช์ที่มีคำสั่งหมดเวลาใช้งานจะไม่ทำงาน ข้อมูลเพิ่มเติมที่นี่:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"เว้นช่องว่างไว้โดยสิ้นเชิงหากคุณไม่ต้องการใช้ตัวเลือกนี้ (ตรวจสอบให้แน่ใจว่าไม่มีตัวอักษรที่ซ่อนอยู่ในกล่อง)","Run processes at low priority?":"เรียกใช้กระบวนการที่มีลำดับความสำคัญต่ำหรือไม่","All conversion processes will be run at low priority, reducing processor usage.":"กระบวนการแปลงทั้งหมดจะทำงานที่ลำดับความสำคัญต่ำลดการใช้งานตัวประมวลผล","Remove apostrophes from filenames:":"ลบ apostrophes ออกจากชื่อไฟล์:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"การสแกน / การตรวจสอบการแปลงสุขภาพอาจล้มเหลวหากชื่อไฟล์มีเครื่องหมายอะโพสโทรฟีอยู่เลือกตัวเลือกนี้เพื่อลบเครื่องหมายอะพอสโทรฟีออกจากชื่อไฟล์โดยอัตโนมัติ"," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"คุณสมบัตินี้สามารถสแกนหาไฟล์วิดีโอที่เสียหายโดยใช้คุณสมบัติ '--scan' ของ HandBrake แม้ว่าจะไม่ถูกต้องเสมอไป นอกจากนี้ยังใช้ FFprobe เพื่อระบุจุดอ้างอิงที่สอง หากทั้ง FFprobe และ HandBrake ล้มเหลวก็มีโอกาสสูงที่ไฟล์จะเสียหาย","Move corrupt files into the following folder:":"ย้ายไฟล์ที่เสียหายไปยังโฟลเดอร์ต่อไปนี้:"," If checked, then any files which give errors will be moved into the specified folder.":"หากเลือกตัวเลือกนี้ไฟล์ที่มีข้อผิดพลาดจะถูกย้ายไปยังโฟลเดอร์ที่ระบุ","Corrupt file folder:":"โฟลเดอร์ไฟล์เสียหาย:","Run thorough file health check:":"เรียกใช้การตรวจสอบความสมบูรณ์ของไฟล์อย่างละเอียด:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"หากเลือกตัวเลือกนี้จะมีการเรียกใช้การตรวจสอบวิดีโอที่ละเอียดและช้ากว่ามากโดยใช้ FFmpeg แทน HandBrake"," Based on Desani's 'ScanMedia.ps1' found at:":"ตาม 'ScanMedia.ps1' ของ Desani ที่:","Attempt to repair files after thorough check:":"พยายามซ่อมแซมไฟล์หลังจากตรวจสอบอย่างละเอียด:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"หากทำเครื่องหมายไว้ HBBatchBeast จะพยายามซ่อมแซมไฟล์โดยใช้ FFmpeg ไฟล์ใหม่ที่มีคำต่อท้าย '_repaired' จะถูกสร้างขึ้นในโฟลเดอร์เดียวกับไฟล์ต้นฉบับ","'CRF' value to use when attempting to repair files:":"ค่า 'CRF' ที่จะใช้เมื่อพยายามซ่อมแซมไฟล์:","The default 'CRF' value is 23. Please see the following for more information:":"ค่า 'CRF' เริ่มต้นคือ 23 โปรดดูข้อมูลเพิ่มเติมต่อไปนี้:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"ช่วงของสเกล CRF คือ 0–51 โดยที่ 0 คือ lossless, 23 คือค่าเริ่มต้นและ 51 เป็นคุณภาพที่แย่ที่สุด โดยทั่วไปแล้วค่าที่ต่ำกว่าจะนำไปสู่คุณภาพที่สูงขึ้นและช่วงของสติที่เป็นอัตวิสัยคือ 17–28 พิจารณา 17 หรือ 18 ว่าจะสูญเสียการมองเห็นหรือเกือบเป็นเช่นนั้น ควรมีลักษณะเหมือนหรือเกือบเหมือนอินพุต แต่ไม่สูญเสียทางเทคนิค","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast บันทึกรายการพา ธ ของไฟล์ที่สแกนที่รายงานว่าไม่เสียหาย ล้างแคชเพื่อทำการสแกนใหม่ในไฟล์ทั้งหมด","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"จำนวนอินสแตนซ์ของ HandBrake / FFmpeg พร้อมกันที่จะใช้? (แนะนำ 4 หรือน้อยกว่า):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"การตั้งค่านี้ใช้กับทั้งกระบวนการ \"ตรวจสุขภาพวิดีโอ\" และ \"สแกนและแปลง\" ระบุจำนวนเธรดของ HandBrake ที่จะใช้ ไม่มีค่าสูงสุดถึงแม้ว่าจะไม่แนะนำให้ใช้มากกว่า 4 จำนวนที่สูงกว่าอาจทำให้คอมพิวเตอร์ของคุณค้างได้หากไม่แรงมาก","Queue size view limit?(Recommended 1000 or fewer):":"ขีด จำกัด การดูขนาดคิว (แนะนำ 1,000 หรือน้อยกว่า):","Automatically start \"Scan and convert\" when program opened?:":"เริ่ม \"สแกนและแปลง\" โดยอัตโนมัติเมื่อเปิดโปรแกรมหรือไม่:","Save verbose logs?:":"บันทึกบันทึก verbose?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"เลือกเช็คบ็อกซ์นี้เพื่อบันทึกบันทึกกระบวนการย่อยโดยละเอียด ซึ่งรวมถึง ouput คอนโซลผู้ปฏิบัติงาน นี่จะทำให้บันทึกมีขนาดใหญ่มาก","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"กรอกรายละเอียดอีเมลเพื่อรับการแจ้งเตือนทางอีเมลหากพบข้อผิดพลาดระหว่างการตรวจสุขภาพหรือการแปลง / ดูโฟลเดอร์ จะไม่ทำงานกับบัญชีที่ต้องใช้ 2FA คุณต้องเปิดใช้งานการเข้าถึงแอปที่ปลอดภัยน้อยกว่าในบัญชี Gmail","Email address:":"ที่อยู่อีเมล:","For example:":"ตัวอย่างเช่น:","Email password(not saved):":"รหัสผ่านอีเมล (ไม่ได้บันทึก):","SMTP server:":"เซิร์ฟเวอร์ SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"คุณสมบัตินี้ช่วยให้สามารถตรวจสอบสถานะการแปลง / สถานะการตรวจสุขภาพโดยใช้เว็บเบราว์เซอร์ใดก็ได้ มีประโยชน์เมื่อใช้เซิร์ฟเวอร์ ฯลฯ ไม่มีการส่งชื่อไฟล์","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"หากเปิดใช้งานข้อมูลที่ไม่ระบุชื่อต่อไปนี้จะถูกส่งไปยัง HBBatchBeast.io:","API key":"รหัส API","Current status ('Searching', 'Running', 'Finished' etc)":"สถานะปัจจุบัน ('ค้นหา', 'กำลังทำงาน', 'เสร็จสิ้น' ฯลฯ )","Number of:":"จำนวน:","Remaining items":"รายการที่เหลืออยู่","Successful items":"รายการที่ประสบความสำเร็จ","Errored items":"รายการที่มีข้อผิดพลาด","Cancelled items":"รายการที่ถูกยกเลิก","Worker percentages":"เปอร์เซ็นต์คนงาน","Last completed item time":"เวลารายการเสร็จสมบูรณ์ล่าสุด","Enable remote monitoring?:":"เปิดใช้งานการตรวจสอบระยะไกลหรือไม่:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"ยูทิลิตี้การเปรียบเทียบพื้นฐานที่สร้างขึ้นเพื่อดูว่าโปรเซสเซอร์ 16+ คอร์ทำงานอย่างไรโดยใช้ HandBrake อินสแตนซ์หลายตัวแม้ว่ามันจะสามารถทำงานกับโปรเซสเซอร์ชนิดใดก็ได้","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"สิ่งนี้จะทำการดาวน์โหลดไฟล์ตัวอย่าง h265 4k (2.5MB) และเรียกใช้เกณฑ์มาตรฐานโดยใช้อินสแตนซ์ของ HandBrake 4 ตัวพร้อมพรีเซ็ต \"Very Fast 1080p30\" ที่ตั้งไว้ล่วงหน้า","Results can be uploaded to hbbatchbeast.io if you choose.":"ผลลัพธ์สามารถอัปโหลดไปยัง hbbatchbeast.io หากคุณเลือก","Queue":"คิว","Output this session":"เอาท์พุทเซสชั่นนี้","Media info viewer tool":"เครื่องมือดูข้อมูลสื่อ","View replaced file cache":"ดูไฟล์แคชที่ถูกแทนที่","Clear replaced file cache":"ล้างแคชไฟล์ที่แทนที่","Save config":"บันทึกการกำหนดค่า","Scan only":"สแกนเท่านั้น","Scan and convert":"สแกนและแปลง","View scan/conversion summary log":"ดูบันทึกสรุปการสแกน / การแปลง","View individual file check/conversion log":"ดูแต่ละไฟล์ตรวจสอบ / บันทึกการแปลง","View worker console output":"ดูเอาต์พุตคอนโซลผู้ปฏิบัติงาน","Health check":"ตรวจสุขภาพ","Clear healthy file cache":"ล้างแคชไฟล์เพื่อสุขภาพ","View error log":"ดูบันทึกข้อผิดพลาด","Email test":"ทดสอบอีเมล์","View master log":"ดูบันทึกหลัก","Wiki help":"ช่วยวิกิ","An application by HaveAGitGat":"แอปพลิเคชันโดย HaveAGitGat","New":"ใหม่","Launch":"เปิด","Benchmark":"เกณฑ์มาตรฐาน","See results":"ดูผลลัพธ์","Pause queue":"หยุดคิวชั่วคราว","Continue queue":"ต่อคิว","Stop queue":"หยุดคิว","Convert selected files":"แปลงไฟล์ที่เลือก","Toggle queue view":"สลับมุมมองคิว","Deselect all":"ยกเลิกการเลือกทั้งหมด","Invert all":"กลับทั้งหมด","Select all":"เลือกทั้งหมด","Toggle output view":"สลับมุมมองเอาต์พุต"}