{
    "The number of custom presets does not match the number of source folders!": "Ang bilang ng mga custom na preset ay hindi tumutugma sa bilang ng mga folder ng pinagmulan!",
    "source folders have been detected.": "Nakita ang mga pinagmulang folder.",
    "custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.": "Napansin ang mga pasadyang preset na linya. Paki-double check para sa mga hindi nakikitang line break. Dapat mayroong isang path ng folder o preset bawat linya. Tiyaking hindi mo sinasadyang lumikha ng isang blangko na linya.",
    "The number of filename suffixes does not match the number of source folders! ": "Ang bilang ng mga suffix ng filename ay hindi tumutugma sa bilang ng mga folder ng mapagkukunan!",
    "filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.": "Natagpuan ang mga linya ng suffix ng filename. Paki-double check para sa mga hindi nakikitang line break. Dapat mayroong isang path ng folder o filename suffix bawat linya. Tiyaking hindi mo sinasadyang lumikha ng isang blangko na linya.",
    "The number of source folders does not match the number of destination folders!": "Ang bilang ng mga pinagmulang folder ay hindi tumutugma sa bilang ng mga destination folder!",
    "destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "napansin ang mga destination folder. Paki-double check para sa mga hindi nakikitang line break. Dapat mayroong isang path ng folder sa bawat linya. Tiyaking hindi mo sinasadyang lumikha ng isang blangko na linya.",
    "The number of source folders does not match the number of temporary conversion folders!": "Ang bilang ng mga pinagmumulan ng mga folder ay hindi tumutugma sa bilang ng pansamantalang mga folder ng conversion!",
    "temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.": "Nakita ang mga pansamantalang mga folder ng conversion. Paki-double check para sa mga hindi nakikitang line break. Dapat mayroong isang path ng folder sa bawat linya. Tiyaking hindi mo sinasadyang lumikha ng isang blangko na linya.",
    "Please enter a valid container such as '.mp4'. Make sure to include the '.'": "Mangyaring maglagay ng wastong lalagyan tulad ng '.mp4'. Tiyaking isama ang '.'",
    "Corrupt file folder": "Nasira ang folder ng file",
    "does not exist! Please make sure there are no spaces or hidden characters before/after the path": "ay hindi umiiral! Mangyaring tiyaking walang mga espasyo o nakatagong mga character bago / pagkatapos ng landas",
    "Source folder": "Folder ng pinagmulan",
    "Temporary conversion folder": "Pansamantalang folder ng conversion",
    "appears to be the same as or is within source folder": "Lumilitaw na kapareho ng o nasa loob ng folder ng pinagmulan",
    "which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "na kung saan ay maiwasan ang HBBatchBeast mula sa gumagana ng tama. Mangyaring baguhin ang pansamantalang folder ng conversion sa isang folder sa labas ng folder ng pinagmulan. Kung nais mong gamitin ang 'Palitan ang orihinal na mga tampok ng mga file', mangyaring pumili ng destination folder na hindi katulad ng, o sa loob, sa folder ng pinagmulan, at pagkatapos ay suriin ang checkbox na 'Palaging palitan ang mga orihinal na file' sa seksyon ng mga advanced na setting . Alisin ang tsek sa checkbox na pansamantalang 'Temporary conversion folder' dahil hindi ito magamit sa kasong ito. Ang mga file ay i-convert sa destination folder at pagkatapos ay inilipat pabalik sa source folder.",
    "Destination folder": "Destination folder",
    "which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.": "na kung saan ay maiwasan ang HBBatchBeast mula sa gumagana ng tama. Mangyaring baguhin ang destination folder sa isang folder sa labas ng folder ng pinagmulan. Kung nais mong gamitin ang 'Palitan ang orihinal na mga tampok ng mga file', mangyaring pumili ng destination folder na hindi katulad ng, o sa loob, sa folder ng pinagmulan, at pagkatapos ay suriin ang checkbox na 'Palaging palitan ang mga orihinal na file' sa seksyon ng mga advanced na setting . Alisin ang tsek sa checkbox na pansamantalang 'Temporary conversion folder' dahil hindi ito magamit sa kasong ito. Ang mga file ay i-convert sa destination folder at pagkatapos ay inilipat pabalik sa source folder.",
    "Error creating temporary conversion folder": "Error sa paglikha ng pansamantalang folder ng conversion",
    "Error creating destination folder": "Error sa paglikha ng destination folder",
    "Please select to use HandBrake or FFmpeg!": "Mangyaring piliin upang gamitin ang HandBrake o FFmpeg!",
    "Please select a standard preset or input a custom one!": "Mangyaring pumili ng standard na preset o mag-input ng pasadyang isa!",
    "Please select a scan interval of 5 seconds or greater!": "Mangyaring pumili ng pagitan ng pag-scan ng 5 segundo o higit pa!",
    "Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!": "Mangyaring siguraduhin na ang bilang ng mga sabay-sabay na HandBrake / FFmpeg mga pagkakataon na gamitin ay isa o mas mataas!",
    "Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.": "Di-wastong API key! Paki-click ang 'Bago' sa remote monitoring tab upang makabuo ng isang bagong key.",
    "Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)": "Mangyaring maglagay ng pang-araw-araw na oras ng pag-scan sa format na 24 oras: hh: mm (halimbawa 13:02)",
    "SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!": "ANG SOURCE FILES AY NAWALA NA PAGKATAPOS NG PAGKAKAROON! Mangyaring subukan bago tamang paggamit!",
    "Benchmark failed!": "Nabigo ang benchmark!",
    "Log does not exist!": "Hindi umiiral ang pag-log!",
    "Folder does not exist!": "Ang folder ay hindi umiiral!",
    "Error sending email! Please check your settings.": "Error sa pagpapadala ng email! Mangyaring suriin ang iyong mga setting.",
    "Test email sent!": "Nagpadala ng email sa pagsubok!",
    "All worker processes have been stopped.": "Ang lahat ng mga proseso ng manggagawa ay tumigil.",
    "Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?": "I-pause ang queue kapag natapos na ang kasalukuyang mga item sa pagproseso. Sigurado ka bang gusto mong i-pause ang queue?",
    "Queue pause initiated.'Continue' button will appear once all workers have paused.": "Itigil ang queue na pinasimulan. Ang pindutan ng 'Magpatuloy' ay lilitaw kapag ang lahat ng mga manggagawa ay naka-pause.",
    "Healthy file cache cleared!": "Naka-clear ang malinis na cache ng file!",
    "Cache cleared!": "Nabura ang cache!",
    "Cancel item": "Kanselahin ang item",
    "Please check the above checkbox to use this feature.": "Mangyaring suriin ang checkbox na nasa itaas upang magamit ang tampok na ito.",
    "Configuration": "Configuration",
    "Source folders": "Mga pinagmulang folder",
    "This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:": "Ito ang pinagmulan folder na i-scan para sa media. Ang folder ay kailangang maipasok nang walang sumusunod na slash. Halimbawa:",
    "The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:": "Ang kahon ng path ng mapagkukunan ng folder ay napapalawak (pindutin ang enter upang lumikha ng isang bagong linya). Kung nais mong tukuyin ang maramihang mga folder ng pinagmulan, siguraduhin na ang bawat path ng pinagmulan folder ay nasa sarili nitong linya tulad ng:",
    "Video health check": "Check sa kalusugan ng video",
    "Batch conversion and Folder watching": "Batch conversion at Folder watching",
    "Remote Monitoring (Beta)": "Remote Pagsubaybay (Beta)",
    "Benchmark (Beta)": "Benchmark (Beta)",
    "System": "System",
    "Help": "Tulong",
    "Temporary conversion folders": "Pansamantalang mga folder ng conversion",
    "If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.": "Kung \"Pansamantalang folder ng conversion?\" ay naka-check, pagkatapos ay i-convert ng HandBrake ang mga file sa folder na iyon. Sa sandaling tapos na ang conversion, ang file ay ililipat sa iyong \"Destination folder\". Kakailanganin mong tukuyin ang maraming pansamantalang mga folder ng conversion bilang mga folder ng pinagmulan. Ang iyong unang pinagmulang folder ay babaguhin sa iyong unang pansamantalang folder ng conversion, ang iyong pangalawang mapagkukunan na folder sa iyong ikalawang pansamantalang conversion folder at iba pa. Siguraduhin na ang bawat pansamantalang landas ng folder ng conversion ay nasa sarili nitong linya.",
    "Destination folders": "Mga destination folder",
    "Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.": "Tukuyin ang mga destination path ng folder. Muli, kakailanganin mong tukuyin ang maraming mga destination folder bilang mga folder ng pinagmulan. Ang mga file mula sa iyong unang pinagmulan na folder ay magtatapos sa iyong unang patutunguhang folder, ang iyong pangalawang mga file ng folder ng pinagmulan sa iyong pangalawang destination folder at iba pa.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder": "Unang pinagmulan folder ---------> Unang pansamantalang conversion folder ---------> Unang destination folder",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder": "Second source folder ---------> Pangalawang pansamantalang conversion folder ---------> Ikalawang destination folder",
    "etc": "atbp",
    "HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ": "Ang HBBatchBeast ay hindi gagana ng maayos kung itinakda mo ang patutunguhang folder na kapareho ng, o sa loob, sa folder ng pinagmulan.",
    "Standard preset:": "Standard preset:",
    "Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:": "Piliin ang preset ng HandBrake na nais mong i-convert ang iyong mga file. Kung ang \"Standard preset\" ay pinili, pagkatapos ay ang lahat ng mga file sa mga napiling mga folder ay mababago gamit ang tinukoy na preset ng HandBrake. Maaari kang makahanap ng higit pa tungkol sa mga preset ng HandBrake dito:",
    "Custom preset:": "Pasadyang preset:",
    "If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:": "Kung ang \"Pasadyang preset\" pagkatapos ay kailangan mong ipasok ang iyong sariling pasadyang preset. Sinasaklaw ng HBBatchBeast ang \"HandBrakeCLI -i source -o destination\" na bahagi ng input ng HandBrakeCLI kaya kailangan mong ipasok ang mga parameter ng conversion. Halimbawa:",
    "If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:": "Kung gumagamit ng FFmpeg, kailangan mong paghiwalayin ang mga parameter ng input at output na may kuwit. Tulad ng:",
    "You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:": "Maaari mo ring i-link sa isang custom na preset na na-export mula sa opisyal na application ng HandBrake GUI halimbawa:",
    "If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:": "Kung nagkakaproblema ka sa mga custom na preset, maaaring ito ay dahil sa isang kilalang bug sa HandBrakeCLI (maayos sa susunod na release ng HandBrakeCLI). Mangyaring tingnan ito para sa pansamantalang solusyon:",
    "Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.": "Ang bawat pasadyang preset ay kailangang nasa sarili nitong linya at, katulad ng mga folder, kailangang mayroong maraming custom na preset bilang mga folder ng pinagmulan.",
    "First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1": "Unang pinagmulan folder ---------> Unang pansamantalang conversion folder ---------> Unang destination folder @ Pasadyang preset 1",
    "Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2": "Second source folder ---------> Pangalawang pansamantalang conversion folder ---------> Ikalawang destination folder @ Pasadyang preset 2",
    "See the following image for guidance:": "Tingnan ang sumusunod na larawan para sa patnubay:",
    "If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.": "Kung gumagamit ng encoding ng graphics card (tulad ng NVENC), maaaring kailangan mong bawasan ang bilang ng mga pagkakataon sa HandBrake (subukan 2 o mas kaunti) dahil sa mga limitasyon ng VRAM.",
    "Select standard preset:": "Piliin ang standard na preset:",
    "NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.": "Natuklasan ng NVENC, siguraduhing babaan ang bilang ng mga kaso ng HandBrakeCLI sa 2 o sa ibaba (para sa karamihan ng mga graphics card) o maaaring makatagpo ka ng mga error dahil sa hindi sapat na VRAM. Ang setting na ito ay matatagpuan sa tab na \"System\".",
    "Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:": "Nakita ang na-import na preset. Kung nagkakaproblema ka sa na-import na custom na preset, maaaring ito ay dahil sa isang kilalang bug sa HandBrakeCLI (maaayos sa susunod na release ng HandBrakeCLI). Ang pansamantalang solusyon ay ang alisin ang \"\" PictureRotate \":\" 0: 0 \"'mula sa. Json file. Higit pang impormasyon dito:",
    "Container:": "Lalagyan:",
    "Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:": "Tukuyin ang lalagyan na gusto mo ang output file na magkaroon ng tulad ng '.mp4'. Maaari mong malaman ang higit pa tungkol sa mga lalagyan sa:",
    "Enable periodic scanning:": "Paganahin ang panaka-scan na:",
    "HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.": "Maaaring masubaybayan ng HBBatchBeast ang iyong mga folder ng mapagkukunan at magpatakbo ng mga pag-scan para sa mga bagong file sa isang tinukoy na agwat. Ang oras ng agwat ay nasa segundo na ang default ay 300 segundo (5 minuto). Kung pinili ang pagpipiliang ito, pagkatapos ay kapag pinindot mo ang \"I-scan at i-convert\", ang programa ay magko-convert ng anumang mga bagong file at magsisimula ang countdown timer. Ito ay magiging walang katapusan hanggang tumigil. Ang agwat ng pag-scan ay nasa seksyon ng mga advanced na setting.",
    "Enable daily scanning:": "Paganahin ang araw-araw na pag-scan:",
    "Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.": "Sa halip na panaka-nakang pag-scan, maaari kang pumili para sa isang pag-scan na tatakbo nang isang beses sa isang araw. Ang oras ng pag-scan ay ipinasok sa seksyon ng mga advanced na setting sa hh: mm na format tulad ng '18: 30 '. Kapag ang \"Scan and convert\" ay pinili, ang programa ay maghihintay hanggang sa tinukoy na oras hanggang sa magpatakbo ng proseso ng pag-scan at conversion. Muli, ito ay mag-loop walang hanggan hanggang tumigil.",
    "Show/hide advanced:": "Ipakita / itago ang mga advanced na:",
    "Scan interval (minimum 5 seconds):": "I-scan ang pagitan (minimum na 5 segundo):",
    "Daily run time (hh:mm):": "Pang-araw-araw na run time (hh: mm):",
    "Output filename suffix:": "Output filename suffix:",
    "This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.": "Ito ay opsyonal. Maaari mong tukuyin ang isang suffix upang idagdag sa dulo ng iyong filename tulad ng '_1080p' o '_testconversion' atbp.",
    "If 'standard preset' is selected then all output files will have the same suffix.": "Kung ang 'standard preset' ay pinili, ang lahat ng mga output file ay magkakaroon ng parehong suffix.",
    "If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:": "Kung ang 'pasadyang preset' ay pinili pagkatapos ay maaari mong tukuyin ang isang suffix bawat pinagmulan folder / pasadyang preset. Tiyaking ang bawat suffix ay nasa sarili nitong linya. Halimbawa, kung mayroon kang dalawang mga folder ng mapagkukunan at gumagamit ng 'custom preset', maaari mong ilagay ito sa kahon ng suffix ng filename:",
    "Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.": "Ang mga file sa folder ng unang pinagmulan ay may '_720p' na idinagdag sa filename na output. Ang mga file sa folder ng pangalawang pinagmulan ay magkakaroon ng '_1080p' na idinagdag sa output filename atbp.",
    "Include these file types:": "Isama ang mga uri ng file na ito:",
    "Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:": "Ipasok ang mga uri ng file upang i-scan para sa. Ang bawat uri ay kailangang ihiwalay ng kuwit. Ang default na entry ay:",
    "Exclude files smaller than (MB):": "Ibukod ang mga file na mas maliit sa (MB):",
    "Specify whether to exclude files smaller than a certain size from conversion (in megabytes)": "Tukuyin kung ibubukod ang mga file na mas maliit kaysa sa isang sukat mula sa conversion (sa megabytes)",
    "Exclude files larger than (MB):": "Ibukod ang mga file na mas malaki sa (MB):",
    "Specify whether to exclude files larger than a certain size from conversion (in megabytes)": "Tukuyin kung ibubukod ang mga file na mas malaki kaysa sa isang sukat mula sa conversion (sa megabytes)",
    "Exclude filenames which include any of these words:": "Ibukod ang mga filename na kinabibilangan ng alinman sa mga salitang ito:",
    "Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:": "Maglagay ng mga keyword upang mai-filter kapag nag-scan para sa mga file. Halimbawa, kung ipinasok ang \"720p\", ang anumang mga file na may \"720p\" sa pamagat ay hindi mapapalitan. Muli, ang mga keyword ay kailangang ihiwalay ng isang kuwit. Halimbawa, ipasok ang sumusunod sa kahon ng filter:",
    "Include files with any ": "Isama ang mga file sa anumang",
    " or all ": "o lahat",
    " of these": "ng mga ito",
    "properties:": "ari-arian:",
    "Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:": "Dito maaari kang mag-input ng mga pag-aari ng video at audio na mayroon ang mga file upang ma-convert (impormasyon nakuha gamit ang FFprobe). Ang mga katangian ay dapat na pinaghiwalay ng isang kuwit. Gamitin ang media viewer tool tool upang makatulong na matukoy kung anong mga katangian ang nais mong isama. Tiyaking maglagay ng kuwit pagkatapos ng huling ari-arian. Halimbawa, upang i-convert lamang ang mga file na naka-encode gamit ang h264 at aac stereo audio:",
    "It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.": "Mahalagang tandaan na ang check ng ari-arian na ito ay tapos na sa sandaling magsimula ang proseso ng conversion (upang makatipid ng oras habang binubuo ang queue), kaya kahit na ang mga file ay maaaring lumitaw sa queue ng conversion, malalampasan ang mga ito / kasama kung tama ang mga kundisyon.",
    "If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.": "Kung ang FFprobe ay makakakuha ng mga katangian, ang isang 'OK' ay lilitaw sa haligi ng \"FFprobe\" sa view ng queue.",
    "Exclude files with any ": "Ibukod ang mga file sa alinman",
    " of these ": "ng mga ito",
    "The opposite of 'Include files with any or all of these properties'": "Ang kabaligtaran ng 'Isama ang mga file sa anuman o lahat ng mga pag-aari na ito'",
    "This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:": "Ito ay isang maliit na tool upang pag-aralan ang mga katangian ng file upang matulungan kang matukoy kung aling mga katangian ang nais mong isama / ibukod sa mga pagpipilian sa itaas. Ginagamit nito ang FFprobe upang bumalik sa impormasyon. I-drag at i-drop ang mga file sa gray na kahon upang pag-aralan ang mga ito. Halimbawa, ang pag-drop sa isang test file ay maaaring ibalik ang mga sumusunod:",
    "If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:": "Kung naghahanap ka upang ibukod ang mga file na tulad nito mula sa pagiging convert, pagkatapos ay maaari kang maglagay ng maraming mga katangian ng file sa \"Ibukod ang mga file sa anumang o lahat ng mga property na ito\" na kahon at suriin ang checkbox sa tabi ng 'lahat' sa halip na 'anumang', tulad nito:",
    "Copy excluded files to destination:": "Kopyahin ang mga ibinukod na file sa patutunguhan:",
    "If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:": "Kung pipiliin mo ang pagpipiliang ito, ang mga file na ibinukod mula sa conversion ay direktang makopya sa destination folder. Nalalapat ito sa mga sumusunod na filter:",
    "Exclude filenames which include any of these words": "Ibukod ang mga filename na kasama ang alinman sa mga salitang ito",
    "Include files with any or all of these properties": "Isama ang mga file sa anuman o lahat ng mga pag-aari na ito",
    "Exclude files with any or all of these properties": "Ibukod ang mga file sa anuman o lahat ng mga pag-aari na ito",
    "Exclude files smaller than (MB)": "Ibukod ang mga file na mas maliit sa (MB)",
    "Exclude files larger than (MB)": "Ibukod ang mga file na mas malaki sa (MB)",
    "Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.": "Tandaan na ito ay nalalapat din sa mga file na ibinukod dahil hindi nila natutugunan ang mga kondisyon ng \"Isama\" ng mga bagay sa itaas nang sa gayon ay hindi sinasadyang kopyahin ang iyong buong library kapag sinusubukan mo lamang i-convert ang ilang mga file.",
    "The copy feature does not apply to the following filters (i.e. files excluded due to the filter)": "Ang tampok na kopya ay hindi nalalapat sa mga sumusunod na filter (ibig sabihin, mga file na hindi kasama dahil sa filter)",
    "Include these file types": "Isama ang mga uri ng file na ito",
    "Delete source files after conversion:": "Tanggalin ang mga file ng pinagmulan pagkatapos ng conversion:",
    "If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.": "Kung ito ay napili, pagkatapos kung matagumpay ang pagtatangka ng conversion, matatanggal ang source file. Ang prosesong ito ay tapos na sa pinakadulo, pagkatapos ng conversion ng lahat ng mga file. Nangangahulugan ito na maaari mong i-convert ang parehong mga file ng pinagmulan gamit ang maramihang mga preset, lahat sa isang pumunta. Pagkatapos ay tatanggalin ang mga file ng pinagmulan.",
    "Replace original file if converted file is smaller?(Compress attempt)": "Palitan ang orihinal na file kung mas maliit ang na-convert na file (Compress attempt)",
    "Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.": "Piliin ang check box na ito kung nais mo ang HBBatchBeast upang awtomatikong palitan ang orihinal na source file kung mas maliit ang bagong file. Kung ang bagong file ay hindi mas maliit, pagkatapos ay iiwan ito sa destination folder.",
    "Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Tiyaking ang iyong destination folder ay hindi katulad ng / o sa loob, ang iyong pinagmulang folder o hindi ito gagana ng maayos.",
    "Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.": "Sa sandaling sinubukan ng HBBatchBeast na i-compress ang isang tukoy na file, idaragdag nito ang landas ng file sa isang cache upang hindi ito susubok muli sa hinaharap. Maaari mong tingnan / i-edit / i-clear ang cache gamit ang mga dilaw na pindutan.",
    "Replace original file always?": "Palaging palitan ang orihinal na file?",
    "The original file will be replaced regardless of whether the new file is larger or smaller.": "Ang orihinal na file ay papalitan anuman kung ang bagong file ay mas malaki o mas maliit.",
    "Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.": "Muli, tiyaking ang iyong destination folder ay hindi katulad ng / o sa loob, ang iyong pinagmulan folder o hindi ito gagana nang maayos.",
    "Copy subtitle (srt) files to destination?": "Kopyahin ang mga subtitle (srt) na mga file sa patutunguhan?",
    "Subtitle '.srt' files will be copied to the destination folder automatically.": "Ang mga file na subtitle '.srt' ay awtomatikong makopya sa patutunguhang folder.",
    "Automatically create temporary/destination folders if they don't exist?": "Awtomatikong lumikha ng pansamantalang / destination folder kung wala sila?",
    "Custom bat path to run after each conversion (leave blank if not using):": "Pasadyang bat path upang tumakbo pagkatapos ng bawat conversion (iwanan ang blangko kung hindi ginagamit):",
    "Input the path to a custom batch file which you'd like to execute after each conversion. For example:": "Ipasok ang landas sa isang pasadyang batch file na gusto mong isagawa pagkatapos ng bawat conversion. Halimbawa:",
    "Batch files with timeout statements won't work. More info here:": "Ang mga batch ng mga file na may mga pahayag ng timeout ay hindi gagana. Higit pang impormasyon dito:",
    "Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)": "Iwanan ang kahon na ganap na walang laman kung ayaw mong gamitin ang pagpipiliang ito (siguraduhing walang nakatagong mga character sa kahon)",
    "Run processes at low priority?": "Patakbuhin ang mga proseso sa mababang priyoridad?",
    "All conversion processes will be run at low priority, reducing processor usage.": "Ang lahat ng mga proseso ng conversion ay tatakbo sa mababang priyoridad, pagbabawas ng paggamit ng processor.",
    "Remove apostrophes from filenames:": "Alisin ang mga apostrophe mula sa mga filename:",
    "Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.": "Maaaring mabibigo ang mga pag-scan ng mga conversion / kalusugan kung ang mga filename ay may mga apostrophe. Suriin ito upang awtomatikong tanggalin ang mga apostrophe mula sa mga filename.",
    " This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.": "Ang tampok na ito ay maaaring i-scan para sa mga sira na mga file ng video gamit ang tampok na '--scan' ng HandBrake, bagaman ito ay hindi laging tumpak. Ginagamit din nito ang FFprobe upang magbigay ng pangalawang reference point. Kung ang parehong FFprobe at HandBrake ay mabibigo pagkatapos ay mayroong isang mataas na pagkakataon na ang file ay sira.",
    "Move corrupt files into the following folder:": "Ilipat ang mga sira na file sa sumusunod na folder:",
    " If checked, then any files which give errors will be moved into the specified folder.": "Kung naka-check, ang anumang mga file na nagbibigay ng mga error ay ililipat sa tinukoy na folder.",
    "Corrupt file folder:": "Kakaibang folder ng file:",
    "Run thorough file health check:": "Patakbuhin ang masusing pagsusuri ng kalusugan ng file:",
    " If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.": "Kung naka-check, pagkatapos ay magkano ang mas mabagal, mas masusing video check kalusugan ay tatakbo gamit ang FFmpeg sa halip ng HandBrake.",
    " Based on Desani's 'ScanMedia.ps1' found at:": "Batay sa 'ScanMedia.ps1' ni Desani na natagpuan sa:",
    "Attempt to repair files after thorough check:": "Subukan upang ayusin ang mga file pagkatapos ng masusing pagsusuri:",
    " If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.": "Kung nasuri, susubukan ng HBBatchBeast na ayusin ang mga file gamit ang FFmpeg. Ang isang bagong file na may suffix '_repaired' ay malilikha sa parehong folder bilang source file.",
    "'CRF' value to use when attempting to repair files:": "Halaga ng 'CRF' na gagamitin kapag sinusubukang i-repair ang mga file:",
    "The default 'CRF' value is 23. Please see the following for more information:": "Ang default na 'CRF' ay 23. Mangyaring tingnan ang mga sumusunod para sa karagdagang impormasyon:",
    "The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.": "Ang saklaw ng scale ng CRF ay 0-51, kung saan 0 ay walang pagkawala, 23 ang default, at 51 ang pinakamasamang kalidad. Ang isang mas mababang halaga sa pangkalahatan ay humahantong sa mas mataas na kalidad, at ang isang paksa na antas ng matalinong ay 17-28. Isaalang-alang ang 17 o 18 upang maging biswal na pagkawala o halos kaya; dapat itong magmukhang pareho o halos kapareho ng input ngunit ito ay hindi technically lossless.",
    "HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.": "Ang HBBatchBeast ay nagse-save ng isang listahan ng mga nai-scan na path ng file na iniulat bilang uncorrupt. I-clear ang cache upang magsagawa ng sariwang pag-scan sa lahat ng mga file.",
    "Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):": "Bilang ng mga sabay-sabay na paggamit ng HandBrake / FFmpeg? (Inirerekumendang 4 o mas kaunti):",
    "This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.": "Nalalapat ang setting na ito sa parehong mga \"Check sa kalusugan ng video\" at \"I-scan at i-convert\" ang mga proseso. Tukuyin kung gaano karaming mga thread ng HandBrake ang gagamitin. Walang maximum na kahit na ito ay inirerekomenda na hindi gumamit ng higit sa 4. Ang isang mas mataas na halaga ay maaaring i-freeze ang iyong computer kung ito ay hindi masyadong malakas.",
    "Queue size view limit?(Recommended 1000 or fewer):": "Limitahan ang view ng laki ng queue? (Inirerekumendang 1000 o mas kaunti):",
    "Automatically start \"Scan and convert\" when program opened?": "Awtomatikong magsimula \"I-scan at i-convert\" kapag binuksan ang programa?",
    "Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.": "Punan ang mga detalye ng email upang makatanggap ng mga abiso sa email kung nakaranas ng isang error sa panahon ng isang tseke sa kalusugan o panonood ng conversion / folder. Hindi gagana sa mga account na nangangailangan ng 2FA. Kailangan mong paganahin ang pag-access sa mga mas secure na apps sa mga Gmail account.",
    "Email address:": "Email address:",
    "For example:": "Halimbawa:",
    "Email password(not saved):": "Password ng email (hindi nai-save):",
    "SMTP server:": "SMTP server:",
    "This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.": "Ang tampok na ito ay nagbibigay-daan sa pagsubaybay ng katayuan ng pag-verify ng conversion / kalusugan gamit ang anumang web-browser. Kapaki-pakinabang kapag tumatakbo ang mga server atbp",
    "If enabled, the following anonymous data will be sent to HBBatchBeast.io:": "Kung pinagana, ang mga sumusunod na hindi nakikilalang data ay ipapadala sa HBBatchBeast.io:",
    "API key": "API key",
    "Current status ('Searching', 'Running', 'Finished' etc)": "Kasalukuyang katayuan ('Paghahanap', 'Pagpapatakbo', 'Tapos' atbp)",
    "Number of:": "Bilang ng:",
    "Remaining items": "Mga natitirang item",
    "Successful items": "Ang mga matagumpay na item",
    "Errored items": "Error sa mga item",
    "Cancelled items": "Kinansela ang mga item",
    "Worker percentages": "Mga porsyento ng manggagawa",
    "Last completed item time": "Huling nakumpleto na oras ng item",
    "Enable remote monitoring?:": "Paganahin ang remote monitoring:",
    "A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.": "Ang isang pangunahing benchmarking utility na binuo pangunahing upang makita kung paano 16 + core processors gumanap gamit ang maraming mga pagkakataon HandBrake bagaman maaari itong tumakbo sa anumang uri ng processor.",
    "This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"": "Mag-download ito ng h265 4k sample file (2.5MB) at magpatakbo ng isang benchmark gamit ang 4 na mga pagkakataon sa HandBrake na may preset na \"Very Fast 1080p30\"",
    "Results can be uploaded to hbbatchbeast.io if you choose.": "Maaaring i-upload ang mga resulta sa hbbatchbeast.io kung pipiliin mo.",
    "Queue": "Queue",
    "Output this session": "I-output ang sesyon na ito",
    "Media info viewer tool": "Tool ng viewer ng impormasyon ng media",
    "View compress attempt cache": "Tingnan ang cache ng compress pagtatangka",
    "Clear compress attempt cache": "I-clear ang cache ng pag-compress ng pag-compress",
    "Save config": "I-save ang config",
    "Scan only": "I-scan lamang",
    "Scan and convert": "I-scan at i-convert",
    "View scan/conversion summary log": "Tingnan ang pag-scan ng pag-scan / buod ng conversion",
    "View individual file check/conversion log": "Tingnan ang log ng tseke / conversion ng indibidwal na file",
    "View worker console output": "Tingnan ang output ng console ng manggagawa",
    "Health check": "Check ng kalusugan",
    "Clear healthy file cache": "I-clear ang cache ng malusog na file",
    "View error log": "Tingnan ang log ng error",
    "Email test": "Pagsubok ng email",
    "View master log": "Tingnan ang master log",
    "Wiki help": "Tulong sa Wiki",
    "An application by HaveAGitGat": "Isang application sa pamamagitan ng HaveAGitGat",
    "New": "Bago",
    "Launch": "Ilunsad",
    "Benchmark": "Benchmark",
    "See results": "Tingnan ang mga resulta",
    "Pause queue": "I-pause ang queue",
    "Continue queue": "Magpatuloy sa pila",
    "Stop queue": "Ihinto ang queue",
    "Convert selected files": "I-convert ang mga napiling file",
    "Toggle queue view": "I-toggle ang view ng queue",
    "Deselect all": "Alisin ang lahat",
    "Invert all": "Baligtarin ang lahat",
    "Select all": "Piliin lahat",
    "Toggle output view": "I-toggle ang view ng output"
}