{"The number of custom presets does not match the number of source folders!":"Özel ön ayarların sayısı, kaynak klasörlerin sayısına uymuyor!","source folders have been detected.":"kaynak klasörler algılandı.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"Özel önceden ayarlanmış çizgiler tespit edildi. Lütfen görünmeyen satır sonu olup olmadığını iki kez kontrol edin. Satır başına bir klasör yolu veya ön ayar bulunmalıdır. Yanlışlıkla boş bir satır oluşturmadığınızdan emin olun.","The number of filename suffixes does not match the number of source folders! ":"Dosya adı soneklerinin sayısı kaynak klasörlerin sayısıyla eşleşmiyor!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"dosya adı soneki satırları algılandı. Lütfen görünmeyen satır sonu olup olmadığını iki kez kontrol edin. Satır başına bir klasör yolu veya dosya adı soneki olmalıdır. Yanlışlıkla boş bir satır oluşturmadığınızdan emin olun.","The number of source folders does not match the number of destination folders!":"Kaynak klasörlerin sayısı hedef klasörlerin sayısına uymuyor!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"Hedef klasörler tespit edildi. Lütfen görünmeyen satır sonu olup olmadığını iki kez kontrol edin. Satır başına bir klasör yolu olmalıdır. Yanlışlıkla boş bir satır oluşturmadığınızdan emin olun.","The number of source folders does not match the number of temporary conversion folders!":"Kaynak klasörlerin sayısı geçici dönüşüm klasörlerinin sayısına uymuyor!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"geçici dönüşüm klasörleri tespit edildi. Lütfen görünmeyen satır sonu olup olmadığını iki kez kontrol edin. Satır başına bir klasör yolu olmalıdır. Yanlışlıkla boş bir satır oluşturmadığınızdan emin olun.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Lütfen '.mp4' gibi geçerli bir kapsayıcı girin. '' Eklediğinizden emin olun. '","Corrupt file folder":"Bozuk dosya klasörü","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"mevcut değil! Lütfen yoldan önce / sonra boşluk veya gizli karakter olmadığından emin olun","Source folder":"Kaynak dosya","Temporary conversion folder":"Geçici dönüşüm klasörü","appears to be the same as or is within source folder":"kaynak klasörle aynı veya içinde görünüyor","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"hangi HBBatchBeast düzgün çalışmasını engelleyecektir. Lütfen geçici dönüştürme klasörünü kaynak klasörün dışındaki bir klasöre değiştirin. 'Orijinal dosyaları değiştir' özelliğini kullanmak istiyorsanız, lütfen kaynak klasörle aynı veya içinde olmayan bir hedef klasör seçin ve ardından gelişmiş ayarlar bölümünde 'Orijinal dosyaları her zaman değiştir' onay kutusunu işaretleyin. . Geçici 'Geçici dönüşüm klasörü' onay kutusunun işaretini kaldırın, çünkü bu durumda hiçbir işe yaramayacak. Dosyalar hedef klasöre dönüştürülecek ve daha sonra kaynak klasöre taşınacaktır.","Destination folder":"Hedef klasör","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"hangi HBBatchBeast düzgün çalışmasını engelleyecektir. Lütfen hedef klasörü kaynak klasörün dışındaki bir klasöre değiştirin. 'Orijinal dosyaları değiştir' özelliğini kullanmak istiyorsanız, lütfen kaynak klasörle aynı veya içinde olmayan bir hedef klasör seçin ve ardından gelişmiş ayarlar bölümünde 'Orijinal dosyaları her zaman değiştir' onay kutusunu işaretleyin. . Geçici 'Geçici dönüşüm klasörü' onay kutusunun işaretini kaldırın, çünkü bu durumda hiçbir işe yaramayacak. Dosyalar hedef klasöre dönüştürülecek ve daha sonra kaynak klasöre taşınacaktır.","Error creating temporary conversion folder":"Geçici dönüşüm klasörü yaratılırken hata oluştu","Error creating destination folder":"Hedef klasör oluşturulurken hata oluştu","Please select to use HandBrake or FFmpeg!":"Lütfen El Freni veya FFmpeg!","Please select a standard preset or input a custom one!":"Lütfen standart bir ön ayar seçin veya özel bir giriş yapın!","Please select a scan interval of 5 seconds or greater!":"Lütfen 5 saniye veya daha büyük bir tarama aralığı seçin!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Lütfen kullanılacak eş zamanlı El Freni / FFmpeg örneklerinin sayısının bir veya daha fazla olduğundan emin olun!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Geçersiz API anahtarı! Yeni bir anahtar oluşturmak için lütfen uzaktan izleme sekmesindeki 'Yeni'yi tıklayın.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Lütfen 24 saat biçiminde günlük bir tarama süresi girin: ss: dd (örneğin 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"KAYNAK SONRASI KAYNAK DOSYALARI SİLECEK! Lütfen uygun kullanımdan önce test edin!","Benchmark failed!":"Karşılaştırma başarısız oldu!","Log does not exist!":"Günlük mevcut değil!","Folder does not exist!":"Klasör mevcut değil!","Error sending email! Please check your settings.":"E-posta gönderirken hata oluştu! Lütfen ayarlarınızı kontrol ediniz.","Test email sent!":"Test e-postası gönderildi!","All worker processes have been stopped.":"Tüm işçi işlemleri durduruldu.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Geçerli öğeler işlemeyi bitirdikten sonra sıra duraklatılır. Sırayı duraklatmak istediğinizden emin misiniz?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Sıra duraklatma başlatıldı. Tüm çalışanlar duraklatıldıktan sonra 'Devam Et' düğmesi görünecek.","Healthy file cache cleared!":"Sağlıklı dosya önbelleği temizlendi!","Cache cleared!":"Önbellek temizlendi!","Cancel item":"Ürünü iptal et","Please check the above checkbox to use this feature.":"Bu özelliği kullanmak için lütfen yukarıdaki onay kutusunu işaretleyin.","Configuration":"Yapılandırma","Source folders":"Kaynak klasörler","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Bu, medya için taranacak kaynak klasördür. Klasörün sonunda eğik çizgi olmadan girilmesi gerekir. Örneğin:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Kaynak klasör yolu kutusu genişletilebilir (yeni bir satır oluşturmak için enter tuşuna basın). Birden fazla kaynak klasör belirlemek istiyorsanız, her kaynak klasör yolunun aşağıdaki gibi kendi satırında olduğundan emin olun:","Video health check":"Video sağlık kontrolü","Batch conversion and Folder watching":"Toplu dönüştürme ve Klasör izleme","Remote Monitoring (Beta)":"Uzaktan İzleme (Beta)","Benchmark (Beta)":"Karşılaştırma (Beta)","System":"sistem","Help":"yardım et","Temporary conversion folders":"Geçici dönüşüm klasörleri","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Eğer \"Geçici dönüşüm klasörü?\" işaretliyse, El Freni dosyaları bu klasöre dönüştürür. Dönüşüm tamamlandığında, dosya \"Hedef klasörünüze\" taşınacaktır. Kaynak klasörler kadar geçici dönüşüm klasörü belirlemeniz gerekir. İlk kaynak klasörünüz ilk geçici dönüşüm klasörünüze, ikinci kaynak klasörünüz ikinci geçici dönüşüm klasörünüze vb. Dönüştürülür. Her geçici dönüştürme klasörü yolunun kendi satırında olduğundan emin olun.","Destination folders":"Hedef klasörler","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Hedef klasör yollarını belirtin. Yine, kaynak klasörler kadar çok hedef klasör belirlemeniz gerekir. İlk kaynak klasörünüzdeki dosyalar ilk hedef klasörünüze, ikinci kaynak klasörünüz ikinci hedef klasörünüzdeki vb.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"İlk kaynak klasör ---------> İlk geçici dönüşüm klasörü ---------> İlk hedef klasör","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"İkinci kaynak klasör ---------> İkinci geçici dönüşüm klasörü ---------> İkinci hedef klasör","etc":"vb","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"Hedef klasörü kaynak klasörle aynı veya içinde ayarlarsanız, HBBatchBeast düzgün çalışmaz.","Standard preset:":"Standart önceden ayarlanmış:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Dosyalarınızı dönüştürmek istediğiniz El Freni hazır ayarını seçin. \"Standart ön ayar\" seçili ise, seçilen klasörlerdeki tüm dosyalar belirtilen El Freni ön ayarı kullanılarak dönüştürülecektir. El Freni ön ayarları hakkında daha fazla bilgiyi burada bulabilirsiniz:","Custom preset:":"Özel önceden ayarlanmış:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"\"Özel ön ayar\" ise, kendi özel ön ayarınızı girmeniz gerekir. HBBatchBeast, HandBrakeCLI girişinin \"HandBrakeCLI - i kaynağı - hedef\" bölümünü kapsar, böylece dönüştürme parametrelerini girmeniz gerekir. Örneğin:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"FFmpeg kullanıyorsanız, giriş ve çıkış parametrelerini virgülle ayırmanız gerekir. Gibi:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Örneğin resmi El Freni GUI uygulamasından verilmiş olan özel bir önayarla da bağlantı kurabilirsiniz:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Özel ön ayarlarla ilgili sorun yaşıyorsanız, bu HandBrakeCLI ile ilgili bilinen bir hatadan kaynaklanıyor olabilir (bir sonraki HandBrakeCLI sürümünde düzeltilecektir). Geçici bir çözüm için lütfen buna bakın:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Her özel ön ayarın kendi satırında olması gerekir ve klasörlere benzer şekilde, kaynak klasörler kadar çok özel ön ayar olması gerekir.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"İlk kaynak klasör ---------> İlk geçici dönüşüm klasörü ---------> İlk hedef klasör @ Özel ön ayar 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"İkinci kaynak klasör ---------> İkinci geçici dönüşüm klasörü ---------> İkinci hedef klasör @ Özel ayar 2","See the following image for guidance:":"Rehberlik için aşağıdaki resme bakın:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Grafik kartı kodlaması kullanıyorsanız (NVENC gibi), VRAM sınırlamaları nedeniyle El Freni örneklerinin sayısını azaltmanız gerekebilir (2 veya daha az deneyin).","Select standard preset:":"Standart ön ayar seç:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC algılandı, lütfen HandBrakeCLI örneklerinin sayısını 2 veya altına düşürdüğünüzden emin olun (çoğu grafik kartı için), aksi halde VRAM yetersiz olduğundan hatalarla karşılaşabilirsiniz. Bu ayar \"Sistem\" sekmesinde bulunabilir.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Alınan ön ayar algılandı. Alınan özel ön ayarlarla ilgili sorun yaşıyorsanız, bu HandBrakeCLI ile ilgili bilinen bir hatadan kaynaklanıyor olabilir (bir sonraki HandBrakeCLI sürümünde düzeltilecektir). Geçici bir çözüm, \"\" PictureRotate \":\" 0: 0 \"'dosyasını .json dosyasından kaldırmaktır. Daha fazla bilgi burada:","Container:":"Konteyner:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Çıktı dosyasının '.mp4' gibi olmasını istediğiniz kabı belirtin. Kaplarda daha fazla bilgi bulabilirsiniz:","Enable periodic scanning:":"Periyodik taramayı etkinleştir:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast kaynak klasörlerinizi izleyebilir ve yeni dosyalar için belirli aralıklarla tarama yapabilir. Aralık süresi, saniye cinsinden 300 saniyedir (5 dakika). Bu seçenek işaretliyse, \"Tara ve dönüştür\" e bastığınızda, program yeni dosyaları dönüştürür ve geri sayım sayacı başlar. Bu, durdurulana kadar sonsuz bir şekilde dönecektir. Tarama aralığı gelişmiş ayarlar bölümündedir.","Enable daily scanning:":"Günlük taramayı etkinleştir:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Periyodik tarama yerine, taramanın günde bir kez çalıştırılmasını seçebilirsiniz. Tarama süresi gelişmiş ayarlar bölümüne ss: dd formatında '18: 30 'olarak girilir. \"Tara ve dönüştür\" seçildikten sonra, program bir tarama ve dönüştürme işlemi yürütene kadar belirtilen süreye kadar bekleyecektir. Yine, bu durdurulana kadar sonsuz döngüye girecek.","Show/hide advanced:":"Gelişmiş göster / gizle:","Scan interval (minimum 5 seconds):":"Tarama aralığı (en az 5 saniye):","Daily run time (hh:mm):":"Günlük çalışma süresi (ss: dd):","Output filename suffix:":"Çıktı dosya adı soneki:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Bu isteğe bağlıdır. Dosya adınızın sonuna '_1080p' veya '_testconversion' vb. Eklemek için bir sonek belirleyebilirsiniz.","If 'standard preset' is selected then all output files will have the same suffix.":"Eğer 'standart ön ayar' seçilirse, tüm çıktı dosyaları aynı son eke sahip olacaktır.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Eğer 'özel ön ayar' seçilmişse, kaynak klasör / özel ön ayar başına bir sonek belirleyebilirsiniz. Her son ekin kendi satırında olduğundan emin olun. Örneğin, 2 kaynak klasörünüz varsa ve 'custom preset' kullanıyorsanız, bunu dosya adı soneki kutusuna koyabilirsiniz:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"İlk kaynak klasördeki dosyalar çıktı dosya adına eklenecek '_720p' olacaktır. İkinci kaynak klasördeki dosyalar çıktı dosya adına vb. Eklenmiş '_1080p' olacaktır.","Include these file types:":"Bu dosya türlerini dahil et:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"Taranacak dosya türlerini girin. Her türün virgülle ayrılması gerekir. Varsayılan giriş:","Exclude files smaller than (MB):":"(MB) 'den küçük dosyaları hariç tut:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Belirli bir boyuttan daha küçük dosyaların dönüşümden çıkarılıp çıkarılmayacağını belirtin (megabayt olarak)","Exclude files larger than (MB):":"(MB) 'den daha büyük dosyaları hariç tut:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Belirli bir boyuttan daha büyük dosyaların dönüşümden çıkarılıp çıkarılmayacağını belirtin (megabayt olarak)","Exclude filenames which include any of these words:":"Bu kelimelerden herhangi birini içeren dosya adlarını hariç tutun:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Dosyaları tararken filtrelenecek anahtar kelimeleri girin. Örneğin, \"720p\" girilirse, başlıkta \"720p\" olan dosyalar dönüştürülmez. Yine, anahtar kelimelerin virgülle ayrılması gerekir. Örneğin, filtre kutusuna aşağıdakini girin:","Include files with any ":"Herhangi bir dosya ekle"," or all ":"veya hepsi"," of these":"bunların","properties:":"özellikleri:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Burada, dosyaların dönüştürülmesi için sahip olması gereken video ve ses özelliklerini girebilirsiniz (FFprobe kullanılarak elde edilen bilgiler). Özellikler virgülle ayrılmalıdır. Hangi özellikleri eklemek istediğinizi belirlemek için medya bilgisi görüntüleyici aracını kullanın. Son özellikten sonra virgül koyduğunuzdan emin olun. Örneğin, yalnızca h264 ve aac stereo ses kullanılarak kodlanmış dosyaları dönüştürmek için:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Bu özellik kontrolünün dönüştürme işlemi başladıktan sonra (sıra oluşturulurken zaman kazanmak için) yapıldığı, bu nedenle dosyalar dönüşüm kuyruğunda görünse de, doğru koşullar sağlandığında atlanır / dahil edilir.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"FFprobe özellikleri çıkarabiliyorsa, sıra görünümünde \"FFprobe\" sütununda bir 'Tamam' görünecektir.","Exclude files with any ":"Herhangi bir dosyadaki dosyaları hariç tut"," of these ":"bunların","The opposite of 'Include files with any or all of these properties'":"'Bu özelliklerden herhangi birine veya tümüne sahip dosyaları ekle'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Bu, yukarıdaki seçeneklere hangi özellikleri dahil etmek / hariç tutmak istediğinizi belirlemenize yardımcı olmak amacıyla dosya özelliklerini analiz etmek için kullanılan küçük bir araçtır. Bilgi döndürmek için FFprobe kullanır. Dosyaları analiz etmek için gri kutuya sürükleyip bırakın. Örneğin, bir test dosyasına bırakmak şunları geri getirebilir:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Bunun gibi dosyaların dönüştürülmesini engellemek istiyorsanız, \"Bu özelliklerden herhangi birini veya tümünü içeren dosyaları dışla\" kutusuna birkaç dosya özelliği koyabilir ve 'herhangi bir' yerine 'tümü' yanındaki onay kutusunu işaretleyebilirsiniz. bunun gibi:","Copy excluded files to destination:":"Dışlanan dosyaları hedefe kopyala:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Bu seçeneği seçerseniz, dönüşümden dışlanan dosyalar doğrudan hedef klasöre kopyalanır. Bu, aşağıdaki filtreler için geçerlidir:","Exclude filenames which include any of these words":"Bu kelimelerin herhangi birini içeren dosya adlarını hariç tut","Include files with any or all of these properties":"Bu özelliklerden herhangi birine veya tümüne sahip olan dosyaları dahil et","Exclude files with any or all of these properties":"Bu özelliklerden herhangi birine veya tümüne sahip olan dosyaları hariç tutun","Exclude files smaller than (MB)":"(MB) 'den küçük dosyaları hariç tut","Exclude files larger than (MB)":"(MB) 'den daha büyük dosyaları hariç tut","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Bunun, yukarıdakilerin \"Dahil Et\" özellik koşullarına uymadıkları için hariç tutulan dosyalar için de geçerli olduğunu unutmayın; bu nedenle, yalnızca birkaç dosyayı dönüştürmeye çalışırken yanlışlıkla kitaplığın tamamını kopyalamayın.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Kopyalama özelliği aşağıdaki filtreler için geçerli değildir (yani filtre nedeniyle hariç tutulan dosyalar)","Include these file types":"Bu dosya türlerini dahil et","Delete source files after conversion:":"Dönüştürmeden sonra kaynak dosyaları silin:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Bu seçilirse, bir dönüşüm denemesi başarılı olursa, kaynak dosya silinir. Bu işlem tüm dosyaların dönüştürülmesinden sonra yapılır. Bu, aynı kaynak dosyaları tek bir seferde birden fazla ön ayar kullanarak dönüştürebileceğiniz anlamına gelir. Kaynak dosyalar daha sonra silinecektir.","Replace original file if converted file is smaller?(Compress attempt)":"Dönüştürülen dosya daha küçükse orijinal dosyayı değiştirilsin mi? (Sıkıştırma girişimi)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Yeni dosya daha küçükse, HBBatchBeast ürününün orijinal kaynak dosyayı otomatik olarak değiştirmesini istiyorsanız bu onay kutusunu seçin. Yeni dosya daha küçük değilse, hedef klasörde bırakılacaktır.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Hedef klasörünüzün kaynak klasörünüzle aynı / veya içinde olmadığından emin olun, aksi halde düzgün çalışmaz.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"HBBatchBeast, belirli bir dosyayı sıkıştırmayı denediğinde, bu dosya yolunu önbelleğe ekler, böylece gelecekte tekrar denenmeyecek. Sarı düğmeleri kullanarak önbelleği görüntüleyebilir / düzenleyebilir / temizleyebilirsiniz.","Replace original file always?":"Orijinal dosyayı her zaman değiştir.","The original file will be replaced regardless of whether the new file is larger or smaller.":"Orijinal dosya, yeni dosyanın daha büyük veya küçük olmasına bakılmaksızın değiştirilecektir.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Yine, hedef klasörünüzün kaynak klasörünüzle aynı / veya aynı olmadığından emin olun, aksi halde düzgün çalışmaz.","Copy subtitle (srt) files to destination?":"Altyazı (srt) dosyalarını hedefe kopyala?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Altyazı '.srt' dosyaları otomatik olarak hedef klasöre kopyalanacaktır.","Automatically create temporary/destination folders if they don't exist?":"Varsa, otomatik olarak geçici / hedef klasörler oluştur?","Custom bat path to run after each conversion (leave blank if not using):":"Her dönüşümden sonra çalıştırılacak özel yarasa yolu (kullanılmıyorsa boş bırakın):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Her dönüşümden sonra yürütmek istediğiniz özel bir toplu iş dosyasının yolunu girin. Örneğin:","Batch files with timeout statements won't work. More info here:":"Zaman aşımı ifadeleri içeren toplu iş dosyaları çalışmaz. Daha fazla bilgi burada:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Bu seçeneği kullanmak istemiyorsanız, kutuyu tamamen boş bırakın (kutuda hiçbir gizli karakter olmadığından emin olun).","Run processes at low priority?":"İşlemleri düşük öncelikte çalıştır?","All conversion processes will be run at low priority, reducing processor usage.":"Tüm dönüşüm işlemleri düşük önceliğe sahip olacak ve işlemci kullanımını azaltacaktır.","Remove apostrophes from filenames:":"Kesme işaretlerini dosya adlarından kaldırın:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Dosya adları kesme işaretlerini içeriyorsa, dönüşümler / sağlık kontrolü taramaları başarısız olabilir."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Bu özellik, her zaman doğru olmasa da, HandBrake'in '--scan' özelliğini kullanarak bozuk video dosyalarını tarayabilir. Ayrıca ikinci bir referans noktası sağlamak için FFprobe kullanır. Hem FFprobe hem de El Freni arızalanırsa, dosyanın bozuk olma ihtimali yüksektir.","Move corrupt files into the following folder:":"Bozuk dosyaları aşağıdaki klasöre taşıyın:"," If checked, then any files which give errors will be moved into the specified folder.":"İşaretliyse, hata veren dosyalar belirtilen klasöre taşınır.","Corrupt file folder:":"Bozuk dosya klasörü:","Run thorough file health check:":"Ayrıntılı dosya sağlığı kontrolünü çalıştırın:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"İşaretlenirse, daha yavaş, daha yavaş, daha ayrıntılı video sağlık kontrolü, El Freni yerine FFmpeg kullanılarak yapılır."," Based on Desani's 'ScanMedia.ps1' found at:":"Desani'nin 'ScanMedia.ps1' kaynağında bulunur:","Attempt to repair files after thorough check:":"Ayrıntılı kontrol ettikten sonra dosyaları onarmaya çalışın:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"İşaretliyse, HBBatchBeast FFmpeg kullanarak dosyaları onarmaya çalışır. Kaynak dosyayla aynı klasörde '_repaired' sonekine sahip yeni bir dosya oluşturulur.","'CRF' value to use when attempting to repair files:":"Dosyaları onarmaya çalışırken kullanılacak 'CRF' değeri:","The default 'CRF' value is 23. Please see the following for more information:":"Varsayılan 'CRF' değeri 23'tür. Lütfen daha fazla bilgi için aşağıdakilere bakın:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"CRF skalasının aralığı 0-51'dir, burada 0 kayıpsızdır, 23 varsayılandır ve 51 mümkün olan en düşük kalitedir. Daha düşük bir değer genellikle daha yüksek kaliteye yol açar ve öznel olarak aklı başında bir aralık 17–28'dir. 17 veya 18'in görsel olarak kayıpsız veya neredeyse öyle olduğunu düşünün; girişle aynı veya neredeyse aynı görünmelidir ancak teknik olarak kayıpsız değildir.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast, bozuk olduğu bildirilen taranan dosya yollarının bir listesini kaydeder. Tüm dosyalar üzerinde yeni bir tarama yapmak için önbelleği temizleyin.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Kullanılacak eşzamanlı El Freni / FFmpeg örneği sayısı? (Tavsiye edilen 4 veya daha az):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Bu ayar hem \"Video sağlık kontrolü\" hem de \"Tara ve dönüştür\" işlemleri için geçerlidir. Kullanılacak kaç El Freni dişi belirtin. 4'ten fazla kullanmamanız tavsiye edilmekle birlikte maksimum yoktur, çok güçlü değilse bilgisayarınızı daha yüksek miktarda donabilir.","Queue size view limit?(Recommended 1000 or fewer):":"Sıra boyutu görüntüleme sınırı? (Önerilen 1000 veya daha az):","Automatically start \"Scan and convert\" when program opened?":"Program açıldığında \"Tara ve dönüştür\" otomatik olarak başlatılsın mı?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Sağlık kontrolü veya dönüşüm / klasör izleme sırasında bir hatayla karşılaşılırsa, e-posta bildirimleri almak için e-posta ayrıntılarını girin. 2FA gerektiren hesaplarla çalışmaz. Gmail hesaplarındaki daha az güvenli uygulamalara erişimi etkinleştirmeniz gerekir.","Email address:":"E:","For example:":"Örneğin:","Email password(not saved):":"E-posta şifresi (kaydedilmedi):","SMTP server:":"SMTP sunucusu:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"Bu özellik herhangi bir web tarayıcısını kullanarak dönüşüm / sağlık kontrolü durumunun izlenmesini sağlar. Sunucuları çalıştırırken kullanışlıdır.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Etkinleştirilirse, aşağıdaki anonim veriler HBBatchBeast.io'ya gönderilir:","API key":"API anahtarı","Current status ('Searching', 'Running', 'Finished' etc)":"Mevcut durum ('Arama', 'Koşu', 'Bitti' vb.)","Number of:":"Sayısı:","Remaining items":"Kalan öğeler","Successful items":"Başarılı öğeler","Errored items":"Hatalı öğeler","Cancelled items":"İptal edilen ürünler","Worker percentages":"İşçi yüzdeleri","Last completed item time":"Son tamamlanan öğe süresi","Enable remote monitoring?:":"Uzaktan izleme etkinleştirilsin mi ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Herhangi bir işlemci türünde çalıştırılabilmesine rağmen, temel olarak 16+ çekirdek işlemcinin birden fazla El Freni örneği kullanarak nasıl performans gösterdiğini görmek için inşa edilmiş temel bir kıyaslama aracı.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Bu, bir h265 4k örnek dosyasını (2.5MB) indirecek ve önceden ayarlanmış \"Çok Hızlı 1080p30\" özellikli 4 El Freni örneği kullanarak bir kıyaslama yapacaktır.","Results can be uploaded to hbbatchbeast.io if you choose.":"İsterseniz sonuçlar hbbatchbeast.io'ya yüklenebilir.","Queue":"kuyruk","Output this session":"Bu oturumu yazdır","Media info viewer tool":"Medya bilgisi görüntüleyici aracı","View compress attempt cache":"Sıkıştırma girişimi önbelleğini görüntüleyin","Clear compress attempt cache":"Sıkıştırma girişimi önbelleğini temizleme","Save config":"Config kaydet","Scan only":"Sadece tara","Scan and convert":"Tara ve dönüştür","View scan/conversion summary log":"Tarama / dönüşüm özeti günlüğünü görüntüle","View individual file check/conversion log":"Bireysel dosya kontrolü / dönüşüm günlüğünü görüntüleyin","View worker console output":"Alt konsol çıktısını görüntüleyin","Health check":"Sağlık kontrolü","Clear healthy file cache":"Sağlıklı dosya önbelleğini temizle","View error log":"Hata günlüğünü görüntüle","Email test":"E-posta testi","View master log":"Ana günlüğü görüntüle","Wiki help":"Wiki yardımı","An application by HaveAGitGat":"HaveAGitGat tarafından bir uygulama","New":"Yeni","Launch":"Başlatmak","Benchmark":"Karşılaştırma","See results":"Sonuçlara bakın","Pause queue":"Sırayı duraklat","Continue queue":"Sıraya devam et","Stop queue":"Durdurma Sırası","Convert selected files":"Seçili dosyaları dönüştür","Toggle queue view":"Sıra görünümünü değiştir","Deselect all":"Hiçbirini seçme","Invert all":"Tümünü ters çevir","Select all":"Hepsini seç","Toggle output view":"Çıktı görünümünü değiştir"}