{"The number of custom presets does not match the number of source folders!":"Кількість власних пресетів не відповідає кількості вихідних папок!","source folders have been detected.":"Виявлені вихідні папки.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"були виявлені спеціальні попередньо встановлені лінії. Повторіть перевірку на наявність невидимих розривів рядків. На рядку має бути один шлях до папки або попередній набір. Переконайтеся, що ви не випадково створили порожній рядок.","The number of filename suffixes does not match the number of source folders! ":"Кількість суфіксів імен файлів не відповідає кількості вихідних папок!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"Були виявлені суфіксні рядки файлів. Повторіть перевірку на наявність невидимих розривів рядків. У рядку має бути один шлях до папки або суфікс назви файлу. Переконайтеся, що ви не випадково створили порожній рядок.","The number of source folders does not match the number of destination folders!":"Кількість вихідних папок не відповідає кількості цільових папок!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"Визначено папки призначення. Повторіть перевірку на наявність невидимих розривів рядків. У кожному рядку має бути один шлях до папки. Переконайтеся, що ви не випадково створили порожній рядок.","The number of source folders does not match the number of temporary conversion folders!":"Кількість вихідних папок не відповідає кількості тимчасових папок перетворення!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"виявлено папки тимчасового перетворення. Повторіть перевірку на наявність невидимих розривів рядків. У кожному рядку має бути один шлях до папки. Переконайтеся, що ви не випадково створили порожній рядок.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Введіть дійсний контейнер, наприклад \".mp4\". Обов’язково вкажіть \".\"","Corrupt file folder":"Пошкоджена папка файлів","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"не існує! Переконайтеся, що до / після шляху немає пробілів або прихованих символів","Source folder":"Вихідна папка","Temporary conversion folder":"Тимчасова папка перетворення","appears to be the same as or is within source folder":"виглядає так само, як і у вихідній папці","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"що запобігає правильному функціонуванню HBBatchBeast. Змініть папку тимчасового перетворення на папку за межами вихідної папки. Якщо ви бажаєте скористатися функцією \"Замінити оригінальні файли\", виберіть папку призначення, яка не збігається з вихідною папкою або в її межах, а потім встановіть прапорець \"Замінити завжди оригінальні файли\" . Зніміть прапорець тимчасової папки \"Тимчасова папка\", оскільки вона не буде використовуватись у цьому випадку. Файли перетворяться в папку призначення, а потім повертаються до вихідної папки.","Destination folder":"Тека призначення","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"що запобігає правильному функціонуванню HBBatchBeast. Змініть цільову папку на папку за межами вихідної папки. Якщо ви бажаєте скористатися функцією \"Замінити оригінальні файли\", виберіть папку призначення, яка не збігається з вихідною папкою або в її межах, а потім встановіть прапорець \"Замінити завжди оригінальні файли\" . Зніміть прапорець тимчасової папки \"Тимчасова папка\", оскільки вона не буде використовуватись у цьому випадку. Файли перетворяться в папку призначення, а потім повертаються до вихідної папки.","Error creating temporary conversion folder":"Помилка створення папки тимчасового перетворення","Error creating destination folder":"Помилка створення папки призначення","Please select to use HandBrake or FFmpeg!":"Будь ласка, оберіть, щоб використовувати HandBrake або FFmpeg!","Please select a standard preset or input a custom one!":"Виберіть стандартну настройку або введіть спеціальний!","Please select a scan interval of 5 seconds or greater!":"Виберіть інтервал сканування 5 секунд або більше!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Будь ласка, переконайтеся, що кількість одночасних випадків HandBrake / FFmpeg для використання є одним або більшим!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Недійсний ключ API! Натисніть \"Новий\" на вкладці віддаленого моніторингу, щоб створити новий ключ.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Введіть час щоденного сканування в 24-годинному форматі: hh: mm (наприклад, 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"Файли джерел будуть видалені після перетворення! Будь ласка, перевірте перед правильним використанням!","Benchmark failed!":"Помилка показників","Log does not exist!":"Журнал не існує!","Folder does not exist!":"Папка не існує!","Error sending email! Please check your settings.":"Помилка надсилання електронної пошти! Перевірте налаштування.","Test email sent!":"Надіслано тестове електронне повідомлення!","All worker processes have been stopped.":"Всі робочі процеси були зупинені.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Черга буде призупинено після завершення обробки поточних елементів. Дійсно призупинити чергу?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Після того, як всі працівники призупинили роботу, з'явиться кнопка \"Продовжити\".","Healthy file cache cleared!":"Знятий здоровий кеш файлу!","Cache cleared!":"Очищено кеш!","Cancel item":"Скасувати елемент","Please check the above checkbox to use this feature.":"Щоб скористатися цією функцією, поставте прапорець вище.","Configuration":"Конфігурація","Source folders":"Вихідні папки","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Це вихідна папка, яка буде перевірятися на носії. Папку потрібно ввести без кінцевої слеш. Наприклад:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Поле шляху вихідної папки можна розгорнути (натисніть клавішу enter, щоб створити новий рядок). Якщо потрібно вказати декілька вихідних папок, переконайтеся, що кожен шлях до папки джерела знаходиться на окремому рядку, наприклад:","Video health check":"Перевірка здоров'я відео","Batch conversion and Folder watching":"Пакетне перетворення та перегляд папок","Remote Monitoring (Beta)":"Віддалений моніторинг (бета-версія)","Benchmark (Beta)":"Тест (бета-версія)","System":"Система","Help":"Довідка","Temporary conversion folders":"Папки тимчасового переходу","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Якщо \"Тимчасова папка перетворення?\" буде позначено, тоді HandBrake перетворить файли в цю папку. Після завершення конверсії файл буде переміщено у папку \"Цільова адреса\". Вам потрібно вказати стільки тимчасових папок перетворення, скільки вихідних папок. Ваша перша папка-джерело буде перетворена у вашу першу папку тимчасового перетворення, друга папка-джерело - у вашу другу папку тимчасового перетворення тощо. Переконайтеся, що кожен шлях тимчасової папки перетворення знаходиться на його власному рядку.","Destination folders":"Папки призначення","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Вкажіть шляхи до папки призначення. Знову ж таки, вам потрібно вказати стільки папок призначення, скільки вихідних папок. Файли з вашої першої вихідної папки закінчаться у вашій першій папці призначення, ваші файли з другої вихідної папки у вашій другій папці призначення тощо.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Перша папка джерела ---------> Перша папка тимчасового перетворення ---------> Перша папка призначення","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Друга папка-джерело ---------> Друга тимчасова папка перетворення ---------> Друга папка призначення","etc":"тощо","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast не буде працювати належним чином, якщо ви призначите папку призначення такою ж, як або у теці вихідної папки.","Standard preset:":"Стандартний набір:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Виберіть налаштування HandBrake, з якими потрібно конвертувати файли. Якщо вибрано \"Стандартне налаштування\", всі файли в вибраних папках будуть перетворені за допомогою заданого стилю HandBrake. Більш детальну інформацію про налаштування HandBrake можна знайти тут:","Custom preset:":"Спеціальні налаштування:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Якщо \"Custom preset\", то вам необхідно ввести власні власні пресети. HBBatchBeast охоплює \"HandBrakeCLI -i джерело -о призначення\" частина вхід HandBrakeCLI так що вам потрібно ввести параметри перетворення. Наприклад:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Якщо ви використовуєте FFmpeg, вам необхідно розділити вхідні та вихідні параметри комою. Як от:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Ви також можете зв'язати зі спеціальним налаштуванням, експортованим з офіційного графічного інтерфейсу HandBrake, наприклад:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Якщо у вас виникли проблеми з користувацькими пресетами, це може бути пов'язано з відомою помилкою з HandBrakeCLI (буде виправлено в наступному випуску HandBrakeCLI). Перегляньте це для тимчасового рішення:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Кожен користувальницький пресет повинен бути на своєму рядку і, подібно до папок, потрібно мати стільки налаштувань, скільки оригінальних папок.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Перша папка джерела ---------> Перша папка тимчасового перетворення ---------> Перша папка призначення @ Первинна попередня настройка 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Друга папка-джерело ---------> Друга тимчасова папка для перетворення ---------> Друга папка призначення @ Власна настройка 2","See the following image for guidance:":"Перегляньте наступне зображення для вказівки:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Якщо використовується кодування відеокарти (наприклад, NVENC), то вам може знадобитися зменшити кількість випадків HandBrake (спробуйте 2 або менше) через обмеження VRAM.","Select standard preset:":"Виберіть стандартну установку:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Виявив NVENC, переконайтеся, що зменшили кількість екземплярів HandBrakeCLI до 2 або нижче (для більшості відеокарт), або виникли помилки через недостатню кількість VRAM. Цей параметр можна знайти на вкладці \"Система\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Виявлено імпортований пресет. Якщо у вас виникли проблеми з імпортованими користувацькими пресетами, це може бути пов'язано з відомою помилкою з HandBrakeCLI (буде виправлено в наступному випуску HandBrakeCLI). Тимчасове рішення - видалити \"PictureRotate\": \"0: 0\" з файлу .json. Докладніше тут:","Container:":"Контейнер:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Вкажіть контейнер, який ви хочете мати у вихідному файлі, наприклад \".mp4\". Ви можете дізнатися більше про контейнери за адресою:","Enable periodic scanning:":"Увімкнути періодичне сканування:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast може контролювати ваші вихідні папки і запускати сканування для нових файлів на заданому інтервалі. Інтервал часу в секундах з типовим значенням 300 секунд (5 хвилин). Якщо вибрано цей параметр, тоді при натисканні кнопки \"Сканувати і конвертувати\" програма перетворить будь-які нові файли, після чого почнеться таймер зворотного відліку. Це буде нескінченно циклічно, поки не буде зупинено. Інтервал сканування знаходиться в розділі додаткових налаштувань.","Enable daily scanning:":"Увімкнути щоденне сканування:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Замість періодичного сканування можна вибрати, щоб сканування запускалося один раз на день. Час сканування вводиться у розділі додаткових налаштувань у форматі hh: mm, наприклад, '18: 30 '. Після вибору пункту \"Сканувати та конвертувати\" програма зачекає до вказаного часу до запуску процесу сканування та перетворення. Знову ж таки, це буде нескінченно циклічно, поки не буде зупинено.","Show/hide advanced:":"Показати / приховати розширений:","Scan interval (minimum 5 seconds):":"Інтервал сканування (мінімум 5 секунд):","Daily run time (hh:mm):":"Щоденний час роботи (чч: мм):","Output filename suffix:":"Суфікс назви файлу:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Це необов'язково. Ви можете вказати суфікс для додавання до кінця назви файлу, наприклад, \"_1080p\" або \"_testconversion\" тощо.","If 'standard preset' is selected then all output files will have the same suffix.":"Якщо вибрано \"стандартний набір\", то всі вихідні файли матимуть один і той же суфікс.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Якщо вибрано \"custom preset\", ви можете вказати один суфікс для кожної папки / попередньо налаштованої програми. Переконайтеся, що кожен суфікс знаходиться на його власній лінії. Наприклад, якщо у вас є 2 вихідні папки і використовується \"спеціальний набір\", ви можете помістити це у поле суфіксу назви файлу:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Файли в першій папці-джерелі матимуть \"_720p\", додані до назви файлу. Файли у другій папці-джерелі матимуть \"_1080p\" у вихідному імені файлу тощо.","Include these file containers:":"Включити ці контейнери файлів:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Введіть контейнери для сканування файлів. Кожен тип має бути розділений комами. Стандартний запис:","Exclude files smaller than (MB):":"Виключити файли розміром менше (МБ):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Укажіть, чи слід виключати файли, розмір яких перевищує певний розмір, із конверсії (в мегабайтах)","Exclude files larger than (MB):":"Виключити файли розміром більше (МБ):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Укажіть, чи слід виключати файли, розмір яких перевищує певний розмір, із конверсії (в мегабайтах)","Exclude filenames which include any of these words:":"Виключити назви файлів, які містять будь-яке з цих слів:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Введіть ключові слова для фільтрації під час сканування файлів. Наприклад, якщо введено \"720p\", то будь-які файли з \"720p\" у заголовку не будуть перетворені. Знову ж таки, ключові слова мають бути розділені комами. Наприклад, введіть у полі фільтра:","Include files with any ":"Включайте файли з будь-якими"," or all ":"або всі"," of these":"з них","properties:":"властивості:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Тут ви можете вводити відео та аудіо властивості, які файли повинні мати для перетворення (інформація витягується за допомогою FFprobe). Властивості повинні бути розділені комою. Використовуйте інструмент перегляду медіаінформації, щоб визначити, які властивості ви хочете включити. Переконайтеся, що після останнього властивості буде додано кому. Наприклад, щоб конвертувати лише файли, закодовані за допомогою h264 та стерео аудіосистеми aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Варто зазначити, що ця перевірка властивості виконується після запуску процесу перетворення (щоб заощадити час при створенні черги), тому, хоча файли можуть з'являтися в черзі перетворення, вони будуть пропущені / включені, якщо будуть виконані правильні умови.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Якщо FFprobe здатний витягувати властивості, то у стовпці \"FFprobe\" у вікні черги з'явиться \"OK\".","Exclude files with any ":"Виключити файли з будь-якими"," of these ":"з них","The opposite of 'Include files with any or all of these properties'":"Навпаки \"Включити файли з будь-якими або всіма цими властивостями\"","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Це невеликий інструмент для аналізу властивостей файлу, щоб допомогти вам визначити, які властивості ви хочете включити / виключити у вищезазначених варіантах. Він використовує FFprobe для повернення інформації. Перетягніть файли в сіре поле, щоб проаналізувати їх. Наприклад, скидання тестового файлу може повернути наступне:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Якщо ви хочете виключити такі файли, як це, перетворюйте їх, то ви можете помістити декілька властивостей файлу в поле \"Вилучити файли з будь-яким або всіма цими властивостями\" і встановіть прапорець біля \"всі\" замість \"будь-який\", так:","Copy excluded files to destination:":"Скопіювати виключені файли до місця призначення:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Якщо вибрати цей параметр, файли, які були виключені з конверсії, буде скопійовано безпосередньо до папки призначення. Це стосується таких фільтрів:","Exclude filenames which include any of these words":"Виключити назви файлів, які містять будь-яке з цих слів","Include files with any or all of these properties":"Включайте файли з будь-якими або всіма цими властивостями","Exclude files with any or all of these properties":"Виключити файли з будь-якими або всіма цими властивостями","Exclude files smaller than (MB)":"Виключити файли розміром менше (МБ)","Exclude files larger than (MB)":"Виключити файли розміром більше (МБ)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Зверніть увагу, що це також стосується файлів, виключених через те, що вони не відповідають умовам властивості \"Включити\" вищезгаданого, тому не випадково копіюєте всю бібліотеку, коли намагаєтеся перетворити лише кілька файлів.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Функція копіювання не застосовується до таких фільтрів (тобто файлів, виключених через фільтр)","Include these file types":"Включіть ці типи файлів","Delete source files after conversion:":"Видалення вихідних файлів після перетворення:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Якщо цей параметр вибрано, тоді, якщо спроба перетворення буде успішною, вихідний файл буде видалено. Цей процес здійснюється в самому кінці, після перетворення всіх файлів. Це означає, що ви можете перетворити однакові вихідні файли за допомогою декількох пресетів, все за один раз. Після цього вихідні файли будуть видалені.","Replace original file if converted file is smaller?(Compress attempt)":"Замінити оригінальний файл, якщо перетворений файл менший? (Спроба стиснення)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Установіть цей прапорець, якщо ви хочете, щоб HBBatchBeast автоматично замінював оригінальний вихідний файл, якщо новий файл менший. Якщо новий файл не менше, то він залишиться в папці призначення.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Переконайтеся, що папка призначення не є такою, як у теці вихідної папки або вона не буде працювати належним чином.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Після того, як HBBatchBeast спробує стиснути певний файл, він додасть цей шлях до кешу, щоб його не було повторно. Ви можете переглядати / редагувати / очищати кеш за допомогою жовтих кнопок.","Replace original file always?":"Замінити оригінальний файл завжди?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Вихідний файл буде замінено, незалежно від того, чи новий файл більший або менший.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Знову ж таки, переконайтеся, що папка призначення не збігається з папкою джерела або з нею, або вона не буде працювати належним чином.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Після того, як HBBatchBeast перекодує певний файл, він додасть цей шлях до кешу, щоб його не було повторно. Ви можете переглядати / редагувати / очищати кеш за допомогою жовтих кнопок.","Copy subtitle (srt) files to destination?":"Копіювати файли субтитрів (srt) до місця призначення?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Файли субтитрів '.srt' будуть автоматично скопійовані до папки призначення.","Automatically create temporary/destination folders if they don't exist?":"Автоматично створювати тимчасові або цільові папки, якщо вони не існують?","Custom bat path to run after each conversion (leave blank if not using):":"Користувальницький шлях до миші для виконання після кожного переходу (залиште порожнім, якщо не використовуєте):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Введіть шлях до власного пакетного файлу, який потрібно виконати після кожного перетворення. Наприклад:","Batch files with timeout statements won't work. More info here:":"Пакетні файли з вираженнями часу очікування не працюватимуть. Докладніше тут:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Залишити поле зовсім порожнім, якщо ви не бажаєте використовувати цей параметр (переконайтеся, що у вікні немає прихованих символів)","Run processes at low priority?":"Запускати процеси з низьким пріоритетом?","All conversion processes will be run at low priority, reducing processor usage.":"Всі процеси перетворення будуть виконуватися з низьким пріоритетом, зменшуючи використання процесора.","Remove apostrophes from filenames:":"Видалити апострофи з назв файлів:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Сканування конверсій / перевірки стану здоров'я можуть завершитися невдало, якщо назви файлів мають апострофи. Позначте це, щоб автоматично видалити апострофи з імен файлів."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Ця функція може сканувати пошкоджені відеофайли за допомогою функції \"--scan\" HandBrake, хоча це не завжди є точним. Він також використовує FFprobe для забезпечення другої опорної точки. Якщо як FFprobe, так і HandBrake виходять з ладу, існує велика ймовірність пошкодження файлу.","Move corrupt files into the following folder:":"Перемістити пошкоджені файли в таку папку:"," If checked, then any files which give errors will be moved into the specified folder.":"Якщо позначено цей пункт, всі файли, які надають помилки, будуть переміщені у вказану папку.","Corrupt file folder:":"Пошкоджена папка файлів:","Run thorough file health check:":"Виконайте ретельну перевірку стану файлу:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Якщо буде позначено цей пункт, то за допомогою FFmpeg замість HandBrake буде виконуватися набагато повільніше, більш ретельна перевірка стану відео."," Based on Desani's 'ScanMedia.ps1' found at:":"На основі Desani 'ScanMedia.ps1':","Attempt to repair files after thorough check:":"Спроба відновити файли після ретельної перевірки:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Якщо позначено, HBBatchBeast спробує відновити файли за допомогою FFmpeg. Новий файл із суфіксом '_repaired' буде створено в тій же папці, що й вихідний файл.","'CRF' value to use when attempting to repair files:":"Значення 'CRF' для використання при спробі відновити файли:","The default 'CRF' value is 23. Please see the following for more information:":"Значення \"CRF\" за умовчанням - 23. Для отримання додаткової інформації див.","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Діапазон шкали CRF дорівнює 0–51, де 0 - без втрат, 23 - за замовчуванням, а 51 - у найгіршій якості. Більш низьке значення зазвичай призводить до більш високої якості, а суб'єктивно нормальний діапазон - 17-28. Розглянемо 17 або 18, щоб бути візуально без втрат або майже так; вона повинна виглядати однаково або майже так само, як і вхідні дані, але технічно не втрачається.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast зберігає список відсканованих шляхів до файлів, які повідомляються як некорректні. Очистіть кеш, щоб оновити всі файли.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Кількість одночасних випадків HandBrake / FFmpeg (рекомендовано 4 або менше):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Це налаштування застосовується до процесів \"Перевірка стану відео\" та \"Сканувати та конвертувати\". Вкажіть кількість потоків HandBrake для використання. Немає максимуму, хоча рекомендується не використовувати більше 4. Більш висока кількість може заблокувати комп'ютер, якщо він не дуже потужний.","Queue size view limit?(Recommended 1000 or fewer):":"Ліміт перегляду розміру черги? (Рекомендовано 1000 або менше):","Automatically start \"Scan and convert\" when program opened?:":"Автоматично запускати \"Сканувати та конвертувати\", коли програма відкрита ?:","Save verbose logs?:":"Зберегти докладні журнали ?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Установіть цей прапорець, щоб зберегти детальні журнали підпроцесів. Це включає в себе робочу консоль. Це викличе дуже великі журнали.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Заповніть відомості про електронну пошту, щоб отримувати сповіщення електронною поштою, якщо під час перевірки стану здоров'я або перегляду папок відбулася помилка. Не буде працювати з обліковими записами, які вимагають 2FA. Потрібно ввімкнути доступ до менш захищених програм на облікових записах Gmail.","Email address:":"Адреса електронної пошти:","For example:":"Наприклад:","Email password(not saved):":"Пароль електронної пошти (не збережено):","SMTP server:":"Сервер SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Ця функція дозволяє контролювати стан конверсії / перевірки стану здоров'я за допомогою будь-якого веб-браузера. Корисно при запуску серверів і т.д. Немає назв файлів.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Якщо цей параметр увімкнено, до HBBatchBeast.io буде надіслано такі анонімні дані:","API key":"Ключ API","Current status ('Searching', 'Running', 'Finished' etc)":"Поточний статус (\"Пошук\", \"Запуск\", \"Завершено\" тощо)","Number of:":"Число:","Remaining items":"Залишилися елементи","Successful items":"Успішні елементи","Errored items":"Помилки","Cancelled items":"Відмінені елементи","Worker percentages":"Відсотки працівників","Last completed item time":"Останній час завершення пункту","Enable remote monitoring?:":"Увімкнути віддалений моніторинг:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Основна утиліта бенчмаркінгу побудована головним чином для того, щоб побачити, як 16 + ядра процесори виконують використання декількох випадків HandBrake, хоча він може бути запущений на будь-якому типі процесора.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Це дозволить завантажити файл зразка h265 4k (2.5 МБ) і запустити бенчмарк за допомогою 4 екземплярів HandBrake з попередньо встановленим \"Very Fast 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Результати можуть бути завантажені на hbbatchbeast.io, якщо ви виберете.","Queue":"Черга","Output this session":"Виведіть цю сесію","Media info viewer tool":"Інструмент для перегляду інформації для медіа","View replaced file cache":"Переглянути замінено кеш файлу","Clear replaced file cache":"Очистити замінений кеш файлу","Save config":"Зберегти конфігурацію","Scan only":"Лише сканування","Scan and convert":"Сканування та перетворення","View scan/conversion summary log":"Переглянути звіт журналу сканування / конверсії","View individual file check/conversion log":"Перегляд журналу перевірки / перетворення окремих файлів","View worker console output":"Переглянути вивід робочої консолі","Health check":"Перевірка здоров'я","Clear healthy file cache":"Очистіть здоровий кеш файлу","View error log":"Переглянути журнал помилок","Email test":"Тест електронної пошти","View master log":"Переглянути головний журнал","Wiki help":"Довідка Wiki","An application by HaveAGitGat":"Додаток від HaveAGitGat","New":"Новий","Launch":"Запуск","Benchmark":"Тест","See results":"Див. Результати","Pause queue":"Призупинити чергу","Continue queue":"Продовжуйте чергу","Stop queue":"Зупинити чергу","Convert selected files":"Перетворення вибраних файлів","Toggle queue view":"Перемкнути перегляд черги","Deselect all":"Зніміть виділення з усіх","Invert all":"Інвертувати все","Select all":"Вибрати все","Toggle output view":"Перемкнути вигляд виводу"}