{"The number of custom presets does not match the number of source folders!":"اپنی مرضی کے مطابق presets کی تعداد ماخذ فولڈر کی تعداد سے متفق نہیں ہے!","source folders have been detected.":"ذریعہ فولڈر کو پتہ چلا ہے.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"اپنی مرضی کے مطابق پیش سیٹ لائنوں کا پتہ چلا ہے. براہ کرم پوشیدہ لائن وقفوں کے لئے چیک کریں. ایک فولڈر کا راستہ یا فی سطر پیش کرنا چاہئے. اس بات کو یقینی بنائیں کہ آپ نے غلطی سے خالی لائن نہیں بنائی ہے.","The number of filename suffixes does not match the number of source folders! ":"فائل نامے کی کافی تعداد کی تعداد ماخذ فولڈر کی تعداد سے متفق نہیں ہے!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"فائل نامے تکمیل لائنوں کو پتہ چلا ہے. براہ کرم پوشیدہ لائن وقفوں کے لئے چیک کریں. فی فولڈر کا راستہ یا فائل نام تک کافی ہونا چاہئے. اس بات کو یقینی بنائیں کہ آپ نے غلطی سے خالی لائن نہیں بنائی ہے.","The number of source folders does not match the number of destination folders!":"ماخذ فولڈر کی تعداد منزل فولڈر کی تعداد سے متفق نہیں ہے!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"منزل فولڈر کو پتہ چلا ہے. براہ کرم پوشیدہ لائن وقفوں کے لئے چیک کریں. فی لائن ایک فولڈر کا راستہ ہونا چاہئے. اس بات کو یقینی بنائیں کہ آپ نے غلطی سے خالی لائن نہیں بنائی ہے.","The number of source folders does not match the number of temporary conversion folders!":"ماخذ فولڈر کی تعداد عارضی تبادلوں کے فولڈر کی تعداد سے متفق نہیں ہوتی!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"عارضی تبادلوں کے فولڈر کو پتہ چلا ہے. براہ کرم پوشیدہ لائن وقفوں کے لئے چیک کریں. فی لائن ایک فولڈر کا راستہ ہونا چاہئے. اس بات کو یقینی بنائیں کہ آپ نے غلطی سے خالی لائن نہیں بنائی ہے.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"برائے مہربانی ایک درست کنٹینر درج کریں جیسے '' .mp4 ''. '.' شامل کرنے کے لئے یقینی بنائیں.","Corrupt file folder":"فریب فائل فولڈر","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"موجود نہیں ہے! براہ کرم اس بات کو یقینی بنائیں کہ راستے سے پہلے / اس سے پہلے کوئی خالی جگہ یا پوشیدہ حروف موجود نہیں ہیں","Source folder":"ماخذ فولڈر","Temporary conversion folder":"عارضی تبادلوں فولڈر","appears to be the same as or is within source folder":"ظاہر ہوتا ہے جیسے ہی منبع فولڈر کے اندر ہے","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"جو ایچ بی بیچ کو درست طریقے سے کام کرنے سے بچا جائے گا. ذریعہ فولڈر کے باہر ایک فولڈر میں عارضی تبادلوں کا فولڈر تبدیل کریں. اگر آپ 'اصل فائلوں کی خصوصیت کو تبدیل کرنے' کا استعمال کرنا چاہتے ہیں تو، براہ کرم ایک منزل فولڈر کا انتخاب کریں جو منبع کے فولڈر میں نہیں ہے، اور اس کے بعد 'اصل فائلوں کو ہمیشہ کی جگہ لے لو' کو اعلی درجے کی ترتیبات سیکشن میں چیک باکس چیک کریں. . عارضی 'عارضی تبادلوں کے فولڈر' چیک باکس کو نشان زد کریں کیونکہ یہ اس معاملے میں کوئی استعمال نہیں کرے گا. فائلوں کو منزل فولڈر میں تبدیل کیا جائے گا اور پھر ذریعہ فولڈر میں واپس منتقل کر دیا جائے گا.","Destination folder":"مطلوبہ فولڈر","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"جو ایچ بی بیچ کو درست طریقے سے کام کرنے سے بچا جائے گا. ذریعہ فولڈر کے باہر فولڈر میں فولڈر فولڈر کو تبدیل کریں. اگر آپ 'اصل فائلوں کی خصوصیت کو تبدیل کرنے' کا استعمال کرنا چاہتے ہیں تو، براہ کرم ایک منزل فولڈر کا انتخاب کریں جو منبع کے فولڈر میں نہیں ہے، اور اس کے بعد 'اصل فائلوں کو ہمیشہ کی جگہ لے لو' کو اعلی درجے کی ترتیبات سیکشن میں چیک باکس چیک کریں. . عارضی 'عارضی تبادلوں کے فولڈر' چیک باکس کو نشان زد کریں کیونکہ یہ اس معاملے میں کوئی استعمال نہیں کرے گا. فائلوں کو منزل فولڈر میں تبدیل کیا جائے گا اور پھر ذریعہ فولڈر میں واپس منتقل کر دیا جائے گا.","Error creating temporary conversion folder":"عارضی تبادلوں فولڈر کی تخلیق میں خرابی","Error creating destination folder":"منزل فولڈر بنانے میں خرابی","Please select to use HandBrake or FFmpeg!":"براہ کرم ہینڈ بیک یا FFmpeg استعمال کرنے کا انتخاب کریں!","Please select a standard preset or input a custom one!":"براہ کرم معیاری پیش سیٹ یا ان پٹ اپنی مرضی کے مطابق منتخب کریں!","Please select a scan interval of 5 seconds or greater!":"براہ کرم 5 سیکنڈ یا زیادہ سے زیادہ اسکین وقفہ منتخب کریں!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"براہ کرم یقینی بنائیں کہ بیک وقت ہینڈ بیکیک / FFmpeg کے استعمال کی تعداد ایک یا زیادہ ہے!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"غلط API کلید! نئی کلید پیدا کرنے کیلئے ریموٹ نگرانی ٹیب پر 'نیا' پر کلک کریں.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"24 گھنٹہ کی شکل میں براہ کرم ایک روزانہ سکین کا وقت درج کریں: hh: mm (مثال کے طور پر 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"ذریعہ فائلوں کو مشاورت کے بعد خارج کر دیا جائے گا! مناسب استعمال سے پہلے آزمائیں!","Benchmark failed!":"بینچ ناکام ہوگیا","Log does not exist!":"لاگ ان موجود نہیں ہے!","Folder does not exist!":"فولڈر موجود نہیں ہے!","Error sending email! Please check your settings.":"ای میل بھیجنے میں خرابی! براہ مہربانی اپنی ترتیبات چیک کریں.","Test email sent!":"ٹیسٹ ای میل بھیج دیا!","All worker processes have been stopped.":"تمام کارکنوں کو روک دیا گیا ہے.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"موجودہ اشیاء نے پروسیسنگ کو ختم کرنے کے بعد قطعہ روک دیا جائے گا. کیا آپ واقعی قطار کو روکنا چاہتے ہیں؟","Queue pause initiated.'Continue' button will appear once all workers have paused.":"قطعے کی روک تھام شروع ہوگئی ہے. سبھی کارکنوں کو روکنے کے بعد بٹن پر دستخط کریں گے.","Healthy file cache cleared!":"صحت مند فائل کیش صاف ہوگئی","Cache cleared!":"کیش صاف ہوگئی","Cancel item":"آئٹم منسوخ کریں","Please check the above checkbox to use this feature.":"اس خصوصیت کو استعمال کرنے کیلئے براہ کرم اوپر چیک باکس چیک کریں.","Configuration":"ترتیب","Source folders":"ماخذ فولڈر","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"یہ ذریعہ فولڈر ہے جو میڈیا کے لئے اسکین کیا جائے گا. فولڈر کو کوئی پھیرنے والی سلیش کے ساتھ داخل کرنے کی ضرورت نہیں ہے. مثال کے طور پر:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"ذریعہ فولڈر کا راستہ باکس قابل تجدید ہے (ایک نئی لائن تخلیق کرنے کے لئے داخل کریں). اگر آپ متعدد ذریعہ فولڈرز کی وضاحت کرنا چاہتے ہیں، تو یقینی بنائیں کہ ہر ذریعہ فولڈر کا راستہ اس کی اپنی لائن پر ہے جیسے:","Video health check":"ویڈیو صحت کی جانچ پڑتال","Batch conversion and Folder watching":"بیچ تبادلوں اور فولڈر دیکھنے","Remote Monitoring (Beta)":"دور دراز نگرانی (بیٹا)","Benchmark (Beta)":"بنچمارک (بیٹا)","System":"نظام","Help":"مدد","Temporary conversion folders":"عارضی تبادلوں کے فولڈر","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"اگر \"عارضی تبادلوں کے فولڈر\"؟ چیک کیا جاتا ہے، پھر ہینڈ بیک فائلوں کو اس فولڈر میں تبدیل کرے گا. ایک بار تبادل ختم ہو جائے گا، فائل آپ کے \"منزل فولڈر\" میں منتقل ہوجائے گی. آپ کو ذریعہ فولڈروں کے طور پر بہت سے عارضی تبادلوں کے فولڈر کو متعین کرنے کی ضرورت ہوگی. آپ کا پہلا ذریعہ فولڈر آپ کے پہلے عارضی تبادلوں کے فولڈر میں تبدیل ہوجائے گا، آپ کا دوسرا ذریعہ فولڈر آپ کے دوسرے عارضی تبادلوں کے فولڈر میں اور اسی طرح. اس بات کو یقینی بنائیں کہ ہر عارضی تبادلوں فولڈر کا راستہ اس کی اپنی لائن پر ہے.","Destination folders":"منزل فولڈر","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"منزل فولڈر کے راستے کی وضاحت کریں. پھر، آپ کو زیادہ سے زیادہ منزل فولڈروں کو ذریعہ فولڈر کے طور پر متعین کرنے کی ضرورت ہوگی. آپ کے پہلے ذریعہ فولڈر کے فائلوں کو آپ کے پہلے منزل مقصود فولڈر میں ختم ہوجائے گا، آپ کا دوسرا ذریعہ فولڈر فائلوں کو آپ کے دوسرے منزل مقصود فولڈر میں اور اسی طرح.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"پہلا ذریعہ فولڈر ---------> سب سے پہلے عارضی تبادلوں کا فولڈر ---------> پہلا منزل فولڈر فولڈر","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"دوسرا ذریعہ فولڈر ---------> دوسرا عارضی تبادلوں کے فولڈر ---------> دوسرا منزل فولڈر","etc":"وغیرہ","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"ایچ بی بی بیبسٹ مناسب طریقے سے کام نہیں کرے گا جب آپ منزل فولڈر کو بھی ذریعہ فولڈر کے طور پر یا اس کے اندر مقرر کرتے ہیں.","Standard preset:":"معیاری پیش سیٹ:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"ہینڈ بیک پیش سیٹ منتخب کریں آپ اپنی فائلوں کو تبدیل کرنا چاہتے ہیں. اگر \"معیاری پیش سیٹ\" منتخب کیا جاتا ہے تو منتخب کردہ فولڈر میں تمام فائلوں کو مخصوص ہینڈبیک پیش سیٹ کے ذریعے تبدیل کیا جائے گا. آپ ہینڈ بیک پریٹس کے بارے میں مزید تلاش کرسکتے ہیں:","Custom preset:":"اپنی مرضی کے پیش سیٹ:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"اگر \"اپنی مرضی کے مطابق پیش سیٹ\" تو آپ کو اپنا اپنی مرضی کے پیش سیٹ درج کرنے کی ضرورت ہے. ایچ بی بی بی بیسٹ ہینڈ بیکیکسیسی ان پٹ کا حصہ \"ہینڈ بیککل سی سی آئی- ذریعۂ منزل\" کا احاطہ کرتی ہے لہذا آپ کو تبادلوں پیرامیٹرز میں داخل کرنے کی ضرورت ہے. مثال کے طور پر:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"اگر FFmpeg استعمال کرتے ہیں، تو آپ ان پٹ اور آؤٹ پٹ پیرامیٹرز کو کوما کے ساتھ الگ کرنے کی ضرورت ہے. جیسا کہ:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"آپ ایک اپنی مرضی کے مطابق پیش سیٹ سے بھی رابطہ کر سکتے ہیں جو سرکاری ہینڈبیچ جی آئی آئی کی درخواست سے برآمد کی گئی ہے مثال کے طور پر:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"اگر آپ اپنی مرضی کے مطابق پیش سیٹ کے ساتھ پریشان ہوسکتے ہیں، تو یہ ہینڈ بیکیک CLI کے ساتھ معروف بگ کی وجہ سے ہوسکتا ہے (اگلا ہینڈ بیکک CLI رہائی میں مقرر کیا جائے گا). براہ کرم یہ ایک عارضی حل کے لئے ملاحظہ کریں:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"ہر ایک اپنی مرضی کے پیش سیٹ کو اپنی اپنی لائن پر ہونا ضروری ہے اور، فولڈرز کی طرح، ذریعہ فولڈروں کے طور پر بہت سے اپنی مرضی کے مطابق presets کی ضرورت ہوتی ہے.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"پہلا ذریعہ فولڈر ---------> سب سے پہلے عارضی تبادلوں فولڈر ---------> پہلا منزل فولڈر فولڈر @ اپنی مرضی کے پیش سیٹ 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"دوسرا ذریعہ فولڈر ---------> دوسرا عارضی تبادلوں کے فولڈر ---------> دوسرا منزل فولڈر @ اپنی مرضی کے پیش سیٹ 2","See the following image for guidance:":"رہنمائی کے لئے مندرجہ ذیل تصویر دیکھیں:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"اگر گرافکس کارڈ انکوڈنگ (جیسے NVENC) کا استعمال کرتے ہوئے استعمال کرتے ہیں تو، آپ VRAM حدود کی وجہ سے ہینڈ بیک مثال کے نمبر کو کم کرنے کی ضرورت ہوسکتی ہے (2 یا کم کوشش کریں).","Select standard preset:":"معیاری پیش سیٹ منتخب کریں:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC پتہ چلا ہے، براہ کرم 2 یا اس سے نیچے ہینڈ بیک کلیسیسی مثالوں کی تعداد کو کم کرنے کے لئے یقینی بنائیں (زیادہ سے زیادہ گرافکس کارڈز کے لئے) یا آپ کافی VRAM کی وجہ سے غلطیوں کا سامنا کرسکتے ہیں. یہ ترتیب \"سسٹم\" کے ٹیب میں پایا جا سکتا ہے.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"درآمد کردہ پیش سیٹ کا پتہ چلا ہے. اگر آپ کو اپنی مرضی کے مطابق اپنی مرضی کے مطابق پیش کردہ مصیبتوں میں دشواری ہوتی ہے تو یہ ہینڈ بیکیک CLI کے ساتھ معروف مسئلے کی وجہ سے ہوسکتا ہے (اگلا ہینڈ بیکک CLI رہائی میں مقرر کیا جائے گا). ایک عارضی حل ہے. \"PictureRotate\": \"0: 0\" '.json فائل سے ہٹا دیں. یہاں مزید معلومات:","Container:":"کنٹینر:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"کنٹینر کی وضاحت کریں جو آپ چاہتے ہیں کہ آؤٹ پٹ فائل '' .mp4 '' کی طرح ہے. آپ کنٹینرز کے بارے میں مزید معلومات حاصل کرسکتے ہیں:","Enable periodic scanning:":"دور دراز اسکیننگ کو فعال کریں:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBast آپ کے ماخذ فولڈر کی نگرانی اور ایک مخصوص وقفہ میں نئی فائلوں کے لئے اسکین چل سکتے ہیں. وقفہ وقت ڈیفالٹ 300 سیکنڈ (5 منٹ) کے ساتھ سیکنڈ میں ہے. اگر یہ اختیار منتخب کیا جاتا ہے تو، جب آپ \"سکین اور تبدیل\" دبائیں گے، تو پروگرام کسی بھی نئی فائلوں میں بدل جائے گی اور پھر ایک الٹی گنتی کا ٹائمر شروع ہو جائے گا. اس وقت تک جب تک روکا جا سکے گا. اسکین وقفہ اعلی درجے کی ترتیبات سیکشن میں ہے.","Enable daily scanning:":"روزانہ سکیننگ کو فعال کریں:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"دور دراز سکیننگ کے بجائے، آپ ایک دن اسکین چلانے کے لئے اسکین کا انتخاب کرسکتے ہیں. اس وقت اعلی درجے کی ترتیبات سیکشن میں سکین کا وقت درج کیا گیا ہے جس میں ایچ ایم: ملی میٹر کی شکل \"جیسے 18: 30\" ہے. ایک بار \"اسکین اور تبدیل\" منتخب کیا جاتا ہے، اس پروگرام کو ایک اسکین اور تبادلوں کے عمل کو چلانے تک مخصوص وقت تک انتظار کرنا ہوگا. ایک بار پھر، اس وقت تک جب تک روکا جاۓ گا.","Show/hide advanced:":"اعلی درجے کی دکھائیں / چھپائیں","Scan interval (minimum 5 seconds):":"اسکین وقفہ (کم سے کم 5 سیکنڈ):","Daily run time (hh:mm):":"ڈیلی رن ٹائم (ہا: ملی میٹر):","Output filename suffix:":"آؤٹ پٹ فائل کا نام کافی:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"یہ اختیاری ہے. آپ اپنے فائل نام کے اختتام میں '_1080p' یا '_testconversion' وغیرہ کے ساتھ شامل کرنے کے لئے ایک کافی کا بیان کرسکتے ہیں.","If 'standard preset' is selected then all output files will have the same suffix.":"اگر 'معیاری پیش سیٹ' کا انتخاب کیا جاتا ہے تو پھر تمام آؤٹ پٹ فائلیں اسی تکلیف ہوگی.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"اگر 'اپنی مرضی کے مطابق پیش سیٹ' منتخب کیا جاتا ہے تو آپ ایک فیسی فی منبع فولڈر / اپنی مرضی کے پیش سیٹ کی وضاحت کرسکتے ہیں. اس بات کو یقینی بنائیں کہ ہر ممکنہ اس کی اپنی لائن پر ہے. مثال کے طور پر، اگر آپ کے پاس 2 منبع فولڈر ہیں اور 'اپنی مرضی کے مطابق پیش سیٹ' کا استعمال کرتے ہوئے ہیں، تو آپ اسے فائل نام کا نام کافی باکس میں ڈال سکتے ہیں:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"پیداوار کے فولڈر میں فائلوں کو '_720p' میں شامل کیا جائے گا. دوسری فائل کے فولڈر میں فائلیں '_1080p' میں آؤٹ پٹ فائل نام وغیرہ میں شامل ہوں گے.","Include these file containers:":"ان فائل کنٹینرز شامل کریں:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"اسکین کرنے کیلئے فائل کنٹینرز درج کریں. ہر قسم کو کوما کی طرف سے الگ کرنے کی ضرورت ہے. پہلے سے طے شدہ اندراج یہ ہے:","Exclude files smaller than (MB):":"(MB) سے چھوٹی فائلوں کو خارج کردیں:","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"اس بات کی وضاحت کریں کہ کیا فائلوں کو تبادلوں سے کسی خاص سائز سے چھوٹا ہے (میگا بائٹس میں)","Exclude files larger than (MB):":"(ایم بی) سے زیادہ فائلوں کو خارج کردیں:","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"اس بات کی وضاحت کریں کہ کیا فائلوں کو کسی خاص سائز سے زیادہ سے زیادہ تبادلوں سے خارج کرنے کے لئے (میگا بائٹس میں)","Exclude filenames which include any of these words:":"فائلوں کے نام کو خارج کردیں جن میں سے کسی بھی الفاظ میں شامل ہیں:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"فائلوں کے لئے اسکیننگ کرتے وقت مطلوبہ الفاظ درج کریں. مثال کے طور پر، اگر \"720p\" درج کیا جاتا ہے تو، عنوان میں \"720p\" کے ساتھ کسی فائلوں کو تبدیل نہیں کیا جائے گا. پھر، کلیدی الفاظ کو ایک کوما کی طرف سے الگ کرنے کی ضرورت ہے. مثال کے طور پر، فلٹر باکس میں درج ذیل درج کریں:","Include files with any ":"کسی بھی فائل میں شامل کریں"," or all ":"یا سب"," of these":"ان میں سے","properties:":"خصوصیات:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"یہاں آپ ان پٹ ویڈیو اور آڈیو خصوصیات کو تبدیل کرسکتے ہیں جو فائلوں کو تبدیل کرنے کے لئے ضروری ہے (FFprobe کا استعمال کرتے ہوئے نکالنے والی معلومات). خصوصیات ایک کما کی طرف سے الگ ہونا ضروری ہے. میڈیا کی معلومات ناظرین کا استعمال کریں کہ آپ کونسا خصوصیات شامل کرنا چاہتے ہیں اس بات کا تعین کرنے کے لۓ آلہ استعمال کریں. آخری جائیداد کے بعد ایک کوما ڈالنے کے لئے یقینی بنائیں. مثال کے طور پر، صرف فائلوں کو تبدیل کرنے کے لئے جو H264 اور AAC سٹیریو آڈیو کا استعمال کرتے ہوئے انکوڈ کر رہے ہیں:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"یہ بات قابل ذکر ہے کہ یہ جائیداد چیک ایک بار ہوتا ہے جب تبادلوں کا عمل شروع ہو جاتا ہے (قطار کی تعمیر کرتے ہوئے وقت بچانے کے لئے)، لہذا اگرچہ تبادلوں کی قطار میں فائلوں کو ظاہر ہوسکتا ہے، اگر وہ درست حالات پورا ہوجائے تو اسے چھوڑ دیا جائے گا.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"اگر FFprobe خصوصیات کو نکالنے کے قابل ہے تو، قطار کے نقطہ نظر میں \"FFprobe\" کالم میں ایک 'ٹھیک' نظر آئے گا.","Exclude files with any ":"کسی کے ساتھ فائلوں کو خارج کردیں"," of these ":"ان میں سے","The opposite of 'Include files with any or all of these properties'":"اس کے برعکس 'فائلوں کو کسی بھی یا ان تمام خصوصیات کے ساتھ شامل کریں'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"فائل فائل کی خصوصیات کا تجزیہ کرنے کا یہ ایک چھوٹا سا آلہ ہے تاکہ اس بات کا تعین کرنے میں آپ کو مندرجہ بالا اختیارات میں شامل کیا جاسکتا ہے / خارج کرنا چاہۓ. معلومات کو واپس لینے کے لئے یہ FFprobe کا استعمال کرتا ہے. ان کی تجزیہ کیلئے بھوری رنگ کے خانے میں فائلیں کھینچیں اور ڈرا دیں. مثال کے طور پر، ایک ٹیسٹ کی فائل میں گرنے والے مندرجہ ذیل واپس لے سکتے ہیں:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"اگر آپ اس طرح فائلوں کو تبدیل کرنے سے باہر نکالنے کی کوشش کر رہے ہیں تو، آپ کئی فائل خصوصیات کو \"کسی بھی یا ان سبھی خصوصیات کے ساتھ فائلوں کو خارج کریں\" میں ڈال سکتے ہیں اور 'کسی' کے بجائے 'سب' کے ساتھ چیک باکس کو چیک کر سکتے ہیں، اسی طرح:","Copy excluded files to destination:":"منزل پر خارج ہونے والے فائلوں کاپی کریں","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"اگر آپ اس اختیار کو منتخب کرتے ہیں تو پھر تبادلوں سے خارج ہونے والے فائلوں کو براہ راست منزل فولڈر میں کاپی کیا جائے گا. یہ مندرجہ ذیل فلٹر پر لاگو ہوتا ہے:","Exclude filenames which include any of these words":"فائلوں کے نام کو خارج کردیں جن میں سے کسی بھی الفاظ میں شامل ہیں","Include files with any or all of these properties":"فائلوں کو کسی بھی یا ان کی تمام خصوصیات میں شامل کریں","Exclude files with any or all of these properties":"فائلوں کو کسی بھی یا ان تمام خصوصیات کے ساتھ خارج کردیں","Exclude files smaller than (MB)":"(MB) سے چھوٹی فائلوں کو خارج کردیں","Exclude files larger than (MB)":"(ایم بی) سے بڑے فائلوں کو خارج کردیں","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"یاد رکھیں کہ یہ خارج ہونے والے فائلوں پر بھی لاگو ہوتا ہے کیونکہ وہ مندرجہ بالا \"شامل کریں\" کی ملکیت کی شرائط کو پورا نہیں کرتے ہیں لہذا آپ کو صرف چند فائلوں کو تبدیل کرنے کی کوشش کر رہے ہیں تو اس وقت آپ کو پوری لائبریری کا کاپی نہیں ہے.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"کیپ خصوصیت مندرجہ ذیل فلٹر پر لاگو نہیں ہوتا ہے (جیسے فائلوں کو فلٹر کی وجہ سے خارج کردیا گیا ہے)","Include these file types":"ان فائل کی اقسام شامل کریں","Delete source files after conversion:":"تبادلوں کے بعد منبع فائلیں حذف کریں:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"اگر یہ منتخب کیا جاتا ہے تو، پھر اگر ایک تبادلوں کی کوشش کامیاب ہو جائے تو، منبع فائل کو حذف کر دیا جائے گا. تمام فائلوں کے تبادلوں کے بعد، یہ عمل بہت ختم ہو جاتا ہے. اس کا مطلب یہ ہے کہ آپ ایک ہی ذریعہ میں ایک سے زیادہ presets کا استعمال کرتے ہوئے اسی ذریعہ فائلوں کو تبدیل کرسکتے ہیں. اس کے بعد منبع فائلوں کو خارج کردیا جائے گا.","Replace original file if converted file is smaller?(Compress attempt)":"اصل فائل کو تبدیل کریں اگر تبدیل کردہ فائل چھوٹا ہے؟ (کمپریس کی کوشش)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. غلط استعمال رپورٹ نہیں کیا جا سکا. ایک یا زیادہ ایرر آ گئے ہیں. براہ مہربانی ایرر پیغام سے نشان زدہ فیلڈز کو ٹھیک کریں. اگر نئی فائل چھوٹا نہیں ہے، تو یہ منزل فولڈر میں چھوڑ دیا جائے گا.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"اس بات کو یقینی بنائیں کہ آپ کا میگزین فولڈر آپ کے منبع فولڈر کے اندر / یا اس کے اندر ہی نہیں ہے یا یہ مناسب طریقے سے کام نہیں کرے گا.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"ایک بار جب بی بی بی بیسٹ نے مخصوص فائل کو کمپریشن کرنے کی کوشش کی ہے، تو وہ اس فائل کو ایک کیش میں شامل کرے گا تاکہ مستقبل میں اسے دوبارہ دوبارہ کوشش نہ کی جائے. آپ پیلے رنگ کے بٹن کا استعمال کرکے کیش کو دیکھنے / ترمیم / صاف کرسکتے ہیں.","Replace original file always?":"اصل فائل کو ہمیشہ تبدیل کریں؟","The original file will be replaced regardless of whether the new file is larger or smaller.":"اصل فائل کو تبدیل کیا جائے گا چاہے نئی فائل بڑی یا چھوٹا ہو.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"پھر، اس بات کو یقینی بنائیں کہ آپ کا منزل فولڈر آپ کے منبع فولڈر کے اندر / یا اس کے اندر ہی نہیں ہے یا یہ مناسب طریقے سے کام نہیں کرے گا.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"ایک بار جب بی بی بیبسٹ نے ایک خاص فائل کو ٹرانسمیشن کیا ہے، تو وہ اس فائل کو ایک کیش میں شامل کرے گا تاکہ مستقبل میں دوبارہ کوشش کی جائے. آپ پیلے رنگ کے بٹن کا استعمال کرکے کیش کو دیکھنے / ترمیم / صاف کرسکتے ہیں.","Copy subtitle (srt) files to destination?":"ذیلی عنوان (آر ایس ایس) فائلوں کو منزل پر کاپی کریں؟","Subtitle '.srt' files will be copied to the destination folder automatically.":"ذیلی عنوان '.rt' فائلوں کو خود بخود منزل فولڈر میں کاپی کیا جائے گا.","Automatically create temporary/destination folders if they don't exist?":"خود کار طریقے سے عارضی / منزل فولڈر بنائیں اگر وہ موجود نہیں ہیں؟","Custom bat path to run after each conversion (leave blank if not using):":"ہر تبادلوں کے بعد اپنی مرضی کے بٹ کا راستہ چلانے کے لئے (استعمال نہ ہونے پر خالی چھوڑ دیں):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"اپنی مرضی کے مطابق بیچ فائل میں راستہ ان پٹ کریں جس میں آپ ہر تبادلوں کے بعد عملدرآمد کرنا چاہتے ہیں. مثال کے طور پر:","Batch files with timeout statements won't work. More info here:":"ٹائم آؤٹ بیانات کے ساتھ بیچ فائلوں کو کام نہیں کرے گا. یہاں مزید معلومات:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"باکس کو مکمل طور پر خالی چھوڑ دیں اگر آپ اس اختیار کو استعمال نہیں کرنا چاہتے ہیں (اس بات کو یقینی بنائیں کہ باکس میں پوشیدہ حروف نہیں ہیں)","Run processes at low priority?":"کم ترجیح پر عمل چلائیں؟","All conversion processes will be run at low priority, reducing processor usage.":"تمام تبادلوں کی عمل کم ترجیح پر چلائے جائیں گے، پروسیسر کے استعمال کو کم کر دیں گے.","Remove apostrophes from filenames:":"فائلوں سے رسولوں کو ہٹا دیں:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"تبادلوں / صحت چیک اسکین ناکام ہوسکتے ہیں اگر filenames میں apostrophes ہے. یہ خود کار طریقے سے فائلوں کے نام سے apostrophes کو دور کرنے کے لئے چیک کریں."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"یہ خصوصیت ہینڈ بکر کی '-کنکن' خصوصیت کا استعمال کرتے ہوئے بدعنوان ویڈیو فائلوں کے لئے اسکین کرسکتا ہے، اگرچہ یہ ہمیشہ درست نہیں ہے. دوسرا حوالہ پوائنٹ فراہم کرنے کے لئے یہ ایف ایف ایف بذریعہ استعمال کرتا ہے. اگر FFprobe اور ہینڈ بیک کی ناکامی دونوں میں ناکام ہوجاتی ہے تو یہ ایک اعلی موقع ہے کہ فائل خراب ہے.","Move corrupt files into the following folder:":"فاسٹ فائلوں کو مندرجہ ذیل فولڈر میں منتقل کریں:"," If checked, then any files which give errors will be moved into the specified folder.":"اگر جانچ پڑتال کی جائے تو، کسی بھی فائلوں کو جو غلطی دے دیئے گئے مخصوص فولڈر میں جائیں گے.","Corrupt file folder:":"فریب فائل فولڈر:","Run thorough file health check:":"مکمل فائل صحت کی جانچ پڑتال کریں:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"اگر جانچ پڑتال کی جاتی ہے تو، ہینڈبیکر کے بجائے ایک بہت سست، زیادہ مکمل ویڈیو صحت کی جانچ ایف ایف پیپ کا استعمال کرتے ہوئے چل جائے گا."," Based on Desani's 'ScanMedia.ps1' found at:":"دیسی کی 'ScanMedia.ps1' پر مبنی ہے:","Attempt to repair files after thorough check:":"مکمل چیک کرنے کے بعد فائلوں کی مرمت کرنے کی کوشش کریں:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"اگر جانچ پڑتال ہو تو، HBBatchBast کے FFmpeg کا استعمال کرتے ہوئے فائلوں کی مرمت کرنے کی کوشش کرے گی. ایک 'فائل' کے ساتھ ایک نئی فائل ذریعہ فائل کے طور پر ایک ہی فولڈر میں تخلیق کیا جائے گا.","'CRF' value to use when attempting to repair files:":"فائلوں کی مرمت کرنے کی کوشش کرتے وقت 'CRF' کی قیمت کا استعمال:","The default 'CRF' value is 23. Please see the following for more information:":"پہلے سے طے شدہ 'سی آر ایف' کی قیمت 23 ہے. مزید معلومات کے لئے مندرجہ ذیل ملاحظہ کریں.","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"سی آر ایف پیمانے کی حد 0-51 ہے، جہاں 0 نقصان دہ ہے، 23 پہلے سے طے شدہ ہے، اور 51 سب سے برا معیار ممکن ہے. کم قیمت عام طور پر اعلی معیار کی طرف جاتا ہے، اور ایک ذہین عقل کی حد 17-28 ہے. 17 یا 18 پر نظر ثانی سے نقصان دہ یا تقریبا اسی طرح؛ یہ ان پٹ کی ایک ہی یا تقریبا نظر آنا چاہئے لیکن یہ تکنیکی طور پر نقصان دہ نہیں ہے.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBastast اسکین شدہ فائل کے راستے کی ایک فہرست محفوظ کرتا ہے جو غیر جانبدار طور پر اطلاع دی جاتی ہے. تمام فائلوں پر تازہ اسکین انجام دینے کیلئے کیش کو صاف کریں.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"استعمال کرنے کے لئے بیک وقت ہینڈبیچ / FFmpeg مثالوں کی تعداد؟ (تجویز کردہ 4 یا کم):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"یہ ترتیب دونوں \"ویڈیو ہیلتھ چیک\" اور \"اسکین اور تبدیل\" عمل پر لاگو ہوتا ہے. ہینڈبیکر کے سلسلے کا استعمال کیسے کریں. اگرچہ اس سے زیادہ سے زیادہ استعمال نہ کرنے کی سفارش کی جاتی ہے اگرچہ زیادہ سے زیادہ نہیں ہے. اگر یہ بہت طاقتور نہیں ہے تو آپ کا کمپیوٹر منجمد ہوسکتا ہے.","Queue size view limit?(Recommended 1000 or fewer):":"قطار کے سائز کی حد کی حد (1000 یا کم کی سفارش کی گئی ہے):","Automatically start \"Scan and convert\" when program opened?:":"پروگرام کھولنے کے بعد خود بخود \"اسکین اور تبدیل کریں\" شروع کریں ؟:","Save verbose logs?:":"verbose لاگ ان کو محفوظ کریں ؟:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"تفصیلی ذیلی پروسیسنگ لاگ ان کو بچانے کیلئے اس چیک باکس کو چیک کریں. اس میں کارکن کنسول آؤٹ پٹ شامل ہے. یہ بہت بڑی لاگت کا سبب بن جائے گا.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"اگر ای میل کی اطلاعات حاصل کرنے کیلئے ای میل کی تفصیلات درج کریں تو صحت کی جانچ یا تبادلوں / فولڈر کو دیکھنے کے دوران کسی غلطی کا سامنا کرنا پڑتا ہے. اکاؤنٹس کے ساتھ کام نہیں کریں گے جو 2FA کی ضرورت ہوتی ہے. آپ کو Gmail کے اکاؤنٹس پر کم محفوظ اطلاقات تک رسائی کو فعال کرنے کی ضرورت ہے.","Email address:":"ای میل اڈریس:","For example:":"مثال کے طور پر:","Email password(not saved):":"ای میل پاس ورڈ (محفوظ نہیں ہے):","SMTP server:":"SMTP سرور:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"یہ خصوصیت کسی بھی ویب براؤزر کا استعمال کرتے ہوئے تبادلوں / صحت چیک کی حیثیت کی نگرانی کی اجازت دیتا ہے. سرورز چلتے وقت مفید. وغیرہ کوئی فائل نام نہیں بھیجے جاتے ہیں.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"اگر فعال ہو تو، مندرجہ ذیل گمنام ڈیٹا کو HBBatchBeast.io پر بھیج دیا جائے گا:","API key":"API کلیدی","Current status ('Searching', 'Running', 'Finished' etc)":"موجودہ حیثیت ('تلاش کرنا'، 'رننگ'، 'ختم' وغیرہ)","Number of:":"کی تعداد:","Remaining items":"باقی اشیاء","Successful items":"کامیاب اشیاء","Errored items":"خراب اشیاء","Cancelled items":"منسوخ شدہ اشیاء","Worker percentages":"مزدور فی صد","Last completed item time":"آخری مکمل وقت کا وقت","Enable remote monitoring?:":"ریموٹ نگرانی کو فعال کریں ؟:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"بنیادی بنچمارک کی افادیت بنیادی طور پر بنائی گئی ہے کہ کس طرح 16+ کور پروسیسرز ایک سے زیادہ ہینڈبیک مثال استعمال کرتے ہیں، لیکن یہ کسی قسم کے پروسیسر پر چل سکتا ہے.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"یہ ایک H265 4K نمونہ فائل (2.5MB) ڈاؤن لوڈ کریں اور پیش سیٹ کے ساتھ 4 ہینڈبیکر مثال کے طور پر \"بہت تیز 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"اگر آپ انتخاب کرتے ہیں تو نتائج hbbatchbeast.io پر اپ لوڈ کی جا سکتی ہے.","Queue":"قطار","Output this session":"اس سیشن کو آؤٹ کریں","Media info viewer tool":"میڈیا کی معلومات ناظرین کا آلہ","View replaced file cache":"تبدیل کردہ فائل کیش دیکھیں","Clear replaced file cache":"فائل کیش کی جگہ صاف کریں","Save config":"ترتیب محفوظ کریں","Scan only":"صرف اسکین","Scan and convert":"اسکین اور تبدیل کریں","View scan/conversion summary log":"اسکین / تبادلوں خلاصہ لاگ دیکھیں","View individual file check/conversion log":"انفرادی فائل چیک / تبادلوں کا لاگ ان کریں","View worker console output":"کارکن کنسول پیداوار دیکھیں","Health check":"صحت کی جانچ","Clear healthy file cache":"صحت مند فائل کیش صاف کریں","View error log":"غلطی لاگ ان دیکھیں","Email test":"ای میل کی جانچ","View master log":"ماسٹر لاگ دیکھیں","Wiki help":"ویکیپیڈیا کی مدد","An application by HaveAGitGat":"HasagitGat کی طرف سے ایک درخواست","New":"نئی","Launch":"شروع کریں","Benchmark":"بینچ","See results":"نتائج دیکھیں","Pause queue":"قطار رکھو","Continue queue":"قطار جاری رکھیں","Stop queue":"قطار بند کرو","Convert selected files":"منتخب فائلوں میں تبدیل کریں","Toggle queue view":"قطار کا نقطہ نظر نظر آتے ہیں","Deselect all":"سب کو منتخب کریں","Invert all":"سب کو تبدیل","Select all":"تمام منتخب کریں","Toggle output view":"پیداوار کا نقطہ نظر ٹول کریں"}