{"The number of custom presets does not match the number of source folders!":"Số lượng cài đặt trước tùy chỉnh không khớp với số lượng thư mục nguồn!","source folders have been detected.":"thư mục nguồn đã được phát hiện.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"dòng cài đặt trước tùy chỉnh đã được phát hiện. Vui lòng kiểm tra lại để ngắt dòng vô hình. Nên có một đường dẫn thư mục hoặc đặt trước trên mỗi dòng. Hãy chắc chắn rằng bạn đã vô tình tạo ra một dòng trống.","The number of filename suffixes does not match the number of source folders! ":"Số lượng hậu tố tên tệp không khớp với số lượng thư mục nguồn!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"tên dòng hậu tố đã được phát hiện. Vui lòng kiểm tra lại để ngắt dòng vô hình. Cần có một đường dẫn thư mục hoặc hậu tố tên tệp trên mỗi dòng. Hãy chắc chắn rằng bạn đã vô tình tạo ra một dòng trống.","The number of source folders does not match the number of destination folders!":"Số lượng thư mục nguồn không khớp với số lượng thư mục đích!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"thư mục đích đã được phát hiện. Vui lòng kiểm tra lại để ngắt dòng vô hình. Nên có một đường dẫn thư mục trên mỗi dòng. Hãy chắc chắn rằng bạn đã vô tình tạo ra một dòng trống.","The number of source folders does not match the number of temporary conversion folders!":"Số lượng thư mục nguồn không khớp với số lượng thư mục chuyển đổi tạm thời!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"thư mục chuyển đổi tạm thời đã được phát hiện. Vui lòng kiểm tra lại để ngắt dòng vô hình. Nên có một đường dẫn thư mục trên mỗi dòng. Hãy chắc chắn rằng bạn đã vô tình tạo ra một dòng trống.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"Vui lòng nhập một vùng chứa hợp lệ, chẳng hạn như '.mp4'. Đảm bảo bao gồm '.'","Corrupt file folder":"Thư mục tập tin bị hỏng","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"không tồn tại! Vui lòng đảm bảo không có khoảng trắng hoặc ký tự ẩn trước / sau đường dẫn","Source folder":"Thư mục nguồn","Temporary conversion folder":"Thư mục chuyển đổi tạm thời","appears to be the same as or is within source folder":"dường như giống hoặc trong thư mục nguồn","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"Điều này sẽ ngăn HBBatchBeast hoạt động chính xác. Vui lòng thay đổi thư mục chuyển đổi tạm thời thành một thư mục bên ngoài thư mục nguồn. Nếu bạn muốn sử dụng tính năng 'Thay thế tệp gốc', vui lòng chọn thư mục đích không giống với hoặc trong thư mục nguồn, sau đó chọn hộp kiểm 'Thay thế tệp gốc luôn' trong phần cài đặt nâng cao . Bỏ chọn hộp kiểm 'Thư mục chuyển đổi tạm thời' tạm thời vì nó sẽ không phục vụ trong trường hợp này. Các tập tin sẽ được chuyển đổi vào thư mục đích và sau đó được chuyển trở lại vào thư mục nguồn.","Destination folder":"Thư mục đích","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"Điều này sẽ ngăn HBBatchBeast hoạt động chính xác. Vui lòng thay đổi thư mục đích thành một thư mục bên ngoài thư mục nguồn. Nếu bạn muốn sử dụng tính năng 'Thay thế tệp gốc', vui lòng chọn thư mục đích không giống với hoặc trong thư mục nguồn, sau đó chọn hộp kiểm 'Thay thế tệp gốc luôn' trong phần cài đặt nâng cao . Bỏ chọn hộp kiểm 'Thư mục chuyển đổi tạm thời' tạm thời vì nó sẽ không phục vụ trong trường hợp này. Các tập tin sẽ được chuyển đổi vào thư mục đích và sau đó được chuyển trở lại vào thư mục nguồn.","Error creating temporary conversion folder":"Lỗi tạo thư mục chuyển đổi tạm thời","Error creating destination folder":"Lỗi khi tạo thư mục đích","Please select to use HandBrake or FFmpeg!":"Vui lòng chọn sử dụng HandBrake hoặc FFmpeg!","Please select a standard preset or input a custom one!":"Vui lòng chọn một cài đặt trước tiêu chuẩn hoặc nhập một tùy chỉnh!","Please select a scan interval of 5 seconds or greater!":"Vui lòng chọn khoảng thời gian quét từ 5 giây trở lên!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"Vui lòng đảm bảo số lượng phiên bản HandBrake / FFmpeg đồng thời sử dụng là một hoặc nhiều hơn!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"Khóa API không hợp lệ! Vui lòng nhấp vào 'Mới' trên tab giám sát từ xa để tạo khóa mới.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"Vui lòng nhập thời gian quét hàng ngày ở định dạng 24 giờ: hh: mm (ví dụ 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"PHIM NGUỒN S DEL ĐƯỢC XÓA SAU KHI CHUYỂN ĐỔI! Vui lòng kiểm tra trước khi sử dụng đúng cách!","Benchmark failed!":"Điểm chuẩn thất bại!","Log does not exist!":"Nhật ký không tồn tại!","Folder does not exist!":"Thư mục không tồn tại!","Error sending email! Please check your settings.":"Lỗi gửi email! Vui lòng kiểm tra cài đặt của bạn.","Test email sent!":"Đã gửi email kiểm tra!","All worker processes have been stopped.":"Tất cả các quy trình công nhân đã được dừng lại.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"Hàng đợi sẽ bị tạm dừng khi các mục hiện tại đã xử lý xong. Bạn có chắc chắn muốn tạm dừng hàng đợi?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"Tạm dừng hàng đợi được bắt đầu. Nút 'Tiếp tục' sẽ xuất hiện khi tất cả các công nhân đã tạm dừng.","Healthy file cache cleared!":"Xóa bộ nhớ cache tập tin lành mạnh!","Cache cleared!":"Đã xóa bộ nhớ cache!","Cancel item":"Hủy hàng","Please check the above checkbox to use this feature.":"Vui lòng kiểm tra hộp kiểm trên để sử dụng tính năng này.","Configuration":"Cấu hình","Source folders":"Thư mục nguồn","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"Đây là thư mục nguồn sẽ được quét cho phương tiện truyền thông. Các thư mục cần phải được nhập mà không có dấu gạch chéo. Ví dụ:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"Hộp đường dẫn thư mục nguồn có thể mở rộng (nhấn enter để tạo một dòng mới). Nếu bạn muốn chỉ định nhiều thư mục nguồn, hãy đảm bảo mỗi đường dẫn thư mục nguồn nằm trên một dòng riêng, chẳng hạn như:","Video health check":"Kiểm tra sức khỏe video","Batch conversion and Folder watching":"Chuyển đổi hàng loạt và xem thư mục","Remote Monitoring (Beta)":"Giám sát từ xa (Beta)","Benchmark (Beta)":"Điểm chuẩn (Beta)","System":"Hệ thống","Help":"Cứu giúp","Temporary conversion folders":"Thư mục chuyển đổi tạm thời","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"Nếu \"Thư mục chuyển đổi tạm thời?\" được kiểm tra, sau đó HandBrake sẽ chuyển đổi tập tin vào thư mục đó. Khi quá trình chuyển đổi kết thúc, tệp sẽ được chuyển vào \"Thư mục đích\" của bạn. Bạn sẽ cần chỉ định nhiều thư mục chuyển đổi tạm thời như các thư mục nguồn. Thư mục nguồn đầu tiên của bạn sẽ được chuyển đổi thành thư mục chuyển đổi tạm thời đầu tiên, thư mục nguồn thứ hai của bạn thành thư mục chuyển đổi tạm thời thứ hai, v.v. Đảm bảo rằng mỗi đường dẫn thư mục chuyển đổi tạm thời nằm trên một dòng riêng.","Destination folders":"Thư mục đích","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"Chỉ định đường dẫn thư mục đích. Một lần nữa, bạn sẽ cần chỉ định nhiều thư mục đích như các thư mục nguồn. Các tệp từ thư mục nguồn đầu tiên của bạn sẽ kết thúc trong thư mục đích đầu tiên, các tệp thư mục nguồn thứ hai trong thư mục đích thứ hai của bạn, v.v.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"Thư mục nguồn đầu tiên ---------> Thư mục chuyển đổi tạm thời đầu tiên ---------> Thư mục đích đầu tiên","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"Thư mục nguồn thứ hai ---------> Thư mục chuyển đổi tạm thời thứ hai ---------> Thư mục đích thứ hai","etc":"v.v.","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"HBBatchBeast sẽ không hoạt động chính xác nếu bạn đặt thư mục đích giống như hoặc trong thư mục nguồn.","Standard preset:":"Tiêu chuẩn đặt trước:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"Chọn cài đặt trước HandBrake mà bạn muốn chuyển đổi tệp của mình. Nếu \"Cài đặt sẵn tiêu chuẩn\" được chọn, thì tất cả các tệp trong các thư mục được chọn sẽ được chuyển đổi bằng cài đặt sẵn HandBrake được chỉ định. Bạn có thể tìm hiểu thêm về các cài đặt trước HandBrake tại đây:","Custom preset:":"Cài đặt trước tùy chỉnh:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"Nếu \"Cài đặt trước tùy chỉnh\" thì bạn cần nhập cài đặt trước tùy chỉnh của riêng bạn. HBBatchBeast bao gồm phần \"HandBrakeCLI -i source -o Destination\" của đầu vào HandBrakeCLI, do đó bạn cần nhập các tham số chuyển đổi. Ví dụ:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"Nếu sử dụng FFmpeg, bạn cần tách các tham số đầu vào và đầu ra bằng dấu phẩy. Nhu la:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"Bạn cũng có thể liên kết đến một cài đặt trước tùy chỉnh đã được xuất từ ứng dụng GUI HandBrake chính thức, ví dụ:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"Nếu bạn gặp sự cố với các cài đặt trước tùy chỉnh, có thể là do lỗi đã biết với HandBrakeCLI (sẽ được khắc phục trong bản phát hành HandBrakeCLI tiếp theo). Xin vui lòng xem điều này cho một giải pháp tạm thời:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"Mỗi cài đặt trước tùy chỉnh cần phải nằm trên một dòng riêng và tương tự như các thư mục, cần có nhiều cài đặt trước tùy chỉnh như các thư mục nguồn.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"Thư mục nguồn đầu tiên ---------> Thư mục chuyển đổi tạm thời đầu tiên ---------> Thư mục đích đầu tiên @ Cài đặt trước tùy chỉnh 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"Thư mục nguồn thứ hai ---------> Thư mục chuyển đổi tạm thời thứ hai ---------> Thư mục đích thứ hai @ Cài đặt trước tùy chỉnh 2","See the following image for guidance:":"Xem hình ảnh sau đây để được hướng dẫn:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"Nếu sử dụng mã hóa card đồ họa (như NVENC), thì bạn có thể cần giảm số lượng phiên bản HandBrake (thử 2 hoặc ít hơn) do giới hạn VRAM.","Select standard preset:":"Chọn cài đặt trước tiêu chuẩn:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"Đã phát hiện thấy NVENC, vui lòng đảm bảo giảm số lượng phiên bản HandBrakeCLI xuống 2 hoặc thấp hơn (đối với hầu hết các card đồ họa) hoặc bạn có thể gặp phải lỗi do không đủ VRAM. Cài đặt này có thể được tìm thấy trong tab \"Hệ thống\".","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"Đã phát hiện cài đặt sẵn đã nhập. Nếu bạn gặp sự cố với cài đặt trước tùy chỉnh đã nhập, có thể do lỗi đã biết với HandBrakeCLI (sẽ được khắc phục trong bản phát hành HandBrakeCLI tiếp theo). Một giải pháp tạm thời là xóa '\"PictureRotate\": \"0: 0\"' khỏi tệp .json. Thêm thông tin ở đây:","Container:":"Thùng đựng hàng:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"Chỉ định vùng chứa mà bạn muốn tệp đầu ra có, chẳng hạn như '.mp4'. Bạn có thể tìm hiểu thêm về container tại:","Enable periodic scanning:":"Cho phép quét định kỳ:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"HBBatchBeast có thể giám sát các thư mục nguồn của bạn và chạy quét các tệp mới trong một khoảng thời gian xác định. Thời gian cách nhau tính bằng giây với mặc định là 300 giây (5 phút). Nếu tùy chọn này được chọn, thì khi bạn nhấn \"Quét và chuyển đổi\", chương trình sẽ chuyển đổi bất kỳ tệp mới nào và sau đó đồng hồ đếm ngược sẽ bắt đầu. Điều này sẽ lặp vô hạn cho đến khi dừng lại. Khoảng thời gian quét là trong phần cài đặt nâng cao.","Enable daily scanning:":"Cho phép quét hàng ngày:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"Thay vì quét định kỳ, bạn có thể chọn quét để chạy một lần một ngày. Thời gian quét được nhập vào phần cài đặt nâng cao ở định dạng hh: mm, chẳng hạn như '18: 30 '. Khi \"Quét và chuyển đổi\" được chọn, chương trình sẽ đợi cho đến thời gian được chỉ định cho đến khi chạy quy trình quét và chuyển đổi. Một lần nữa, điều này sẽ lặp lại vô tận cho đến khi dừng lại.","Show/hide advanced:":"Hiển thị / ẩn nâng cao:","Scan interval (minimum 5 seconds):":"Khoảng thời gian quét (tối thiểu 5 giây):","Daily run time (hh:mm):":"Thời gian chạy hàng ngày (hh: mm):","Output filename suffix:":"Hậu tố tên tệp đầu ra:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"Đây là tùy chọn. Bạn có thể chỉ định một hậu tố để thêm vào cuối tên tệp của mình như '_1080p' hoặc '_testconversion', v.v.","If 'standard preset' is selected then all output files will have the same suffix.":"Nếu 'cài đặt sẵn tiêu chuẩn' được chọn thì tất cả các tệp đầu ra sẽ có cùng hậu tố.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"Nếu 'cài đặt trước tùy chỉnh' được chọn thì bạn có thể chỉ định một hậu tố cho mỗi thư mục nguồn / cài đặt trước tùy chỉnh. Hãy chắc chắn rằng mỗi hậu tố nằm trên dòng riêng của nó. Ví dụ: nếu bạn có 2 thư mục nguồn và đang sử dụng 'cài đặt trước tùy chỉnh', bạn có thể đặt thư mục này vào hộp hậu tố tên tệp:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"Các tệp trong thư mục nguồn đầu tiên sẽ có '_720p' được thêm vào tên tệp đầu ra. Các tệp trong thư mục nguồn thứ hai sẽ có '_1080p' được thêm vào tên tệp đầu ra, v.v.","Include these file containers:":"Bao gồm các thùng chứa tập tin:","Enter the file containers to scan for. Each type needs to be separated by a comma. The default entry is:":"Nhập các tập tin chứa để quét. Mỗi loại cần được phân tách bằng dấu phẩy. Mục nhập mặc định là:","Exclude files smaller than (MB):":"Loại trừ các tệp nhỏ hơn (MB):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"Chỉ định xem có loại trừ các tệp nhỏ hơn một kích thước nhất định khỏi chuyển đổi không (tính bằng megabyte)","Exclude files larger than (MB):":"Loại trừ các tệp lớn hơn (MB):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"Chỉ định xem có loại trừ các tệp lớn hơn một kích thước nhất định khỏi chuyển đổi không (tính bằng megabyte)","Exclude filenames which include any of these words:":"Không bao gồm tên tệp bao gồm bất kỳ từ nào trong số này:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"Nhập từ khóa để được lọc ra khi quét tệp. Ví dụ: nếu \"720p\" được nhập, thì mọi tệp có \"720p\" trong tiêu đề sẽ không được chuyển đổi. Một lần nữa, các từ khóa cần được phân tách bằng dấu phẩy. Ví dụ: nhập thông tin sau vào hộp lọc:","Include files with any ":"Bao gồm các tệp với bất kỳ"," or all ":"hoặc tất cả"," of these":"trong số này","properties:":"tính chất:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"Tại đây, bạn có thể nhập các thuộc tính video và âm thanh mà các tệp phải có để được chuyển đổi (thông tin được trích xuất bằng FFprobe). Các thuộc tính phải được phân tách bằng dấu phẩy. Sử dụng công cụ xem thông tin đa phương tiện để giúp xác định những thuộc tính bạn muốn đưa vào. Đảm bảo đặt dấu phẩy sau thuộc tính cuối cùng. Ví dụ: để chỉ chuyển đổi các tệp được mã hóa bằng âm thanh nổi h264 và aac:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"Cần lưu ý rằng kiểm tra thuộc tính này được thực hiện khi quá trình chuyển đổi bắt đầu (để tiết kiệm thời gian trong khi xây dựng hàng đợi), vì vậy mặc dù các tệp có thể xuất hiện trong hàng đợi chuyển đổi, chúng sẽ bị bỏ qua / bao gồm nếu đáp ứng các điều kiện chính xác.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"Nếu FFprobe có thể trích xuất các thuộc tính, thì 'OK' sẽ xuất hiện trong cột \"FFprobe\" trong chế độ xem hàng đợi.","Exclude files with any ":"Loại trừ các tệp với bất kỳ"," of these ":"trong số này","The opposite of 'Include files with any or all of these properties'":"Ngược lại với 'Bao gồm các tệp với bất kỳ hoặc tất cả các thuộc tính này'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"Đây là một công cụ nhỏ để phân tích các thuộc tính tệp để giúp bạn xác định thuộc tính nào bạn muốn bao gồm / loại trừ trong các tùy chọn ở trên. Nó sử dụng FFprobe để trả về thông tin. Kéo và thả tệp vào hộp màu xám để phân tích chúng. Ví dụ: thả vào tệp kiểm tra có thể trả về các mục sau:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"Nếu bạn đang tìm cách loại trừ các tệp như thế này khỏi bị chuyển đổi, thì bạn có thể đặt một số thuộc tính tệp vào hộp \"Loại trừ tệp với bất kỳ hoặc tất cả các thuộc tính này\" và chọn hộp kiểm bên cạnh 'all' thay vì 'any', như vậy","Copy excluded files to destination:":"Sao chép các tệp bị loại trừ đến đích:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"Nếu bạn chọn tùy chọn này, thì các tệp đã bị loại trừ khỏi chuyển đổi sẽ được sao chép trực tiếp vào thư mục đích. Điều này áp dụng cho các bộ lọc sau:","Exclude filenames which include any of these words":"Không bao gồm tên tệp bao gồm bất kỳ từ nào trong số những từ này","Include files with any or all of these properties":"Bao gồm các tệp có bất kỳ hoặc tất cả các thuộc tính này","Exclude files with any or all of these properties":"Loại trừ các tệp có bất kỳ hoặc tất cả các thuộc tính này","Exclude files smaller than (MB)":"Loại trừ các tệp nhỏ hơn (MB)","Exclude files larger than (MB)":"Loại trừ các tệp lớn hơn (MB)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"Lưu ý điều này cũng áp dụng cho các tệp bị loại trừ vì chúng không đáp ứng các điều kiện thuộc tính \"Bao gồm\" ở trên để không vô tình sao chép toàn bộ thư viện khi bạn chỉ cố gắng chuyển đổi một vài tệp.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"Tính năng sao chép không áp dụng cho các bộ lọc sau (tức là các tệp bị loại do bộ lọc)","Include these file types":"Bao gồm các loại tệp","Delete source files after conversion:":"Xóa các tệp nguồn sau khi chuyển đổi:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"Nếu điều này được chọn, thì nếu một nỗ lực chuyển đổi thành công, tệp nguồn sẽ bị xóa. Quá trình này được thực hiện ở cuối, sau khi chuyển đổi tất cả các tệp. Điều này có nghĩa là bạn có thể chuyển đổi các tệp nguồn giống nhau bằng nhiều cài đặt trước, tất cả trong một lần. Các tập tin nguồn sau đó sẽ bị xóa sau đó.","Replace original file if converted file is smaller?(Compress attempt)":"Thay thế tệp gốc nếu tệp được chuyển đổi nhỏ hơn? (Nén nỗ lực)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"Chọn hộp kiểm này nếu bạn muốn HBBatchBeast tự động thay thế tệp nguồn gốc nếu tệp mới nhỏ hơn. Nếu tệp mới không nhỏ hơn, thì nó sẽ được để lại trong thư mục đích.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Đảm bảo thư mục đích của bạn không giống với / hoặc bên trong, thư mục nguồn của bạn hoặc nó sẽ không hoạt động đúng.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Khi HBBatchBeast đã cố gắng nén một tệp cụ thể, nó sẽ thêm đường dẫn tệp đó vào bộ đệm để nó sẽ không được thử lại trong tương lai. Bạn có thể xem / chỉnh sửa / xóa bộ đệm bằng các nút màu vàng.","Replace original file always?":"Thay thế tập tin gốc luôn?","The original file will be replaced regardless of whether the new file is larger or smaller.":"Tệp gốc sẽ được thay thế bất kể tệp mới lớn hơn hay nhỏ hơn.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"Một lần nữa, đảm bảo thư mục đích của bạn không giống với / hoặc bên trong, thư mục nguồn của bạn hoặc nó sẽ không hoạt động đúng.","Once HBBatchBeast has transcoded a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"Khi HBBatchBeast đã chuyển mã một tệp cụ thể, nó sẽ thêm đường dẫn tệp đó vào bộ đệm để không bị thử lại trong tương lai. Bạn có thể xem / chỉnh sửa / xóa bộ đệm bằng các nút màu vàng.","Copy subtitle (srt) files to destination?":"Sao chép tập tin phụ đề (srt) đến đích?","Subtitle '.srt' files will be copied to the destination folder automatically.":"Các tập tin phụ đề '.srt' sẽ được tự động sao chép vào thư mục đích.","Automatically create temporary/destination folders if they don't exist?":"Tự động tạo thư mục tạm thời / đích nếu chúng không tồn tại?","Custom bat path to run after each conversion (leave blank if not using):":"Đường dẫn dơi tùy chỉnh để chạy sau mỗi chuyển đổi (để trống nếu không sử dụng):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"Nhập đường dẫn đến tệp bó tùy chỉnh mà bạn muốn thực hiện sau mỗi lần chuyển đổi. Ví dụ:","Batch files with timeout statements won't work. More info here:":"Các tệp hàng loạt với các câu lệnh hết thời gian sẽ không hoạt động. Thêm thông tin ở đây:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"Để trống ô hoàn toàn nếu bạn không muốn sử dụng tùy chọn này (đảm bảo không có ký tự ẩn trong hộp)","Run processes at low priority?":"Chạy các quy trình ở mức ưu tiên thấp?","All conversion processes will be run at low priority, reducing processor usage.":"Tất cả các quy trình chuyển đổi sẽ được chạy ở mức ưu tiên thấp, giảm mức sử dụng bộ xử lý.","Remove apostrophes from filenames:":"Xóa dấu nháy đơn khỏi tên tệp:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"Chuyển đổi / quét kiểm tra sức khỏe có thể thất bại nếu tên tệp có dấu nháy đơn. Kiểm tra điều này để tự động xóa dấu nháy đơn khỏi tên tệp."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"Tính năng này có thể quét các tệp video bị hỏng bằng tính năng '--scan' của HandBrake, mặc dù điều này không phải lúc nào cũng chính xác. Nó cũng sử dụng FFprobe để cung cấp một điểm tham chiếu thứ hai. Nếu cả FFprobe và HandBrake đều thất bại thì khả năng cao là tệp bị hỏng.","Move corrupt files into the following folder:":"Di chuyển các tệp bị hỏng vào thư mục sau:"," If checked, then any files which give errors will be moved into the specified folder.":"Nếu được chọn, thì bất kỳ tệp nào báo lỗi sẽ được chuyển vào thư mục đã chỉ định.","Corrupt file folder:":"Thư mục tập tin bị hỏng:","Run thorough file health check:":"Chạy kiểm tra sức khỏe tập tin kỹ lưỡng:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"Nếu được chọn, thì kiểm tra sức khỏe video kỹ lưỡng hơn, chậm hơn nhiều sẽ được chạy bằng FFmpeg thay vì HandBrake."," Based on Desani's 'ScanMedia.ps1' found at:":"Dựa trên 'ScanMedia.ps1' của Desani được tìm thấy tại:","Attempt to repair files after thorough check:":"Cố gắng sửa chữa các tập tin sau khi kiểm tra kỹ lưỡng:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"Nếu được chọn, HBBatchBeast sẽ cố gắng sửa chữa các tệp bằng FFmpeg. Một tệp mới có hậu tố '_repaired' sẽ được tạo trong cùng thư mục với tệp nguồn.","'CRF' value to use when attempting to repair files:":"Giá trị 'CRF' để sử dụng khi cố gắng sửa chữa các tệp:","The default 'CRF' value is 23. Please see the following for more information:":"Giá trị 'CRF' mặc định là 23. Vui lòng xem phần sau để biết thêm thông tin:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"Phạm vi của thang CRF là 0 mộc51, trong đó 0 là lossless, 23 là mặc định và 51 là chất lượng kém nhất có thể. Giá trị thấp hơn thường dẫn đến chất lượng cao hơn và phạm vi lành mạnh chủ quan là 17 Tắt28. Xem xét 17 hoặc 18 là mất thị giác hoặc gần như vậy; nó sẽ trông giống hoặc gần giống với đầu vào nhưng về mặt kỹ thuật thì không mất dữ liệu.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"HBBatchBeast lưu một danh sách các đường dẫn tệp được quét được báo cáo là không tham nhũng. Xóa bộ nhớ cache để thực hiện quét mới trên tất cả các tệp.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"Số lượng phiên bản HandBrake / FFmpeg đồng thời sẽ sử dụng? (Khuyến nghị 4 hoặc ít hơn):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"Cài đặt này áp dụng cho cả quá trình \"Kiểm tra sức khỏe video\" và \"Quét và chuyển đổi\". Chỉ định có bao nhiêu chủ đề HandBrake để sử dụng. Không có mức tối đa mặc dù không nên sử dụng nhiều hơn 4. Số tiền cao hơn có thể đóng băng máy tính của bạn nếu nó không mạnh lắm.","Queue size view limit?(Recommended 1000 or fewer):":"Giới hạn kích thước xem hàng đợi? (Khuyến nghị 1000 hoặc ít hơn):","Automatically start \"Scan and convert\" when program opened?:":"Tự động bắt đầu \"Quét và chuyển đổi\" khi chương trình mở?:","Save verbose logs?:":"Lưu nhật ký dài dòng?:","Check this checkbox to save detailed sub-process logs. This includes worker console ouput. This will cause very large logs.":"Chọn hộp kiểm này để lưu nhật ký quy trình phụ chi tiết. Điều này bao gồm ouput giao diện điều khiển công nhân. Điều này sẽ gây ra các bản ghi rất lớn.","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"Điền chi tiết email để nhận thông báo email nếu gặp lỗi trong quá trình kiểm tra sức khỏe hoặc chuyển đổi / xem thư mục. Không hoạt động với các tài khoản yêu cầu 2FA. Bạn cần kích hoạt quyền truy cập vào các ứng dụng kém an toàn hơn trên tài khoản Gmail.","Email address:":"Địa chỉ email:","For example:":"Ví dụ:","Email password(not saved):":"Mật khẩu email (không được lưu):","SMTP server:":"Máy chủ SMTP:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc. No filenames are sent.":"Tính năng này cho phép theo dõi tình trạng kiểm tra chuyển đổi / kiểm tra sức khỏe bằng bất kỳ trình duyệt web nào. Hữu ích khi chạy máy chủ, vv Không có tên tệp được gửi.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"Nếu được bật, dữ liệu ẩn danh sau sẽ được gửi tới HBBatchBeast.io:","API key":"Mã API","Current status ('Searching', 'Running', 'Finished' etc)":"Trạng thái hiện tại ('Tìm kiếm', 'Đang chạy', 'Đã hoàn thành', v.v.)","Number of:":"Số lượng:","Remaining items":"Hạng mục còn lại","Successful items":"Mục thành công","Errored items":"Các mặt hàng bị xóa","Cancelled items":"Các mặt hàng bị hủy","Worker percentages":"Tỷ lệ công nhân","Last completed item time":"Thời gian hoàn thành mục cuối cùng","Enable remote monitoring?:":"Cho phép giám sát từ xa?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"Một tiện ích đo điểm chuẩn cơ bản được xây dựng chủ yếu để xem cách 16+ bộ xử lý lõi hoạt động bằng cách sử dụng nhiều phiên bản HandBrake mặc dù nó có thể chạy trên bất kỳ loại bộ xử lý nào.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"Điều này sẽ tải xuống tệp mẫu h265 4k (2,5 MB) và chạy điểm chuẩn bằng 4 phiên bản HandBrake với giá trị đặt trước \"Rất nhanh 1080p30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"Kết quả có thể được tải lên hbbatchbeast.io nếu bạn chọn.","Queue":"Xếp hàng","Output this session":"Đầu ra phiên này","Media info viewer tool":"Công cụ xem thông tin truyền thông","View replaced file cache":"Xem bộ đệm tập tin thay thế","Clear replaced file cache":"Xóa bộ nhớ cache thay thế tập tin","Save config":"Lưu cấu hình","Scan only":"Chỉ quét","Scan and convert":"Quét và chuyển đổi","View scan/conversion summary log":"Xem nhật ký tóm tắt quét / chuyển đổi","View individual file check/conversion log":"Xem nhật ký kiểm tra / chuyển đổi tệp cá nhân","View worker console output":"Xem đầu ra giao diện điều khiển công nhân","Health check":"Kiểm tra sức khỏe","Clear healthy file cache":"Xóa bộ nhớ cache tập tin lành mạnh","View error log":"Xem nhật ký lỗi","Email test":"Kiểm tra email","View master log":"Xem nhật ký chính","Wiki help":"Wiki giúp","An application by HaveAGitGat":"Một ứng dụng của HaveAGitGat","New":"Mới","Launch":"Phóng","Benchmark":"Điểm chuẩn","See results":"Xem kết quả","Pause queue":"Tạm dừng hàng đợi","Continue queue":"Tiếp tục xếp hàng","Stop queue":"Dừng hàng đợi","Convert selected files":"Chuyển đổi tập tin đã chọn","Toggle queue view":"Chuyển đổi chế độ xem hàng đợi","Deselect all":"Bỏ chọn tất cả","Invert all":"Đảo ngược tất cả","Select all":"Chọn tất cả","Toggle output view":"Chuyển đổi chế độ xem đầu ra"}