{"The number of custom presets does not match the number of source folders!":"די נומער פון מנהג פּרעסעץ טוט ניט גלייַכן די נומער פון מקור פאָלדערס!","source folders have been detected.":"מקור פאָלדערס האָבן שוין דיטעקטאַד.","custom preset lines have been detected. Please double check for invisible line breaks. There should be one folder path or preset per line. Make sure you haven't accidentally created a blank line.":"מנהג פּריסעט שורות האָבן שוין דיטעקטאַד. ביטע טאָפּל טשעק פֿאַר ומזעיק שורה ברייקס. עס זאָל זיין איין טעקע דרך אָדער פּריסעט פּער שורה. מאַכן זיכער איר האָבן ניט אַקסאַדענאַלי באשאפן אַ ליידיק שורה.","The number of filename suffixes does not match the number of source folders! ":"די נומער פון פילענאַמע סופפיקסעס טוט נישט גלייַכן די נומער פון מקור פאָלדערס!","filename suffix lines have been detected. Please double check for invisible line breaks. There should be one folder path or filename suffix per line. Make sure you haven't accidentally created a blank line.":"פיליפינען סאַפיקס שורות האָבן שוין דיטעקטאַד. ביטע טאָפּל טשעק פֿאַר ומזעיק שורה ברייקס. עס זאָל זיין איין טעקע דרך אָדער פילענאַמע סאַפיקס פּער שורה. מאַכן זיכער איר האָבן ניט אַקסאַדענאַלי באשאפן אַ ליידיק שורה.","The number of source folders does not match the number of destination folders!":"די נומער פון מקור פאָלדערס טוט ניט גלייַכן די נומער פון דעסטיניישאַן פאָלדערס!","destination folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"דעסטיניישאַן פאָלדערס האָבן שוין דיטעקטאַד. ביטע טאָפּל טשעק פֿאַר ומזעיק שורה ברייקס. עס זאָל זיין איין טעקע דרך פּער שורה. מאַכן זיכער איר האָבן ניט אַקסאַדענאַלי באשאפן אַ ליידיק שורה.","The number of source folders does not match the number of temporary conversion folders!":"די נומער פון מקור פאָלדערס טוט ניט גלייַכן די נומער פון צייַטווייַליק קאַנווערזשאַן פאָלדערס!","temporary conversion folders have been detected. Please double check for invisible line breaks. There should be one folder path per line. Make sure you haven't accidentally created a blank line.":"צייטווייַזער קאַנווערזשאַן פאָלדערס האָבן שוין דיטעקטאַד. ביטע טאָפּל טשעק פֿאַר ומזעיק שורה ברייקס. עס זאָל זיין איין טעקע דרך פּער שורה. מאַכן זיכער איר האָבן ניט אַקסאַדענאַלי באשאפן אַ ליידיק שורה.","Please enter a valid container such as '.mp4'. Make sure to include the '.'":"ביטע אַרייַן אַ גילטיק קאַנטיינער אַזאַ ווי '. מפּ 4'. מאַכן זיכער צו אַרייַננעמען די '.'","Corrupt file folder":"Corrupt טעקע טעקע","does not exist! Please make sure there are no spaces or hidden characters before/after the path":"טוט נישט עקסיסטירן! ביטע מאַכן זיכער עס זענען קיין ספּייסאַז אָדער פאַרבאָרגן אותיות איידער / נאָך די דרך","Source folder":"מקור טעקע","Temporary conversion folder":"Temporary conversion folder","appears to be the same as or is within source folder":"קען זיין די זעלבע ווי אָדער איז אין מקור טעקע","which will prevent HBBatchBeast from functioning correctly. Please change the temporary conversion folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"וואָס וועט פאַרמייַדן הבבאַטטשבעאַסט פון פאַנגקשאַנינג ריכטיק. ביטע טוישן די צייַטווייַליק קאַנווערזשאַן טעקע צו אַ טעקע אַרויס פון די מקור טעקע. אויב איר ווילן צו נוצן די 'רעפּלאַסע אָריגינעל טעקעס שטריך', ביטע אויסקלייַבן אַ דעסטיניישאַן טעקע וואָס איז ניט די זעלבע ווי אין די מקור טעקע און דעמאָלט טשעק די 'אָרביטירן אָריגינעל טעקעס שטענדיק' טשעקקבאָקס אין די אַוואַנסירטע סעטטינגס אָפּטיילונג . באַשטעטיק די צייטווייליגע 'טעמפּערערי קאַנווערזשאַן טעקע' טשעקקבאָקס ווי עס וועט דינען קיין נוצן אין דעם פאַל. טעקעס וועט ווערן קאָנווערטעד אין די דעסטיניישאַן טעקע און דעמאָלט אריבערגעפארן צוריק אין דער מקור טעקע.","Destination folder":"Destination folder","which will prevent HBBatchBeast from functioning correctly. Please change the destination folder to a folder outside of the source folder. If you're wanting to use the 'Replace original files feature', please select a destination folder that is not the same as, or within, the source folder, and then check the 'Replace original files always' checkbox in the advanced settings section. Uncheck the temporary 'Temporary conversion folder' checkbox as it will serve no use in this case. Files will be converted into the destination folder and then moved back into the source folder.":"וואָס וועט פאַרמייַדן הבבאַטטשבעאַסט פון פאַנגקשאַנינג ריכטיק. ביטע טוישן די דעסטאַניישאַן טעקע צו אַ טעקע אַרויס פון די מקור טעקע. אויב איר ווילן צו נוצן די 'רעפּלאַסע אָריגינעל טעקעס שטריך', ביטע אויסקלייַבן אַ דעסטיניישאַן טעקע וואָס איז ניט די זעלבע ווי אין די מקור טעקע און דעמאָלט טשעק די 'אָרביטירן אָריגינעל טעקעס שטענדיק' טשעקקבאָקס אין די אַוואַנסירטע סעטטינגס אָפּטיילונג . באַשטעטיק די צייטווייליגע 'טעמפּערערי קאַנווערזשאַן טעקע' טשעקקבאָקס ווי עס וועט דינען קיין נוצן אין דעם פאַל. טעקעס וועט ווערן קאָנווערטעד אין די דעסטיניישאַן טעקע און דעמאָלט אריבערגעפארן צוריק אין דער מקור טעקע.","Error creating temporary conversion folder":"טעות שאפן צייַטווייַליק קאַנווערזשאַן טעקע","Error creating destination folder":"טעות שאפן דעסטיניישאַן טעקע","Please select to use HandBrake or FFmpeg!":"ביטע אויסקלייַבן צו נוצן האַנדבראַקע אָדער פפמפּעג!","Please select a standard preset or input a custom one!":"ביטע אויסקלייַבן אַ נאָרמאַל פּאָסיטה אָדער אַרייַנשרייַב אַ מנהג איינער!","Please select a scan interval of 5 seconds or greater!":"ביטע אויסקלייַבן אַ יבערקוקן מעהאַלעך פון 5 סעקונדעס אָדער מער!","Please make sure the number of simultaneous HandBrake/FFmpeg instances to use is one or greater!":"ביטע מאַכן זיכער די נומער פון סיימאַלטייניאַס האַנדבראַקע / פפמפּעג ינסטאַנסיז צו נוצן איז איינער אָדער מער!","Invalid API key! Please click 'New' on the remote monitoring tab to generate a new key.":"פאַרקריפּלט אַפּי שליסל! ביטע גיט 'ניו' אויף די ווייַט מאָניטאָרינג קוויטל צו דזשענערייט אַ נייַ שליסל.","Please enter a daily scan time in 24 hour format: hh:mm (for example 13:02)":"ביטע אַרייַן אַ טעגלעך יבערקוקן צייַט אין 24 שעה פֿאָרמאַט: הה: מם (פֿאַר בייַשפּיל 13:02)","SOURCE FILES WILL BE DELETED AFTER CONVERSION! Please test before proper use!":"סאָורס טעקעס וועט זיין דילייטיד נאָך קאַנווערזשאַן! ביטע פּרובירן איידער געהעריק נוצן!","Benchmark failed!":"Benchmark failed!","Log does not exist!":"קלאָץ טוט נישט עקסיסטירן!","Folder does not exist!":"טעקע טוט נישט עקסיסטירן!","Error sending email! Please check your settings.":"טעות שיקט email! ביטע טשעק דיין סעטטינגס.","Test email sent!":"טעסט עמאַיל געשיקט!","All worker processes have been stopped.":"אַלע אַרבעטער פּראַסעסאַז האָבן שוין פארשטאפט.","Queue will be paused once current items have finished processing. Are you sure you want to pause the queue?":"רייע וועט זיין פּיוזד אַמאָל קראַנט זאכן האָבן פאַרטיק פּראַסעסינג. ביסט איר זיכער איר ווילן צו פאַרריכטן די ריי?","Queue pause initiated.'Continue' button will appear once all workers have paused.":"רייצנ פּויזע ינישיייטיד. 'קאָנטינוע' קנעפּל וועט דערשייַנען אַמאָל אַלע וואָרקערס האָבן פּאָזד.","Healthy file cache cleared!":"געזונט טעקע קאַש קלירד!","Cache cleared!":"Cache cleared!","Cancel item":"באָטל מאַכן נומער","Please check the above checkbox to use this feature.":"ביטע טשעק די אויבן קאָנטראָל קעסטל צו נוצן דעם שטריך.","Configuration":"קאָנפיגוראַטיאָן","Source folders":"מקור פאָלדערס","This is the source folder which will be scanned for media. The folder needs to be entered with no trailing slash. For example:":"דעם איז דער מקור טעקע וואָס וועט זיין סקאַנד פֿאַר מידיאַ. דער טעקע דארף זיין אריין מיט קיין טרילינג צעהאַקן. פֿאַר בייַשפּיל:","The source folder path box is expandable (press enter to create a new line). If you want to specify multiple source folders, make sure each source folder path is on its own line such as:":"די מקור טעקע וועג קעסטל איז יקספּאַנדאַבאַל (דריקן אַרייַן צו שאַפֿן אַ נייַ שורה). אויב איר ווילן צו ספּעציפיצירן קייפל מקור פאָלדערס, מאַכן זיכער יעדער מקור טעקע דרך איז אויף זייַן אייגן שורה אַזאַ ווי:","Video health check":"ווידעא געזונט טשעק","Batch conversion and Folder watching":"פּעקל קאַנווערזשאַן און טעקע וואַטשינג","Remote Monitoring (Beta)":"ווייַט מאָניטאָרינג (ביתא)","Benchmark (Beta)":"בענטשמאַרק (ביתא)","System":"סיסטעם","Help":"הילף","Temporary conversion folders":"טעמפּערערי קאַנווערזשאַן פאָלדערס","If \"Temporary conversion folder?\" is checked, then HandBrake will convert files into that folder. Once the conversion is finished, the file will be moved into your \"Destination folder\". You'll need to specify as many temporary conversion folders as source folders. Your first source folder will be converted into your first temporary conversion folder, your second source folder into your second temporary conversion folder and so on. Make sure each temporary conversion folder path is on its own line.":"אויב \"צייַטווייַליק קאַנווערזשאַן טעקע?\" איז אָפּגעשטעלט, דעמאָלט האַנדבראַקע וועט גער טעקעס אין אַז טעקע. אַמאָל די קאַנווערזשאַן איז פאַרטיק, די טעקע וועט זיין אריבערגעפארן אין דיין \"דעסטינאַטיאָן טעקע\". איר דאַרפֿן צו ספּעציפיצירן ווי פילע צייַטווייַליק קאַנווערזשאַן פאָלדערס ווי מקור פאָלדערס. דיין ערשטער מקור טעקע וועט ווערן קאָנווערטעד אין דיין ערשטער צייַטווייַליק קאַנווערזשאַן טעקע, דיין צווייט מקור טעקע אין דיין רגע צייַטווייַליק קאַנווערזשאַן טעקע און אַזוי אויף. מאַכן זיכער יעדער צייַטווייַליק קאַנווערזשאַן טעקע דרך איז אויף זייַן אייגן שורה.","Destination folders":"Destination folders","Specify destination folder paths. Again, you'll need to specify as many destination folders as source folders. Files from your first source folder will end up in your first destination folder, your second source folder files in your second destination folder and so on.":"ספּעציפיצירן דעסטיניישאַן טעקע פּאַטס. ווידער, איר וועט דאַרפֿן צו ספּעציפיצירן ווי פילע דעסטיניישאַן פאָלדערס ווי מקור פאָלדערס. טעקעס פון דיין ערשטער מקור טעקע וועט סוף אַרויף אין דיין ערשטער דעסטאַניישאַן טעקע, דיין צווייט מקור טעקע טעקעס אין דיין רגע דעסטאַניישאַן טעקע און אַזוי אויף.","First source folder ---------> First temporary conversion folder ---------> First destination folder":"ערשטער מקור טעקע ---------> ערשטער צייַטווייַליק קאַנווערזשאַן טעקע ---------> ערשטער דעסטיניישאַן טעקע","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder":"צווייטע מקור טעקע ---------> צווייטע צייַטווייַליק קאַנווערזשאַן טעקע ---------> צווייטע דעסטיניישאַן טעקע","etc":"עטק","HBBatchBeast won't work properly if you set the destination folder the same as, or within, the source folder. ":"הבבאַטטשבעאַסט וועט נישט אַרבעטן רעכט אויב איר שטעלן דעם דעסטיניישאַן טעקע די זעלבע ווי, אָדער ין, די מקור טעקע.","Standard preset:":"Standard Preset:","Select the HandBrake preset you'd like to convert your files with. If \"Standard preset\" is selected, then all files in the folders selected will be converted using the specified HandBrake preset. You can find more about HandBrake presets here:":"אויסקלייַבן די האַנדבראַקע פּרעסיס איר'ד ווי צו בייַטן דיין טעקעס מיט. אויב \"סטאַנדאַרד פּריסעט\" איז אויסגעקליבן, דעמאָלט אַלע טעקעס אין די פאָלדערס אויסגעקליבן וועט ווערן קאָנווערטעד ניצן די ספּעסאַפייד האַנדבראַקע פּריסעט. איר קענען געפינען מער וועגן האַנדבראַקע פּרעסעץ דאָ:","Custom preset:":"מנהג פּריסעט:","If \"Custom preset\" then you need to enter your own custom preset. HBBatchBeast covers the \"HandBrakeCLI -i source -o destination\" part of the HandBrakeCLI input so you need to enter the conversion parameters. For example:":"אויב \"קאַסטאַם פּריסעט\", איר דאַרפֿן צו אַרייַן אייער אייגן מנהג פּרעסעט. הבבאַטטשבעאַסט קאָווערס די \"האַנדבראַקלעקלי -י מקור -אָ דעסטיניישאַן\" טייל פון די האַנדבראַקלעקלי אַרייַנשרייַב אַזוי איר דאַרפֿן צו אַרייַן די קאַנווערזשאַן פּאַראַמעטערס. פֿאַר בייַשפּיל:","If using FFmpeg, you need to separate the input and output parameters with a comma. Such as:":"אויב ניצן פפמפּעג, איר דאַרפֿן צו באַזונדער די אַרייַנשרייַב און רעזולטאַט פּאַראַמעטערס מיט אַ קאָמע. אזוי ווי:","You can also link to a custom preset that's been exported from the official HandBrake GUI application for example:":"איר קען אויך פֿאַרבינדונג צו אַ מנהג פּרעסיס וואָס איז געווען יקספּאָרטאַד פון די באַאַמטער האַנדבראַקע גוי אַפּלאַקיישאַן פֿאַר בייַשפּיל:","If you're having trouble with custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). Please see this for a temporary solution:":"אויב איר האָבן אַ קאָנפליקט מיט מנהג פּרעסעץ, עס קען זיין אַ באַקוועם זשוק מיט די האַנדבראַקלעקלי (וועט זיין פאַרפעסטיקט אין ווייַטער האַנדבראַקלעקלי מעלדונג). ביטע זען דעם פֿאַר אַ צייַטווייַליק לייזונג:","Each custom preset needs to be on its own line and, similar to the folders, there need to be as many custom presets as source folders.":"יעדער מנהג פּרעסעט באדערפענישן צו זיין אויף זייַן אייגן שורה און, ענלעך צו די פאָלדערס, עס זאָל זיין ווי פילע מנהג פּרעסעץ ווי מקור פאָלדערס.","First source folder ---------> First temporary conversion folder ---------> First destination folder @ Custom preset 1":"ערשטער מקור טעקע ---------> ערשטער צייַטווייַליק קאַנווערזשאַן טעקע ---------> ערשטער דעסטיניישאַן טעקע @ Custom preset 1","Second source folder ---------> Second temporary conversion folder ---------> Second destination folder @ Custom preset 2":"צווייטע מקור טעקע ---------> צווייטע צייַטווייַליק קאַנווערזשאַן טעקע ---------> צווייטע דעסטיניישאַן טעקע @ Custom preset 2","See the following image for guidance:":"זען די פאלגענדע בילד פֿאַר גיידאַנס:","If using graphics card encoding (such as NVENC), then you may need to reduce the number of HandBrake instances (try 2 or fewer) due to VRAM limitations.":"אויב ניצן גראַפיקס קאָרט קאָד (אַזאַ ווי NVENC), איר קען דאַרפֿן צו רעדוצירן די נומער פון האַנדבראַקע ינסטאַנסיז (פּרובירן 2 אָדער ווייניקער) רעכט צו ווראַם לימיטיישאַנז.","Select standard preset:":"אויסקלייַבן נאָרמאַל פּרעסעט:","NVENC detected, please make sure to lower the number of HandBrakeCLI instances to 2 or below (for most graphics cards) or you may encounter errors due to not enough VRAM. This setting can be found in the \"System\" tab.":"NVENC דיטעקטאַד, ביטע מאַכן זיכער צו רעדוצירן די נומער פון האַנדבראַקלעקלי ינסטאַנסיז צו 2 אָדער ווייטער (פֿאַר רובֿ גראַפיקס קאַרדס) אָדער איר קען טרעפן קיין טעות ווראַם. דעם באַשטעטיקן קענען זיין געפונען אין דער \"סיסטעם\" קוויטל.","Imported preset detected.If you're having trouble with imported custom presets, it may be due to a known bug with the HandBrakeCLI (will be fixed in next HandBrakeCLI release). A temporary solution is to remove '\"PictureRotate\": \"0:0\"' from the .json file. More info here:":"ימפּאָרטיד פּרעסעט דעטעקטעד.אויב איר האָבן אַ קאָנפליקט מיט ימפּאָרטיד מנהג פּרעסעץ, עס קען זיין אַ באַקוועם זשוק מיט די האַנדבראַקלעקלי (וועט זיין פאַרפעסטיקט אין ווייַטער האַנדבראַקלעקלי מעלדונג). א צייַטווייַליק לייזונג איז צו באַזייַטיקן '\"פּיקטוראָראָטאַטע\": \"0: 0\"' פון די. דזשסאָן טעקע. מער אינפֿאָרמאַציע דאָ:","Container:":"קאנטעינער:","Specify the container you'd like the output file to have such as '.mp4'. You can find out more about containers at:":"ספּעציפיצירן די קאַנטיינער איר'ד ווי דער רעזולטאַט טעקע צו האָבן אַזאַ '. מפּ 4'. איר קענען געפֿינען מער וועגן קאַנטיינערז בייַ:","Enable periodic scanning:":"געבן פּעריאָדיש סקאַנינג:","HBBatchBeast can monitor your source folders and run scans for new files at a specified interval. The interval time is in seconds with the default being 300 seconds (5 minutes). If this option is selected, then when you press \"Scan and convert\", the program will convert any new files and then a countdown timer will begin. This will loop infinitely until stopped. The scan interval is in the advanced settings section.":"הבבאַטטשבעאַסט קענען מאָניטאָר דיין מקור פאָלדערס און לויפן סקאַנז פֿאַר נייַע טעקעס אין אַ ספּעסאַפייד ינטערוואַל. די ינטערוואַל צייַט איז אין סעקונדעס מיט די פעליקייַט זייַענדיק 300 סעקונדעס (5 מינוט). אויב דאָס אָפּציע איז אויסגעקליבן, דעמאָלט ווען איר דריקן \"יבערקוקן און גער\", די פּראָגראַם וועט בייַטן קיין נייַע טעקעס, און דעמאָלט אַ קאָונטדאָוון טייַמער וועט אָנהייבן. דעם וועט שלייף ינפאַנאַטלי ביז פארשטאפט. דער יבערקוקן מעהאַלעך איז אין די אַוואַנסירטע סעטטינגס אָפּטיילונג.","Enable daily scanning:":"געבן טעגלעך סקאַנינג:","Instead of periodic scanning, you can choose for a scan to be run once a day. The scan time is entered in the advanced settings section in hh:mm format such as '18:30'. Once \"Scan and convert\" is selected, the program will wait until the specified time until running a scan and conversion process. Again, this will loop infinitely until stopped.":"אַנשטאָט פּעריאָדיש סקאַנינג, איר קענען קלייַבן פֿאַר אַ יבערקוקן צו לויפן אַ מאָל אַ טאָג. דער יבערקוקן צייַט איז אַרייַנגעשיקט אין די אַוואַנסירטע סעטטינגס אָפּטיילונג אין הה: מם פֿאָרמאַט אַזאַ ווי '18: 30 '. אַמאָל \"סקאַן און גער\" איז אויסגעקליבן, די פּראָגראַם וועט וואַרטן ביז די ספּעסאַפייד צייט ביז פליסנדיק אַ יבערקוקן און קאַנווערזשאַן פּראָצעס. ווידער, דעם וועט שלייף ינפאַנאַטלי ביז פארשטאפט.","Show/hide advanced:":"ווייַזן / באַהאַלטן אַוואַנסירטע:","Scan interval (minimum 5 seconds):":"יבערקוקן מעהאַלעך (מינימום 5 סעקונדעס):","Daily run time (hh:mm):":"Daily run time (hh: mm):","Output filename suffix:":"רעזולטאַט פילענאַמע סופיקס:","This is optional. You can specify a suffix to add to the end of your filename like '_1080p' or '_testconversion' etc.":"דאָס איז אַפּשאַנאַל. איר קענען ספּעציפיצירן אַ סופפיקס צו לייגן צו דעם סוף פון דיין טעקע נאָמען ווי '_1080 פּ' אָדער '_טעסטקאָנווערסיאָן' אאז\"וו.","If 'standard preset' is selected then all output files will have the same suffix.":"אויב 'נאָרמאַל פּראַסעט' איז אויסגעקליבן, אַלע רעזולטאַט טעקעס וועט האָבן די זעלבע סאַפיקס.","If 'custom preset' is selected then you can specify one suffix per source folder/custom preset. Make sure each suffix is on its own line. For example, if you have 2 source folders and are using 'custom preset', you could put this in the filename suffix box:":"אויב 'מנהג פּריסעט' איז אויסגעקליבן, איר קענען ספּעציפיצירן איין סופיקס פּער מקור טעקע / מנהג פּרעסעט. מאַכן זיכער יעדער סופפיקס איז אויף זייַן אייגן שורה. פֿאַר בייַשפּיל, אויב איר האָבן 2 מקור פאָלדערס און זענען ניצן 'מנהג פּריסעט', איר קען שטעלן דעם אין די פילענאַמע סאַפיקס קעסטל:","Files in the first source folder will have '_720p' added to output filename. Files in the second source folder will have '_1080p' added to output filename etc.":"טעקעס אין דער ערשטער מקור טעקע וועט האָבן '_720 פּ' צוגעגעבן צו רעזולטאַט פילענאַמע. טעקעס אין די רגע מקור טעקע וועט האָבן '_1080 פּ' צוגעגעבן צו רעזולטאַט פילענאַמע עטק.","Include these file types:":"אַרייַננעמען די טעקע טייפּס:","Enter the file types to scan for. Each type needs to be separated by a comma. The default entry is:":"אַרייַן די טעקע טייפּס צו יבערקוקן פֿאַר. יעדער טיפּ דאַרף זיין אפגעשיידט דורך אַ קאָמע. די פעליקייַט פּאָזיציע איז:","Exclude files smaller than (MB):":"ויסמעקן טעקעס קלענערער ווי (מב):","Specify whether to exclude files smaller than a certain size from conversion (in megabytes)":"פּרוּווט צו אויסמעקן טעקעס קלענערער ווי אַ זיכער גרייס פון קאַנווערזשאַן (אין מעגאַביטעס)","Exclude files larger than (MB):":"ויסשליסן טעקעס גרעסער ווי (מעגאבייטן):","Specify whether to exclude files larger than a certain size from conversion (in megabytes)":"ספּעציפיצירן צי צו ויסמעקן טעקעס גרעסער ווי אַ זיכער גרייס פון קאַנווערזשאַן (אין מעגאַביטעס)","Exclude filenames which include any of these words:":"ויסשליסן פילענאַמעס וואָס אַרייַננעמען קיין פון די ווערטער:","Enter keywords to be filtered out when scanning for files. For example, if \"720p\" is entered, then any files with \"720p\" in the title will not be converted. Again, keywords need to be separated by a comma. For example, enter the following in the filter box:":"אַרייַן טערמינען צו זיין געפילטערט ווען סקאַנינג פֿאַר טעקעס. פֿאַר בייַשפּיל, אויב \"720 פּ\" איז אריין, דעמאָלט קיין טעקעס מיט \"720 פּ\" אין דעם טיטל וועט נישט זיין קאָנווערטעד. ווידער, טערמינען מוזן זיין אפגעשיידט דורך אַ קאָמע. למשל, אַרייַן די פאלגענדע אין די פילטער קעסטל:","Include files with any ":"אַרייַננעמען טעקעס מיט קיין"," or all ":"אָדער אַלע"," of these":"פון די","properties:":"פּראָפּערטיעס:","Here you can input video and audio properties that files must have in order to be converted (info extracted using FFprobe). The properties must be separated by a comma. Use the media info viewer tool to help determine what properties you'd like to include. Make sure to put a comma after the last property. For example, to only convert files which are encoded using h264 and aac stereo audio:":"דאָ איר קענען אַרייַנשרייַב וידאו און אַודיאָ פּראָפּערטיעס וואָס טעקעס מוזן האָבן אין סדר צו זיין קאָנווערטעד (אינפֿאָרמאַציע יקסטראַקטיד ניצן פפפּראָבע). די פּראָפּערטיעס מוזן זיין אפגעשיידט דורך אַ קאָמע. ניצן די מידיאַ אינפֿאָרמאַציע צוקוקער געצייַג צו העלפן באַשטימען וואָס פּראָפּערטיעס וואָס איר וואָלט ווי צו אַרייַננעמען. מאַכן זיכער צו שטעלן אַ קאָמע נאָך די לעצטע פאַרמאָג. למשל, צו בלויז גער טעקעס וואָס זענען קאָדעד ניצן ה 264 און אַאַק סטעריאָו אַודיאָ:","It's worth noting that this property check is done once the conversion process starts (to save time while building the queue), so although files may appear in the conversion queue, they will be skipped/included if the correct conditions are met.":"עס איז כדאי צו באמערקן אַז דעם פאַרמאָג טשעק איז געטאן אַמאָל די קאַנווערזשאַן פּראָצעס סטאַרץ (צו ראַטעווען צייַט בשעת בנין די ריי), כאָטש טעקעס זאלן דערשייַנען אין די קאַנווערזשאַן ריי, זיי וועלן זיין סקיפּט / אַרייַנגערעכנט אויב די ריכטיק באדינגונגען זענען באגעגנט.","If FFprobe is able to extract properties, then an 'OK' will appear in the \"FFprobe\" column in the queue view.":"אויב פפפּראָבע איז ביכולת צו עקסטראַקט פּראָפּערטיעס, דעמאָלט 'OK' וועט דערשייַנען אין די \"פפפּראָבע\" זייַל אין דער ריי מיינונג.","Exclude files with any ":"ויסשליסן טעקעס מיט קיין"," of these ":"פון די","The opposite of 'Include files with any or all of these properties'":"דער פאַרקערט פון 'אַרייַננעמען טעקעס מיט קיין אָדער אַלע פון די פּראָפּערטיעס'","This is a small tool to analyse file properties with in order to help you determine which properties you'd like to include/exclude in the above options. It uses FFprobe to return information. Drag and drop files into the grey box to analyse them. For example, dropping in a test file might return the following:":"דאָס איז אַ קליין געצייַג צו פונאַנדערקלייַבן טעקע פּראָפּערטיעס צו העלפן איר באַשליסן וואָס פּראָפּערטיעס איר וואָלט ווי צו אַרייַננעמען / ויסשליסן אין די אויבן אָפּציעס. עס ניצט פפפּראָבע צו צוריקקומען אינפֿאָרמאַציע. שלעפּן און פאַלן טעקעס אין די גרוי קעסטל צו פונאַנדערקלייַבן זיי. למשל, דראַפּינג אין אַ פּרובירן טעקע זאל צוריקקומען די פאלגענדע:","If you're looking to exclude files like this from being converted, then you can put several file properties into the \"Exclude files with any or all of these properties\" box and check the checkbox next to 'all' instead of 'any', like so:":"אויב איר 'רע איר זוכט צו ויסשליסן טעקעס אַזאַ ווי דאָס פון זייַענדיק קאָנווערטעד, דעמאָלט איר קענען שטעלן עטלעכע טעקע פּראָפּערטיעס אין די \"ויסשליסן טעקעס מיט קיין אָדער אַלע פון די פּראָפּערטיעס\" קעסטל און טשעק די טשעקקבאָקס ווייַטער צו' אַלע 'אַנשטאָט פון' קיין ' ווי אַזוי:","Copy excluded files to destination:":"קאָפּיע ויסשליסיק טעקעס צו דעסטיניישאַן:","If you select this option, then files which have been excluded from conversion will be copied directly to the destination folder. This applies to the following filters:":"אויב איר אויסקלייַבן דעם אָפּציע, די טעקעס וואָס זענען יקסקלודיד פון קאַנווערזשאַן וועט זיין קאַפּיד גלייַך צו די דעסטיניישאַן טעקע. דאס אַפּלייז צו די פאלגענדע פילטערס:","Exclude filenames which include any of these words":"ויסשליסן פילענאַמעס וואָס אַרייַננעמען קיין פון די ווערטער","Include files with any or all of these properties":"אַרייַננעמען טעקעס מיט קיין אָדער אַלע פון די פּראָפּערטיעס","Exclude files with any or all of these properties":"ויסשליסן טעקעס מיט קיין אָדער אַלע פון די פּראָפּערטיעס","Exclude files smaller than (MB)":"ויסמעקן טעקעס קלענערער ווי (מב)","Exclude files larger than (MB)":"ויסמעקן טעקעס גרעסער ווי (מב)","Note this also applies to files excluded because they don't meet the \"Include\" property conditions of the above so don't accidentally copy you're entire library when you're only trying to convert a few files.":"באַמערקונג איז אויך אַפּלייז צו טעקעס יקסקלודיד ווייַל זיי טאָן ניט טרעפן די \"ינקלודע\" פאַרמאָג טנאָים פון די אויבן אַזוי טאָן ניט אַקסאַדענאַלי נאָכמאַכן איר ניטאָ גאַנץ ביבליאָטעק ווען איר'רע נאָר טריינג צו בייַטן אַ ביסל טעקעס.","The copy feature does not apply to the following filters (i.e. files excluded due to the filter)":"די קאָפּיע שטריך טוט נישט פּאַסירן צו די פאלגענדע פילטערס (ד\"ה טעקעס יקסקלודיד ווייַל פון די פילטער)","Include these file types":"אַרייַננעמען די טעקע טייפּס","Delete source files after conversion:":"דיליט מקור טעקעס נאָך קאַנווערזשאַן:","If this is selected, then if a conversion attempt is successful, the source file will be deleted. This process is done at the very end, after conversion of all files. This means that you can convert the same source files using multiple presets, all in one go. The source files will then be deleted afterwards.":"אויב דאָס איז אויסגעקליבן, דעמאָלט אויב אַ קאַנווערזשאַן פּרווון איז מצליח, די מקור טעקע וועט ווערן אויסגעמעקט. דעם פּראָצעס איז געטאן אין די סוף סוף, נאָך קאַנווערזשאַן פון אַלע טעקעס. דעם מיטל אַז איר קענען גער די זעלבע מקור טעקעס ניצן קייפל פּרעסעץ, אַלע אין איין גיין. דער מקור טעקעס וועט דעמאָלט זיין אויסגעמעקט.","Replace original file if converted file is smaller?(Compress attempt)":"פאַרריכטן אָריגינעל טעקע אויב קאָנווערטעד טעקע איז קלענערער? (קאַמפּרעס פּרווון)","Select this check box if you'd like HBBatchBeast to automatically replace the original source file if the new file is smaller. If the new file is not smaller, then it will be left in the destination folder.":"סעלעקט דעם טשעק קעסטל אויב איר וואָלט ווי HBBatchBeast צו אויטאָמאַטיש פאַרבייַטן די אָריגינעל מקור טעקע אויב די נייַ טעקע איז קלענערער. אויב די נייַ טעקע איז ניט קלענערער, דעמאָלט עס וועט זיין לינקס אין די דעסטיניישאַן טעקע.","Make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"מאַכן זיכער דיין דעסטיניישאַן טעקע איז ניט די זעלבע ווי / אָדער ין, דיין מקור טעקע אָדער עס וועט נישט אַרבעט רעכט.","Once HBBatchBeast has attempted to compress a specific file, it will add that file path to a cache so that it won't be attempted again in future. You can view/edit/clear the cache using the yellow buttons.":"אַמאָל HBBatchBeast האט געפרוווט צו קאָמפּרעס אַ ספּעציפיש טעקע, עס וועט לייגן דעם טעקע דרך צו אַ קאַש אַזוי אַז עס וועט נישט זיין געפרוווט ווידער אין צוקונפֿט. איר קענען זען / רעדאַגירן / קלאָר די קאַש ניצן די געל קנעפּלעך.","Replace original file always?":"פאַרריכטן אָריגינעל טעקע שטענדיק?","The original file will be replaced regardless of whether the new file is larger or smaller.":"דער אָריגינעל טעקע וועט זיין ריפּלייסט ראַגאַרדלאַס צי די נייַ טעקע איז גרעסערע אָדער קלענערער.","Again, make sure your destination folder is not the same as/or within, your source folder or it won't work properly.":"ווידער, מאַכן זיכער דיין דעסטאַניישאַן טעקע איז ניט די זעלבע ווי / אָדער ין, דיין מקור טעקע אָדער עס וועט נישט אַרבעט רעכט.","Copy subtitle (srt) files to destination?":"קאָפּי סאַבטייטאַל (סרט) טעקעס צו דעסטיניישאַן?","Subtitle '.srt' files will be copied to the destination folder automatically.":"סובטיטלע '.רירט' טעקעס וועט זיין קאַפּיד צו די דעסטיניישאַן טעקע אויטאָמאַטיש.","Automatically create temporary/destination folders if they don't exist?":"אויטאָמאַטיש מאַכן צייַטווייַליק / דעסטיניישאַן פאָלדערס אויב זיי טאָן ניט עקסיסטירן?","Custom bat path to run after each conversion (leave blank if not using):":"מנהג שלאָגן וועג צו לויפן נאָך יעדער קאַנווערזשאַן (לאָזן ליידיק אויב נישט ניצן):","Input the path to a custom batch file which you'd like to execute after each conversion. For example:":"אַרייַנשיקן דעם וועג צו אַ מנהג פּעקל טעקע וואָס איר'ד ווי צו ויספירן נאָך יעדער קאַנווערזשאַן. פֿאַר בייַשפּיל:","Batch files with timeout statements won't work. More info here:":"באַטש טעקעס מיט טיימאַוט סטייטמאַנץ וועט נישט אַרבעטן. מער אינפֿאָרמאַציע דאָ:","Leave box completely empty if you do not wish to use this option (make sure there are no hidden characters in the box)":"לאָזן קעסטל גאָר ליידיק אויב איר טאָן נישט וועלן צו נוצן דעם אָפּציע (מאַכן זיכער עס זענען קיין פאַרבאָרגן אותיות אין די קעסטל)","Run processes at low priority?":"לויף פּראַסעסאַז בייַ נידעריק בילכערקייַט?","All conversion processes will be run at low priority, reducing processor usage.":"אַלע קאַנווערזשאַן פּראַסעסאַז וועט לויפן בייַ נידעריק בילכערקייַט, רידוסינג פּראַסעסער באַניץ.","Remove apostrophes from filenames:":"אַראָפּנעמען אַפּראָופּראָפּעס פון פילענאַמעס:","Conversions/health check scans may fail if filenames have apostrophes in. Check this to automatically remove apostrophes from filenames.":"קאָנווערסיאָנס / געזונט טשעק סקאַנז זאל פאַרלאָזן אויב פילענאַמעס האָבן אַפּראָופּראָפעס ין טשעק דאָס צו אויטאָמאַטיש באַזייַטיקן אַפּראָופּראָפעס פון פילענאַמעס."," This feature can scan for corrupt video files using HandBrake's '--scan' feature, although this is not always accurate. It also uses FFprobe to provide a second reference point. If both FFprobe and HandBrake fail then there is a high chance that the file is corrupt.":"דעם שטריך קענען יבערקוקן פֿאַר פאַרדאָרבן ווידעא טעקעס ניצן האַנדבראַקע ס '- סקאַן' שטריך, כאָטש דאָס איז ניט שטענדיק פּינטלעך. עס אויך ניצט פפפּראָבע צו צושטעלן אַ צווייט דערמאָנען פונט. אויב ביידע פפּראָבאָבע און האַנדבראַקע דורכפאַל, עס איז אַ הויך געלעגנהייַט אַז די טעקע איז פאַרדאָרבן.","Move corrupt files into the following folder:":"מאַך פאַרדאָרבן טעקעס אין די פאלגענדע טעקע:"," If checked, then any files which give errors will be moved into the specified folder.":"אויב אָפּגעשטעלט, דעמאָלט קיין טעקעס וואָס געבן ערראָרס וועט זיין אריבערגעפארן אין די ספּעסאַפייד טעקע.","Corrupt file folder:":"קאָרופּציע טעקע טעקע:","Run thorough file health check:":"לויפן גרונטיק טעקע געזונט קאָנטראָל:"," If checked, then a much slower, more thorough video health check will be run using FFmpeg instead of HandBrake.":"אויב אָפּגעשטעלט, דעמאָלט אַ פיל סלאָוער, מער גרונטיק ווידעא געזונט קאָנטראָל וועט זיין לויפן ניצן פפמפּעג אַנשטאָט פון האַנדבראַקע."," Based on Desani's 'ScanMedia.ps1' found at:":"Based on Desani's 'ScanMedia.ps1' found at:","Attempt to repair files after thorough check:":"פרווון פֿאַר פאַרריכטן טעקעס נאָך גרונטיק קאָנטראָל:"," If checked, HBBatchBeast will attempt to repair files using FFmpeg. A new file with the suffix '_repaired' will be created in the same folder as the source file.":"אויב אָפּגעשטעלט, HBBatchBeast וועט פּרובירן צו פאַרריכטן טעקעס ניצן פפמפּעג. א נייַ טעקע מיט סאַפיקס '_פּאַיראַרד' וועט זיין באשאפן אין דער זעלביקער טעקע ווי די מקור טעקע.","'CRF' value to use when attempting to repair files:":"'קרף' ווערט צו נוצן ווען איר פּרובירן צו פאַרריכטן טעקעס:","The default 'CRF' value is 23. Please see the following for more information:":"די פעליקייַט 'קרף' ווערט איז 23. ביטע זען די פאלגענדע פֿאַר מער אינפֿאָרמאַציע:","The range of the CRF scale is 0–51, where 0 is lossless, 23 is the default, and 51 is worst quality possible. A lower value generally leads to higher quality, and a subjectively sane range is 17–28. Consider 17 or 18 to be visually lossless or nearly so; it should look the same or nearly the same as the input but it isn't technically lossless.":"דער קייט פון די CRF וואָג איז 0-51, ווו 0 איז לאָססלעסס, 23 איז די פעליקייַט, און 51 איז די ערגסטע קוואַליטעט מעגלעך. א נידעריקער ווערט בכלל פירט צו העכער קוואַליטעט, און אַ סאַבדזשעקטיוולי כיטרע קייט איז 17-28. באַטראַכטן 17 אָדער 18 צו זיין וויזשוואַלי לאָססלעסס אָדער קימאַט אַזוי; עס זאָל קוקן די זעלבע אָדער קימאַט די זעלבע ווי די אַרייַנשרייַב אָבער עס איז נישט טעקניקלי לאָססלעסס.","HBBatchBeast saves a list of scanned file paths reported as uncorrupt. Clear the cache to perform a fresh scan on all files.":"הבבאַטטשבעאַסט סאַוועס אַ רשימה פון סקאַנד טעקע פּאַטס געמאלדן ווי ונקאָררופּט. קלאָר די קאַש צו דורכפירן אַ פריש יבערקוקן אויף אַלע טעקעס.","Number of simultaneous HandBrake/FFmpeg instances to use?(Recommended 4 or fewer):":"נומער פון סיימאַלטייניאַס האַנדבראַקע / פפמפּעג ינסטאַנסיז צו נוצן? (רעקאַמענדיד 4 אָדער ווייניקער):","This setting applies to both the \"Video health check\" and \"Scan and convert\" processes. Specify how many HandBrake threads to use. There is no maximum although it's recommended not to use more than 4. A higher amount may freeze your computer if it's not very powerful.":"דעם באַשטעטיקן אַפּלייז צו ביידע \"וידאו געזונט טשעק\" און \"סקאַן און גער\" פּראַסעסאַז. ספּעציפיצירן ווי פילע האַנדבראַקע פֿעדעם צו נוצן. עס איז קיין מאַקסימום כאָטש עס ס רעקאַמענדיד נישט צו נוצן מער ווי 4. א העכער סומע קען פאַרפרוירן דיין קאָמפּיוטער אויב עס איז נישט זייער שטאַרק.","Queue size view limit?(Recommended 1000 or fewer):":"רייען גרייס מיינונג שיעור? (Recommended 1000 אָדער ווייניקער):","Automatically start \"Scan and convert\" when program opened?":"אויטאָמאַטיש אָנהייב \"סקאַן און גער\" ווען די פּראָגראַם געעפנט?","Fill in email details to receive email notifications if an error is encountered during a health check or conversion/folder watching. Won't work with accounts that require 2FA. You need to enable access to less secure apps on Gmail accounts.":"פּלאָמבירן אין בליצפּאָסט פרטים צו באַקומען email נאָוטאַפאַקיישאַנז אויב אַ טעות איז געפּלאָנטערט בעשאַס אַ געזונט טשעק אָדער קאַנווערזשאַן / פאָלדינג וואַטשינג. וועט נישט אַרבעטן מיט אַקאַונץ וואָס דאַרפן 2 פף. איר דאַרפֿן צו געבן צוטריט צו ווייניקער זיכער אַפּפּס אויף Gmail אַקאַונץ.","Email address:":"אימעיל אדרעס:","For example:":"פֿאַר בייַשפּיל:","Email password(not saved):":"בליצפּאָסט פּאַראָל (ניט געהאלפן):","SMTP server:":"סמטפּ סערווער:","This feature allows monitoring of conversion/health check status using any web-browser. Useful when running servers etc.":"דעם שטריך אַלאַוז מאָניטאָרינג פון קאַנווערזשאַן / געזונט קאָנטראָלירן סטאַטוס ניצן קיין וועב-בלעטערער. נוציק ווען פליסנדיק סערווערס עטק.","If enabled, the following anonymous data will be sent to HBBatchBeast.io:":"אויב ענייבאַלד, די ווייַטערדיק אַנאָנימאָוס דאַטן וועט ווערן געשיקט צו HBBatchBeast.io:","API key":"API key","Current status ('Searching', 'Running', 'Finished' etc)":"קראַנט סטאַטוס ('זוכן', 'פליסנדיק', 'פאַרטיק', עטק)","Number of:":"נומער פון:","Remaining items":"רימיינינג זאכן","Successful items":"מצליח זאכן","Errored items":"Errored items","Cancelled items":"קאַנסעלד ייטאַמז","Worker percentages":"וואָרקערס פּערסענטידזשיז","Last completed item time":"לעצט געענדיקט פּונקט צייַט","Enable remote monitoring?:":"געבן ווייַט מאָניטאָרינג ?:","A basic benchmarking utility built mainly to see how 16+ core processors perform using multiple HandBrake instances although it can be run on any type of processor.":"א יקערדיק בענטשמאַרקינג נוצן געבויט דער הויפּט צו זען ווי 16 + האַרץ פּראַסעסערז דורכפירן ניצן קייפל האַנדבראַקע ינסטאַנסיז כאָטש עס קענען זיין לויפן אויף קיין טיפּ פון פּראַסעסער.","This will download a h265 4k sample file (2.5MB) and run a benchmark using 4 HandBrake instances with preset \"Very Fast 1080p30\"":"דעם וועט אראפקאפיע אַ ה .264 4 ק מוסטער טעקע (2.5 מב) און לויפן אַ בענטשמאַרק ניצן 4 האַנדבראַקע ינסטאַנסיז מיט פּריסעט \"זייער פאַסט 1080 פּ 30\"","Results can be uploaded to hbbatchbeast.io if you choose.":"רעזולטאַטן קענען זיין ופּלאָאַדעד צו hbbatchbeast.io אויב איר קלייַבן.","Queue":"ריי","Output this session":"רעזולטאַט דעם סעסיע","Media info viewer tool":"מידיאַ אינפֿאָרמאַציע צוקוקער געצייַג","View compress attempt cache":"View קאַמפּרעס פּרווון קאַש","Clear compress attempt cache":"קלאָר קאַמפּרעס פּרווון קאַש","Save config":"היט קאָנפיג","Scan only":"יבערקוקן בלויז","Scan and convert":"יבערקוקן און גער","View scan/conversion summary log":"View יבערקוקן / קאַנווערזשאַן קיצער קלאָץ","View individual file check/conversion log":"View יחיד טעקע טשעק / באַניצער לאָג","View worker console output":"View אַרבעטער קאַנסאָול פּראָדוקציע","Health check":"געזונט קאָנטראָל","Clear healthy file cache":"קלאָר געזונט טעקע קאַש","View error log":"View טעות קלאָץ","Email test":"Email test","View master log":"View מאַסע קלאָץ","Wiki help":"וויקי הילף","An application by HaveAGitGat":"אַ אַפּלאַקיישאַן דורך HaveAGitGat","New":"New","Launch":"Launch","Benchmark":"Benchmark","See results":"זען רעזולטאַטן","Pause queue":"Pause queue","Continue queue":"פאָרזעצן ריי","Stop queue":"האַלטן ריי","Convert selected files":"גער אויסגעקליבן טעקעס","Toggle queue view":"טאַגאַל ריי מיינונג","Deselect all":"אָפּלייקענען אַלע","Invert all":"יבערקערן אַלע","Select all":"וועל אויס אלע","Toggle output view":"Toggle output view"}